{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/221426-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 221426, u'veryPopular': False, u'lowFodmap': False, u'title': u'Wild Garlic and White Bean Curry', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 283.98, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'seeds from 5 cardamom pods', u'aisle': u'Spices and Seasonings', u'name': u'cardamom pods', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1002006, u'unit': u''}, {u'originalString': u'small handful of cilantro roots, washed and minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'washed and minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'generous 3/4 cup coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1 1/2 tsp coriander seeds', u'aisle': u'Spices and Seasonings', u'name': u'coriander seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2013, u'unit': u'tsp'}, {u'originalString': u'12 fresh curry leaves', u'aisle': u'Ethnic Foods', u'name': u'curry leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 93604, u'unit': u''}, {u'originalString': u'1 tsp fenugreek seeds', u'aisle': u'Spices and Seasonings', u'name': u'fenugreek seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fenugreek.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2019, u'unit': u'tsp'}, {u'originalString': u'3 tbsp fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tbsp'}, {u'originalString': u'4 cloves garlic, peeled and crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'10 ounces wild garlic leaves', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'wild'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11215, u'unit': u'ounces'}, {u'originalString': u'juice of 2 limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'6 kaffir lime leaves', u'aisle': u'Ethnic Foods', u'name': u'kaffir lime leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 93633, u'unit': u''}, {u'originalString': u'2 (12-ounce) cans good-quality peeled plum tomatoes', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'peeled', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 10411529, u'unit': u'ounce'}, {u'originalString': u'3 fresh red chiles (or more if you like heat), sliced (seeded if you prefer less heat)', u'aisle': u'Produce', u'name': u'red chiles', u'metaInformation': [u'fresh', u'red', u'seeded', u'sliced', u'( if you like heat)', u'( if you prefer less heat)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 red onions, peeled and finely sliced', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'peeled', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2 cups shelled fresh coco beans, or 1 cup dried cannellini beans, cooked', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'dried', u'fresh', u'shelled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16033, u'unit': u'cups'}, {u'originalString': u'2 tbsp jaggery or superfine sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 tsp vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tsp'}, {u'originalString': u'1 tsp yellow mustard seeds', u'aisle': u'Spices and Seasonings', u'name': u'yellow mustard seeds', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'tsp'}], u'healthScore': 74.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Wild-Garlic-and-White-Bean-Curry-358389', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large heavy pan over medium-low heat and sweat the onions until soft and translucent.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a separate pan, warm all the spice seeds until they release their fragrance and just begin to jump in the pan. Tip into a mortar and grind with the pestle while still warm.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the warm ground spices to the onions along with the chiles, curry leaves, lime leaves, and cilantro. Cook for another 5 minutes over fairly low heat, then add the garlic, jaggery, lime juice, and fish sauce. Stir well and cook for 5 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'id': 93604, u'name': u'curry leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-leaves.jpg', u'id': 93633, u'name': u'lime leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the tomatoes, stir well, and cook for another 10 minutes, then add the fresh or cooked dried beans and coconut milk. Cook gently for 10 to 15 minutes (or until the beans are tender if cooking fresh).', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'While the curry is cooking, wash the wild garlic very well, picking over each leaf thoroughly for they can carry little stones.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u"A couple of minutes before serving the curry, add the wild garlic and cook until it is just wilted and soft. Don't overcook it—wild garlic should be bright and vibrant. Taste and adjust the seasoning if necessary. This curry should be soft, fragrant, gently sweet, sharp, and salty, with just enough heat to warm you.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Reprinted with permission from My Favorite Ingredients by Skye Gyngell, copyright \xa9 2010. Published by Ten Speed Press, a division of Random House, Inc.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Asian can be paired with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The L'Ecole 41 Chenin Blanc with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish.', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 30, u'instructions': u"Preparation                                                        Heat the oil in a large heavy pan over medium-low heat and sweat the onions until soft and translucent.                                                                In a separate pan, warm all the spice seeds until they release their fragrance and just begin to jump in the pan. Tip into a mortar and grind with the pestle while still warm.                                                                Add the warm ground spices to the onions along with the chiles, curry leaves, lime leaves, and cilantro. Cook for another 5 minutes over fairly low heat, then add the garlic, jaggery, lime juice, and fish sauce. Stir well and cook for 5 minutes.                                                                 Add the tomatoes, stir well, and cook for another 10 minutes, then add the fresh or cooked dried beans and coconut milk. Cook gently for 10 to 15 minutes (or until the beans are tender if cooking fresh).                                                                While the curry is cooking, wash the wild garlic very well, picking over each leaf thoroughly for they can carry little stones.                                                                A couple of minutes before serving the curry, add the wild garlic and cook until it is just wilted and soft. Don't overcook it—wild garlic should be bright and vibrant. Taste and adjust the seasoning if necessary. This curry should be soft, fragrant, gently sweet, sharp, and salty, with just enough heat to warm you.                                                                            Reprinted with permission from My Favorite Ingredients by Skye Gyngell, copyright \xa9 2010. Published by Ten Speed Press, a division of Random House, Inc.", u'spoonacularSourceUrl': u'https://spoonacular.com/wild-garlic-and-white-bean-curry-221426', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}