{u'recipes': [{u'sourceName': u'Cookie Madness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/833543-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 833543, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chips Ahoy Icebox Cake with Chips Ahoy Thins', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 81.04, u'creditText': u'Cookie Madness', u'extendedIngredients': [{u'originalString': u'45 Chips Ahoy Thins (buy 2 bags)', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [u'(buy 2 bags)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 45.0, u'consistency': u'solid', u'id': 19003, u'unit': u''}, {u'originalString': u'Some chopped nuts (any kind) for topping', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'chopped', u'for topping', u'(any kind)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 12135, u'unit': u'servings'}, {u'originalString': u'6 tablespoons of powdered sugar, plus more if desired', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'plus more if desired'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'2 cups whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.cookiemadness.net/2016/12/chips-ahoy-icebox-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Have ready a 2 quart 8 inch square baking dish.Whip the cream, gradually adding the sugar and vanilla.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Spread a very thin layer of whipped cream across the bottom of the dish, then line up 9 cookies.Top with a layer of whipped cream (about a cup -- but this is an estimate) and then keep layering with more cookies and whipped cream to make 5 layers of 9.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread whipped cream across top.Cover and chill for 4 to 6 hours. Regular size Chips Ahoy will take 6 hours to soften, but the Thins will probably be soft in 4.Sprinkle your favorite type of nuts over the top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'id': 12135, u'name': u'nuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Have ready a 2 quart 8 inch square baking dish.Whip the cream, gradually adding the sugar and vanilla.Spread a very thin layer of whipped cream across the bottom of the dish, then line up 9 cookies.Top with a layer of whipped cream (about a cup -- but this is an estimate) and then keep layering with more cookies and whipped cream to make 5 layers of 9. Spread whipped cream across top.Cover and chill for 4 to 6 hours. Regular size Chips Ahoy will take 6 hours to soften, but the Thins will probably be soft in 4.Sprinkle your favorite type of nuts over the top.', u'spoonacularSourceUrl': u'https://spoonacular.com/chips-ahoy-icebox-cake-with-chips-ahoy-thins-833543', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}