{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/468770-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 468770, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoked Shrimp & Wild Mushroom Fettuccine', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 187.09, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1-1/2 cups fresh broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'cups'}, {u'originalString': u'1/2 cup white wine or chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'2 cups soaked mesquite wood chips', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19003, u'unit': u'cups'}, {u'originalString': u'1 package (12 ounces) fettuccine', u'aisle': u'Pasta and Rice', u'name': u'fettuccine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10020409, u'unit': u'ounces'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 cups heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'10 uncooked jumbo shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'jumbo shrimp', u'metaInformation': [u'deveined', u'uncooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'liquid', u'id': 15152, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 large portobello mushrooms, sliced', u'aisle': u'Produce', u'name': u'portobello mushrooms', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11265, u'unit': u''}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 medium tomato, chopped', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/smoked-shrimp---wild-mushroom-fettuccine', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add wood chips to grill according to manufacturer’s directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Using long-handled tongs, moisten a paper towel with cooking oil and lightly coat the grill rack. Thread shrimp onto two metal or soaked wooden skewers. Grill, covered, over medium heat for 5-8 minutes or until shrimp turn pink, turning once.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Meanwhile, cook fettuccine according to package directions. In a large skillet, saute broccoli and mushrooms in oil until tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 10020409, u'name': u'fettuccine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Add garlic and salt; cook 1 minute longer.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add wine, stirring to loosen browned bits from pan. Gradually stir in cream. Bring to a boil. Reduce heat; simmer, uncovered, for 10-12 minutes or until thickened.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Drain fettuccine.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 10020409, u'name': u'fettuccine'}]}, {u'equipment': [], u'step': u'Add to sauce mixture with shrimp. Cook and stir until heated through; gently stir in tomato.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Maso Canali Pinot Grigio with a 4.6 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal.', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 50, u'instructions': u'Directions                                                                                Add wood chips to grill according to manufacturer’s directions.                                                                                                 Using long-handled tongs, moisten a paper towel with cooking oil and lightly coat the grill rack. Thread shrimp onto two metal or soaked wooden skewers. Grill, covered, over medium heat for 5-8 minutes or until shrimp turn pink, turning once.                                                                                           Meanwhile, cook fettuccine according to package directions. In a large skillet, saute broccoli and mushrooms in oil until tender. Add garlic and salt; cook 1 minute longer. Add wine, stirring to loosen browned bits from pan. Gradually stir in cream. Bring to a boil. Reduce heat; simmer, uncovered, for 10-12 minutes or until thickened.                                                                                           Drain fettuccine. Add to sauce mixture with shrimp. Cook and stir until heated through; gently stir in tomato.                                        Yield: 5 servings.                                                                                                                         Originally published as Smoked Shrimp & Wild Mushroom Fettuccine in  CountryAugust/September 2010, p52                                                                                                                                                                                                        Nutritional Facts                                                                             1-1/2 cups equals 686 calories, 43 g fat (23 g saturated fat), 192 mg cholesterol, 247 mg sodium, 55 g carbohydrate, 4 g fiber, 21 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-shrimp-wild-mushroom-fettuccine-468770', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}