{u'recipes': [{u'sourceName': u'Kawaling Pinoy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/568298-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 568298, u'veryPopular': False, u'lowFodmap': False, u'title': u'Adobong Sitaw', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 116.83, u'creditText': u'Kawaling Pinoy', u'extendedIngredients': [{u'originalString': u'5 to 6 cloves garlic, peeled and minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 small onion, peeled and chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'1/2 pound thick-cut bacon, chopped', u'aisle': u'Meat', u'name': u'thick-cut bacon', u'metaInformation': [u'thick-cut', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10310123, u'unit': u'pound'}, {u'originalString': u'3/4 cup vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}, {u'originalString': u'1 bunch sitaw (long beans), ends trimmed and cut into 3-inch lengths', u'aisle': u'?', u'name': u'sitaw', u'metaInformation': [u'trimmed', u'cut into 3-inch lengths', u'(long beans)'], u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'unit': u'bunch'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.kawalingpinoy.com/2013/06/adobong-sitaw/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a pot over medium heat, add bacon and cook until it starts to release fat and slightly browns.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add onions and garlic and cook, stirring occasionally, until limp and aromatic.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add vinegar and allow to simmer for about 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}]}, {u'equipment': [], u'step': u'Add soy sauce and continue to simmer until slighty reduced.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [], u'step': u'Add long beans, stirring to combine. Cover and continue to simmer until sauce is reduced and long beans have changed color and are tender yet crisp. Season with pepper to taste and salt if needed.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 17, u'instructions': u'In a pot over medium heat, add bacon and cook until it starts to release fat and slightly browns. Add onions and garlic and cook, stirring occasionally, until limp and aromatic. Add vinegar and allow to simmer for about 3 to 5 minutes. Add soy sauce and continue to simmer until slighty reduced. Add long beans, stirring to combine. Cover and continue to simmer until sauce is reduced and long beans have changed color and are tender yet crisp. Season with pepper to taste and salt if needed.', u'spoonacularSourceUrl': u'https://spoonacular.com/adobong-sitaw-568298', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}