{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/600824-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 600824, u'veryPopular': True, u'lowFodmap': False, u'title': u'Olive Garden Toasted Ravioli – with our you can make these at home', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 36.57, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 cup plain bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'16 ounce package of meat-filled ravioli (fresh or frozen--thaw first if frozen)', u'aisle': u'Canned and Jarred', u'name': u'meat ravioli', u'metaInformation': [u'frozen', u'(fresh--thaw first if )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 22900, u'unit': u'ounce'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.copykat.com/2009/02/02/olive-garden-toasted-ravioli/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix water with eggs and beat well; set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix Italian seasonings and garlic salt with the bread crumbs and set aside.Measure flour in bowl and set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/deep-fryer.jpg', u'id': 404759, u'name': u'deep fryer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat vegetable oil in deep fryer or skillet to 350 degrees for deep frying.Dip ravioli in flour, then in the egg wash, then in bread crumbs and carefully place in hot oil. Fry until golden.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove from oil and drain.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with your favorite marinara sauce.You can find more Olive Garden Recipes at Copy', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Kat.com, the web's most popular destination for copycat restaurant recipes.", u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Ravioli. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Santa Margherita Chianti Classico Riserva with a 4.2 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The aromas of this complex red wine range from cherries and plums to gladiolus flowers and earthy flint. The tannic, oak-aged flavors are bright and round, with a dry, warm, earthy finish. Recommended for barbecued meat, like sliced Chianina steak, or with game, such as pheasant stuffed with truffles. It is also excellent with mature cheese.', u'title': u'Santa Margherita Chianti Classico Riserva', u'price': u'$26.99', u'id': 436659, u'link': u'https://www.wine.com/product/santa-margherita-chianti-classico-riserva-2013/167314', u'imageUrl': u'https://spoonacular.com/productImages/436659-312x231.jpg'}]}, u'aggregateLikes': 580, u'instructions': u"Mix water with eggs and beat well; set aside. Mix Italian seasonings and garlic salt with the bread crumbs and set aside.Measure flour in bowl and set aside.Heat vegetable oil in deep fryer or skillet to 350 degrees for deep frying.Dip ravioli in flour, then in the egg wash, then in bread crumbs and carefully place in hot oil. Fry until golden. Remove from oil and drain. Serve with your favorite marinara sauce.You can find more Olive Garden Recipes at CopyKat.com, the web's most popular destination for copycat restaurant recipes.", u'spoonacularSourceUrl': u'https://spoonacular.com/olive-garden-toasted-ravioli-with-our-you-can-make-these-at-home-600824', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}