{u'recipes': [{u'sourceName': u'Fed and Fit', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611077-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 611077, u'veryPopular': False, u'lowFodmap': False, u'title': u'Twice Baked Loaded Sweet Potatoes', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 96.46, u'creditText': u'Fed and Fit', u'extendedIngredients': [{u'originalString': u'1 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons butter, ghee, or coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'full-fat coconut cream for garnish', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'servings'}, {u'originalString': u'pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups shredded chicken', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cups'}, {u'originalString': u'4 medium-sized sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'medium-sized'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://fedandfit.com/2014/09/05/twice-baked-loaded-sweet-potatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Wash the sweet potatoes and place on a baking sheet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Bake at 375 for one hour.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let the sweet potatoes cool completely before moving onto the next step. *Tip: you can do this step days ahead and save yourself time.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Cut the top 1/4th of the sweet potato off, creating an opening. Using a spoon, spoon out the majority of the cooked sweet potato but be careful to leave a thick parameter near the skin so that the hallowed-out potato still retains its shape.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Add the butter, cinnamon, salt, and pepper to the mashed sweet potatoes and combine evenly. Lastly, add the shredded chicken and combine evenly.Spoon an equal amount of the seasoned sweet potato and chicken mixture back into each of the hallowed-out shells.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'id': 5348, u'name': u'shredded chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake at 375 for 15 minutes.To plate, garnish with a dollop of chilled full-fat coconut cream.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 23, u'instructions': u'Wash the sweet potatoes and place on a baking sheet. Bake at 375 for one hour. Let the sweet potatoes cool completely before moving onto the next step. *Tip: you can do this step days ahead and save yourself time.Cut the top 1/4th of the sweet potato off, creating an opening. Using a spoon, spoon out the majority of the cooked sweet potato but be careful to leave a thick parameter near the skin so that the hallowed-out potato still retains its shape.Add the butter, cinnamon, salt, and pepper to the mashed sweet potatoes and combine evenly. Lastly, add the shredded chicken and combine evenly.Spoon an equal amount of the seasoned sweet potato and chicken mixture back into each of the hallowed-out shells. Bake at 375 for 15 minutes.To plate, garnish with a dollop of chilled full-fat coconut cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/twice-baked-loaded-sweet-potatoes-611077', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}