{u'recipes': [{u'sourceName': u'Noob Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/565054-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 565054, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oyster Donburi', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 569.22, u'creditText': u'Noob Cook', u'extendedIngredients': [{u'originalString': u'100 ml dashi stock cheat by using 1/2 tsp dashi powder with hot water', u'aisle': u'Ethnic Foods', u'name': u'dashi', u'metaInformation': [u'with hot water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 1006963, u'unit': u'ml'}, {u'originalString': u'2 small eggs lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'small', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tsp ginger juice grate some ginger & tablespoon the pulp', u'aisle': u'Ethnic Foods', u'name': u'ginger juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93752, u'unit': u'tsp'}, {u'originalString': u'small handful of shredded seaweed or dashes of Japanese furikake', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'japanese 7 spice', u'metaInformation': [u'shredded', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shi-chimi.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 1002009, u'unit': u'handful'}, {u'originalString': u'1 tsp light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'tsp'}, {u'originalString': u'1 tsp mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93830, u'unit': u'tsp'}, {u'originalString': u'1/2 onion thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'6 Japanese oysters if using frozen, thaw before use', u'aisle': u'Seafood', u'name': u'oysters', u'metaInformation': [u'frozen', u'thaw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 15167, u'unit': u''}, {u'originalString': u'lightly salted water just a small pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'salted', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'dashes of Shichimi togarashi (Japanese seven flavor chili pepper) to taste', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'shichimi togarashi', u'metaInformation': [u'to taste', u'(Japanese seven flavor chili pepper)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shi-chimi.jpg', u'unitLong': u'dashe', u'unitShort': u'dashes', u'amount': 1.0, u'consistency': u'solid', u'id': 1002009, u'unit': u'dashes'}, {u'originalString': u'1 serving cooked Japanese short-grain rice', u'aisle': u'Pasta and Rice', u'name': u'short grain rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 10120052, u'unit': u'serving'}, {u'originalString': u'1/2 tbsp chopped spring onions', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11291, u'unit': u'tbsp'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.noobcook.com/oyster-donburi/2/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare the oysters by first cleaning them in lightly salted water, then rinse in clean water. Blanch oysters in boiling water briefly for about 10 seconds or until they plump up slightly, drain and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'id': 15167, u'name': u'oysters'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add dashi stock, soy sauce and mirin to a saucepan. Once the sauce starts to boil, reduce heat. Distribute onions, oysters and ginger juice evenly across the pan. Simmer for two minutes, then flip oysters to the other side for another minute.Once the oysters are cooked, gently distribute the beaten egg evenly over the contents of the saucepan. When the egg is half-cooked, turn off the heat, put on the lid and let the egg continue cooking in the heat until it reaches the desired consistency (almost cooked with moist & silky appearance).To serve, ladle cooked Japanese rice to serving bowl and top with seaweed or furikake. Scoop the egg mixture over the rice and top with dashes of Shichimi togarashi and spring onions.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shi-chimi.jpg', u'id': 1002009, u'name': u'shichimi togarashi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger-juice.jpg', u'id': 93752, u'name': u'ginger juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'id': 15167, u'name': u'oysters'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006963, u'name': u'dashi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'id': 93830, u'name': u'mirin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Casa Catelli Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Prepare the oysters by first cleaning them in lightly salted water, then rinse in clean water. Blanch oysters in boiling water briefly for about 10 seconds or until they plump up slightly, drain and set aside.Add dashi stock, soy sauce and mirin to a saucepan. Once the sauce starts to boil, reduce heat. Distribute onions, oysters and ginger juice evenly across the pan. Simmer for two minutes, then flip oysters to the other side for another minute.Once the oysters are cooked, gently distribute the beaten egg evenly over the contents of the saucepan. When the egg is half-cooked, turn off the heat, put on the lid and let the egg continue cooking in the heat until it reaches the desired consistency (almost cooked with moist & silky appearance).To serve, ladle cooked Japanese rice to serving bowl and top with seaweed or furikake. Scoop the egg mixture over the rice and top with dashes of Shichimi togarashi and spring onions.', u'spoonacularSourceUrl': u'https://spoonacular.com/oyster-donburi-565054', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}