{u'recipes': [{u'sourceName': u'Seeded at the Table', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/615604-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 615604, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peanut Butter and Bacon Burger with Peach Chutney', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 240.82, u'creditText': u'Seeded at the Table', u'extendedIngredients': [{u'originalString': u'8 slices cooked bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1/4 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup creamy peanut butter (more or less, to taste)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [u'to taste', u'(more or less, )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'4 hamburger buns (homemade or store-bought)', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [u'homemade', u'store-bought', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.seededatthetable.com/2014/10/01/peanut-butter-and-bacon-burger-with-peach-chutney/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat up your grill.  Meanwhile, shape the ground beef into 4 individual patties, mixing in the salt and pepper. Grill the burgers until cooked to desired doneness, 4 to 5 minutes per side or until the internal temperature reaches 160 degrees F.  Lightly toast the buns on the grill, if desired.To assemble the burgers, place a burger patty on bottom half of bun. Layer with peanut butter, bacon and peach chutney (amounts are up to your taste). Finish it off with the top half of the bun. Repeat with the other patties and ingredients. Open your mouth wide, take a big bite and relish the sweet and savory delight!', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger can be paired with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Belasco de Baquedano Llama Malbec. It has 4.3 out of 5 stars and a bottle costs about 17 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'As its namesake, this wine embodies the distinctive spirit of our vineyards, spanning the foothills of the Andes. Llama is a rich ruby-purple color, and boasts elegant flavors of black berries, ripe plum and robust spices with good balance and structure.', u'title': u'Belasco de Baquedano Llama Malbec', u'price': u'$16.99', u'id': 449922, u'link': u'https://www.wine.com/product/belasco-de-baquedano-llama-malbec-2013/132727', u'imageUrl': u'https://spoonacular.com/productImages/449922-312x231.jpg'}]}, u'aggregateLikes': 105, u'instructions': u'Heat up your grill.  Meanwhile, shape the ground beef into 4 individual patties, mixing in the salt and pepper. Grill the burgers until cooked to desired doneness, 4 to 5 minutes per side or until the internal temperature reaches 160 degrees F.  Lightly toast the buns on the grill, if desired.To assemble the burgers, place a burger patty on bottom half of bun. Layer with peanut butter, bacon and peach chutney (amounts are up to your taste). Finish it off with the top half of the bun. Repeat with the other patties and ingredients. Open your mouth wide, take a big bite and relish the sweet and savory delight!', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-and-bacon-burger-with-peach-chutney-615604', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}