{u'recipes': [{u'sourceName': u'Foodista', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/633263-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 633263, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon & Potato Soup, Gluten & Dairy Free', u'diets': [u'dairy free'], u'pricePerServing': 155.75, u'creditText': u'Foodista.com – The Cooking Encyclopedia Everyone Can Edit', u'extendedIngredients': [{u'originalString': u'2 slices Bacon (cooked and diced)', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'diced', u'cooked', u'( and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'2 1/4 cups diced red or baking potaotes', u'aisle': u'Baking', u'name': u'baking mix', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 18010, u'unit': u'cups'}, {u'originalString': u'7 cups vegetable or chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 7.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 tsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tsp'}, {u'originalString': u'3 Tbsp flat leaf parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'3 cups Savoy cabbage, shredded', u'aisle': u'Produce', u'name': u'savoy cabbage', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/savoy-cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11114, u'unit': u'cups'}, {u'originalString': u'1 tsp Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tsp'}, {u'originalString': u'2 yellow onions, diced', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}, {u'originalString': u'Garnish with a tablespoon of lemon', u'aisle': u'?', u'name': u'garnish', u'metaInformation': [u'with a tablespoon of lemon'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'unit': u'servings'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.foodista.com/recipe/QPXXKRS4/bacon-potato-soup-gluten-free', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large stock pot, heat the olive oil over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the chopped bacon and onions, cooking until the bacon is crisp and the onions are translucent.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add garlic and cook for one more minute, until fragrant.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the chicken or vegetable stock, potatoes, cabbage, Worcestershire sauce and mustard.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Mix well and season with salt and pepper. Bring soup to a boil, then reduce heat and simmer for 30 minutes, or until potatoes are tender but not disintegrating.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the pot from heat and allow it to cool for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Transfer 2 1/2 cups of the soup to a blender and pulse quickly to achiever a coarse puree.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Pour blended portion back into the stock pot and return to heat. Cook, stirring often, for 5-10 minutes or until heated through.Stir in parsley and ladle into serving bowls.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve with a wedge of lemon and gluten free garlic croutons.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 47, u'instructions': u'<ol><li>In a large stock pot, heat the olive oil over medium-high heat. Add the chopped bacon and onions, cooking until the bacon is crisp and the onions are translucent. Add garlic and cook for one more minute, until fragrant.</li><li>Add the chicken or vegetable stock, potatoes, cabbage, Worcestershire sauce and mustard. Mix well and season with salt and pepper. Bring soup to a boil, then reduce heat and simmer for 30 minutes, or until potatoes are tender but not disintegrating.</li><li>Remove the pot from heat and allow it to cool for 5 minutes. Transfer 2 1/2 cups of the soup to a blender and pulse quickly to achiever a coarse puree. Pour blended portion back into the stock pot and return to heat. Cook, stirring often, for 5-10 minutes or until heated through.</li><li>Stir in parsley and ladle into serving bowls. Serve with a wedge of lemon and gluten free garlic croutons.</li></ol>', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-potato-soup-gluten-dairy-free-633263', u'license': u'CC BY 3.0', u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}