{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599866-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 599866, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spaghetti Pie', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 139.59, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1/4 pound butter or margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'pound'}, {u'originalString': u'1 Large container small curd cottage cheese', u'aisle': u'Cheese', u'name': u'cheese curd', u'metaInformation': [u'small', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheese-curds.png', u'unitLong': u'container', u'unitShort': u'container', u'amount': 1.0, u'consistency': u'solid', u'id': 98921, u'unit': u'container'}, {u'originalString': u'4 eggs or eggbeaters', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 Large bag of shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'bag'}, {u'originalString': u'1 pound spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'pound'}, {u'originalString': u"1 Large jar spaghetti sauce (I use 2 large Prego's)", u'aisle': u'Pasta and Rice', u'name': u'spaghetti sauce', u'metaInformation': [u'large', u"(I use 2 Prego's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 10011549, u'unit': u'jar'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.copykat.com/2009/02/07/spaghetti-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put cooked spaghetti (not rinsed) in large bowl with: butter, parmesan and eggs After you mix this well, put into a buttered 10 x 14 pan or put into two pie pans and freeze one if you want smaller portions.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour spaghetti sauce on top, spread on cottage cheese. Sprinkle more Parmesan cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10011549, u'name': u'pasta sauce'}]}, {u'equipment': [], u'step': u'Bake at 350 for thirty minutes. Put on mozzarella cheese and make ten more minutes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 94, u'instructions': u'Put cooked spaghetti (not rinsed) in large bowl with: butter, parmesan and eggs After you mix this well, put into a buttered 10 x 14 pan or put into two pie pans and freeze one if you want smaller portions. Pour spaghetti sauce on top, spread on cottage cheese. Sprinkle more Parmesan cheese. Bake at 350 for thirty minutes. Put on mozzarella cheese and make ten more minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-pie-599866', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}