{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520010-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 520010, u'veryPopular': True, u'lowFodmap': False, u'title': u'Soft and Chewy Cinnamon Chip Snickerdoodle Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 18.17, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tablespoon Greek yogurt or sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'pinch salt, optional and to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 10-ounce bag (about 1 2/3 cups) cinnamon chips', u'aisle': u'Tea and Coffee', u'name': u'tea bag', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.6666666666666665, u'consistency': u'solid', u'id': 10111111, u'unit': u'cups'}, {u'originalString': u'1/2 cup unsalted butter (1 stick)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.averiecooks.com/2013/05/soft-and-chewy-cinnamon-chip-snickerdoodle-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To the bowl of a stand mixer fitted with the paddle attachment, combine the egg, butter, sugars, and beat on medium-high speed until well-creamed, light and fluffy, about 5 minutes (or use a hand mixer and beat for at least 7 minutes).', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add the Greek yogurt, vanilla, and beat to incorporate until fluffy again, about 2 minutes. Stop, scrape down the sides of the bowl, and add the flour, cinnamon, cornstarch, cream of tartar, baking soda, optional salt, and beat until just incorporated, about 2 minutes. Don't overmix.", u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the cinnamon chips and either fold in by hand or beat momentarily to combine. Using a medium 2-inch cookie scoop, form mounds (I made 23).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place mounds on a large plate, flatten mounds slightly, cover with plasticwrap, and refrigerate for at least 2 hours, or up to 5 days, before baking. Do not bake with warm dough because cookies will spread and bake thinner and flatter. Preheat oven to 350F, line a baking sheet with a\xa0Silpat, parchment, or spray with cooking spray.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet).', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake for 8 to 9 minutes, or until edges have set and tops are just beginning to set, even if slightly undercooked, pale and glossy in the center. Do not bake longer than 10 minutes as cookies will firm up as they cool (The cookies shown in the photos were baked with dough that had been chilled overnight, allowed to come to room temp for 15 minutes, and were baked for 8 minutes, with trays rotated at the 4-minute mark. They have chewy edges with soft, pillowy centers). Allow cookies to cool on the baking sheet for 5 minutes before removing and transferring to a rack to finish cooling. Store cookies airtight at room temperature for up to 1 week, or in the freezer for up to 3 months. Alternatively, unbaked cookie dough can be stored airtight in the refrigerator for up to 5 days, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.  Adapted from Sugar-Doodle Vanilla Cookies and White Chocolate Snickerdoodles', u'length': {u'number': 46, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 6124, u'instructions': u"To the bowl of a stand mixer fitted with the paddle attachment, combine the egg, butter, sugars, and beat on medium-high speed until well-creamed, light and fluffy, about 5 minutes (or use a hand mixer and beat for at least 7 minutes). Add the Greek yogurt, vanilla, and beat to incorporate until fluffy again, about 2 minutes. Stop, scrape down the sides of the bowl, and add the flour, cinnamon, cornstarch, cream of tartar, baking soda, optional salt, and beat until just incorporated, about 2 minutes. Don't overmix. Add the cinnamon chips and either fold in by hand or beat momentarily to combine. Using a medium 2-inch cookie scoop, form mounds (I made 23). Place mounds on a large plate, flatten mounds slightly, cover with plasticwrap, and refrigerate for at least 2 hours, or up to 5 days, before baking. Do not bake with warm dough because cookies will spread and bake thinner and flatter. Preheat oven to 350F, line a baking sheet with a\xa0Silpat, parchment, or spray with cooking spray. Place mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet). Bake for 8 to 9 minutes, or until edges have set and tops are just beginning to set, even if slightly undercooked, pale and glossy in the center. Do not bake longer than 10 minutes as cookies will firm up as they cool (The cookies shown in the photos were baked with dough that had been chilled overnight, allowed to come to room temp for 15 minutes, and were baked for 8 minutes, with trays rotated at the 4-minute mark. They have chewy edges with soft, pillowy centers). Allow cookies to cool on the baking sheet for 5 minutes before removing and transferring to a rack to finish cooling. Store cookies airtight at room temperature for up to 1 week, or in the freezer for up to 3 months. Alternatively, unbaked cookie dough can be stored airtight in the refrigerator for up to 5 days, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.  Adapted from Sugar-Doodle Vanilla Cookies and White Chocolate Snickerdoodles", u'spoonacularSourceUrl': u'https://spoonacular.com/soft-and-chewy-cinnamon-chip-snickerdoodle-cookies-520010', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 22, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}