{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/492909-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 492909, u'veryPopular': True, u'lowFodmap': False, u'title': u'Simple Grilled Whole Lobster', u'diets': [u'gluten free', u'primal', u'pescatarian'], u'preparationMinutes': 25, u'pricePerServing': 271.04, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'4 tablespoons melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon minced garlic (optional)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'pinch of ground pepper (grinding it fresh onto the lobster will make a huge difference)', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh', u'(grinding it onto the lobster will make a huge difference)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 whole lobster', u'aisle': u'Seafood', u'name': u'whole lobster', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 15147, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.foodrepublic.com/2012/05/07/simple-grilled-whole-lobster-recipe', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Parboil the lobster so you don't end up with a nicely grilled outside and raw inside. Drop the lobster in a pot of boiling water, remove after five minutes and shock in an ice bath to stop it from cooking any further.Slice the lobster lengthwise all the way through into two halves. Clean out the tomalley (green stuff) from the body.With the same knife, cut small slits in the claws to vent while cooking.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush the exposed meat with a mixture of melted butter, lemon juice, a little salt and freshly ground pepper, and if you want, some minced garlic.Clean and lightly oil the grill and get your coals at medium heat. Lay the lobster flesh side down and cook for about five minutes. Then turn it over, brush on more lemon butter, and cook shell side down for another five minutes. When finished the meat should be firm and opaque all the way through.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with more lemon butter on the side.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Lobster can be paired with Chablis and Chardonnay. Chablis is perfect with lobster, but a chardonny from other regions is bound to hit the spot too. The Louis Jadot Chablis with a 4.4 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chablis', u'chardonnay'], u'productMatches': [{u'description': u'The Louis Jadot Chablis has a very nice golden yellow color. It is a lipid, bright and fresh wine, which taste and bouquet develop relatively quickly.It should be served chilled, and can be served with oysters, charcuterie and fried fish. It also goes very well with goats cheese. View More', u'title': u'Louis Jadot Chablis', u'price': u'$19.99', u'id': 441116, u'link': u'https://www.wine.com/product/louis-jadot-chablis-2009/106717', u'imageUrl': u'https://spoonacular.com/productImages/441116-312x231.jpg'}]}, u'aggregateLikes': 1634, u'instructions': u"Directions:\xa0                                    Parboil the lobster so you don't end up with a nicely grilled outside and raw inside. Drop the lobster in a pot of boiling water, remove after five minutes and shock in an ice bath to stop it from cooking any further.Slice the lobster lengthwise all the way through into two halves. Clean out the tomalley (green stuff) from the body.With the same knife, cut small slits in the claws to vent while cooking. Brush the exposed meat with a mixture of melted butter, lemon juice, a little salt and freshly ground pepper, and if you want, some minced garlic.Clean and lightly oil the grill and get your coals at medium heat. Lay the lobster flesh side down and cook for about five minutes. Then turn it over, brush on more lemon butter, and cook shell side down for another five minutes. When finished the meat should be firm and opaque all the way through.Serve with more lemon butter on the side.", u'spoonacularSourceUrl': u'https://spoonacular.com/simple-grilled-whole-lobster-492909', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}