{u'recipes': [{u'sourceName': u'Mels Kitchen Caf\xe9', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/568900-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 568900, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoked Salmon Chowder', u'diets': [], u'pricePerServing': 234.96, u'creditText': u'Mels Kitchen Caf\xe9', u'extendedIngredients': [{u'originalString': u'4 strips smoked bacon, diced', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'smoked', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 large carrot, peeled and finely diced (or about 7 baby carrots)', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'diced', u'large', u'peeled', u'finely', u'(or 7 baby carrots)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 celery rib, finely diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'rib', u'unitShort': u'rib', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'12 ounces frozen sweet corn kernels', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [u'sweet', u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11172, u'unit': u'ounces'}, {u'originalString': u'\xbc cup plus 2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tablespoon'}, {u'originalString': u'2 garlic cloves, finely minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'5 cups 1% or higher fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'1%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 1174, u'unit': u'cups'}, {u'originalString': u'1 red bell pepper, finely diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 cup diced smoked salmon (about 6 ounces)', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'smoked', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 15076, u'unit': u'ounces'}, {u'originalString': u'1/2 tablespoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'\xbc teaspoon tobasco sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 6150, u'unit': u'teaspoon'}, {u'originalString': u'1 large yellow onion, minced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.melskitchencafe.com/smoked-salmon-chowder/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, melt the butter over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the bacon and cook until it renders its fat and starts to crisp, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add the onion and cook until soft, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the carrot, celery, garlic and bell pepper and cook for 5 minutes more, stirring occasionally.Sprinkle the flour over the vegetables and cook, stirring, for 1-2 minutes. Gradually whisk in the milk. Bring the soup to a simmer over medium heat, stirring constantly to avoid scorching. Reduce the heat to low and simmer for 20 minutes, stirring occasionally.Stir in the corn kernels and smoked salmon.', u'length': {u'number': 27, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11172, u'name': u'corn kernels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Heat through for about 5 minutes. Season with salt, Tabasco, pepper, lemon juice and dill. Taste a bit of the soup and add more salt and fresh dill as needed.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'fresh dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Serve immediately. The soup can also be cooled to room temperature and then refrigerated for up to 2 days. Reheat slowly on the stove, stirring often.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add more milk gradually if the soup is too thick.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salmon Chowder on the menu? Try pairing with Chardonnay, Pinot Noir, and Riesling. Chowder can benefit from a crisp white to cut through the rich, creamy broth - or you can go big or go home with a rich, buttery chardonnay. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling', u'sauvignon blanc', u'sparkling rose'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 30, u'instructions': u'In a large saucepan, melt the butter over medium heat. Add the bacon and cook until it renders its fat and starts to crisp, about 5 minutes. Add the onion and cook until soft, about 5 minutes. Add the carrot, celery, garlic and bell pepper and cook for 5 minutes more, stirring occasionally.Sprinkle the flour over the vegetables and cook, stirring, for 1-2 minutes. Gradually whisk in the milk. Bring the soup to a simmer over medium heat, stirring constantly to avoid scorching. Reduce the heat to low and simmer for 20 minutes, stirring occasionally.Stir in the corn kernels and smoked salmon. Heat through for about 5 minutes. Season with salt, Tabasco, pepper, lemon juice and dill. Taste a bit of the soup and add more salt and fresh dill as needed.Serve immediately. The soup can also be cooled to room temperature and then refrigerated for up to 2 days. Reheat slowly on the stove, stirring often. Add more milk gradually if the soup is too thick.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-salmon-chowder-568900', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}