{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 694946, u'veryPopular': True, u'lowFodmap': False, u'title': u'Smoked Turkey, Kale & Rice Bake', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 356.22, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 28-ounce can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 cup thinly sliced celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 cup low-fat, no-salt-added cottage cheese', u'aisle': u'Cheese', u'name': u'cottage cheese', u'metaInformation': [u'low-fat,'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1012, u'unit': u'cup'}, {u'originalString': u'4 cups slivered kale leaves', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'2 cups thinly sliced leeks, white and light green parts only', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'light', u'white', u'green', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u'cups'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon freshly ground pepper, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup instant or quick-cooking brown rice', u'aisle': u'Pasta and Rice', u'name': u'quick-cooking brown rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10020048, u'unit': u'cup'}, {u'originalString': u'1 cup shredded extra-sharp Cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded', u'extra-sharp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'6 ounces smoked turkey breast or smoked tofu, chopped (1 1/2 cups)', u'aisle': u'Meat', u'name': u'turkey breast', u'metaInformation': [u'smoked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 5696, u'unit': u'cups'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 73.0, u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/turkey_kale_bake.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a large, ovenproof skillet over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add leeks and celery and cook, stirring frequently, until beginning to soften, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add kale and tomatoes and cook, stirring, until the kale begins to wilt, 1 to 2 minutes. Stir in cottage cheese, rice, turkey (or tofu), water and pepper. Bring to a simmer. Reduce heat to medium-low, cover and cook for 10 minutes.Meanwhile, position rack in upper third of oven; preheat broiler.Stir the rice mixture, increase the heat to medium and cook, uncovered, until most of the liquid has evaporated, 10 to 12 minutes.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'id': 1012, u'name': u'cottage cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Spread cheese on top. Broil until the cheese is bubbling, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 3504, u'instructions': u'Heat oil in a large, ovenproof skillet over medium-high heat. Add leeks and celery and cook, stirring frequently, until beginning to soften, 2 to 3 minutes. Add kale and tomatoes and cook, stirring, until the kale begins to wilt, 1 to 2 minutes. Stir in cottage cheese, rice, turkey (or tofu), water and pepper. Bring to a simmer. Reduce heat to medium-low, cover and cook for 10 minutes.Meanwhile, position rack in upper third of oven; preheat broiler.Stir the rice mixture, increase the heat to medium and cook, uncovered, until most of the liquid has evaporated, 10 to 12 minutes. Spread cheese on top. Broil until the cheese is bubbling, 2 to 3 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-turkey-kale-rice-bake-694946', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}