{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/445015-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 445015, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pepperoni Frittata', u'diets': [u'gluten free', u'ketogenic'], u'preparationMinutes': 5, u'pricePerServing': 62.1, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 to 3 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup small cauliflowerets', u'aisle': u'Produce', u'name': u'cauliflowerets', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011135, u'unit': u'cup'}, {u'originalString': u'5 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1-1/4 cups chopped onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1/3 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'26 slices pepperoni', u'aisle': u'Meat', u'name': u'pepperoni', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 26.0, u'consistency': u'solid', u'id': 7057, u'unit': u'slices'}, {u'originalString': u'1 cup sliced zucchini', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/pepperoni-frittata', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a 10-in. ovenproof skillet, saute the onions in oil until tender.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the zucchini, cauliflower and eggs. Cover and cook over medium heat for 10-15 minutes or until eggs are nearly set.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Arrange pepperoni over eggs. Broil 6 in. from the heat for 2 minutes. Sprinkle with Parmesan cheese; broil 1-2 minutes longer or until eggs are completely set and top is lightly browned.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'id': 7057, u'name': u'pepperoni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Cut into wedges.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 26, u'instructions': u'Directions                                                                                In a 10-in. ovenproof skillet, saute the onions in oil until tender. Add the zucchini, cauliflower and eggs. Cover and cook over medium heat for 10-15 minutes or until eggs are nearly set.                                                                                           Arrange pepperoni over eggs. Broil 6 in. from the heat for 2 minutes. Sprinkle with Parmesan cheese; broil 1-2 minutes longer or until eggs are completely set and top is lightly browned. Cut into wedges.                                        Yield: 6 servings.                                                                                                                         Originally published as Pepperoni Frittata in  Quick CookingJanuary/February 2004, p58                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 181 calories, 14 g fat (4 g saturated fat), 188 mg cholesterol, 299 mg sodium, 5 g carbohydrate, 1 g fiber, 9 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/pepperoni-frittata-445015', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}