{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/695205-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 695205, u'veryPopular': True, u'lowFodmap': False, u'title': u'Seared Steaks with Caramelized Onions & Gorgonzola', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 238.67, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 tablespoon balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons canola oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup crumbled Gorgonzola or blue cheese', u'aisle': u'Cheese', u'name': u'gorgonzola', u'metaInformation': [u'blue', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1011004, u'unit': u'cup'}, {u'originalString': u'1/2 cup reduced-sodium beef broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium beef broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10093741, u'unit': u'cup'}, {u'originalString': u'2 large onions, sliced (about 4 cups)', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound beef tenderloin (filet mignon) or sirloin steak, 1-1 1/4 inches thick, trimmed and cut into 4 steaks', u'aisle': u'Meat', u'name': u'sirloin steak', u'metaInformation': [u'thick', u'trimmed', u'cut into 4 steaks', u'(filet mignon)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sirloin-raw.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23625, u'unit': u'pound'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/seared_steaks_with_caramelized_onions_gorgonzola.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tablespoon oil in a large skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add onions and brown sugar and cook, stirring often, until the onions are very tender and golden brown, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add broth, vinegar and 1/4 teaspoon salt and cook, stirring, until the liquid has almost evaporated, 3 to 4 minutes more.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the onions to a bowl; cover to keep warm. Clean and dry the pan.Sprinkle the remaining 1/4 teaspoon salt and pepper on both sides of each steak.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining 1 tablespoon oil in the pan over medium-high heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the steaks and cook until browned, 3 to 5 minutes. Turn them over and top with cheese. Reduce heat to medium-low, cover and cook until the cheese is melted and the steaks are cooked to desired doneness, 3 to 5 minutes for medium-rare.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the steaks with the caramelized onions.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10211282, u'name': u'caramelized onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are my top picks for Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. You could try NV The Big Kahuna Merlot. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 7 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'A ripe and rounded Merlot with notes of plum, blackberry, and hint of spice .', u'title': u'NV The Big Kahuna Merlot', u'price': u'$6.99', u'id': 430475, u'link': u'https://www.amazon.com/Big-Kahuna-Merlot-Red-Wine/dp/B01F5XPTUW', u'imageUrl': u'https://spoonacular.com/productImages/430475-312x231.jpg'}]}, u'aggregateLikes': 3822, u'instructions': u'Heat 1 tablespoon oil in a large skillet over medium heat. Add onions and brown sugar and cook, stirring often, until the onions are very tender and golden brown, about 15 minutes. Add broth, vinegar and 1/4 teaspoon salt and cook, stirring, until the liquid has almost evaporated, 3 to 4 minutes more. Transfer the onions to a bowl; cover to keep warm. Clean and dry the pan.Sprinkle the remaining 1/4 teaspoon salt and pepper on both sides of each steak. Heat the remaining 1 tablespoon oil in the pan over medium-high heat. Add the steaks and cook until browned, 3 to 5 minutes. Turn them over and top with cheese. Reduce heat to medium-low, cover and cook until the cheese is melted and the steaks are cooked to desired doneness, 3 to 5 minutes for medium-rare. Serve the steaks with the caramelized onions.', u'spoonacularSourceUrl': u'https://spoonacular.com/seared-steaks-with-caramelized-onions-gorgonzola-695205', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}