{u'recipes': [{u'sourceName': u'Eclectic Recipes', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/612334-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 612334, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cheesy Chicken and Broccoli Pizza', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 254.69, u'creditText': u'Eclectic Recipes', u'extendedIngredients': [{u'originalString': u'1 (11 oz) bag Green Giant Tuscan Seasoned Broccoli', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 11090, u'unit': u'oz'}, {u'originalString': u'1 (8 oz) bag Grilled and Ready Chicken Breasts Strips, or leftover grilled chicken breasts strips', u'aisle': u'Meat', u'name': u'chicken strips', u'metaInformation': [u'leftover'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1015062, u'unit': u'oz'}, {u'originalString': u'1 12-inch ready made pizza crust', u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93770, u'unit': u''}, {u'originalString': u'1/2 cup jarred pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'jarred'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'1 cup shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://eclecticrecipes.com/cheesy-chicken-and-broccoli-pizza', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 450.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place broccoli in microwave and cook for 5 minutes, just until thawed. Broccoli will finish cooking in oven. Start assembling pizza by spreading pizza sauce over crust.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Add  cup of the shredded cheese on top of the sauce.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1011026, u'name': u'shredded cheese'}]}, {u'equipment': [], u'step': u'Spread grilled chicken on top of cheese and then place broccoli on top of pizza.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Add the other  cup of cheese on top of pizza.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake pizza for 10  15 minutes, or until cheese has melted and pizza has lightly browned.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Fonterutoli Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u"Color: Deep purplish-red but bright and exceptionally concentrated.Bouquet: Extremely intense and complex with scents of cherries and raspberries accompanied by light toasty and spicy shadings.Flavor: The impact in the mouth is incisive but soft due to a substantial structure of tannins in which those that are soft and well rounded stand out. Acidity is fused with the wine's body and aids the transmission of pleasant sensations of warmth and strength. The wine features a long finish that is unusual for a regular Chianti Classico.Conclusions: Those who argue that Chianti Classico is a prickly and rough wine will change their minds after tasting this 1999, which is ready to drink now but will improve for at least five years more.Alcohol: 13.5% by volume View More", u'title': u'Fonterutoli Chianti Classico', u'price': u'$24.49', u'id': 440954, u'link': u'https://www.wine.com/product/fonterutoli-chianti-classico-1998/12434', u'imageUrl': u'https://spoonacular.com/productImages/440954-312x231.jpg'}]}, u'aggregateLikes': 553, u'instructions': u'Heat oven to 450.  Place broccoli in microwave and cook for 5 minutes, just until thawed. Broccoli will finish cooking in oven. Start assembling pizza by spreading pizza sauce over crust. Add  cup of the shredded cheese on top of the sauce. Spread grilled chicken on top of cheese and then place broccoli on top of pizza. Add the other  cup of cheese on top of pizza.  Bake pizza for 10  15 minutes, or until cheese has melted and pizza has lightly browned.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-chicken-and-broccoli-pizza-612334', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}