{u'recipes': [{u'sourceName': u'I Heart Nap Time', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/610603-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 610603, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy taco salad', u'diets': [], u'pricePerServing': 419.86, u'creditText': u'I Heart Nap Time', u'extendedIngredients': [{u'originalString': u"Other fix-in's you could add: avocado, pico de gallo, black beans, corn", u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9037, u'unit': u'servings'}, {u'originalString': u'Shredded lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'1 lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u"Uncle Ben's Ready Rice", u'aisle': u'Pasta and Rice', u'name': u'ready-to-serve Asian fried rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fried-rice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 93721, u'unit': u'servings'}, {u'originalString': u'1 rotisserie chicken, shredded', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 5112, u'unit': u''}, {u'originalString': u'Salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'servings'}, {u'originalString': u'Shredded cheese', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'servings'}, {u'originalString': u'Sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}, {u'originalString': u'Diced tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u'servings'}, {u'originalString': u'Tortilla strips or crushed tortilla strips', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'tortilla strips', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-strips.jpg', u'unitLong': u'strip', u'unitShort': u'strips', u'amount': 1.0, u'consistency': u'solid', u'id': 98977, u'unit': u'strips'}], u'healthScore': 61.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.iheartnaptime.net/easy-taco-salad-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl layer the lettuce, chicken and rice. Then top with salsa, shredded cheese, tomatoes, sour cream and tortilla strips. Squeeze fresh lime juice over the top of your salad if desired.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1011026, u'name': u'shredded cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-strips.jpg', u'id': 98977, u'name': u'tortilla strips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Taco Salad can be paired with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The District 7 Estate Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 93, u'instructions': u'In a small bowl layer the lettuce, chicken and rice. Then top with salsa, shredded cheese, tomatoes, sour cream and tortilla strips. Squeeze fresh lime juice over the top of your salad if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-taco-salad-610603', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}