{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/603163-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 603163, u'veryPopular': True, u'lowFodmap': False, u'title': u'S’Mores Rice Krispie Treats', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 11.38, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'5 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'3 cups Golden Grahams cereal, crushed slightly (put in plastic bag and roll with a rolling pin)', u'aisle': u'Cereal', u'name': u'cereal', u'metaInformation': [u'with a rolling pin)', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bran-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 8029, u'unit': u'cups'}, {u'originalString': u'1 package small marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u'package'}, {u'originalString': u'6 regular size Hershey Bars broken into small sections', u'aisle': u'Cereal', u'name': u'regular chex', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chex-cereal.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1008082, u'unit': u''}, {u'originalString': u'3 cups Rice Krispies cereal', u'aisle': u'Cereal', u'name': u'rice krispies cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 8065, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.creative-culinary.com/smores-rice-krispie-treats/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat broiler in oven. Put shelf on 2nd row down from heating element.Butter the inside of a 13" X 9" pan.In large saucepan melt the butter over low heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the marshmallows and stir until completely coated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Add the two cereals and stir until well coated.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from heat and using a buttered spatula press the mixture into the prepared pan. Scatter the Hershey bar pieces evenly over the cereal mixture. Put in the oven for a minute to soften; remove and spread the chocolate evenly over the top.Cover the entire surface of the treats with small marshmallows.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'id': 8029, u'name': u'cereal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the pan into the oven to broil the top of the marshmallows. WATCH CLOSELY. Ovens will vary but start checking after one minute; change position of pan if necessary to brown evenly.Cool.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Cut into 2-inch squares. Best if served the same day.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Rice Crispy Treats. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1094, u'instructions': u'Preheat broiler in oven. Put shelf on 2nd row down from heating element.Butter the inside of a 13" X 9" pan.In large saucepan melt the butter over low heat. Add the marshmallows and stir until completely coated. Add the two cereals and stir until well coated.Remove from heat and using a buttered spatula press the mixture into the prepared pan. Scatter the Hershey bar pieces evenly over the cereal mixture. Put in the oven for a minute to soften; remove and spread the chocolate evenly over the top.Cover the entire surface of the treats with small marshmallows. Put the pan into the oven to broil the top of the marshmallows. WATCH CLOSELY. Ovens will vary but start checking after one minute; change position of pan if necessary to brown evenly.Cool. Cut into 2-inch squares. Best if served the same day.', u'spoonacularSourceUrl': u'https://spoonacular.com/smores-rice-krispie-treats-603163', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 23, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}