{u'recipes': [{u'sourceName': u'Foxes Love Lemons', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/605883-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 6, u'id': 605883, u'veryPopular': False, u'lowFodmap': False, u'title': u'Raisin Crostini with Blue Cheese & Apples', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 62.96, u'creditText': u'Foxes Love Lemons', u'extendedIngredients': [{u'originalString': u'2 Fuji apples, cored and chopped', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'cored', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'2 sprigs fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'Honey for drizzling', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'servings'}, {u'originalString': u'Juice of \xbd lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'3 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces Salemville Reserve Extra-Aged Amish Blue Cheese, cut or crumbled into large pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'pecan pieces', u'metaInformation': [u'blue', u'crumbled', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 10012142, u'unit': u'ounces'}, {u'originalString': u'1/2 loaf raisin bread, halved and cut into \xbd-inch-thick slices (about 10 pieces)', u'aisle': u'Bakery/Bread', u'name': u'raisin bread', u'metaInformation': [u'halved', u'cut into \xbd-inch-thick slices ( 10 pieces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-raisin-bread.jpg', u'unitLong': u'loafs', u'unitShort': u'loaf', u'amount': 0.5, u'consistency': u'solid', u'id': 18047, u'unit': u'loaf'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://foxeslovelemons.com/raisin-crostini-blue-cheese-apples/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place bread slices on rimmed baking pan and brush with 2 tablespoons oil.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake 4 to 6 minutes or until crisp.Meanwhile, heat remaining 1 tablespoon oil in large skillet over medium-low heat.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add apples and thyme; cook 6 to 8 minutes or until apples are just slightly tender.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Remove from heat; remove thyme sprigs and stir in lemon juice.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Let cool slightly.Divide cheese over toast points. Divide apple mixture over cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Drizzle with honey and serve immediately.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'aggregateLikes': 18, u'instructions': u'Preheat oven to 400 degrees F. Place bread slices on rimmed baking pan and brush with 2 tablespoons oil. Bake 4 to 6 minutes or until crisp.Meanwhile, heat remaining 1 tablespoon oil in large skillet over medium-low heat. Add apples and thyme; cook 6 to 8 minutes or until apples are just slightly tender. Remove from heat; remove thyme sprigs and stir in lemon juice. Let cool slightly.Divide cheese over toast points. Divide apple mixture over cheese. Drizzle with honey and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/raisin-crostini-with-blue-cheese-apples-605883', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 16, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}