{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/411893-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 411893, u'veryPopular': False, u'lowFodmap': True, u'title': u'Raspberry Meringues', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 20, u'pricePerServing': 6.36, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/2 cup finely chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'3 tablespoons plus 1 teaspoon raspberry gelatin powder', u'aisle': u'Baking', u'name': u'raspberry gelatin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-jello.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10319172, u'unit': u'tablespoons'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1 teaspoon shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/raspberry-meringues', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place egg whites in a large bowl; let stand at room temperature for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [], u'step': u'Beat eggs whites until soft peaks form. Gradually add gelatin, beating until combined. Gradually add sugar, 1 tablespoon at a time, beating until stiff peaks form. Beat in vinegar and salt. Fold in chocolate chips and nuts.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Drop by rounded teaspoonfuls onto parchment-lined baking sheets.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake at 250\xb0 for 20-25 minutes or until firm to the touch. Turn oven off; leave cookies in the oven with door ajar for about 1-1/2 hours or until cool.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'In a microwave, melt chocolate chips and shortening; stir until smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [], u'step': u'Drizzle over cookies.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 32, u'instructions': u'Directions                                                                                Place egg whites in a large bowl; let stand at room temperature for 30 minutes.                                                                                            Beat eggs whites until soft peaks form. Gradually add gelatin, beating until combined. Gradually add sugar, 1 tablespoon at a time, beating until stiff peaks form. Beat in vinegar and salt. Fold in chocolate chips and nuts.                                                                                           Drop by rounded teaspoonfuls onto parchment-lined baking sheets. Bake at 250\xb0 for 20-25 minutes or until firm to the touch. Turn oven off; leave cookies in the oven with door ajar for about 1-1/2 hours or until cool.                                                                                            In a microwave, melt chocolate chips and shortening; stir until smooth. Drizzle over cookies.                                        Yield: 7-1/2 dozen.                                                                                                                         Originally published as Raspberry Meringues in  Country Woman ChristmasAnnual 2003, p45                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (2 each) equals 68 calories, 4 g fat (2 g saturated fat), 0 cholesterol, 14 mg sodium, 10 g carbohydrate, 1 g fiber, 1 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/raspberry-meringues-411893', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 45, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}