{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479978-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 479978, u'veryPopular': True, u'lowFodmap': False, u'title': u'Summer Linguine with Grilled Vegetables', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 233.15, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'15 cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'\xbc cup Assorted chopped fresh herbs', u'aisle': u'Produce', u'name': u'fresh herbs', u'metaInformation': [u'fresh', u'assorted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1012024, u'unit': u'cup'}, {u'originalString': u'4 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'Juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'10 oz. linguine', u'aisle': u'Pasta and Rice', u'name': u'linguine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10720420, u'unit': u'oz'}, {u'originalString': u'8 oz mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'\xbd cup olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'\xbd cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 pinches red pepper', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'pinches', u'unitShort': u'pinches', u'amount': 2.0, u'consistency': u'solid', u'id': 11821, u'unit': u'pinches'}, {u'originalString': u'Salt and Pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 squash, chopped in bite sized chunks', u'aisle': u'Produce', u'name': u'squash', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011485, u'unit': u''}, {u'originalString': u'1 zucchini, chopped in bite sized chunks', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 98.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.neighborfoodblog.com/2013/07/lemony-summer-linguine-with-grilled-vegetables-for-sundaysupper.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Preheat grill over medium high heat. In a large bowl, toss the pepper, mushrooms, tomato, squash, and zucchini with \xbc cup olive oil. Sprinkle liberally with sea salt and black pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the vegetables on a grill safe tray and grill for 15-20 minutes or until tender and slightly charred, flipping once.Meanwhile, bring a pot of water to boil and boil the linguine according to package directions. As soon as the linguine is al dente, drain and place in a large serving bowl. Cover to keep warm.Meanwhile, heat the remaining \xbc cup olive oil in a skillet over medium heat.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 10720420, u'name': u'linguine'}]}, {u'equipment': [], u'step': u'Add garlic cloves and red pepper flakes and stir until fragrant, 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in lemon juice.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Add olive oil mixture to cooked pasta.When vegetables are done toss them with the pasta. Stir in Parmesan cheese and fresh herbs.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1012024, u'name': u'fresh herbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve with a final drizzle of olive oil and grated Parmesan.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 571, u'instructions': u'Preheat grill over medium high heat. In a large bowl, toss the pepper, mushrooms, tomato, squash, and zucchini with \xbc cup olive oil. Sprinkle liberally with sea salt and black pepper. Place the vegetables on a grill safe tray and grill for 15-20 minutes or until tender and slightly charred, flipping once.Meanwhile, bring a pot of water to boil and boil the linguine according to package directions. As soon as the linguine is al dente, drain and place in a large serving bowl. Cover to keep warm.Meanwhile, heat the remaining \xbc cup olive oil in a skillet over medium heat. Add garlic cloves and red pepper flakes and stir until fragrant, 1-2 minutes. Remove from heat and stir in lemon juice. Add olive oil mixture to cooked pasta.When vegetables are done toss them with the pasta. Stir in Parmesan cheese and fresh herbs. Serve with a final drizzle of olive oil and grated Parmesan.', u'spoonacularSourceUrl': u'https://spoonacular.com/summer-linguine-with-grilled-vegetables-479978', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}