{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601297-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 601297, u'veryPopular': False, u'lowFodmap': False, u'title': u'Avocado Veggie Panini', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 193.23, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'2 avocados', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 cup cherry or grape tomatoes', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'cup'}, {u'originalString': u'2 cups chopped kale, stems removed', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'melty white cheese like Provolone or Mozzarella, if you want', u'aisle': u'Cheese', u'name': u'mozzarella', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'oz'}, {u'originalString': u'1\xbd tablespoons butter or olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces sliced baby portobello mushrooms', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11266, u'unit': u'ounces'}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 minced shallot (onion or garlic works too)', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'(onion or garlic works too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'8 pieces thick, sturdy wheat bread', u'aisle': u'Bakery/Bread', u'name': u'whole wheat bread', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 18075, u'unit': u'pieces'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://pinchofyum.com/avocado-veggie-panini', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the butter in a large skillet over medium high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the shallots; saute until translucent.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the mushrooms and saute until browned lightly on the outside.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the tomatoes and kale; saute until wilted and warmed through.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and season with salt.Mash the avocado in a bowl with a fork.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}], u'step': u'Spread some avocado on the surface of each piece of bread. Assemble the sandwiches by carefully arranging the vegetables on the bread. Get as many veggies on as you can because the sandwiches sink down when you use the panini press.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}], u'step': u'Add the cheese on top of the veggies if you want, cover with another slice of bread, and place on a preheated panini press. When the bread is browned on the outside, remove from heat. If you did not cut the tomatoes, be careful as they might burst when you bite into them and they will be hot! :)', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 90, u'instructions': u'Heat the butter in a large skillet over medium high heat. Add the shallots; saute until translucent. Add the mushrooms and saute until browned lightly on the outside. Add the tomatoes and kale; saute until wilted and warmed through. Remove from heat and season with salt.Mash the avocado in a bowl with a fork. Spread some avocado on the surface of each piece of bread. Assemble the sandwiches by carefully arranging the vegetables on the bread. Get as many veggies on as you can because the sandwiches sink down when you use the panini press.Add the cheese on top of the veggies if you want, cover with another slice of bread, and place on a preheated panini press. When the bread is browned on the outside, remove from heat. If you did not cut the tomatoes, be careful as they might burst when you bite into them and they will be hot! :)', u'spoonacularSourceUrl': u'https://spoonacular.com/avocado-veggie-panini-601297', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}