{u'recipes': [{u'sourceName': u'My Baking Addiction', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/480723-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 480723, u'veryPopular': True, u'lowFodmap': False, u'title': u'Kitchen PLAY: Red Onion Chutney', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 82.02, u'creditText': u'My Baking Addiction', u'extendedIngredients': [{u'originalString': u'1/4 cup Balsamic Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'1 Bay Leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'pinch of freshly ground Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1/4 cup packed Brown Sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 Jalapeno, deseeded, deribbed and diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced', u'deseeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1/4 teaspoon Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 medium Red Onions, sliced finely', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'medium', u'sliced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'3 tablespoons Red Wine Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tablespoons'}, {u'originalString': u'2 Shallots, diced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 large Yellow Onion, chopped fine', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.mybakingaddiction.com/red-onion-chutney-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large saut\xe9 pan, heat the olive oil on low heat. Slice the red onions finely. Chop and dice the yellow onion and shallot into small pieces.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10511282, u'name': u'yellow onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the different onions to the heated oil, and add salt and pepper. Cover with a lid.2. De-seed, de-rib, and dice the jalapeno finely.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add it to the pan of onions. Replace the lid and cook for about 30 minutes, until the onions have softened, but not browned.3.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the balsamic and red wine vinegars, brown sugar, cinnamon, and bay leaf. Stir well to mix in completely, and do not replace the lid. Cook on low for another hour to hour and a half, until no liquid remains and the onions are dark and rich in color.4. Stir often during the last half an hour of cooking to prevent the onions from burning.5. Allow to cool slightly, then place in jars or any airtight container. Seal jars with lids, then refrigerate as soon as jars are cool enough to handle.6.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Serve on freshly toasted crostini spread with your favorite goat cheese.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 4964, u'instructions': u'1. In a large saut\xe9 pan, heat the olive oil on low heat. Slice the red onions finely. Chop and dice the yellow onion and shallot into small pieces. Add the different onions to the heated oil, and add salt and pepper. Cover with a lid.2. De-seed, de-rib, and dice the jalapeno finely. Add it to the pan of onions. Replace the lid and cook for about 30 minutes, until the onions have softened, but not browned.3. Add the balsamic and red wine vinegars, brown sugar, cinnamon, and bay leaf. Stir well to mix in completely, and do not replace the lid. Cook on low for another hour to hour and a half, until no liquid remains and the onions are dark and rich in color.4. Stir often during the last half an hour of cooking to prevent the onions from burning.5. Allow to cool slightly, then place in jars or any airtight container. Seal jars with lids, then refrigerate as soon as jars are cool enough to handle.6. Serve on freshly toasted crostini spread with your favorite goat cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/kitchen-play-red-onion-chutney-480723', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 140, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}