{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/772950-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 65, u'id': 772950, u'veryPopular': True, u'lowFodmap': False, u'title': u"Sunny's Italian Sausage-Stuffed Acorn Squash", u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 25, u'pricePerServing': 204.08, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 acorn squash, halved through the stem to the base and seeds removed', u'aisle': u'Produce', u'name': u'acorn squash', u'metaInformation': [u'seeds removed', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11482, u'unit': u''}, {u'originalString': u'1 stalk celery, finely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1/4 cup dried cranberries, finely chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'Chopped fresh parsley, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'6 fresh sage leaves, finely chopped', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'1/4 teaspoon hot Hungarian paprika', u'aisle': u'Spices and Seasonings', u'name': u'hungarian paprika', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002028, u'unit': u'teaspoon'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/2 cup shredded Cheddar-Monterey Jack cheese blend', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoon'}, {u'originalString': u'1 red bell pepper, seeded and finely chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/2 cup chopped red onions', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'2 links (8 ounces) spicy Italian sausage, casings removed', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017063, u'unit': u'ounces'}, {u'originalString': u'1/2 cup chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 23.0, u'imageType': u'jpeg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/sunny-anderson/sunnys-italian-sausage-stuffed-acorn-squash.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the squash: Preheat the oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the squash on a baking sheet flesh-side up and rub with the olive oil. Season liberally with salt and pepper. Roast until the edges begin to ripple and a poke with a fork reveals tender flesh, about 40 minutes. Allow to cool until easy to handle.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Lower the oven temperature to 350 degrees F.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Use a spoon to scoop out the flesh into a large bowl, leaving about 1/4 inch of flesh within the skin of each squash half to help it maintain its shape.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the filling: In a large pan on medium-high heat, add the olive oil and sausage. While cooking, break the sausage into bits like ground meat with a wooden spoon. Once some of the fat is rendered from the sausage, add the onions, paprika, pumpkin pie spice, sage, celery, bell peppers and a pinch of salt. Cook until the sausage is done and the vegetables are tender.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the mixture to the bowl of squash along with the cheese, walnuts and cranberries and stir to combine. Taste and season with salt and pepper if needed. Fill the hollowed squash halves with the mixture and place back in the oven to melt the cheese and make the tops golden brown, 15 more minutes. Sprinkle with parsley and serve warm.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian can be paired with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Santa Margherita Chianti Classico Riserva. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The aromas of this complex red wine range from cherries and plums to gladiolus flowers and earthy flint. The tannic, oak-aged flavors are bright and round, with a dry, warm, earthy finish. Recommended for barbecued meat, like sliced Chianina steak, or with game, such as pheasant stuffed with truffles. It is also excellent with mature cheese.', u'title': u'Santa Margherita Chianti Classico Riserva', u'price': u'$26.99', u'id': 436659, u'link': u'https://www.wine.com/product/santa-margherita-chianti-classico-riserva-2013/167314', u'imageUrl': u'https://spoonacular.com/productImages/436659-312x231.jpg'}]}, u'aggregateLikes': 10723, u'instructions': u'For the squash: Preheat the oven to 400 degrees F.                          Place the squash on a baking sheet flesh-side up and rub with the olive oil. Season liberally with salt and pepper. Roast until the edges begin to ripple and a poke with a fork reveals tender flesh, about 40 minutes. Allow to cool until easy to handle.                          Lower the oven temperature to 350 degrees F.                          Use a spoon to scoop out the flesh into a large bowl, leaving about 1/4 inch of flesh within the skin of each squash half to help it maintain its shape.                          For the filling: In a large pan on medium-high heat, add the olive oil and sausage. While cooking, break the sausage into bits like ground meat with a wooden spoon. Once some of the fat is rendered from the sausage, add the onions, paprika, pumpkin pie spice, sage, celery, bell peppers and a pinch of salt. Cook until the sausage is done and the vegetables are tender.                          Add the mixture to the bowl of squash along with the cheese, walnuts and cranberries and stir to combine. Taste and season with salt and pepper if needed. Fill the hollowed squash halves with the mixture and place back in the oven to melt the cheese and make the tops golden brown, 15 more minutes. Sprinkle with parsley and serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/sunnys-italian-sausage-stuffed-acorn-squash-772950', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}