{u'recipes': [{u'sourceName': u'Bon Appetit', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/715295-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 715295, u'veryPopular': True, u'lowFodmap': False, u'title': u'Maple-Cinnamon Toast with Citrus and Cr\xe8me Fra\xeeche', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 234.69, u'creditText': u'Bon Appetit', u'extendedIngredients': [{u'originalString': u'4 \xbd-inch-thick slices brioche or challah', u'aisle': u'Baking', u'name': u'brioche', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brioche.png', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 4.5, u'consistency': u'solid', u'id': 93730, u'unit': u'inch'}, {u'originalString': u'1 cup cr\xe8me fra\xeeche', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'creme fraiche', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001056, u'unit': u'cup'}, {u'originalString': u'1\xbc teaspoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons plus 1 cup pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'1 small blood orange or navel orange, very thinly sliced, seeds removed', u'aisle': u'Produce', u'name': u'navel orange', u'metaInformation': [u'seeds removed', u'small', u'very thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9202, u'unit': u''}, {u'originalString': u'Flaky sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup (1 stick) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'\xbd vanilla bean, split lengthwise', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 93622, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.bonappetit.com/recipe/maple-cinnamon-toast-with-citrus-and-creme-fraiche', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 450.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place orange slices and sugar in a small bowl. Scrape in vanilla seeds; save pod for another use. Toss to coat orange slices.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix butter, cinnamon, a pinch of salt, and 2 Tbsp. maple syrup in a medium bowl to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Spread cinnamon butter on one side of each piece of brioche.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brioche.png', u'id': 93730, u'name': u'brioche'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place on a rimmed baking sheet and toast in oven until brioche is golden brown (the bottoms should be very crisp), 810 minutes.', u'length': {u'number': 810, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brioche.png', u'id': 93730, u'name': u'brioche'}]}, {u'equipment': [], u'step': u'Place each toast, buttered side down, on plates. Top with crme frache and orange slices.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle remaining 1 cup maple syrup over toasts and finish with a sprinkle of salt.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2634, u'instructions': u'Preheat oven to 450. Place orange slices and sugar in a small bowl. Scrape in vanilla seeds; save pod for another use. Toss to coat orange slices.Mix butter, cinnamon, a pinch of salt, and 2 Tbsp. maple syrup in a medium bowl to combine. Spread cinnamon butter on one side of each piece of brioche. Place on a rimmed baking sheet and toast in oven until brioche is golden brown (the bottoms should be very crisp), 810 minutes. Place each toast, buttered side down, on plates. Top with crme frache and orange slices. Drizzle remaining 1 cup maple syrup over toasts and finish with a sprinkle of salt.', u'spoonacularSourceUrl': u'https://spoonacular.com/maple-cinnamon-toast-with-citrus-and-crme-frache-715295', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}