{u'recipes': [{u'sourceName': u'My Whole Food Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626572-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 626572, u'veryPopular': True, u'lowFodmap': True, u'title': u'PBJ Chocolate Cups', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 93.31, u'creditText': u'My Whole Food Life', u'extendedIngredients': [{u'originalString': u'2 T almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'T'}, {u'originalString': u'1 1/2 cups chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10019146, u'unit': u'cups'}, {u'originalString': u'1/4 cup jam (I used my chia jam)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jam', u'metaInformation': [u'(I used my chia jam)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19297, u'unit': u'cup'}, {u'originalString': u'roughly 1/2 cup peanut butter or nut butter.', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12195, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://mywholefoodlife.com/2015/01/17/pbj-chocolate-cups/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}], u'step': u'Melt the chocolate chips and the almond milk using a double boiler method.  Once the chocolate is melted, put a little into the bottom of each lined muffins cup.  I got 6 standard sized cups out of the batch.  Once you filled a little into each muffin cup, place the tray in the freezer for a couple minutes.  Once the chocolate is solid, then add a dollop of peanut butter into each cup.  Then add a tiny bit of jam on top of the peanut butter.  Fill the reminder of each cup with chocolate and place in the freezer to set up.  It should take about an hour for the chocolate to be firm enough.  Once the chocolate is firm, you can store it in the fridge.  Enjoy!', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}], u'name': u''}], u'aggregateLikes': 536, u'instructions': u'Melt the chocolate chips and the almond milk using a double boiler method.  Once the chocolate is melted, put a little into the bottom of each lined muffins cup.  I got 6 standard sized cups out of the batch.  Once you filled a little into each muffin cup, place the tray in the freezer for a couple minutes.  Once the chocolate is solid, then add a dollop of peanut butter into each cup.  Then add a tiny bit of jam on top of the peanut butter.  Fill the reminder of each cup with chocolate and place in the freezer to set up.  It should take about an hour for the chocolate to be firm enough.  Once the chocolate is firm, you can store it in the fridge.  Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/pbj-chocolate-cups-626572', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}