{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/762909-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 762909, u'veryPopular': True, u'lowFodmap': False, u'title': u"Kardea's Crawfish Pie", u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 363.55, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup shredded asiago cheese', u'aisle': u'Cheese', u'name': u'asiago cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001033, u'unit': u'cup'}, {u'originalString': u'1 tablespoon butter, plus more for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'plus more for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'6 ounces cream cheese, at room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 cup chopped green bell pepper', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'1/2 cup half-and-half, plus more if needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [u'plus more if needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1 pound fresh crawfish tail meat', u'name': u'meat', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1065062, u'unit': u'pound'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 17.3-ounce package puff pastry', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 17.3, u'consistency': u'solid', u'id': 18337, u'unit': u'ounce'}, {u'originalString': u'1/2 cup chopped red bell pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon seafood seasoning, such as Old Bay', u'aisle': u'Spices and Seasonings', u'name': u'seafood seasoning', u'metaInformation': [u' such as old bay'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032034, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup minced yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 28.0, u'imageType': u'jpeg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/kardeas-crawfish-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 39, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Special equipment: 4 single-serving clay pots or souffle dishes', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F. Grease 4 single-serving clay pots or souffle dishes.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a pan set over medium-low heat, add the butter and oil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add in the onions, green peppers and garlic and saute until the onions are transparent.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the crawfish, seafood seasoning and red pepper, and cook 2 minutes stirring frequently.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'id': 1032034, u'name': u'seafood seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}]}, {u'equipment': [], u'step': u'Add the cream cheese and stir until melted, then add the half-and-half.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add half of the asiago and stir.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1001033, u'name': u'asiago cheese'}]}, {u'equipment': [], u'step': u'Cut the puff pastry to fit the shape of the serving dishes, and then set aside.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [], u'step': u'Divide the mixture into the prepared dishes. Sprinkle with remaining asiago, then place the puff pastry on top.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1001033, u'name': u'asiago cheese'}]}, {u'equipment': [], u'step': u'Brush the egg wash over the pastry, then bake until the tops are golden, 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie on the menu? Try pairing with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try McFadden Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 1026, u'instructions': u'Watch how to make this recipe.      Special equipment: 4 single-serving clay pots or souffle dishes              Preheat the oven to 400 degrees F. Grease 4 single-serving clay pots or souffle dishes.                          In a pan set over medium-low heat, add the butter and oil. Add in the onions, green peppers and garlic and saute until the onions are transparent. Add the crawfish, seafood seasoning and red pepper, and cook 2 minutes stirring frequently. Add the cream cheese and stir until melted, then add the half-and-half. Add half of the asiago and stir.                          Cut the puff pastry to fit the shape of the serving dishes, and then set aside.                          Divide the mixture into the prepared dishes. Sprinkle with remaining asiago, then place the puff pastry on top. Brush the egg wash over the pastry, then bake until the tops are golden, 15 minutes. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/kardeas-crawfish-pie-762909', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}