{u'recipes': [{u'sourceName': u'Cookin Canuck', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/584745-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 584745, u'veryPopular': True, u'lowFodmap': False, u'title': u'Kicked-Up Avocado Margarita for Cinco de Mayo', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 458.47, u'creditText': u'Cookin Canuck', u'extendedIngredients': [{u'originalString': u'2 tsp agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'tsp'}, {u'originalString': u'1/4 - 1/2 tsp ancho (or regular) chili powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'ancho chili powder', u'metaInformation': [u'(or regular)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022009, u'unit': u'tsp'}, {u'originalString': u'1 California avocado, cut into pieces', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'3 spring cilantro', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11165, u'unit': u''}, {u'originalString': u'1 1/2 cups crushed ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10014412, u'unit': u'cups'}, {u'originalString': u'3 oz. lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'oz'}, {u'originalString': u'2 lime wedges, for garnish', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1 1/2 tbsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tbsp'}, {u'originalString': u'4 oz. tequila', u'aisle': u'Alcoholic Beverages', u'name': u'tequila', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 10814037, u'unit': u'oz'}, {u'originalString': u'2 oz. triple sec', u'aisle': u'Alcoholic Beverages', u'name': u'triple sec', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 14534, u'unit': u'oz'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.cookincanuck.com/2013/04/kicked-up-avocado-margarita-recipe-for-cinco-de-mayo/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'On a plate, mix together the salt and chili pepper.  Run a lime wedge around the rim of each margarita glass and turn each glass upside down into salt mixture.  Turn the glass until the rim is completely coated.In a blender, combine the avocado, crushed ice, agave nectar, tequila, triple sec and cilantro springs.  Blend until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crushed-ice.png', u'id': 10114412, u'name': u'crushed ice cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'id': 14534, u'name': u'triple sec'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'id': 10814037, u'name': u'tequila'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour the margarita into the two prepared glasses.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish the rims of the glasses with lime wedges.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 3124, u'instructions': u'On a plate, mix together the salt and chili pepper.  Run a lime wedge around the rim of each margarita glass and turn each glass upside down into salt mixture.  Turn the glass until the rim is completely coated.In a blender, combine the avocado, crushed ice, agave nectar, tequila, triple sec and cilantro springs.  Blend until smooth.Pour the margarita into the two prepared glasses.  Garnish the rims of the glasses with lime wedges.  Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/kicked-up-avocado-margarita-for-cinco-de-mayo-584745', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}