{u'recipes': [{u'sourceName': u'Faithful Provisions', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/485771-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 485771, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken Stroganoff', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 140.46, u'creditText': u'Faithful Provisions', u'extendedIngredients': [{u'originalString': u'1 lb frozen chicken breast', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5062, u'unit': u'lb'}, {u'originalString': u'1 can cream of mushroom soup', u'aisle': u'Canned and Jarred', u'name': u'cream of mushroom soup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-mushroom-soup.png', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 6147, u'unit': u'can'}, {u'originalString': u'1 container sliced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'container', u'unitShort': u'container', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'container'}, {u'originalString': u'1 packed onion soup mix', u'aisle': u'Canned and Jarred', u'name': u'onion soup mix', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6094, u'unit': u''}, {u'originalString': u'1- 16 oz tub sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1056, u'unit': u'oz'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://faithfulprovisions.com/2010/01/10/crockpot-chicken-stroganoff/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place frozen chicken breast and mushrooms in the bottom of the crock pot.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Mix remaining ingredients and pour over.   Cook on low for about 6-7 hours.  Stirring hourly so the sauce doesn’t stick and burn. Before serving,I shred the chicken in the pot with the sauce and serve over egg noodles.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Raymond Reserve Selection Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 641, u'instructions': u'Place frozen chicken breast and mushrooms in the bottom of the crock pot.  Mix remaining ingredients and pour over.   Cook on low for about 6-7 hours.  Stirring hourly so the sauce doesn’t stick and burn. Before serving,I shred the chicken in the pot with the sauce and serve over egg noodles.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-stroganoff-485771', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 365, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}