{u'recipes': [{u'sourceName': u"Can't Stay out of the Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/501168-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 250, u'id': 501168, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pineapple Carrot Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 41.2, u'creditText': u"Can't Stay out of the Kitchen", u'extendedIngredients': [{u'originalString': u'1 13 cup bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 13.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cup'}, {u'originalString': u'1 \xbc tsp. bread machine yeast', u'aisle': u'Baking', u'name': u'bread machine yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 10218375, u'unit': u'tsp'}, {u'originalString': u'1 cup buttermilk (I used 1 cup milk and 2 tbsp. white vinegar)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'20-oz. can crushed pineapple, drained', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 9354, u'unit': u'oz'}, {u'originalString': u'4 tsp. canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tsp'}, {u'originalString': u'4 tsp. honey (or brown sugar)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'(or brown sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tsp'}, {u'originalString': u'1 tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'4 tsp. vital wheat gluten', u'aisle': u'Health Foods;Baking', u'name': u'vital wheat gluten', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 48052, u'unit': u'tsp'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://cantstayoutofthekitchen.com/2013/07/09/pineapple-carrot-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Layer ingredients into breadmaker canister as listed.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place on whole wheat setting.Mine takes 4 hours 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from breadmaker oven about 15 minutes after cycle is complete.Butter the top and sides of bread with butter to prevent hardening of crust.Slice down. 2-lb. loaf.Approximately 14 half slices.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 237, u'instructions': u'Layer ingredients into breadmaker canister as listed.Place on whole wheat setting.Mine takes 4 hours 10 minutes.Remove from breadmaker oven about 15 minutes after cycle is complete.Butter the top and sides of bread with butter to prevent hardening of crust.Slice down. 2-lb. loaf.Approximately 14 half slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/pineapple-carrot-bread-501168', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 260, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}