{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601201-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 601201, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Peanut Chicken Soba Noodle Salad', u'diets': [u'dairy free'], u'pricePerServing': 128.87, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'1 each red, green, and yellow bell pepper', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'green', u'red', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'fresh cilantro or basil to taste', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'1 teaspoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'half of a jalape\xf1o pepper', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11979, u'unit': u'servings'}, {u'originalString': u'5 tablespoons low sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 16424, u'unit': u'tablespoons'}, {u'originalString': u'5 tablespoons peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 16098, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16091, u'unit': u'cup'}, {u'originalString': u'2 tablespoons sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoons'}, {u'originalString': u'1 lb. boneless skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'8.8 (250 grams) soba noodles', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'soba noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 20114, u'unit': u'grams'}, {u'originalString': u'5 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoon'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://pinchofyum.com/spicy-peanut-chicken-soba-noodle-salad', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of water to boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the chicken in the water and reduce to a simmer. Cover and cook for 15 minutes or until chicken is no longer pink. When chicken is cool enough to handle, shred with your hands or with two forks. Set aside. Meanwhile, cut the bell peppers into very thin strips - it makes the salad extra awesome if they are thin and easy to wrap your fork around, almost like a little noodle.Puree all the ingredients for the Spicy Peanut Sauce in a food processor, adding the peanuts last so you can control how smooth the sauce will be (I like to leave some pieces of crushed peanut in the sauce).Cook the soba noodles according to package directions.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'id': 20114, u'name': u'soba noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain and toss with the chicken, veggies, fresh cilantro, and Spicy Peanut Sauce.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}]}, {u'equipment': [], u'step': u'Serve hot or cold - but I recommend cold! Yummay.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 155, u'instructions': u'Bring a large pot of water to boil. Place the chicken in the water and reduce to a simmer. Cover and cook for 15 minutes or until chicken is no longer pink. When chicken is cool enough to handle, shred with your hands or with two forks. Set aside. Meanwhile, cut the bell peppers into very thin strips - it makes the salad extra awesome if they are thin and easy to wrap your fork around, almost like a little noodle.Puree all the ingredients for the Spicy Peanut Sauce in a food processor, adding the peanuts last so you can control how smooth the sauce will be (I like to leave some pieces of crushed peanut in the sauce).Cook the soba noodles according to package directions. Drain and toss with the chicken, veggies, fresh cilantro, and Spicy Peanut Sauce. Serve hot or cold - but I recommend cold! Yummay.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-peanut-chicken-soba-noodle-salad-601201', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}