{u'recipes': [{u'sourceName': u'Gourmande in the Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610416-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_FULL', u'cookingMinutes': 20, u'id': 610416, u'veryPopular': False, u'lowFodmap': False, u'title': u'Concord Grape Sorbet With Rosemary and Black Pepper from The Nourished Kitchen | Interview with the Author and Giveaway', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 0, u'pricePerServing': 429.87, u'creditText': u'Gourmande in the Kitchen', u'extendedIngredients': [{u'originalString': u'2 tablespoons whole black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'whole', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'tablespoons'}, {u'originalString': u'2 1/2 pounds Concord grapes, stems removed', u'aisle': u'Produce', u'name': u'concord grapes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 1009132, u'unit': u'pounds'}, {u'originalString': u'1/2 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'2 large sprigs rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2036, u'unit': u'sprigs'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://gourmandeinthekitchen.com/2014/concord-grape-sorbet-with-rosemary-and-black-pepper/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Toss the grapes into a food processor and process them for 45 to 60 seconds, until they form 3 to 4 cups of a coarse and lumpy, vibrantly purple slurry. If your food processor is small, work in small batches until youve processed all the grapes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the puree to a saucepan, pour in the honey, and drop in the rosemary and black peppercorns. Simmer the mixture over medium-low heat for 15 to 20 minutes, until slightly thickened and deeply fragrant. Set a fine-mesh sieve over a large bowl and pour the puree into the sieve, straining out the grape seeds, rosemary, and peppercorns. Cover the bowl and transfer it to the refrigerator. Allow the puree to chill for at least 12 hours. Churn the puree in an ice cream maker according to the manufacturers instructions. Spoon the sorbet into a container, cover tightly, and store it in the freezer. It will keep for up to 2 weeks.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'black peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are my top picks for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 66, u'instructions': u'Toss the grapes into a food processor and process them for 45 to 60 seconds, until they form 3 to 4 cups of a coarse and lumpy, vibrantly purple slurry. If your food processor is small, work in small batches until youve processed all the grapes.Transfer the puree to a saucepan, pour in the honey, and drop in the rosemary and black peppercorns. Simmer the mixture over medium-low heat for 15 to 20 minutes, until slightly thickened and deeply fragrant. Set a fine-mesh sieve over a large bowl and pour the puree into the sieve, straining out the grape seeds, rosemary, and peppercorns. Cover the bowl and transfer it to the refrigerator. Allow the puree to chill for at least 12 hours. Churn the puree in an ice cream maker according to the manufacturers instructions. Spoon the sorbet into a container, cover tightly, and store it in the freezer. It will keep for up to 2 weeks.', u'spoonacularSourceUrl': u'https://spoonacular.com/concord-grape-sorbet-with-rosemary-and-black-pepper-from-the-nourished-kitchen-interview-with-the-author-and-giveaway-610416', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}