{u'recipes': [{u'sourceName': u'Cookie Madness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/257576-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 1, u'id': 257576, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramel Topped Girl Scout Cookie Trefoils', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 34.93, u'creditText': u'Cookie Madness', u'extendedIngredients': [{u'originalString': u'4 unwrapped caramel candies', u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramel candies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 19074, u'unit': u''}, {u'originalString': u'8 Golden Trefoil Cookies', u'aisle': u'Sweet Snacks', u'name': u'golden oreo cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-sandwich-cookies.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10018210, u'unit': u''}, {u'originalString': u'1 teaspoon each — heavy cream and butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'teaspoon'}, {u'originalString': u'2 ounces of chopped semisweet chocolate (or whatever kind you like)', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'chopped', u'(or whatever kind you like)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.cookiemadness.net/2014/02/caramel-topped-girl-scout-cookie-trefoils/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Arrange the cookies on a foil lined plate or toaster oven tray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}], u'step': u'Put the cream, butter and caramels in a 2 cup Microwave-safe measuring cup (I use a Pyrex).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel candy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat on high for 15 seconds and stir vigorously until mixture is melted and smooth (caramels should go from soft looking blobs to smooth as you stir). If your mixture isn’t hot enough and caramels aren’t quite soft enough to melt, return to the microwave for another 5 to 10 seconds and repeat, stirring until mixture is smooth. Don’t overheat.Spoon a little caramel sauce over each cookie. If you want, stick a few peanuts in the caramel (optional).Chill until set.Meanwhile, melt chocolate in a microwave safe bowl using 50% power. Spoon chocolate over cookies. Chill until set.To decorate, put a small handful of white melting wafers or white chips in a heavy duty freezer bag. Microwave for about 30 seconds. Knead bag lightly making sure chocolate is completely melted. Snip off tip and drizzle over cookies.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel candy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'Arrange the cookies on a foil lined plate or toaster oven tray.Put the cream, butter and caramels in a 2 cup Microwave-safe measuring cup (I use a Pyrex). Heat on high for 15 seconds and stir vigorously until mixture is melted and smooth (caramels should go from soft looking blobs to smooth as you stir). If your mixture isn’t hot enough and caramels aren’t quite soft enough to melt, return to the microwave for another 5 to 10 seconds and repeat, stirring until mixture is smooth. Don’t overheat.Spoon a little caramel sauce over each cookie. If you want, stick a few peanuts in the caramel (optional).Chill until set.Meanwhile, melt chocolate in a microwave safe bowl using 50% power. Spoon chocolate over cookies. Chill until set.To decorate, put a small handful of white melting wafers or white chips in a heavy duty freezer bag. Microwave for about 30 seconds. Knead bag lightly making sure chocolate is completely melted. Snip off tip and drizzle over cookies.', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-topped-girl-scout-cookie-trefoils-257576', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 11, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}