{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/295149-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 295149, u'veryPopular': False, u'lowFodmap': False, u'title': u'Scrapple', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 329.43, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tablespoons'}, {u'originalString': u'4 cups roasted cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 35137, u'unit': u'cups'}, {u'originalString': u'1 pork heart', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10010219, u'unit': u''}, {u'originalString': u'2 pounds pork liver', u'aisle': u'Meat', u'name': u'pork liver', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liver.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10110, u'unit': u'pounds'}, {u'originalString': u'1 pound meaty pork ribs or bones', u'aisle': u'Meat', u'name': u'pork ribs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-ribs.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10204, u'unit': u'pound'}, {u'originalString': u'2 1/2 tablespoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoons'}], u'healthScore': 100.0, u'imageType': u'jpeg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/scrapple-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Trim the fat from around the top of the heart and remove the sinews.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the heart into 4 pieces and put it in a heavy stewing kettle with the meaty bones and liver.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add 3 quarts of water, cover and simmer gently for 3 hours until the meat falls from the bones.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Strain the broth into a clean pot. Discard the bones and put the meat through a coarse grinder. Grind the heart and liver as fine as possible and combine the 2 meat mixtures.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bring the broth to a simmer.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the cornmeal and the seasonings and gradually add to the boiling broth, stirring constantly. Reduce heat to medium and add the meat mixture. Stir until everything is well mixed. Cook slowly for 30 minutes, stirring almost constantly so it does not stick to the bottom, as it will be quite thick.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}]}, {u'equipment': [], u'step': u'After 30 minutes it is ready to pour. Rinse 9 small breadpans with cold water or grease them and pour the scrapple to the top of the pans. Set the pans to cool and when cool refrigerate until the next day.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'When ready to eat, unmold the scrapple onto a cutting board and cut into 1/4-inch thick slices. Melt fat in a skillet and fry the slices until brown and crusty on both sides.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately with or without maple syrup.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'The loaves can be unmolded and frozen but will keep refrigerated for about 1 week.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 17, u'instructions': u'Trim the fat from around the top of the heart and remove the sinews. Cut the heart into 4 pieces and put it in a heavy stewing kettle with the meaty bones and liver. Add 3 quarts of water, cover and simmer gently for 3 hours until the meat falls from the bones.                          Strain the broth into a clean pot. Discard the bones and put the meat through a coarse grinder. Grind the heart and liver as fine as possible and combine the 2 meat mixtures.                          Bring the broth to a simmer. Combine the cornmeal and the seasonings and gradually add to the boiling broth, stirring constantly. Reduce heat to medium and add the meat mixture. Stir until everything is well mixed. Cook slowly for 30 minutes, stirring almost constantly so it does not stick to the bottom, as it will be quite thick.                          After 30 minutes it is ready to pour. Rinse 9 small breadpans with cold water or grease them and pour the scrapple to the top of the pans. Set the pans to cool and when cool refrigerate until the next day.                          When ready to eat, unmold the scrapple onto a cutting board and cut into 1/4-inch thick slices. Melt fat in a skillet and fry the slices until brown and crusty on both sides. Serve immediately with or without maple syrup.                          The loaves can be unmolded and frozen but will keep refrigerated for about 1 week.', u'spoonacularSourceUrl': u'https://spoonacular.com/scrapple-295149', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}