{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/220492-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 220492, u'veryPopular': False, u'lowFodmap': False, u'title': u'The ultimate makeover: Chicken korma', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 238.48, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tbsp flaked almonds, toasted', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'flaked', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'tbsp'}, {u'originalString': u'5 cardamom pods', u'aisle': u'Spices and Seasonings', u'name': u'cardamom pods', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1002006, u'unit': u''}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'250g basmati rice, cooked with a generous pinch saffron', u'aisle': u'Pasta and Rice', u'name': u'cooked basmati rice', u'metaInformation': [u'with a generous pinch saffron', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 10020445, u'unit': u'g'}, {u'originalString': u'handful coriander leaves and stems, coursely chopped', u'aisle': u'Spices and Seasonings', u'name': u'dried coriander leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'handful'}, {u'originalString': u'100ml full-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'full-fat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'1 \xbd tsp garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 93663, u'unit': u'tsp'}, {u'originalString': u'3 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'about 2cm piece fresh root ginger (to give you 2 tbsp finely chopped)', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'fresh', u'finely chopped', u'(to give you 2 tbsp )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'2 small green chillies, deseeded and shredded', u'aisle': u'Produce', u'name': u'green chillies', u'metaInformation': [u'shredded', u'green', u'small', u'deseeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'2 tsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp ground mace', u'aisle': u'Spices and Seasonings', u'name': u'ground mace', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2022, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'150ml natural yogurt, not fridge cold', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'natural yogurt', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'ml'}, {u'originalString': u'2 medium onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'600g boneless, skinless chicken breasts, cut into bite-size pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into bite-size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 600.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'g'}, {u'originalString': u'2 tbsp vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/13417/the-ultimate-makeover-chicken-korma', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat 1 tbsp of the oil in a deep saut\xe9pan or wok. Tip in the onions, then fry overa medium-high heat for about 12-15 mins,stirring occasionally, until a rich goldencolour and the pan is sticky on thebottom. While they cook, chop the garlicand ginger. Make a slit down the length ofeach cardamom pod just deep enough toreveal the tiny seeds.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Remove the onionsfrom the heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer a third of themto a small blender along with the garlic,ginger and 2 tbsp water. Whizz togetherto make a paste that is as smooth as youcan get it. Set aside.Return the onions in the pan to the heat,add the remaining oil, cardamom podsand cinnamon stick, then stir-fry for acouple of mins. Stir in the chicken, groundcoriander, 1\xbc tsp of the garam masala,mace and black pepper, then stir-fry foranother 2 mins. Reserve 3 tbsp of theyogurt, then slowly start to add the rest,1 tbsp at a time, stirring between eachspoonful. When all the yogurt has gonein, stir in the oniony paste and stir-fry for2-3 mins. Stir in 150ml water, then themilk. Bring to a boil, then simmer, covered,for 20 mins, scattering in the chillies forthe final 5 mins, by which time thechicken should be very tender.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 93663, u'name': u'garam masala'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2022, u'name': u'ground mace'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Removethe cardamom pods and cinnamon.The flavours mellow all the more ifrefrigerated overnight. When gentlyreheating, splash in a little water ifneeded to slacken the korma sauce.Finish by stirring in the choppedcoriander. Taste and add a little saltif you wish. Swirl in the reserved yogurt.Spoon the korma into bowls, scattera few almonds over each portion with asprinkling of the remaining garam masala.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 1002006, u'name': u'cardamom pods'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 93663, u'name': u'garam masala'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}]}, {u'equipment': [], u'step': u'Serve the saffron rice on the side.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'Heat 1 tbsp of the oil in a deep saut\xe9pan or wok. Tip in the onions, then fry overa medium-high heat for about 12-15 mins,stirring occasionally, until a rich goldencolour and the pan is sticky on thebottom. While they cook, chop the garlicand ginger. Make a slit down the length ofeach cardamom pod just deep enough toreveal the tiny seeds. Remove the onionsfrom the heat. Transfer a third of themto a small blender along with the garlic,ginger and 2 tbsp water. Whizz togetherto make a paste that is as smooth as youcan get it. Set aside.Return the onions in the pan to the heat,add the remaining oil, cardamom podsand cinnamon stick, then stir-fry for acouple of mins. Stir in the chicken, groundcoriander, 1\xbc tsp of the garam masala,mace and black pepper, then stir-fry foranother 2 mins. Reserve 3 tbsp of theyogurt, then slowly start to add the rest,1 tbsp at a time, stirring between eachspoonful. When all the yogurt has gonein, stir in the oniony paste and stir-fry for2-3 mins. Stir in 150ml water, then themilk. Bring to a boil, then simmer, covered,for 20 mins, scattering in the chillies forthe final 5 mins, by which time thechicken should be very tender. Removethe cardamom pods and cinnamon.The flavours mellow all the more ifrefrigerated overnight. When gentlyreheating, splash in a little water ifneeded to slacken the korma sauce.Finish by stirring in the choppedcoriander. Taste and add a little saltif you wish. Swirl in the reserved yogurt.Spoon the korma into bowls, scattera few almonds over each portion with asprinkling of the remaining garam masala.Serve the saffron rice on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-ultimate-makeover-chicken-korma-220492', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}