{u'recipes': [{u'sourceName': u'Bright Eyed Baker', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/542504-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 542504, u'veryPopular': True, u'lowFodmap': False, u'title': u'Confession #71: I’ve Been Hoarding These… Ice Cream Cupcake Peanut Butter Cups', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 68.2, u'creditText': u'Bright Eyed Baker', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup butter, softened (1/2 a stick)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened', u'(1/2 a stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 cup good quality chocolate chips or chopped chocolate*', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'generous 2 cups good quality chocolate chips or chopped chocolate, divided*', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'chopped', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cups'}, {u'originalString': u'1 egg plus 1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3/8 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.375, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'3/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 2/3 cup half-n-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.6666666666666665, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'3/4 cup smooth peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'smooth peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 16150, u'unit': u'cup'}, {u'originalString': u'3/8 cup unsweetened good quality cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.375, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup yogurt (Use any kind; I used nonfat Greek yogurt)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'(Use any kind; I used nonfat Greek yogurt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1116, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.brighteyedbaker.com/2012/06/25/confession-71-ive-been-hoarding-these-ice-cream-cupcake-peanut-butter-cups/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Do the first coating for the chocolate cups. While the cups are freezing after the first coating, prepare the mixture for the peanut butter ice cream. Chill in fridge.  Do the second coating for the chocolate cups. While the cups are freezing again, make the chocolate cupcakes. While the cupcakes are cooling, peel the liners off of the chocolate cups. Freeze until ready to assemble peanut butter cups. Once the cupcakes are cool, churn/freeze the peanut butter ice cream. Meanwhile, slice the cupcakes to prepare for assembly. Assemble the peanut butter cups as soon as the ice cream has finished churning, or freeze the ice cream for no more than one hour after churning and then assemble. Freeze the assembled cups.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u"Add the final chocolate coating to the tops of the cups. Freeze until ready to serve. Line 12 cups in a standard size muffin tin with paper liners. It seems helpful to place a drop of honey in the bottom of each muffin cup and press the paper liners in on top so that they stick. This way, they won't move around quite as much when you're coating them with chocolate. Be sure to use muffin liners that fit your tin well and don't scrunch up inside. Melt a generous cup of chocolate chips or chopped chocolate in a double boiler over medium heat. As soon as the chocolate begins to melt, stir continuously until smooth. Use a pastry brush to brush the melted chocolate over the insides of the muffin liners, starting at the bottom of each one and moving outward and up against the sides. Make sure you cover all of the liners' grooves, checking from every angle including the top view. If you find any small spots that your brush can't fill, use a toothpick. Use all of the melted chocolate, making a thick first coat for each cup. Return the chocolate to the double boiler if needed during this process to remelt/reheat. Alternatively, keep the chocolate over the double boiler, removed from the stove, so it stays warm while you work. If the chocolate gets too cool, it will become gloppy and hard to use.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u"Place the chocolate cups in the freezer for about 30 minutes, until firm. Meanwhile, prepare the ice cream mixture and chill. Once the first coating for the chocolate cups has set, melt another cup of chocolate chips or chopped chocolate in the double boiler. Coat the chocolate cups with a second layer of melted chocolate, being sure to cover the first coat entirely. Again, you can use a toothpick to fill in any small missed spots that the pastry brush can't get to. Return the chocolate cups to the freezer for about an hour, until solid. Meanwhile, make the chocolate cupcakes. While the cupcakes are cooling, remove the chocolate cups from the freezer and gently lift them out of the muffin tin. If the edges are stuck to the tin, run a toothpick along the outsides to loosen the cups. Once you can spin them around in the tin, you should be able to get them out. Carefully peel the muffin liners off of the cups. Be patient with this step, and if you get to a problem spot, start again at a different location. If the cups get too soft and feel like they're giving in to the pressure of your hands, place them back into the freezer for a bit and then continue.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place the chocolate cups in an airtight container and return to the freezer until ready to assemble the peanut butter cups. If you don't already have your ice cream freezer bowl in the freezer, place it in now.", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Combine the peanut butter, sugar, half-n-half, vanilla, and salt in a blender and blend until smooth, pausing to wipe down the sides if needed. Chill mixture in the fridge thoroughly while you finish preparing the chocolate cups and make the chocolate cupcakes. For reference, you need to chill the mixture about 2 hours at least, until very cold. Once the other components of the peanut butter cups are ready, freeze the chilled ice cream mixture in your ice cream maker according to manufacturer's instructions. Assemble peanut butter cups immediately after ice cream is done churning/freezing, or place ice cream in the freezer for no more than one hour (to firm up slightly) before assembling. Store leftover ice cream in an airtight container in the freezer.Preheat oven to 350 F and grease (not line) 6 cups in a standard size muffin tin.***Sift together the cocoa powder, all-purpose flour, baking powder, and salt in a bowl.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk lightly if needed to evenly combine. In the bowl of a stand mixer, cream together butter and sugar until light and fluffy.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the egg and egg yolk one at a time, beating after each addition. Beat in vanilla.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Add 1/2 of the dry ingredients to the wet, mixing in at lowest speed until somewhat incorporated but still streaked throughout the batter.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add the yogurt in the same way, until partially incorporated.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u'Add the remaining dry ingredient mixture and mix until all ingredients are just combined with no streaks. Scoop the batter into the prepared muffin cups, gently leveling out the tops.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Bake in the preheated oven for 20 minutes, or until a toothpick inserted into the center of a cupcakes comes out clean. Allow the cupcakes to cool for 5 minutes, and then place on a wire rack to cool completely. Cover with plastic wrap until ready to use. While the cupcakes are cooling, remove the paper liners from the chocolate cups. Once the cupcakes have cooled and while the ice cream is churning, slice the cupcakes into 3 sections. The ideas is to make two halves that will go into two separate peanut butter cups, with a thin middle section that can be set aside.**** Starting from the bottom of the cupcake, move the knife up to the height of half of a chocolate cup and make one slice here. Make the second slice at the bottom of the cupcake's dome. Grasp the dome as you make this second slice in order to get a clean cut. You should be able to fit each cupcake half narrow side (or dome side) down into a chocolate cup so that the top will line up with top of the chocolate cup once you fill the bottom half with ice cream. Click here for a diagram of how to slice the cupcakes.Scoop ice cream into each peanut butter cup to fill halfway.", u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Place a cupcake half on top, dome side or narrow side down. Put a bit of pressure on top to sink the cupcake in so the top is level with the top of the chocolate cup. If you added to much ice cream and it is coming up around the cupcake, you may need to remove some and try again.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u"Place assembled peanut butter cups in an airtight container and freeze immediately, until the ice cream is solid. I recommend letting them freeze overnight. Melt chocolate for topping peanut butter cups in a double boiler as previously instructed over medium heat. Working with one cup at a time, spoon some melted chocolate onto the top. Use a spatula to push the chocolate gently toward the edges of the cup until all openings are completely sealed with chocolate. Use an icing spatula to lightly smooth the melted chocolate. Again, don't let the melted chocolate get cool and gloppy during this process.", u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Place finished peanut butter cups in the freezer until ready to serve. Enjoy immediately upon serving.', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 380, u'instructions': u"Do the first coating for the chocolate cups. While the cups are freezing after the first coating, prepare the mixture for the peanut butter ice cream. Chill in fridge.  Do the second coating for the chocolate cups. While the cups are freezing again, make the chocolate cupcakes. While the cupcakes are cooling, peel the liners off of the chocolate cups. Freeze until ready to assemble peanut butter cups. Once the cupcakes are cool, churn/freeze the peanut butter ice cream. Meanwhile, slice the cupcakes to prepare for assembly. Assemble the peanut butter cups as soon as the ice cream has finished churning, or freeze the ice cream for no more than one hour after churning and then assemble. Freeze the assembled cups. Add the final chocolate coating to the tops of the cups. Freeze until ready to serve. Line 12 cups in a standard size muffin tin with paper liners. It seems helpful to place a drop of honey in the bottom of each muffin cup and press the paper liners in on top so that they stick. This way, they won't move around quite as much when you're coating them with chocolate. Be sure to use muffin liners that fit your tin well and don't scrunch up inside. Melt a generous cup of chocolate chips or chopped chocolate in a double boiler over medium heat. As soon as the chocolate begins to melt, stir continuously until smooth. Use a pastry brush to brush the melted chocolate over the insides of the muffin liners, starting at the bottom of each one and moving outward and up against the sides. Make sure you cover all of the liners' grooves, checking from every angle including the top view. If you find any small spots that your brush can't fill, use a toothpick. Use all of the melted chocolate, making a thick first coat for each cup. Return the chocolate to the double boiler if needed during this process to remelt/reheat. Alternatively, keep the chocolate over the double boiler, removed from the stove, so it stays warm while you work. If the chocolate gets too cool, it will become gloppy and hard to use. Place the chocolate cups in the freezer for about 30 minutes, until firm. Meanwhile, prepare the ice cream mixture and chill. Once the first coating for the chocolate cups has set, melt another cup of chocolate chips or chopped chocolate in the double boiler. Coat the chocolate cups with a second layer of melted chocolate, being sure to cover the first coat entirely. Again, you can use a toothpick to fill in any small missed spots that the pastry brush can't get to. Return the chocolate cups to the freezer for about an hour, until solid. Meanwhile, make the chocolate cupcakes. While the cupcakes are cooling, remove the chocolate cups from the freezer and gently lift them out of the muffin tin. If the edges are stuck to the tin, run a toothpick along the outsides to loosen the cups. Once you can spin them around in the tin, you should be able to get them out. Carefully peel the muffin liners off of the cups. Be patient with this step, and if you get to a problem spot, start again at a different location. If the cups get too soft and feel like they're giving in to the pressure of your hands, place them back into the freezer for a bit and then continue. Place the chocolate cups in an airtight container and return to the freezer until ready to assemble the peanut butter cups. If you don't already have your ice cream freezer bowl in the freezer, place it in now. Combine the peanut butter, sugar, half-n-half, vanilla, and salt in a blender and blend until smooth, pausing to wipe down the sides if needed. Chill mixture in the fridge thoroughly while you finish preparing the chocolate cups and make the chocolate cupcakes. For reference, you need to chill the mixture about 2 hours at least, until very cold. Once the other components of the peanut butter cups are ready, freeze the chilled ice cream mixture in your ice cream maker according to manufacturer's instructions. Assemble peanut butter cups immediately after ice cream is done churning/freezing, or place ice cream in the freezer for no more than one hour (to firm up slightly) before assembling. Store leftover ice cream in an airtight container in the freezer.Preheat oven to 350 F and grease (not line) 6 cups in a standard size muffin tin.***Sift together the cocoa powder, all-purpose flour, baking powder, and salt in a bowl. Whisk lightly if needed to evenly combine. In the bowl of a stand mixer, cream together butter and sugar until light and fluffy. Add the egg and egg yolk one at a time, beating after each addition. Beat in vanilla. Add 1/2 of the dry ingredients to the wet, mixing in at lowest speed until somewhat incorporated but still streaked throughout the batter. Add the yogurt in the same way, until partially incorporated. Add the remaining dry ingredient mixture and mix until all ingredients are just combined with no streaks. Scoop the batter into the prepared muffin cups, gently leveling out the tops. Bake in the preheated oven for 20 minutes, or until a toothpick inserted into the center of a cupcakes comes out clean. Allow the cupcakes to cool for 5 minutes, and then place on a wire rack to cool completely. Cover with plastic wrap until ready to use. While the cupcakes are cooling, remove the paper liners from the chocolate cups. Once the cupcakes have cooled and while the ice cream is churning, slice the cupcakes into 3 sections. The ideas is to make two halves that will go into two separate peanut butter cups, with a thin middle section that can be set aside.**** Starting from the bottom of the cupcake, move the knife up to the height of half of a chocolate cup and make one slice here. Make the second slice at the bottom of the cupcake's dome. Grasp the dome as you make this second slice in order to get a clean cut. You should be able to fit each cupcake half narrow side (or dome side) down into a chocolate cup so that the top will line up with top of the chocolate cup once you fill the bottom half with ice cream. Click here for a diagram of how to slice the cupcakes.Scoop ice cream into each peanut butter cup to fill halfway. Place a cupcake half on top, dome side or narrow side down. Put a bit of pressure on top to sink the cupcake in so the top is level with the top of the chocolate cup. If you added to much ice cream and it is coming up around the cupcake, you may need to remove some and try again. Place assembled peanut butter cups in an airtight container and freeze immediately, until the ice cream is solid. I recommend letting them freeze overnight. Melt chocolate for topping peanut butter cups in a double boiler as previously instructed over medium heat. Working with one cup at a time, spoon some melted chocolate onto the top. Use a spatula to push the chocolate gently toward the edges of the cup until all openings are completely sealed with chocolate. Use an icing spatula to lightly smooth the melted chocolate. Again, don't let the melted chocolate get cool and gloppy during this process. Place finished peanut butter cups in the freezer until ready to serve. Enjoy immediately upon serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/confession-71-ive-been-hoarding-these-ice-cream-cupcake-peanut-butter-cups-542504', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}