{u'recipes': [{u'sourceName': u'Picky Eater Blog', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/613120-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 613120, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sneaky Zucchini Lasagna and a Giveaway from Snack Girl', u'diets': [], u'pricePerServing': 104.59, u'creditText': u'Picky Eater Blog', u'extendedIngredients': [{u'originalString': u'1 (14.5-ounce) can diced fire-roasted tomatoes with juice', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'with juice', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u"6 no-bake lasagna noodles (Anjali's note: I'd use whole wheat lasagna noodles if you can!)", u'aisle': u'Pasta and Rice', u'name': u'lasagna noodles', u'metaInformation': [u'whole wheat', u"(Anjali's note: I'd use lasagna noodles if you can!)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10620420, u'unit': u''}, {u'originalString': u'1 cup grated mozzarella cheese', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'cup'}, {u'originalString': u'\xbd cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 (15-ounce) container part-skim ricotta cheese', u'aisle': u'Cheese', u'name': u'part-skim ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 1037, u'unit': u'ounce'}, {u'originalString': u'1 (25-ounce) jar tomato sauce, no cheese or sugar added (such as marinara sauce)', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'(such as marinara sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 25.0, u'consistency': u'solid', u'id': 19335, u'unit': u'ounce'}, {u'originalString': u'1 large zucchini, sliced lengthwise into 7 or 8 slices', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'large', u'sliced lengthwise into 7 or 8 slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://pickyeaterblog.com/sneaky-zucchini-lasagna-and-a-giveaway-from-snack-girl/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375F degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the ricotta, Parmesan, and egg in a small bowl. In another bowl, combine the tomato sauce and diced tomatoes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour 1 cup of the tomato mixture into a 9  13  2-inch casserole. Layer all of the zucchini slices over the sauce.Dollop half the ricotta mixture over the zucchini and top with another cup of the tomato mixture. Cover with 3 pasta sheets and spread with the rest of the ricotta mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add 1 cup sauce and top with the remaining 3 pasta sheets. Top with the rest of the sauce and cover with grated mozzarella.Cover with foil and bake for 40 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the foil and bake for another 10 minutes to finish melting the cheese. After taking the lasagna out of the oven, let it sit for 5 to 10 minutes to firm up.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Montepulciano, Sangiovese, and Chianti are great choices for Lasagne. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. You could try Buccicatino Montepulciano d. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'Dark chocolate and raspberries, harmonious, great palate authority', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 226, u'instructions': u'Preheat the oven to 375F degrees.Mix the ricotta, Parmesan, and egg in a small bowl. In another bowl, combine the tomato sauce and diced tomatoes.Pour 1 cup of the tomato mixture into a 9  13  2-inch casserole. Layer all of the zucchini slices over the sauce.Dollop half the ricotta mixture over the zucchini and top with another cup of the tomato mixture. Cover with 3 pasta sheets and spread with the rest of the ricotta mixture. Add 1 cup sauce and top with the remaining 3 pasta sheets. Top with the rest of the sauce and cover with grated mozzarella.Cover with foil and bake for 40 minutes. Remove the foil and bake for another 10 minutes to finish melting the cheese. After taking the lasagna out of the oven, let it sit for 5 to 10 minutes to firm up.', u'spoonacularSourceUrl': u'https://spoonacular.com/sneaky-zucchini-lasagna-and-a-giveaway-from-snack-girl-613120', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}