{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/250167-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 250167, u'veryPopular': True, u'lowFodmap': False, u'title': u'Dairy-Free Creamed Spinach Parmesan Cups', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 42.0, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup So Delicious Dairy Free Coconut Milk Barista Style “Creamer”', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy milk', u'metaInformation': [u'barista style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'20 ounces frozen chopped spinach', u'aisle': u'Frozen', u'name': u'frozen spinach', u'metaInformation': [u'frozen', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 11463, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'Gluten Free refrigerated pie and pastry crust dough', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [u'gluten free', u'refrigerated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 18334, u'unit': u'servings'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup finely chopped shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11677, u'unit': u'cup'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/creamed-spinach-parmesan-cups', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make crust in advance.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat your oven to 425\xbaF. Knead dough until softened and no longer crumbly. Press 1 rounded teaspoonful dough in bottom and up side of each of 24 ungreased mini muffin cups, extending dough 1/4 inch above edge of cup.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 16 to 18 minutes or until puffed and golden brown. Take out and  put to the side to cool', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put coconut oil in medium saute pan over medium-high heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [], u'step': u'Add the shallots and garlic and cook, stirring, until soft and fragrant, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the So Delicious creamer, salt, pepper, and nutmeg, and cook until the cream is reduced by half, about 4 minutes then add Parma, after thoroughly mixed add in frozen spinach.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'id': 11463, u'name': u'frozen spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from heat. Spoon into the cool pastry cups. After spooned in, you warm just before serving', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 643, u'instructions': u'Make crust in advance. Heat your oven to 425\xbaF. Knead dough until softened and no longer crumbly. Press 1 rounded teaspoonful dough in bottom and up side of each of 24 ungreased mini muffin cups, extending dough 1/4 inch above edge of cup. Bake 16 to 18 minutes or until puffed and golden brown. Take out and  put to the side to coolPut coconut oil in medium saute pan over medium-high heat. Add the shallots and garlic and cook, stirring, until soft and fragrant, about 2 minutes. Add the So Delicious creamer, salt, pepper, and nutmeg, and cook until the cream is reduced by half, about 4 minutes then add Parma, after thoroughly mixed add in frozen spinach. Remove from heat. Spoon into the cool pastry cups. After spooned in, you warm just before serving', u'spoonacularSourceUrl': u'https://spoonacular.com/dairy-free-creamed-spinach-parmesan-cups-250167', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}