{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/622674-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 622674, u'veryPopular': False, u'lowFodmap': False, u'title': u'Candied Nuts Snack Mix', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 167.86, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1 cup roasted almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup salted cashews', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups craisins', u'aisle': u'Dried Fruits;Produce', u'name': u'craisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9079, u'unit': u'cups'}, {u'originalString': u'1 large egg white, whisked to foamy', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 1/2 cup pretzels', u'aisle': u'Savory Snacks', u'name': u'pretzels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19047, u'unit': u'cup'}, {u'originalString': u'1 tablespoon pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'tablespoon'}, {u'originalString': u'1 cup roasted and salted peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'roasted peanuts', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16092, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup semi sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1 tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup white chocolate chips', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 10019087, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2014/12/candied-nuts-snack-mix-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 300 degrees. Line a baking sheet with parchment paper in order to keep the nuts from sticking to the pan.To a large bowl, add the nuts and set aside. In a small bowl, add the egg white and water, and whisk vigorously until very foamy, which will take about a minute.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the egg mixture over the nuts and stir to coat evenly.In another small bowl, add the sugars, pumpkin pie spice and salt, and stir very well to coat everything evenly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Spread the nuts out evenly on the parchment paper and bake for 25 to 30 minutes, do not over bake. Do not worry about any of the sugar looking funny when hot, as the nuts cool everything will solidify.Allow nuts to cool on baking tray for a few hours or we prefer to just leave ours out all night. When nuts are cooled completely, sprinkle the dried fruit, pretzels and baking chips over nuts.Break apart any big chunks of nuts and toss everything into jars or sealed containers to keep.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood on the menu? Try pairing with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Piper-Heidsieck Brut Cuvee. It has 4.4 out of 5 stars and a bottle costs about 40 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Piper-Heidsieck Cuv\xe9e Brut is a classic, structured, full-bodied and bursting with fruit Champagne. The blend is composed of a majority of Pinots Noirs, incorporating more than 100 crus from around the Champagne region and Pinots Meuniers from the Grande et Petite Montagne de Reims region.On the palate:A structured, full-bodied and franc wine. A juicy, fleshy pear and golden grape texture. The finish narrows to citrus and grapefruit flavors. A wine with great fruit, a good mouthfeel and a harmonious balance.', u'title': u'Piper-Heidsieck Brut Cuvee', u'price': u'$39.99', u'id': 450714, u'link': u'https://www.wine.com/product/piper-heidsieck-brut-cuvee/20128', u'imageUrl': u'https://spoonacular.com/productImages/450714-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u'Preheat oven to 300 degrees. Line a baking sheet with parchment paper in order to keep the nuts from sticking to the pan.To a large bowl, add the nuts and set aside. In a small bowl, add the egg white and water, and whisk vigorously until very foamy, which will take about a minute.Pour the egg mixture over the nuts and stir to coat evenly.In another small bowl, add the sugars, pumpkin pie spice and salt, and stir very well to coat everything evenly.Spread the nuts out evenly on the parchment paper and bake for 25 to 30 minutes, do not over bake. Do not worry about any of the sugar looking funny when hot, as the nuts cool everything will solidify.Allow nuts to cool on baking tray for a few hours or we prefer to just leave ours out all night. When nuts are cooled completely, sprinkle the dried fruit, pretzels and baking chips over nuts.Break apart any big chunks of nuts and toss everything into jars or sealed containers to keep.', u'spoonacularSourceUrl': u'https://spoonacular.com/candied-nuts-snack-mix-622674', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 480, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}