{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/153018-556x370.', u'cheap': False, u'gaps': u'no', u'id': 153018, u'veryPopular': False, u'lowFodmap': False, u'title': u"Primanti's Sandwich", u'diets': [], u'pricePerServing': 299.86, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'4 ounces capicola, sliced', u'aisle': u'Meat', u'name': u'capicola', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 93679, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon celery seed, crushed', u'aisle': u'Spices and Seasonings', u'name': u'celery seed', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-seed.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2007, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoon'}, {u'originalString': u'4 thick slices Italian bread (ideally, about 6 by 4 inches, not too crusty)', u'aisle': u'Bakery/Bread', u'name': u'italian bread', u'metaInformation': [u'italian', u'thick', u'(ideally, 6 by 4 inches, not too crusty)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'slices'}, {u'originalString': u'1/4 teaspoon kosher salt, plus more for seasoning', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'plus more for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'4 ounces provolone, sliced', u'aisle': u'Cheese', u'name': u'provolone', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1035, u'unit': u'ounces'}, {u'originalString': u'2 small russet potatoes', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'3 cups very finely shredded Savoy cabbage', u'aisle': u'Produce', u'name': u'savoy cabbage', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/savoy-cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11114, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 ripe tomato, sliced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'ripe', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'Vegetable oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}], u'healthScore': 20.0, u'imageType': u'', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Primantis-Sandwich-369031', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Toss together the cabbage, vinegar, olive oil, celery seed, salt, and sugar in a large bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-seed.jpg', u'id': 2007, u'name': u'celery seed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let the slaw sit and the flavors mingle while you make the fries.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut unpeeled potatoes into sticks about 1/4 to 1/2 inch thick.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Heat 1 inch of vegetable oil in a deep skillet over medium heat. The oil is ready when the tip of a potato really sizzles on contact. Carefully slide the potatoes into the oil to fry over moderate heat, turning occasionally with tongs, until crisp, golden brown, and cooked through, about 8 to 10 minutes. Don’t let the fries brown too quickly! (They might remain raw on the inside and burned on the outside if they are cooked too fast.)', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels, and season with salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat another large skillet over high heat. When the skillet is hot, sear the sliced capicola until crisped on both sides, about 1 minute per side.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 93679, u'name': u'capicola'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove skillet from heat, and make two stacks of capicola on a side plate, laying the sliced provolone on top, to get it started melting while you assemble the sandwiches.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'id': 1035, u'name': u'provolone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 93679, u'name': u'capicola'}]}, {u'equipment': [], u'step': u'To assemble, lay two slices of bread on your work surface.Top with the capicola and melted cheese. Top with the fries, slaw, and sliced tomatoes.Top with the remaining bread, cut in half, and serve immediately.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 93679, u'name': u'capicola'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'aggregateLikes': 35, u'instructions': u"Preparation                                                                    Toss together the cabbage, vinegar, olive oil, celery seed, salt, and sugar in a large bowl. Let the slaw sit and the flavors mingle while you make the fries.                                                                            Cut unpeeled potatoes into sticks about 1/4 to 1/2 inch thick. Heat 1 inch of vegetable oil in a deep skillet over medium heat. The oil is ready when the tip of a potato really sizzles on contact. Carefully slide the potatoes into the oil to fry over moderate heat, turning occasionally with tongs, until crisp, golden brown, and cooked through, about 8 to 10 minutes. Don’t let the fries brown too quickly! (They might remain raw on the inside and burned on the outside if they are cooked too fast.) Drain on paper towels, and season with salt.                                                                            Heat another large skillet over high heat. When the skillet is hot, sear the sliced capicola until crisped on both sides, about 1 minute per side. Remove skillet from heat, and make two stacks of capicola on a side plate, laying the sliced provolone on top, to get it started melting while you assemble the sandwiches.                                                                            To assemble, lay two slices of bread on your work surface.Top with the capicola and melted cheese. Top with the fries, slaw, and sliced tomatoes.Top with the remaining bread, cut in half, and serve immediately.                                                                            Reprinted with permission from Lidia's Italy in America by Lidia Matticchio Bastianich and Tanya Bastianich Manuali. Copyright \xa9 2011 by Lidia Matticchio Bastianich and Tanya Bastianich Manuali. Excerpted by permission of Knopf, a division of Random House, Inc. All rights reserved.Lidia Matticchio Bastianich is the author of seven precious books, five of which have been accompanied by nationally syndicated public television series. She is the owner of the New York City restaurant Felidia, among others, and she gives lectures on Italian cuisine throughout the country. She lives on Long Island, New York.Tanya Bastianich Manuali received her Ph.D. in Renaissance art history from Oxford University. In 1996 she started Experienze Italiane, a travel company that arranges food, wine, and art tours to Italy. She also co-authors books with her mother, Lidia; manages Lidia's product line; and serves as the cultural and art consultant for the television series. She lives on Long Island.", u'spoonacularSourceUrl': u'https://spoonacular.com/primantis-sandwich-153018', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}