{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/739210-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 739210, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cold Roasted Veggies with Herbed Yogurt Dip', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 20, u'pricePerServing': 166.2, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'3 carrots, cut into sticks', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'cut into sticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 tablespoon finely chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons finely chopped fresh mint', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons finely chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves garlic, grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Zest of 1 lemon plus juice of 1/2 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/2 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'5 parsnips, cut into sticks', u'aisle': u'Produce', u'name': u'parsnips', u'metaInformation': [u'cut into sticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'2 cups plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cups'}, {u'originalString': u'2 red onions, cut into quarters', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'cut into quarters'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2 zucchini, cut into sticks', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'cut into sticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 45.0, u'imageType': u'jpeg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/cold-roasted-veggies-with-herbed-yogurt-dip.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the yogurt, mint, parsley, dill, garlic, lemon zest and juice, 1 teaspoon salt and 1/2 teaspoon pepper in a medium bowl and mix well; taste to check the seasonings. Cover with plastic wrap and refrigerate until ready to serve.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 475.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the roasted veggies: Preheat the oven to 475 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Arrange the parsnips and carrots on a baking sheet in a single layer. Arrange the zucchini and onions on a second baking sheet in a single layer.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drizzle both with the olive oil and sprinkle with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Roast the parsnips and carrots until lightly browned but still firm, about 10 minutes, roast the zucchini and onions until lightly browned but not soggy, 7 to 8 minutes.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Transfer to a ziptop bag and refrigerate until cold.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the roasted veggies cold with the herbed yogurt dip.', u'number': 7, u'ingredients': []}], u'name': u'For the herbed yogurt dip'}], u'winePairing': {}, u'aggregateLikes': 1388, u'instructions': u'Watch how to make this recipe.                    For the herbed yogurt dip: Combine the yogurt, mint, parsley, dill, garlic, lemon zest and juice, 1 teaspoon salt and 1/2 teaspoon pepper in a medium bowl and mix well; taste to check the seasonings. Cover with plastic wrap and refrigerate until ready to serve.                          For the roasted veggies: Preheat the oven to 475 degrees F.                          Arrange the parsnips and carrots on a baking sheet in a single layer. Arrange the zucchini and onions on a second baking sheet in a single layer. Drizzle both with the olive oil and sprinkle with salt and pepper.                          Roast the parsnips and carrots until lightly browned but still firm, about 10 minutes, roast the zucchini and onions until lightly browned but not soggy, 7 to 8 minutes. Transfer to a ziptop bag and refrigerate until cold.                          Serve the roasted veggies cold with the herbed yogurt dip.', u'spoonacularSourceUrl': u'https://spoonacular.com/cold-roasted-veggies-with-herbed-yogurt-dip-739210', u'dishTypes': [u'side dish'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}