{u'recipes': [{u'sourceName': u'Bakerette', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/585966-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 585966, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Cheese for Grown-ups', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 234.49, u'creditText': u'Bakerette', u'extendedIngredients': [{u'originalString': u'arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11959, u'unit': u'servings'}, {u'originalString': u'8 ounces baby', u'aisle': u'Produce', u'name': u'baby peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11304, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons vegan butter, at room temperature (preferably Earth Balance)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'at room temperature', u'(preferably Earth Balance)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'servings'}, {u'originalString': u'Red Onion Jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jam', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 19297, u'unit': u'servings'}, {u'originalString': u'1 plum tomato, thinly sliced and patted dry with paper towels', u'aisle': u'Produce', u'name': u'plum tomato', u'metaInformation': [u'dry', u'with paper towels', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'Sliced vegan cheddar cheese as needed (preferably Follow Your Heart brand)', u'aisle': u'Cheese;Health Foods', u'name': u'vegan cheddar cheese', u'metaInformation': [u'as needed', u'sliced', u'(preferably Follow Your Heart brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10193701, u'unit': u'servings'}, {u'originalString': u'Vidalia onion', u'aisle': u'Produce', u'name': u'vidalia onion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u'servings'}, {u'originalString': u'4 slices whole wheat bread', u'aisle': u'Bakery/Bread', u'name': u'whole wheat bread', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18075, u'unit': u'slices'}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://bakerette.com/grilled-cheese-for-grown-ups/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Lay out the 4 bread slices and spread 2 of them with 1/2 teaspoon each of butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Spread the other 2 bread slices with Dijon mustard, then add the onion jam or sprinkle each with a layer of sliced Vidalia onion. Please 3 slices of the tomato on top of the onion.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'id': 11294, u'name': u'vidalia onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}, {u'equipment': [], u'step': u'Place the sliced vegan cheddar on top of the tomatoes and mound the arugula over the cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place the buttered bread slices, butter side up, on top.Preheat a large nonstick pan with a lid over medium-low heat. (If you don't have a lid that fits, use an extra-large lid or a baking sheet.)", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining teaspoon of butter to the pan and swirl it around until melted. Using a spatula, place the sandwiches, butter side up, in the pan and cover.After about 4 minutes, gently pull up a corner of each sandwich to check the bottom bread slices for browning. When the bottom slices are golden brown, flip the sandwiches over, cover the pan, and cook for an additional 4 minutes or more.The sandwiches are perfect when the cheese has melted and both sides are "GB&D" (golden brown and delicious). Allow the sandwiches to cool slightly, then slice each, corner to corner.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 20, u'instructions': u'Lay out the 4 bread slices and spread 2 of them with 1/2 teaspoon each of butter.Spread the other 2 bread slices with Dijon mustard, then add the onion jam or sprinkle each with a layer of sliced Vidalia onion. Please 3 slices of the tomato on top of the onion.Place the sliced vegan cheddar on top of the tomatoes and mound the arugula over the cheese. Place the buttered bread slices, butter side up, on top.Preheat a large nonstick pan with a lid over medium-low heat. (If you don\'t have a lid that fits, use an extra-large lid or a baking sheet.) Add the remaining teaspoon of butter to the pan and swirl it around until melted. Using a spatula, place the sandwiches, butter side up, in the pan and cover.After about 4 minutes, gently pull up a corner of each sandwich to check the bottom bread slices for browning. When the bottom slices are golden brown, flip the sandwiches over, cover the pan, and cook for an additional 4 minutes or more.The sandwiches are perfect when the cheese has melted and both sides are "GB&D" (golden brown and delicious). Allow the sandwiches to cool slightly, then slice each, corner to corner.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-cheese-for-grown-ups-585966', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}