{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/443513-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 443513, u'veryPopular': False, u'lowFodmap': False, u'title': u'Rhubarb Custard Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 84.61, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 teaspoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'Cinnamon-sugar, optional', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cinnamon sugar butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-sugar-butter.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 93674, u'unit': u'servings'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Half-and-half cream, optional', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1049, u'unit': u'servings'}, {u'originalString': u'3 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'Pastry for double-crust pie (9 inches)', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'for double-crust pie (9 inches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 18337, u'unit': u'servings'}, {u'originalString': u'3 tablespoons quick-cooking tapioca', u'aisle': u'Baking', u'name': u'quick cooking tapioca', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tapioca-pearls.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93660, u'unit': u'tablespoons'}, {u'originalString': u'4 cups diced fresh or frozen rhubarb', u'aisle': u'Produce', u'name': u'rhubarb', u'metaInformation': [u'fresh', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 9307, u'unit': u'cups'}, {u'originalString': u'2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/rhubarb-custard-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, lightly beat eggs; blend in milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Combine sugar and tapioca; stir into egg mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Let stand for 15 minutes. Line a 9-in. pie plate with bottom pastry; trim even with edge of plate.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the rhubarb.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'id': 9307, u'name': u'rhubarb'}]}, {u'equipment': [], u'step': u'Pour egg mixture over rhubarb. Dot with butter.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'id': 9307, u'name': u'rhubarb'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Roll out remaining pastry to fit top of pie; place over filling. Trim, seal and flute edges.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cut slit in top.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Brush pastry with cream if desired.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake at 425\xb0 for 15 minutes. Reduce heat to 350\xb0, bake 35-40 minutes longer or until lightly brown. Sprinkle with cinnamon-sugar if desired. Cool on a wire rack for 1 hour. Refrigerate for at least 3 hours before serving. Refrigerate leftovers.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Chateau Chantal Late Harvest Riesling with a 4.5 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': None, u'title': u'Chateau Chantal Late Harvest Riesling', u'price': u'$21.0', u'id': 430249, u'link': u'https://www.amazon.com/Chateau-Chantal-Late-Harvest-Riesling/dp/B00IJI3V3I', u'imageUrl': u'https://spoonacular.com/productImages/430249-312x231.jpg'}]}, u'aggregateLikes': 119, u'instructions': u"Directions                                                                                In a small bowl, lightly beat eggs; blend in milk. Combine sugar and tapioca; stir into egg mixture. Let stand for 15 minutes. Line a 9-in. pie plate with bottom pastry; trim even with edge of plate. Add the rhubarb. Pour egg mixture over rhubarb. Dot with butter.                                                                                            Roll out remaining pastry to fit top of pie; place over filling. Trim, seal and flute edges. Cut slit in top. Brush pastry with cream if desired.                                                                                            Bake at 425\xb0 for 15 minutes. Reduce heat to 350\xb0, bake 35-40 minutes longer or until lightly brown. Sprinkle with cinnamon-sugar if desired. Cool on a wire rack for 1 hour. Refrigerate for at least 3 hours before serving. Refrigerate leftovers.                                        Yield: 6-8 servings.                                                                                                     Editor's Note: If using frozen rhubarb, measure rhubarb while still frozen, then thaw completely.  Drain in a colander, but do not press liquid out.                                                                                                Originally published as Rhubarb Custard Pie in  ReminisceJuly/August 1993, p51                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 piece) equals 501 calories, 17 g fat (7 g saturated fat), 93 mg cholesterol, 239 mg sodium, 83 g carbohydrate, 1 g fiber, 5 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/rhubarb-custard-pie-443513', u'dishTypes': [u'dessert'], u'occasions': [u'spring', u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}