{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/764288-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 17, u'id': 764288, u'veryPopular': True, u'lowFodmap': False, u'title': u'Healthier Blueberry Muffins', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 61.31, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'1/2 cup Almond Breeze Original Unsweetened Almondmilk (shelf-stable or refrigerated)', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'unsweetened', u'refrigerated', u'(shelf-stable or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'2 teaspoons Almond Breeze Original Unsweetened Almondmilk (shelf-stable or refrigerated)', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'unsweetened', u'refrigerated', u'(shelf-stable or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'2 cups fresh or frozen blueberries (if frozen, do not thaw first)', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh', u'frozen', u'thaw', u'(if , do not first)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cups'}, {u'originalString': u'1/2 cup melted butter or coconut oil, slightly cooled', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1 teaspoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'1 cup non-fat plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'non-fat greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}, {u'originalString': u'1/2 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'3 cups white whole wheat flour', u'aisle': u'Baking', u'name': u'white whole wheat flour', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 93824, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.gimmesomeoven.com/healthier-blueberry-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'How To Make The Healthier Blueberry Muffins:Preheat oven to 375F. Grease 24* baking cups with cooking spray, or line them with paper liners. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Add the flour, baking powder, cinnamon, and salt together in a large mixing bowl, and whisk until completelycombined. Set aside.In a separate mixing bowl, add the eggs, Greek yogurt, honey, vanilla, and almondmilk, and whisk until completelycombined. Gradually add in the melted butter (or coconut oil), whisking continuallyas you add it in so that its warmth doesn't accidentally cook the eggs.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk until completely combined.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour the wet ingredients into the mixing bowl with the dry ingredients, using a rubber spatula to gently fold everything together untiljust combined. (Be really careful not to overmix the batter.) Gently fold in the blueberries until just combined.Scoopthe batter into the prepared baking cups, filling them 3/4 full and topping with a few extra fresh blueberries if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 17-20 minutes, or until a toothpick inserted in the middle of the muffin comes out clean.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Remove and let cool on a wire rack.', u'number': 6, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk all ingredients together untilsmooth. If you need to thicken the glaze, add more powdered sugar. If you need to thin the glaze, add more almondmilk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u"Serve immediately, drizzled with the optional glaze if you'd like. Or store in a sealed container for up to 3 days.How To Make The Honey Lemon Glaze"}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1843, u'instructions': u"How To Make The Healthier Blueberry Muffins:Preheat oven to 375F. Grease 24* baking cups with cooking spray, or line them with paper liners. Set aside.Add the flour, baking powder, cinnamon, and salt together in a large mixing bowl, and whisk until completelycombined. Set aside.In a separate mixing bowl, add the eggs, Greek yogurt, honey, vanilla, and almondmilk, and whisk until completelycombined. Gradually add in the melted butter (or coconut oil), whisking continuallyas you add it in so that its warmth doesn't accidentally cook the eggs. Whisk until completely combined.Pour the wet ingredients into the mixing bowl with the dry ingredients, using a rubber spatula to gently fold everything together untiljust combined. (Be really careful not to overmix the batter.) Gently fold in the blueberries until just combined.Scoopthe batter into the prepared baking cups, filling them 3/4 full and topping with a few extra fresh blueberries if desired.Bake for 17-20 minutes, or until a toothpick inserted in the middle of the muffin comes out clean. Remove and let cool on a wire rack. Serve immediately, drizzled with the optional glaze if you'd like. Or store in a sealed container for up to 3 days.How To Make The Honey Lemon Glaze:Whisk all ingredients together untilsmooth. If you need to thicken the glaze, add more powdered sugar. If you need to thin the glaze, add more almondmilk.", u'spoonacularSourceUrl': u'https://spoonacular.com/healthier-blueberry-muffins-764288', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 32, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}