{u'recipes': [{u'sourceName': u'Jeanettes Healthy Living', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/604191-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 604191, u'veryPopular': False, u'lowFodmap': False, u'title': u'Brazilian Acai Breakfast Bowl', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 226.17, u'creditText': u'Jeanettes Healthy Living', u'extendedIngredients': [{u'originalString': u'1 medium banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'fresh fruit, to serve', u'aisle': u'Produce', u'name': u'fresh fruit', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 9431, u'unit': u'servings'}, {u'originalString': u'1 pack frozen acai fruit pulp (100 grams)', u'aisle': u'Produce', u'name': u'fruit', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9431, u'unit': u'grams'}, {u'originalString': u'gluten-free granola, to serve', u'aisle': u'Cereal', u'name': u'granola', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 8212, u'unit': u'servings'}, {u'originalString': u'1/4 cup pineapple juice', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9273, u'unit': u'cup'}, {u'originalString': u'4 strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}, {u'originalString': u'unsweetened dried coconut', u'aisle': u'Baking', u'name': u'unsweetened dried coconut', u'metaInformation': [u'dried', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12108, u'unit': u'servings'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://jeanetteshealthyliving.com/2014/07/brazilian-acai-breakfast-bowl.html', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place acai, banana, strawberries and pineapple in blender and blend until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour into a bowl and top with fresh fruit, granola and coconut.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fresh fruit'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'id': 8212, u'name': u'granola'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The J Vineyards & Winery Pinot Noir with a 5 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'At J, we are devoted to the concept of terroir in the Russian River Valley, and our 2013 J Vineyards Pinot Noir is a reflection of this vintage, the vineyards and our attention to detail in the winery. Delivering bright berry flavors-red cherry, raspberry and blackberry- this elegant Pinot is enhanced by notes of licorice and red tea, which linger on the finish. Aromas of wild strawberries and spices delight the nose.', u'title': u'J Vineyards & Winery Pinot Noir', u'price': u'$47.99', u'id': 428384, u'link': u'https://www.amazon.com/Vineyards-Winery-Russian-River-Valley/dp/B01A6A3A1O', u'imageUrl': u'https://spoonacular.com/productImages/428384-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Place acai, banana, strawberries and pineapple in blender and blend until smooth. Pour into a bowl and top with fresh fruit, granola and coconut.', u'spoonacularSourceUrl': u'https://spoonacular.com/brazilian-acai-breakfast-bowl-604191', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}