{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/219887-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 219887, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spring onion & halloumi bruschetta with carrot & saffron salsa', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 467.31, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g whole blanched almonds', u'aisle': u'Nuts;Savory Snacks', u'name': u'blanched almonds', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blanched-almonds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 12062, u'unit': u'g'}, {u'originalString': u'4 carrots, thinly sliced into rounds', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'thinly sliced into rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 red chicory, leaves separated', u'aisle': u'Produce', u'name': u'chicory', u'metaInformation': [u'red', u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/escarole.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11213, u'unit': u''}, {u'originalString': u'small bunch coriander, chopped', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'bunch'}, {u'originalString': u'1 garlic clove, halved', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'225g pack halloumi cheese', u'aisle': u'Cheese', u'name': u'halloumi cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halloumi.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 93624, u'unit': u'g'}, {u'originalString': u'juice \xbd lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'50ml extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 50.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'ml'}, {u'originalString': u'pinch of saffron threads', u'aisle': u'Ethnic Foods;Spices and Seasonings;Gourmet', u'name': u'saffron threads', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2037, u'unit': u'pinch'}, {u'originalString': u'4 slices sourdough bread', u'aisle': u'Bakery/Bread', u'name': u'sourdough bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sourdough-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10118029, u'unit': u'slices'}, {u'originalString': u'12 spring onions, trimmed', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 tbsp vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 47.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2137644/spring-onion-and-halloumi-bruschetta-with-carrot-a', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'If you want to reduce the saltiness of the halloumi, soak it for two hours beforehand in cold water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halloumi.png', u'id': 93624, u'name': u'halloumi'}]}, {u'equipment': [], u'step': u'Cut the halloumi evenly into 8 slicesacross the width of the cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halloumi.png', u'id': 93624, u'name': u'halloumi'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heatoven to 200C/180C fan/gas 6. Tossthe carrots together with the oliveoil, saffron, lemon juice and someseasoning. Tip onto a baking tray androast for 20 mins or until tender andgolden. Leave to cool, then tip into afood processor with the almonds andcoarsely blitz. Scrape the salsa out intoa bowl and add the chopped coriander.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}]}, {u'equipment': [], u'step': u'Mix well and add more seasoning orlemon juice if needed.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the vegetable oil in a large pan.Thoroughly pat dry the halloumi slices.When the pan is hot, carefully place inthe pan and cook over a medium heatuntil golden brown, then turn over andcook until the other side is golden.While the cheese is cooking, toastthe sourdough, then rub one side withgarlic.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halloumi.png', u'id': 93624, u'name': u'halloumi'}]}, {u'equipment': [], u'step': u'Place a piece of toast on eachof 4 plates and top with 2 slices ofhalloumi.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the spring onions tothe pan and cook for a couple of minson each side until wilting and a littlegolden. Put 3 spring onions on eachhalloumi-topped sourdough slice, thengenerously spoon over the carrot &saffron salsa.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Serve with chicory leaves.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/escarole.jpg', u'id': 11213, u'name': u'endive'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Bruschetta works really well with Chianti, Sparkling ros\xe9, and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Felsina Chianti Colli Senesi. It has 4.1 out of 5 stars and a bottle costs about 21 dollars.", u'pairedWines': [u'chianti', u'sparkling rose', u'sparkling wine', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 23, u'instructions': u'If you want to reduce the saltiness of the halloumi, soak it for two hours beforehand in cold water.Cut the halloumi evenly into 8 slicesacross the width of the cheese. Heatoven to 200C/180C fan/gas 6. Tossthe carrots together with the oliveoil, saffron, lemon juice and someseasoning. Tip onto a baking tray androast for 20 mins or until tender andgolden. Leave to cool, then tip into afood processor with the almonds andcoarsely blitz. Scrape the salsa out intoa bowl and add the chopped coriander.Mix well and add more seasoning orlemon juice if needed.Heat the vegetable oil in a large pan.Thoroughly pat dry the halloumi slices.When the pan is hot, carefully place inthe pan and cook over a medium heatuntil golden brown, then turn over andcook until the other side is golden.While the cheese is cooking, toastthe sourdough, then rub one side withgarlic. Place a piece of toast on eachof 4 plates and top with 2 slices ofhalloumi. Add the spring onions tothe pan and cook for a couple of minson each side until wilting and a littlegolden. Put 3 spring onions on eachhalloumi-topped sourdough slice, thengenerously spoon over the carrot &saffron salsa. Serve with chicory leaves.', u'spoonacularSourceUrl': u'https://spoonacular.com/spring-onion-halloumi-bruschetta-with-carrot-saffron-salsa-219887', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'spring', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}