{u'recipes': [{u'sourceName': u'The Messy Baker Blog', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/612085-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 612085, u'veryPopular': False, u'lowFodmap': False, u'title': u'Harvest Chili Bowls', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 1424.26, u'creditText': u'The Messy Baker Blog', u'extendedIngredients': [{u'originalString': u'1 (15.5-ounce) can cannellini beans, drained', u'aisle': u'Canned and Jarred', u'name': u'canned cannellini beans', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 10016051, u'unit': u'ounce'}, {u'originalString': u'1 (28-ounce) can tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon coriander', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 (14.5-ounce) can fire roasted tomatoes', u'aisle': u'Canned and Jarred', u'name': u'fire roasted canned tomatoes', u'metaInformation': [u'fire roasted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 98849, u'unit': u'ounce'}, {u'originalString': u'1 cup frozen or fresh corn kernels', u'aisle': u'Produce', u'name': u'fresh corn kernels', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011167, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 cup diced green pepper', u'aisle': u'Produce', u'name': u'green pepper', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'1 jalape\xf1o, diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 cup diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup diced red pepper', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'serving'}, {u'originalString': u'1/4 teaspoon smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'1 cup diced squash', u'aisle': u'Produce', u'name': u'squash', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011485, u'unit': u'cup'}, {u'originalString': u'1 cup diced zucchini', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u'cup'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://themessybakerblog.com/2014/09/15/harvest-chili-bowls/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 89, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat 1 tablespoon of olive oil in a large pot over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the ground beef and a generous pinch of salt and pepper. Brown the beef, breaking it up with a spatula or wooden spoon as it cooks, until it is no longer pink.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Add the peppers, onions, and garlic. Cook until tender, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the zucchini and squash and cook for an additional 5 minutes.Turn the heat down to medium-low and stir in the tomato sauce, diced tomatoes, beans, corn, and spices. Cover and cook 30 minutes, stirring occasionally.Season with salt and pepper to taste.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili works really well with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. You could try Juve Y Camps Brut Nature Reserva de la Familia Cava. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 16 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale gold in color, this Cava has aromas of mature white peach, toasted bread and green tea with hints of lemon citrus and apricots. Equally rich and broad on the palate, these flavors continue to unfold on the palate.Its fresh profile makes it a perfect match for pate, seafood, tapas, paellas, grilled poultry or cured meats.', u'title': u'Juve Y Camps Brut Nature Reserva de la Familia Cava', u'price': u'$15.99', u'id': 433977, u'link': u'https://www.wine.com/product/juve-y-camps-brut-nature-reserva-de-la-familia-cava-2011/150306', u'imageUrl': u'https://spoonacular.com/productImages/433977-312x231.jpg'}]}, u'aggregateLikes': 111, u'instructions': u'Heat 1 tablespoon of olive oil in a large pot over medium-high heat. Add the ground beef and a generous pinch of salt and pepper. Brown the beef, breaking it up with a spatula or wooden spoon as it cooks, until it is no longer pink.Add the peppers, onions, and garlic. Cook until tender, about 5 minutes. Add the zucchini and squash and cook for an additional 5 minutes.Turn the heat down to medium-low and stir in the tomato sauce, diced tomatoes, beans, corn, and spices. Cover and cook 30 minutes, stirring occasionally.Season with salt and pepper to taste. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/harvest-chili-bowls-612085', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}