{u'recipes': [{u'sourceName': u'Curious Cuisiniere', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/674764-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 674764, u'veryPopular': False, u'lowFodmap': False, u'title': u'Thai Fried Rice', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 143.63, u'creditText': u'Curious Cuisiniere', u'extendedIngredients': [{u'originalString': u'\xbc lb chicken (shrimp, crab, or pork), chopped into bite sized pieces', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'chopped', u'(shrimp, crab, or pork)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 1025006, u'unit': u'lb'}, {u'originalString': u'Handful fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Handful'}, {u'originalString': u'2 c cooked rice, room temperature', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'cooked', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'c'}, {u'originalString': u'1 cucumber, sliced', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tsp fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tsp'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 green onion, chopped', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 lime, cut into wedges', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'cut into wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'\xbd large onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 Tbsp peanut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'Tbsp'}, {u'originalString': u'\xbd large red pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 red chili (Serrano or Thai if you like it hot, seeded red jalapeno if you like it mild), chopped', u'aisle': u'Produce', u'name': u'red chili', u'metaInformation': [u'red', u'hot', u'seeded', u'chopped', u'(Serrano or Thai if you like it , jalapeno if you like it mild)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 tsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tsp'}, {u'originalString': u'1 medium tomato, sliced thin', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'medium', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.curiouscuisiniere.com/thai-fried-rice/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat the peanut oil in a large wok (or very large skillet) over high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'id': 4042, u'name': u'peanut oil'}]}, {u'equipment': [], u'step': u'Add the garlic and chilies and saut for a few seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the chicken and saut until cooked through, 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Add the cooked rice, onion and red pepper, and saut for 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10220445, u'name': u'cooked rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Add the fish sauce, soy sauce, and sliced tomato. Saut for 1-2 minutes, mixing well.Push all the ingredients in your wok to one side and crack the egg directly into the wok. Scramble it with your spatula and let it cook until it is just starting to set. Toss the egg with the rice mixture until the egg is cooked through.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve the fried rice topped with cucumber slices, chopped green onions, a lime wedge, a sprinkling of fresh cilantro, and a dash of extra white pepper (if desired).', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian can be paired with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try Tanian et Vincent Careme Terre Brulee Chenin Blanc. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'Heat the peanut oil in a large wok (or very large skillet) over high heat. Add the garlic and chilies and saut for a few seconds. Add the chicken and saut until cooked through, 2-3 minutes.Add the cooked rice, onion and red pepper, and saut for 1-2 minutes.Add the fish sauce, soy sauce, and sliced tomato. Saut for 1-2 minutes, mixing well.Push all the ingredients in your wok to one side and crack the egg directly into the wok. Scramble it with your spatula and let it cook until it is just starting to set. Toss the egg with the rice mixture until the egg is cooked through.Serve the fried rice topped with cucumber slices, chopped green onions, a lime wedge, a sprinkling of fresh cilantro, and a dash of extra white pepper (if desired).', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-fried-rice-674764', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}