{u'recipes': [{u'sourceName': u'Seasonal and Savory', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478598-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 478598, u'veryPopular': False, u'lowFodmap': True, u'title': u'Wild Sardine and Grapefruit Salad in Endive Cups', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 108.65, u'creditText': u'Seasonal and Savory', u'extendedIngredients': [{u'originalString': u'1 teaspoon Aleppo pepper (or crushed red pepper)', u'aisle': u'Spices and Seasonings', u'name': u'aleppo pepper', u'metaInformation': [u'red', u'crushed', u'(or pepper)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1062009, u'unit': u'teaspoon'}, {u'originalString': u'Belgium Endive', u'aisle': u'Produce', u'name': u'endive', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/escarole.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11213, u'unit': u'servings'}, {u'originalString': u'juice of two limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'\xbc cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 large red grapefruit, peeled and with membranes removed, in bite-sized pieces', u'aisle': u'Produce', u'name': u'red grapefruit', u'metaInformation': [u'red', u'with membranes removed, in bite-sized pieces', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapefruit.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009112, u'unit': u''}, {u'originalString': u'salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 cans Wild Planet Sardines in Spring Water, drained', u'aisle': u'Beverages', u'name': u'spring water', u'metaInformation': [u'wild', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cans'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.seasonalandsavory.com/2013/07/wild-sardine-and-grapefruit-salad-in-endive-cups.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a small mixing bowl, break the sardines into bite-sized pieces.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chopped red onion, lime juice, olive oil, grapefruit, Aleppo pepper, and salt, and stir gently to combine. Refrigerate until ready to serve.To serve, spoon some of the salad into individual Belgium endive leaves.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1062009, u'name': u'aleppo pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grapefruit.jpg', u'id': 9112, u'name': u'grapefruit'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/escarole.jpg', u'id': 11213, u'name': u'endive'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with lime wedges and/or chopped fresh cilantro sprinkled on top, if desired.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are great choices for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 66, u'instructions': u'In a small mixing bowl, break the sardines into bite-sized pieces. Add the chopped red onion, lime juice, olive oil, grapefruit, Aleppo pepper, and salt, and stir gently to combine. Refrigerate until ready to serve.To serve, spoon some of the salad into individual Belgium endive leaves. Serve with lime wedges and/or chopped fresh cilantro sprinkled on top, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/wild-sardine-and-grapefruit-salad-in-endive-cups-478598', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}