{u'recipes': [{u'sourceName': u'The Purple Foodie', u'cuisines': [u'middl eastern'], u'image': u'https://spoonacular.com/recipeImages/252664-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 252664, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baklava', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 94.42, u'creditText': u'The Purple Foodie', u'extendedIngredients': [{u'originalString': u'1 tablespoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'225g honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'g'}, {u'originalString': u'1 lemon, halved', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 teaspoons freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoons'}, {u'originalString': u'1 orange, halved', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'250g pistachios, finely chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 12151, u'unit': u'g'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 (approx 400g) package phyllo pastry sheets, thawed if frozen', u'aisle': u'Refrigerated;Frozen', u'name': u'sheets phyllo pastry', u'metaInformation': [u'frozen', u'thawed', u'(approx 400g)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18338, u'unit': u''}, {u'originalString': u'250g sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'340g unsalted butter, melted and cooled slightly', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 340.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'250g walnuts, finely chopped', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 12155, u'unit': u'g'}, {u'originalString': u'160g water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 160.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'g'}, {u'originalString': u'500g whole almonds, finely chopped', u'aisle': u'Nuts', u'name': u'whole almonds', u'metaInformation': [u'whole', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 12061, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://purplefoodie.com/baklava-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine sugar and water in a saucepan. Squeeze juice from lemon and orange into sugar mixture and then throw the halves in as well. .', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the cinnamon sticks. Bring the mixture to a boil over moderate heat until sugar is dissolved, then simmer 10 minutes. Skim as necessary. Stir in the honey and return to a boil.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from heat and cool to room temperature.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 170.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u"Pour through a sieve into a large bowl and discard the fruit rind while leaving the cinnamon stick inside. Chill until completely cold. NOTE: One time, we left the fruit halves in thinking it might draw out more of the citrus flavour into the syrup. Turns out, that it makes it rather strong and it's best to discard it before cooling it. Make the Baklava: Put oven rack in middle position and preheat oven to 170C.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together almonds, walnuts, sugar, cinnamon, nutmeg, cloves, and salt until combined well.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Brush a 13x9 inch baking dish with melted butter.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut the phyllo sheets into half along the width and stack them all up. Keep stack covered with  a dampened clean kitchen towel to prevent it from drying out. Lay 2 sheets of phyllo in bottom of baking dish and brush top sheet with butter. Continue to layer 2 sheets at a time, staggering sheets in each double layer slightly to cover bottom of dish, then brushing every second sheet with butter, until you have used 10 sheets of phyllo total. After brushing top layer of phyllo with butter, spread about 1 1/2 cups of nut mixture over it. Spoon over 2 tablespoons butter.Repeat this layering process 3 more times. Top with 10 more sheets of phyllo. (You will use 50 sheets of phyllo total.) Butter top and let baklava stand at room temperature for the butter to firm up slightly to facilitate cutting, 10 to 15 minutes.Using a sharp knife, cut baklava into 16 equal rectangles, then cut each piece in half diagonally, making sure to cut all the way through.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'id': 18338, u'name': u'filo pastry'}]}, {u'equipment': [], u'step': u'Bake baklava until golden, 50 minutes to 1 hour.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer dish to a rack to cool, then slowly pour cold syrup around edges of hot baklava, in between all cuts, and over top.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand at room temperature at least 8 hours. (Cover once baklava is at room temperature.) Do not chill.', u'number': 10, u'ingredients': []}], u'name': u'Soaking Syrup'}], u'winePairing': {u'pairingText': u"Baklava works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 23, u'instructions': u"Soaking Syrup: Combine sugar and water in a saucepan. Squeeze juice from lemon and orange into sugar mixture and then throw the halves in as well. . Add the cinnamon sticks. Bring the mixture to a boil over moderate heat until sugar is dissolved, then simmer 10 minutes. Skim as necessary. Stir in the honey and return to a boil. Remove from heat and cool to room temperature. Pour through a sieve into a large bowl and discard the fruit rind while leaving the cinnamon stick inside. Chill until completely cold. NOTE: One time, we left the fruit halves in thinking it might draw out more of the citrus flavour into the syrup. Turns out, that it makes it rather strong and it's best to discard it before cooling it. Make the Baklava: Put oven rack in middle position and preheat oven to 170C.Whisk together almonds, walnuts, sugar, cinnamon, nutmeg, cloves, and salt until combined well.Brush a 13x9 inch baking dish with melted butter. Cut the phyllo sheets into half along the width and stack them all up. Keep stack covered with  a dampened clean kitchen towel to prevent it from drying out. Lay 2 sheets of phyllo in bottom of baking dish and brush top sheet with butter. Continue to layer 2 sheets at a time, staggering sheets in each double layer slightly to cover bottom of dish, then brushing every second sheet with butter, until you have used 10 sheets of phyllo total. After brushing top layer of phyllo with butter, spread about 1 1/2 cups of nut mixture over it. Spoon over 2 tablespoons butter.Repeat this layering process 3 more times. Top with 10 more sheets of phyllo. (You will use 50 sheets of phyllo total.) Butter top and let baklava stand at room temperature for the butter to firm up slightly to facilitate cutting, 10 to 15 minutes.Using a sharp knife, cut baklava into 16 equal rectangles, then cut each piece in half diagonally, making sure to cut all the way through.Bake baklava until golden, 50 minutes to 1 hour. Transfer dish to a rack to cool, then slowly pour cold syrup around edges of hot baklava, in between all cuts, and over top. Let stand at room temperature at least 8 hours. (Cover once baklava is at room temperature.) Do not chill.", u'spoonacularSourceUrl': u'https://spoonacular.com/baklava-252664', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}