{u'recipes': [{u'sourceName': u'The Comfort of Cooking', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/590057-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590057, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ratatouille Crostini', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 40.3, u'creditText': u'The Comfort of Cooking', u'extendedIngredients': [{u'originalString': u'1 (14.5 oz.) can diced tomatoes, undrained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'1/4 cup chopped parsley or 2 Tbsp. dried', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley', u'metaInformation': [u'dried', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2029, u'unit': u'cup'}, {u'originalString': u'1 medium eggplant, peeled, cut into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'medium', u'peeled', u'cut into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'1 French baguette, sliced into 1-inch thick slices', u'aisle': u'Bakery/Bread', u'name': u'french baguette', u'metaInformation': [u'french', u'sliced into slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tsp. Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'tsp'}, {u'originalString': u'3 Tbsp. fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 medium red bell pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 medium red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 cups (8 oz.) Sargento\xae Fine Cut Shredded Mozzarella Cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'cut ', u'fine', u'sargento\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'oz'}, {u'originalString': u'1 large or 2 medium zucchini, cut into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'medium', u'cut into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.thecomfortofcooking.com/2013/07/ratatouille-crostini.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450 degrees F.On a large baking sheet, combine eggplant, zucchini, onion and bell pepper. In a separate small bowl, mix oil, lemon juice, garlic, basil, oregano and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Drizzle over vegetables, tossing to coat.Roast for 20 minutes or until vegetables are tender. Halfway through cooking time, remove from oven and stir in diced tomatoes with liquid.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer back to oven and roast for 10 more minutes.Meanwhile, place baguette slices on a large baking sheet. Spray with nonstick butter spray or brush with butter, and toast in oven until golden, 5-6 minutes.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and top each slice with a pinch of mozzarella.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer back to oven for 2-3 minutes to melt cheese.Top each toast slice with heaping 1 tablespoon vegetable mixture and a sprinkle of parsley.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm or at room temperature.Enjoy!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Korbel Organic Brut. It has 4.3 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'#73 Wine Spectator Top 100 of 2016Korbel Brut – Made with Organically Grown Grapes is created in the classic Korbel style, crisp, delicate and bright. We always strive to present the pure flavors of the grape in all of our champagnes. The organically grown grapes in this cuvee deliver well-integrated aromas and flavors of apple, pear and white peaches. The finish is medium dry, with a slight savory note at the end.', u'title': u'Korbel Organic Brut', u'price': u'$12.98', u'id': 443895, u'link': u'https://www.wine.com/product/korbel-organic-brut/105310', u'imageUrl': u'https://spoonacular.com/productImages/443895-312x231.jpg'}]}, u'aggregateLikes': 813, u'instructions': u'Preheat oven to 450 degrees F.On a large baking sheet, combine eggplant, zucchini, onion and bell pepper. In a separate small bowl, mix oil, lemon juice, garlic, basil, oregano and salt. Drizzle over vegetables, tossing to coat.Roast for 20 minutes or until vegetables are tender. Halfway through cooking time, remove from oven and stir in diced tomatoes with liquid. Transfer back to oven and roast for 10 more minutes.Meanwhile, place baguette slices on a large baking sheet. Spray with nonstick butter spray or brush with butter, and toast in oven until golden, 5-6 minutes. Remove from oven and top each slice with a pinch of mozzarella. Transfer back to oven for 2-3 minutes to melt cheese.Top each toast slice with heaping 1 tablespoon vegetable mixture and a sprinkle of parsley. Serve warm or at room temperature.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/ratatouille-crostini-590057', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}