{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/751328-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 751328, u'veryPopular': True, u'lowFodmap': False, u'title': u'Milk Chocolate Mousse', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 201.77, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 tablespoons butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'4 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'Gummy worms, for serving', u'aisle': u'Sweet Snacks', u'name': u'gummy worms', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gummy-worms.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 93642, u'unit': u'servings'}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'8 ounces milk chocolate, plus more for grating', u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [u'plus more for grating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 19081, u'unit': u'ounces'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpeg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/milk-chocolate-mousse.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 45, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}], u'step': u'Melt the chocolate and butter in a double boiler. Set aside to cool a little.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Whip the cream with an electric mixer on high for about a minute. Turn the mixer to low while adding the sugar, then turn back to high and whip to stiff peaks.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the egg yolks in a pitcher and add the vanilla.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Next, temper the eggs by adding a little of the melted chocolate. Then pour the eggs back into the bowl of melted chocolate and stir to combine. Fold in three-quarters of the whipped cream (refrigerate the remaining whipped cream for serving). Spoon the mousse into serving glasses or bowls and refrigerate for at least 1 hour.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [], u'step': u'Serve the mousse with dollops of whipped cream and garnish with grated chocolate and gummy worms.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gummy-worms.jpg', u'id': 93642, u'name': u'gummy worms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 843, u'instructions': u'Watch how to make this recipe.                    Melt the chocolate and butter in a double boiler. Set aside to cool a little.                          Whip the cream with an electric mixer on high for about a minute. Turn the mixer to low while adding the sugar, then turn back to high and whip to stiff peaks.                          Whisk the egg yolks in a pitcher and add the vanilla.                          Next, temper the eggs by adding a little of the melted chocolate. Then pour the eggs back into the bowl of melted chocolate and stir to combine. Fold in three-quarters of the whipped cream (refrigerate the remaining whipped cream for serving). Spoon the mousse into serving glasses or bowls and refrigerate for at least 1 hour.                          Serve the mousse with dollops of whipped cream and garnish with grated chocolate and gummy worms.', u'spoonacularSourceUrl': u'https://spoonacular.com/milk-chocolate-mousse-751328', u'dishTypes': [u'dessert'], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}