{u'recipes': [{u'sourceName': u'Making Thyme for Health', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/620610-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 620610, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cauliflower Potato & Leek Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 202.17, u'creditText': u'Making Thyme for Health', u'extendedIngredients': [{u'originalString': u'5 cups cauliflower florets (approx. 2lb head of cauliflower)', u'aisle': u'Produce', u'name': u'cauliflower florets', u'metaInformation': [u'(approx. 2lb head of cauliflower)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 10011135, u'unit': u'cups'}, {u'originalString': u'fresh chives, chopped', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11156, u'unit': u'servings'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 cups chopped leeks (approx. 3 medium-size leeks)', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'medium-size', u'chopped', u'(approx. 3 leeks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups milk (I used unsweetened plain almond milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'plain', u'unsweetened', u'(I used almond milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'4 cups cubed and peeled russet potatoes (approx 2 large potatoes)', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'large', u'cubed', u'peeled', u'(approx 2 potatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11353, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.makingthymeforhealth.com/2014/11/19/cauliflower-potato-and-leek-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Warm one tablespoon olive oil in a large pot over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the leeks and garlic then cook for 2-3 minutes.Next add the potatoes and the cauliflower then sprinkle with salt & pepper and stir together. Cook for another 5 minutes and then pour in the vegetable broth. Bring to a boil and then reduce to a simmer and cook for about 20 minutes, until vegetables are tender.Using a blender (or an immersion blender) puree the vegetables until smooth.', u'length': {u'number': 28, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour in the milk and stir together until thoroughly heated. If you prefer the soup to have a thinner texture, simply add more milk and puree until desired consistency is reached. Distribute the soup into separate bowls and top with fresh chives then serve!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'fresh chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'aggregateLikes': 280, u'instructions': u'Warm one tablespoon olive oil in a large pot over medium heat. Add the leeks and garlic then cook for 2-3 minutes.Next add the potatoes and the cauliflower then sprinkle with salt & pepper and stir together. Cook for another 5 minutes and then pour in the vegetable broth. Bring to a boil and then reduce to a simmer and cook for about 20 minutes, until vegetables are tender.Using a blender (or an immersion blender) puree the vegetables until smooth. Pour in the milk and stir together until thoroughly heated. If you prefer the soup to have a thinner texture, simply add more milk and puree until desired consistency is reached. Distribute the soup into separate bowls and top with fresh chives then serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/cauliflower-potato-leek-soup-620610', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}