{u'recipes': [{u'sourceName': u'A Girl Worth saving', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/541758-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 541758, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fudgy Pecan Pie Bars', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 133.02, u'creditText': u'A Girl Worth saving', u'extendedIngredients': [{u'originalString': u'1 cup Raw Almond Butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12195, u'unit': u'cup'}, {u'originalString': u'4 tbsp Cacao', u'aisle': u'Health Foods;Gourmet', u'name': u'cacao nibs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cacao-nibs.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 98846, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tbsp'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup of ghee', u'aisle': u'Ethnic Foods', u'name': u'ghee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93632, u'unit': u'cup'}, {u'originalString': u'\xbc cup of honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1 cup pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'\xbc tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'\xbd 85% Dark Chocolate Bar', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate bar', u'metaInformation': [u'dark', u'85%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 10019904, u'unit': u''}, {u'originalString': u'\xbd tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.agirlworthsaving.net/2013/12/fudgy-pecan-pie-bars.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 350 degrees.To make the fudgy crust combine the ingredients in a small bowl and mix thoroughly. The mixture will be really sticky.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour this into a grease 8" round baking dish and you will have to use a wet a spoon to spread the crust throughout the pan.In another small add the eggs, honey, sea salt, ghee and vanilla and whisk until well combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}]}, {u'equipment': [], u'step': u'Pour in the pecans to coat and the pour this on top of the fudgy crust.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake at 350 for 25 - 30 minutes.For the chocolate sauce, in a pan warm the coconut oil and half of the chocolate bar until completely melted.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [], u'step': u'Pour over the pecan bars and let chill to set.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Pecan Pie Bar. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 41, u'instructions': u'Preheat your oven to 350 degrees.To make the fudgy crust combine the ingredients in a small bowl and mix thoroughly. The mixture will be really sticky.Pour this into a grease 8" round baking dish and you will have to use a wet a spoon to spread the crust throughout the pan.In another small add the eggs, honey, sea salt, ghee and vanilla and whisk until well combined.Pour in the pecans to coat and the pour this on top of the fudgy crust.Bake at 350 for 25 - 30 minutes.For the chocolate sauce, in a pan warm the coconut oil and half of the chocolate bar until completely melted. Pour over the pecan bars and let chill to set.', u'spoonacularSourceUrl': u'https://spoonacular.com/fudgy-pecan-pie-bars-541758', u'dishTypes': [u'dessert'], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}