{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/616338-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 616338, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Cake II', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 78.4, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'3 teaspoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups solid pack pumpkin puree', u'aisle': u'Baking', u'name': u'solid pack pumpkin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cups'}, {u'originalString': u'1/2 cup chopped walnuts', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'2 cups white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Pumpkin-Cake-II/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 10 inch tube pan. Sift together flour, soda, baking powder, cinnamon and salt. Set aside.In a large bowl, combine oil and sugar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add eggs one at a time and mix well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the flour mixture and beat until smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add nuts and pumpkin and blend until smooth.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour batter into greased 10 inch tube pan.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 331, u'instructions': u'Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 10 inch tube pan. Sift together flour, soda, baking powder, cinnamon and salt. Set aside.In a large bowl, combine oil and sugar. Add eggs one at a time and mix well. Add the flour mixture and beat until smooth. Add nuts and pumpkin and blend until smooth. Pour batter into greased 10 inch tube pan.Bake at 375 degrees F (190 degrees C) for 1 hour or until a toothpick inserted into the center of cake comes out clean. Cool in pan for 10 minutes, then turn out onto a wire rack and finish cooling. Dust with confectioners sugar before serving.Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-cake-ii-616338', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}