{u'recipes': [{u'sourceName': u'The Cookie Rookie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/629312-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 629312, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blackberry Ombre Sparkler', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 40.43, u'creditText': u'The Cookie Rookie', u'extendedIngredients': [{u'originalString': u'1 cup fresh blackberries', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9042, u'unit': u'cup'}, {u'originalString': u'1 bottle champagne', u'aisle': u'Alcoholic Beverages', u'name': u'champagne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'liquid', u'id': 10043155, u'unit': u'bottle'}, {u'originalString': u'4 sprigs fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2063, u'unit': u'sprigs'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.thecookierookie.com/blackberry-ombre-sparkler/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small saucepan, combine blackberries, sugar, and water. Bring to a boil on high heat, and then reduce to a simmer and let cook for approximately 12-15 minutes. The blackberries will become soft and bright in color and a pinkish purple syrup will form. Take off of the heat and drain the blackberries, keeping the syrup in a separate bowl. Set both aside and allow to cool.Once blackberries and simple syrup are cooled, spoon about 4 tablespoons of syrup into the bottom of each champagne flute (this recipe makes 4 drinks)Top with champagne.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'id': 10043155, u'name': u'champagne'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Garnish with fresh blackberries or the cooked blackberries, and a sprig of rosemary.Cheers!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 27, u'instructions': u'In a small saucepan, combine blackberries, sugar, and water. Bring to a boil on high heat, and then reduce to a simmer and let cook for approximately 12-15 minutes. The blackberries will become soft and bright in color and a pinkish purple syrup will form. Take off of the heat and drain the blackberries, keeping the syrup in a separate bowl. Set both aside and allow to cool.Once blackberries and simple syrup are cooled, spoon about 4 tablespoons of syrup into the bottom of each champagne flute (this recipe makes 4 drinks)Top with champagne.Garnish with fresh blackberries or the cooked blackberries, and a sprig of rosemary.Cheers!', u'spoonacularSourceUrl': u'https://spoonacular.com/blackberry-ombre-sparkler-629312', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}