{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/751284-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 751284, u'veryPopular': True, u'lowFodmap': False, u'title': u"Mike's Crispy Treats", u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 95.48, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 24-ounce package white almond bark', u'aisle': u'Baking', u'name': u'almond bark', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 98857, u'unit': u'ounce'}, {u'originalString': u'6 cups fruit-flavored cereal rings, such as Froot Loops', u'aisle': u'Cereal', u'name': u'fruit loops cereal', u'metaInformation': [u' such as froot loops'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fruit-loops.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 8030, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 10-ounce bag rainbow mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 19116, u'unit': u'ounce'}, {u'originalString': u'1 10-ounce bag white mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'white', u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 19116, u'unit': u'ounce'}, {u'originalString': u'4 tablespoons salted butter, plus more softened butter, for greasing the baking dish', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'softened', u'plus more  butter, for greasing the baking dish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/mikes-crispy-treats.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Thoroughly grease a 9-inch-by-13-inch baking dish with softened butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Add the 4 tablespoons butter to a medium pot over medium heat. When the butter is melted, stir in the white mini marshmallows and heat until they're totally melted. Stir in the salt.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Remove from the heat and pour in the cereal, folding gently until it is all combined. Then gently fold in the rainbow mini marshmallows. Press into the prepared baking dish.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}]}, {u'equipment': [], u'step': u'Let cool completely.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Melt the bark according to the package directions.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Cut the treats into 12 pieces. Dip half of each piece into the white chocolate and place onto wax paper.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Let set and serve.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Treat. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 2238, u'instructions': u"Watch how to make this recipe.                    Thoroughly grease a 9-inch-by-13-inch baking dish with softened butter.                          Add the 4 tablespoons butter to a medium pot over medium heat. When the butter is melted, stir in the white mini marshmallows and heat until they're totally melted. Stir in the salt. Remove from the heat and pour in the cereal, folding gently until it is all combined. Then gently fold in the rainbow mini marshmallows. Press into the prepared baking dish. Let cool completely.                          Melt the bark according to the package directions. Cut the treats into 12 pieces. Dip half of each piece into the white chocolate and place onto wax paper. Let set and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/mikes-crispy-treats-751284', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}