{u'recipes': [{u'sourceName': u'Olgas Flavor Factory', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/485108-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 485108, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Chicken Salad Bites', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 29.67, u'creditText': u'Olgas Flavor Factory', u'extendedIngredients': [{u'originalString': u'2 cans (10 oz each) canned chicken', u'aisle': u'Canned and Jarred', u'name': u'canned chicken', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 5311, u'unit': u'oz'}, {u'originalString': u'36 crackers,', u'aisle': u'Savory Snacks', u'name': u'crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 36.0, u'consistency': u'solid', u'id': 18621, u'unit': u''}, {u'originalString': u'1 large cucumber, seedless, sliced', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'seedless', u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'2 hard-boiled eggs, finely shredded', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard-boiled eggs', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1129, u'unit': u''}, {u'originalString': u'\xbc cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons Homemade Ranch dressing, optional', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4639, u'unit': u'Tablespoons'}, {u'originalString': u'1 tomato, seeded and chopped', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.olgasflavorfactory.com/2012/09/24/creamy-chicken-salad-bites/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Drain the canned chicken and discard all the liquid. Mash the chicken with a fork.Finely shred the hard boiled egg. Get rid off all the seeds and liquid from the tomato and chop it finely.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'id': 1129, u'name': u'hard boiled egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 5311, u'name': u'canned chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Mix the chicken, eggs and tomato.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add the mayonnaise and Homemade Ranch Dressing.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [], u'step': u'Mix until all the ingredients are evenly distributed.Slice the cucumber into thin slices.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}]}, {u'equipment': [], u'step': u'Place about 1 Tablespoon of chicken mixture on top of the crackers.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}]}, {u'equipment': [], u'step': u'Place a cucumber slice on top of the chicken mixture.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 109, u'instructions': u'Drain the canned chicken and discard all the liquid. Mash the chicken with a fork.Finely shred the hard boiled egg. Get rid off all the seeds and liquid from the tomato and chop it finely. Mix the chicken, eggs and tomato.Add the mayonnaise and Homemade Ranch Dressing. Mix until all the ingredients are evenly distributed.Slice the cucumber into thin slices.Place about 1 Tablespoon of chicken mixture on top of the crackers. Place a cucumber slice on top of the chicken mixture. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-chicken-salad-bites-485108', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 36, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}