{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/282014-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 282014, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cajun Chicken Melt', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 118.3, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'4 slices OSCAR MAYER Deli Fresh Bold Cajun Style Chicken Breast', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'fresh', u'cajun style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 5062, u'unit': u'slices'}, {u'originalString': u'2 slices Italian bread', u'aisle': u'Bakery/Bread', u'name': u'italian bread', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'slices'}, {u'originalString': u'1 KRAFT Singles', u'aisle': u'Cheese', u'name': u'kraft singles', u'metaInformation': [u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1190, u'unit': u''}, {u'originalString': u'1-1/2 tsp. KRAFT Real Mayo Mayonnaise', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tsp'}, {u'originalString': u'2 tsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'1 small pepperoncini pepper, stemmed, sliced', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'stemmed', u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u''}, {u'originalString': u'3 roasted red pepper strips', u'aisle': u'Canned and Jarred', u'name': u'roasted red pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11916, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/cajun-chicken-melt-114872.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Spread 1 bread slice with mayo.  Fill bread slices with all remaining ingredients except oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [], u'step': u'Brush outside of sandwich with oil.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook in skillet on medium heat 3 min. on each side or until Singles is melted and sandwich is golden brown on both sides.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'Spread 1 bread slice with mayo.  Fill bread slices with all remaining ingredients except oil.                                            Brush outside of sandwich with oil.                                            Cook in skillet on medium heat 3 min. on each side or until Singles is melted and sandwich is golden brown on both sides.', u'spoonacularSourceUrl': u'https://spoonacular.com/cajun-chicken-melt-282014', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}