{u'recipes': [{u'sourceName': u'Fat Girl Trapped in a Skinny Body', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/497089-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 497089, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Hamburger Helper', u'diets': [], u'pricePerServing': 300.58, u'creditText': u'Fat Girl Trapped in a Skinny Body', u'extendedIngredients': [{u'originalString': u'1 batch easy alfredo sauce (recipe below)', u'aisle': u'Pasta and Rice', u'name': u'alfredo sauce', u'metaInformation': [u'(recipe below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93606, u'unit': u''}, {u'originalString': u'1 can (15 oz) diced tomatoes, with juices', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'with juices', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3/4 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 lbs ground beef (I used extra lean)', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean', u'(I used extra )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lbs'}, {u'originalString': u'3 cups (24 oz) marinara sauce (storebought or homemade)', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [u'homemade', u'(storebought or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'oz'}, {u'originalString': u'pinch of nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'1/2 cup grated parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Garnish: parmesan cheese and julienned basil', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'Black pepper and salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'pinch of salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'pinch'}, {u'originalString': u'4 tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'1 1/2 lbs penne noodles (I used whole wheat)', u'aisle': u'Pasta and Rice', u'name': u'whole wheat penne noodles', u'metaInformation': [u'whole wheat', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-penne.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 99182, u'unit': u'lbs'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.fatgirltrappedinaskinnybody.com/2012/06/homemade-hamburger-helper/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To make the alfredo:Melt the butter in a large saut\xe9 pan set over low heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the cream to the butter as it melts. Stir occasionally (keeping the heat on low).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let it simmer for about 15 minutes.  When it’s reduced slightly, add the parmesan cheese, nutmeg, salt and pepper and stir.  Set aside while you make the rest of the sauce.  Stir the alfredo occasionally. Note: if the alfredo is WAY too thick for your liking, add some extra milk or cream (1 tbsp at a time) after it’s simmered and reduced.To make the hamburger helper:Brown the ground beef in a large skillet then drain the fat.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the garlic to the drained beef and cook for about 30 seconds.  Then add the marinara and diced tomatoes. Bring to a boil. As soon as it starts to boil, turn down the heat to low and simmer for 30 minutes, stirring occasionally.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add the alfredo sauce a few minutes before you add the noodles.While the sauce is cooking, boil the pasta noodles.Using a slotted spoon (or pasta scoop) spoon the noodles into the sauce pan.On a low heat, mix the noddles and sauce for about 3 minutes. Note: if you sauce is too thick, add some of the reserved pasta water, 1/4 cup at a time.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'id': 93606, u'name': u'alfredo sauce'}]}, {u'equipment': [], u'step': u'Serve immediately with parmesan cheese and julienned basil on the top.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 282, u'instructions': u'To make the alfredo:Melt the butter in a large saut\xe9 pan set over low heat. Add the cream to the butter as it melts. Stir occasionally (keeping the heat on low).  Let it simmer for about 15 minutes.  When it’s reduced slightly, add the parmesan cheese, nutmeg, salt and pepper and stir.  Set aside while you make the rest of the sauce.  Stir the alfredo occasionally. Note: if the alfredo is WAY too thick for your liking, add some extra milk or cream (1 tbsp at a time) after it’s simmered and reduced.To make the hamburger helper:Brown the ground beef in a large skillet then drain the fat.Add the garlic to the drained beef and cook for about 30 seconds.  Then add the marinara and diced tomatoes. Bring to a boil. As soon as it starts to boil, turn down the heat to low and simmer for 30 minutes, stirring occasionally. Add the alfredo sauce a few minutes before you add the noodles.While the sauce is cooking, boil the pasta noodles.Using a slotted spoon (or pasta scoop) spoon the noodles into the sauce pan.On a low heat, mix the noddles and sauce for about 3 minutes. Note: if you sauce is too thick, add some of the reserved pasta water, 1/4 cup at a time.Serve immediately with parmesan cheese and julienned basil on the top.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-hamburger-helper-497089', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}