{u'recipes': [{u'sourceName': u'Noob Cook', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/565173-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 565173, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kimchi Fried Rice', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 77.76, u'creditText': u'Noob Cook', u'extendedIngredients': [{u'originalString': u'fried egg(s)/ sunny side up egg(s)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u'servings'}, {u'originalString': u'3 cloves garlic minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tbsp gochujang (Korean chilli paste)', u'aisle': u'Ethnic Foods', u'name': u'gochujang', u'metaInformation': [u'(Korean chilli paste)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1016973, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp kimchi juice (from the bottle of kimchi)', u'aisle': u'Beverages', u'name': u'juice', u'metaInformation': [u'(from the bottle of kimchi)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1019016, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 10216124, u'unit': u'tsp'}, {u'originalString': u'1 tbsp pine nuts roasted in a dry pan until lightly browned', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12147, u'unit': u'tbsp'}, {u'originalString': u'1/2 tbsp sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4058, u'unit': u'tbsp'}, {u'originalString': u'cooked short-grain rice cook 1 cup washed rice with 1 cup water in rice cooker; refrigerate overnight', u'aisle': u'Pasta and Rice', u'name': u'short grain rice', u'metaInformation': [u'with 1 cup water in rice cooker; refrigerate overnight', u'washed', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10120052, u'unit': u'cup'}, {u'originalString': u'A Sauce (In a small bowl, mix well to dissolve into a smooth paste)', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'small', u'well', u'(In a bowl, mix to dissolve into a smooth paste)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}, {u'originalString': u'1 tbsp chopped spring onions', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'Garnishing Suggestions', u'aisle': u'?', u'name': u'garnishing suggestions', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'unit': u'servings'}, {u'originalString': u'1 cup kimchi chopped to smaller, bite-sized pieces', u'aisle': u'?', u'name': u'kimchi to smaller', u'metaInformation': [u'chopped'], u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.noobcook.com/kimchi-fried-rice/2/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To make sunny side up eggs, heat and grease a cooking pan. Crack the egg(s) into the pan, taking care not to break the yolk. Cook until the yolk is just set, about 1-2 minutes. Set aside.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat oil in wok. Stir fry garlic for 30 seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add kimchi, cover with lid and simmer for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add rice and pour (A) over the rice. Stir fry on high heat until the rice is dry and absorbs the sauce evenly.Portion the fried rice to individual serving bowls or a Korean stone bowl for communal sharing.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle sesame oil over the rice.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [], u'step': u'Garnish with fried egg, spring onions and pine nuts.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try L'Ecole 41 Chenin Blanc. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish.', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'To make sunny side up eggs, heat and grease a cooking pan. Crack the egg(s) into the pan, taking care not to break the yolk. Cook until the yolk is just set, about 1-2 minutes. Set aside.Heat oil in wok. Stir fry garlic for 30 seconds. Add kimchi, cover with lid and simmer for 1 minute.Add rice and pour (A) over the rice. Stir fry on high heat until the rice is dry and absorbs the sauce evenly.Portion the fried rice to individual serving bowls or a Korean stone bowl for communal sharing. Drizzle sesame oil over the rice. Garnish with fried egg, spring onions and pine nuts.', u'spoonacularSourceUrl': u'https://spoonacular.com/kimchi-fried-rice-565173', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}