{u'recipes': [{u'sourceName': u'Naturally Ella', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/621767-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 621767, u'veryPopular': False, u'lowFodmap': False, u'title': u'White Bean and Butternut Squash Salad', u'diets': [u'dairy free'], u'pricePerServing': 214.05, u'creditText': u'Naturally Ella', u'extendedIngredients': [{u'originalString': u'1 cup arugula leaves', u'aisle': u'Produce', u'name': u'arugula leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cup'}, {u'originalString': u'1 tablespoon balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoon'}, {u'originalString': u'\xbc teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 cups day-old bread, cut in \xbd-inch cubes', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'cut in \xbd-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18064, u'unit': u'cups'}, {u'originalString': u'2 cups butternut squash, cut in \xbc-inch cubes', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'cut in \xbc-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'2 cups chopped lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11252, u'unit': u'cups'}, {u'originalString': u'2 teaspoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'\xbc cup pepitas', u'aisle': u'Savory Snacks', u'name': u'pepitas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10012014, u'unit': u'cup'}, {u'originalString': u'Salad', u'aisle': u'Produce', u'name': u'salad mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 21052, u'unit': u'servings'}, {u'originalString': u'\xbc teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'slaw dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 43016, u'unit': u'servings'}, {u'originalString': u'1 cup white beans, drained and rinsed if using canned', u'aisle': u'Pasta and Rice;Canned and Jarred;Produce', u'name': u'white beans', u'metaInformation': [u'white', u'drained and rinsed if using canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10516050, u'unit': u'cup'}], u'healthScore': 46.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://naturallyella.com/2014/12/01/white-bean-and-butternut-squash-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 425 degrees. Toss bread cubes with olive oil, black pepper and sea salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18064, u'name': u'bread cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread into a single layer on a baking sheet; bake until crisp, 12 to 14 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour about  inch of water into the bottom of a large stockpot.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/steamer.jpg', u'id': 404767, u'name': u'steamer basket'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place a steaming basket in the pot; turn heat to medium. When the water simmers, place butternut squash in the steaming basket, cover with a lid and steam until squash is just tender, but not mushy, 10 to 14 minutes.In a large bowl, combine the chopped lettuce, arugula, white beans, feta, pepitas, toasted bread and butternut squash. In a small jar with lid, combine ingredients for the dressing; shake well.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'id': 10516050, u'name': u'white beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 10012014, u'name': u'raw pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Pour over the salad, then toss until everything is well combined.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm or at room temperature.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are great choices for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 239, u'instructions': u'Preheat oven to 425 degrees. Toss bread cubes with olive oil, black pepper and sea salt. Spread into a single layer on a baking sheet; bake until crisp, 12 to 14 minutes.Pour about  inch of water into the bottom of a large stockpot. Place a steaming basket in the pot; turn heat to medium. When the water simmers, place butternut squash in the steaming basket, cover with a lid and steam until squash is just tender, but not mushy, 10 to 14 minutes.In a large bowl, combine the chopped lettuce, arugula, white beans, feta, pepitas, toasted bread and butternut squash. In a small jar with lid, combine ingredients for the dressing; shake well. Pour over the salad, then toss until everything is well combined. Serve warm or at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/white-bean-and-butternut-squash-salad-621767', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}