{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/754250-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 754250, u'veryPopular': True, u'lowFodmap': False, u'title': u'Prosciutto and Cucumber Crostini with Arugula Mustard', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 65.89, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 cups baby arugula', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cups'}, {u'originalString': u'1 baguette', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'1/2 English cucumber, thinly sliced into ribbons with a vegetable peeler', u'aisle': u'Produce', u'name': u'english cucumber', u'metaInformation': [u'english', u'with a vegetable peeler', u'thinly sliced into ribbons '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10111205, u'unit': u''}, {u'originalString': u'1 clove garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3 tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'4 ounces prosciutto, thinly sliced, halved lengthwise', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'halved lengthwise', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup whole-grain mustard', u'aisle': u'Condiments', u'name': u'whole-grain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1012046, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/prosciutto-and-cucumber-crostini-with-arugula-mustard.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Preheat the broiler to high.', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the arugula, salt and garlic in a food processor. Pulse until finely chopped.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the mustard and maple syrup and puree until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Transfer to a container and refrigerate until ready to use. (The mustard can be made up to 2 days in advance.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'For the crostini: Slice the baguette on a steep bias into 1/4-inch slices; it should yield about 18 to 20 slices.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-baguette-or-crostini.jpg', u'id': 10018033, u'name': u'crostini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Brush each slice with some of the olive oil and place on a baking sheet. Sprinkle with the salt and broil until golden brown and crunchy, 5 to 6 minutes. Set aside to cool.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'To assemble, spread 1/ 2 teaspoon of the arugula mustard onto each crostini. Top with a ribbon of cucumber and a piece of prosciutto, folded into a ribbon-like shape.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-baguette-or-crostini.jpg', u'id': 10018033, u'name': u'crostini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 7, u'ingredients': []}], u'name': u'For the mustard'}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Mumm Napa Cuvee M. It has 4.1 out of 5 stars and a bottle costs about 20 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"The naturally ripened fruit selected from more than 50 separate vineyards, reveals layers of crisp and creamy textures that are rich and lingering. Individually selected lots were kept separate during initial fermentation in order to highlight their vineyard differences and extract the quintessence of their specific strengths. The resulting blend is a soft and elegant wine that highlights the delicious and powerful ripe fruit flavors that characterize the world-class grapes of the Napa Valley.Cuv\xe9e M exhibits a graceful stream of very fine bubbles gently rising to a persistent mousse cordon with a light peach rose color. The aromas are elegant, rich and complex, showing fresh white and yellow stone fruits with subtle hints of wild strawberry. A light touch of fresh brioche, with hints of vanilla and honey add to the wine's complex bouquet. On the palate, full flavors of peach and pear combine with a creamy caramel character, which lingers into a long satisfying finish.Mumm Napa's Cuv\xe9e M is the perfect sparkling wine for champagne cocktails or as an ap\xe9ritif to pair with hors d'oeuvres. It is also a perfect match with creamy desserts and spicy foods.", u'title': u'Mumm Napa Cuvee M', u'price': u'$19.99', u'id': 451872, u'link': u'https://www.wine.com/product/mumm-napa-cuvee-m/80229', u'imageUrl': u'https://spoonacular.com/productImages/451872-312x231.jpg'}]}, u'aggregateLikes': 866, u'instructions': u'Preheat the broiler to high.                          For the mustard: Place the arugula, salt and garlic in a food processor. Pulse until finely chopped. Add the mustard and maple syrup and puree until smooth. Transfer to a container and refrigerate until ready to use. (The mustard can be made up to 2 days in advance.)                          For the crostini: Slice the baguette on a steep bias into 1/4-inch slices; it should yield about 18 to 20 slices. Brush each slice with some of the olive oil and place on a baking sheet. Sprinkle with the salt and broil until golden brown and crunchy, 5 to 6 minutes. Set aside to cool.                          To assemble, spread 1/ 2 teaspoon of the arugula mustard onto each crostini. Top with a ribbon of cucumber and a piece of prosciutto, folded into a ribbon-like shape. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/prosciutto-and-cucumber-crostini-with-arugula-mustard-754250', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}