{u'recipes': [{u'sourceName': u'The Happier Homemaker', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/568893-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 568893, u'veryPopular': False, u'lowFodmap': False, u'title': u'Strawberry Cheesecake Stuffed Cupcakes', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 56.37, u'creditText': u'The Happier Homemaker', u'extendedIngredients': [{u'originalString': u'1 box instant cheesecake flavored pudding', u'aisle': u'Baking', u'name': u'instant cheesecake pudding mix', u'metaInformation': [u'flavored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 99192, u'unit': u'box'}, {u'originalString': u'5 strawberries plus additional for garnish if desired', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'for garnish if desired'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}, {u'originalString': u'1 box Vanilla Cake Mix', u'aisle': u'Baking', u'name': u'vanilla cake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'box'}, {u'originalString': u'8 oz container Cool Whip whipped cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1054, u'unit': u'oz'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.thehappierhomemaker.com/2014/02/strawberry-cheesecake-stuffed-cupcakes.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare cupcakes and pudding separately according to package instructions.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Bake the cupcakes according to package directions.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the cupcakes from the oven and set aside to cool.Once cupcakes have completely cooled use a cupcake plunger or spoon to scoop out the interior of the cupcake from the top. (I found my cupcake plunger at TJ Maxx but they can be found in any kitchen retailer or online)Finely dice strawberries and mix with pudding.Fill each cupcake with strawberry pudding mixture.Use a pastry bag to pipe whipped cream on top of cupcake and garnish with a sliced strawberry if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Prepare cupcakes and pudding separately according to package instructions.Bake the cupcakes according to package directions.Remove the cupcakes from the oven and set aside to cool.Once cupcakes have completely cooled use a cupcake plunger or spoon to scoop out the interior of the cupcake from the top. (I found my cupcake plunger at TJ Maxx but they can be found in any kitchen retailer or online)Finely dice strawberries and mix with pudding.Fill each cupcake with strawberry pudding mixture.Use a pastry bag to pipe whipped cream on top of cupcake and garnish with a sliced strawberry if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-cheesecake-stuffed-cupcakes-568893', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}