{u'recipes': [{u'sourceName': u'Cook Like a Champion Blog', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/595978-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 595978, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Toffee Crunch Cupcakes', u'diets': [], u'pricePerServing': 50.62, u'creditText': u'Cook Like a Champion Blog', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces bittersweet chocolate, finely chopped', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup brewed coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14209, u'unit': u'cup'}, {u'originalString': u'5 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'4 large eggs, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon espresso powder', u'aisle': u'Tea and Coffee', u'name': u'espresso powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10014214, u'unit': u'tablespoon'}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1\xbd-2 cups toffee bits', u'aisle': u'Baking', u'name': u'toffee bits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/toffee-pieces.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19383, u'unit': u'cups'}, {u'originalString': u'4 sticks unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'sticks'}, {u'originalString': u'\xbe cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.cooklikeachampionblog.com/2013/06/chocolate-toffee-crunch-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'To make the cupcakes, heat oven to 350\xba. Line cupcake pans with paper liners.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the flour, cocoa powder, espresso powder, baking soda and salt in a medium bowl and set aside. In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and sugar together at medium-high speed for 2-3 minutes, or until light and fluffy.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10014214, u'name': u'instant espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the eggs one at a time, beating well after each addition, and scrape the sides and bottom of the bowl as needed. Blend in the vanilla.  With the mixer on low speed, alternately add the flour mixture and the coffee, starting and ending with the flour.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Mix until just incorporated. Fold in the toffee bits with a spatula.Divide the batter evenly between the prepared liners.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/toffee-pieces.jpg', u'id': 19383, u'name': u'toffee pieces'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake for 18-20 minutes or until a toothpick inserted in the center comes out clean. Allow to cool in the pans 5-10 minutes before transferring to a wire rack to cool completely. Once the cupcakes are cool, core them using your desired method (I promise the finger trick is really fast and easy!). To make the ganache, place the chopped chocolate in a heatproof bowl. Bring the cream to a simmer in a small saucepan.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove from heat and pour the hot cream over the chocolate; let stand 1-2 minutes, then whisk together until a smooth ganache forms.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the butter 1 tablespoon at a time until completely melted and incorporated. Chill the ganache in the refrigerator or freezer until it reaches a pipeable consistency, whisking every 5-10 minutes to ensure even cooling. Once the ganache has thickened slightly, transfer it to a pastry bag.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Cut a small opening in the bag and fill each cupcake with ganache.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the toffee bits in a bowl. Pipe a ring of ganache around the top of each cupcake, leaving a hole in the center. Dip the ganache portion of each cupcake into the toffee, pressing gently to adhere.To make the frosting, combine the egg whites, sugar and salt in the bowl of a stand mixer set over a small saucepan of simmering water.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/toffee-pieces.jpg', u'id': 19383, u'name': u'toffee pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/toffee-pieces.jpg', u'id': 10019383, u'name': u'toffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Whisk constantly by hand until the sugar has dissolved. Test by rubbing the mixture between your fingers; you shouldn't feel any grittiness.Attach the bowl to the stand mixer fitted with the whisk attachment. Begin mixing on low speed and gradually increase to high and whip until stiff peaks form. Continue mixing until the mixture is completely cool (test by feeling the bottom of the bowl) and light, fluffy and glossy. This should take about 10 minutes but may take longer.Replace the whisk attachment with the paddle attachment. Set the mixer to medium-low and add the butter, 2 tablespoons at a time, mixing well between each addition. Once all the butter has been incorporated, increase to medium speed and beat until fluffy. Blend in the vanilla and caramel until smooth and completely incorporated, scraping down the sides of the bowl as needed.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Place the frosting in a pastry bag with a decorative tip and top each cupcake with a swirl of frosting. Sprinkle with additional toffee pieces, if desired.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/toffee-pieces.jpg', u'id': 19383, u'name': u'toffee pieces'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cupcakes. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 5546, u'instructions': u"To make the cupcakes, heat oven to 350\xba. Line cupcake pans with paper liners. Whisk together the flour, cocoa powder, espresso powder, baking soda and salt in a medium bowl and set aside. In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and sugar together at medium-high speed for 2-3 minutes, or until light and fluffy. Add the eggs one at a time, beating well after each addition, and scrape the sides and bottom of the bowl as needed. Blend in the vanilla.  With the mixer on low speed, alternately add the flour mixture and the coffee, starting and ending with the flour. Mix until just incorporated. Fold in the toffee bits with a spatula.Divide the batter evenly between the prepared liners.  Bake for 18-20 minutes or until a toothpick inserted in the center comes out clean. Allow to cool in the pans 5-10 minutes before transferring to a wire rack to cool completely. Once the cupcakes are cool, core them using your desired method (I promise the finger trick is really fast and easy!). To make the ganache, place the chopped chocolate in a heatproof bowl. Bring the cream to a simmer in a small saucepan. Remove from heat and pour the hot cream over the chocolate; let stand 1-2 minutes, then whisk together until a smooth ganache forms. Whisk in the butter 1 tablespoon at a time until completely melted and incorporated. Chill the ganache in the refrigerator or freezer until it reaches a pipeable consistency, whisking every 5-10 minutes to ensure even cooling. Once the ganache has thickened slightly, transfer it to a pastry bag. Cut a small opening in the bag and fill each cupcake with ganache. Place the toffee bits in a bowl. Pipe a ring of ganache around the top of each cupcake, leaving a hole in the center. Dip the ganache portion of each cupcake into the toffee, pressing gently to adhere.To make the frosting, combine the egg whites, sugar and salt in the bowl of a stand mixer set over a small saucepan of simmering water. Whisk constantly by hand until the sugar has dissolved. Test by rubbing the mixture between your fingers; you shouldn't feel any grittiness.Attach the bowl to the stand mixer fitted with the whisk attachment. Begin mixing on low speed and gradually increase to high and whip until stiff peaks form. Continue mixing until the mixture is completely cool (test by feeling the bottom of the bowl) and light, fluffy and glossy. This should take about 10 minutes but may take longer.Replace the whisk attachment with the paddle attachment. Set the mixer to medium-low and add the butter, 2 tablespoons at a time, mixing well between each addition. Once all the butter has been incorporated, increase to medium speed and beat until fluffy. Blend in the vanilla and caramel until smooth and completely incorporated, scraping down the sides of the bowl as needed.Place the frosting in a pastry bag with a decorative tip and top each cupcake with a swirl of frosting. Sprinkle with additional toffee pieces, if desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-toffee-crunch-cupcakes-595978', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 30, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}