{u'recipes': [{u'sourceName': u'Gourmande in the Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512282-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 512282, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Winter Squash Salad with Goat Cheese and Pine Nuts', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 20, u'pricePerServing': 323.32, u'creditText': u'Gourmande in the Kitchen', u'extendedIngredients': [{u'originalString': u'2 small kuri or acorn squash', u'aisle': u'Produce', u'name': u'acorn squash', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11482, u'unit': u''}, {u'originalString': u'5 oz/ 142g baby spinach and kale, washed and dried', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'dried', u'washed and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11457, u'unit': u'oz'}, {u'originalString': u'2 oz/56g goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'1 tablespoon/15ml honey or maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons/45ml olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup/28g pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'1 cup/240ml port wine vinegar', u'aisle': u'Alcoholic Beverages', u'name': u'port wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/port.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 10114057, u'unit': u'cup'}, {u'originalString': u'Sea salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://gourmandeinthekitchen.com/2012/roasted-winter-squash-salad-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour the vinegar into a heavy bottomed saucepan and place over moderate heat. Stir in the honey or maple syrup, and bring to a simmer. Allow the vinegar to reduce slowly to half of its original volume, (it will start to appear syrupy). Store in the refrigerator, in a sealed container until ready to use. Preheat oven to 400 degrees.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread pine nuts on a large rimmed baking sheet; toast in oven, stirring occasionally, until fragrant and lightly golden, (about 5 minutes). Set aside.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}]}, {u'equipment': [], u'step': u'Cut squash in half and scrap out seeds.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut into quarters, leaving skin on. On a large baking sheet, toss with 1 tablespoon of the oil and a pinch of salt and pepper. Roast until tender (about 35 to 45 minutes depending on size); let cool.In a large bowl add 1 tablespoon of reduced port vinegar, remaining olive oil; season with salt and pepper to taste.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/port.jpg', u'id': 10114057, u'name': u'port'}]}, {u'equipment': [], u'step': u'Add baby spinach and kale, toss to combine. To serve, divide squash, skin side-down, among plates; place dressed salad on top of each quarter and drizzle with extra reduced port wine vinegar if desired and top with toasted pine nuts and crumbled goat cheese.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 11457, u'name': u'baby spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/port.jpg', u'id': 10114057, u'name': u'port'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 177, u'instructions': u'Pour the vinegar into a heavy bottomed saucepan and place over moderate heat. Stir in the honey or maple syrup, and bring to a simmer. Allow the vinegar to reduce slowly to half of its original volume, (it will start to appear syrupy). Store in the refrigerator, in a sealed container until ready to use. Preheat oven to 400 degrees. Spread pine nuts on a large rimmed baking sheet; toast in oven, stirring occasionally, until fragrant and lightly golden, (about 5 minutes). Set aside.Cut squash in half and scrap out seeds.  Cut into quarters, leaving skin on. On a large baking sheet, toss with 1 tablespoon of the oil and a pinch of salt and pepper. Roast until tender (about 35 to 45 minutes depending on size); let cool.In a large bowl add 1 tablespoon of reduced port vinegar, remaining olive oil; season with salt and pepper to taste. Add baby spinach and kale, toss to combine. To serve, divide squash, skin side-down, among plates; place dressed salad on top of each quarter and drizzle with extra reduced port wine vinegar if desired and top with toasted pine nuts and crumbled goat cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-winter-squash-salad-with-goat-cheese-and-pine-nuts-512282', u'dishTypes': [u'side dish', u'salad'], u'occasions': [u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}