{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479803-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 479803, u'veryPopular': False, u'lowFodmap': False, u'title': u'OREO Cookie Ball Santa Hats', u'diets': [], u'preparationMinutes': 90, u'pricePerServing': 61.87, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'1 small bowl for the coconut/sugar mixture', u'aisle': u'Bread', u'name': u'bread bowl', u'metaInformation': [u'small', u'for the coconut/sugar mixture'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-bowl.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 99169, u'unit': u''}, {u'originalString': u'2 deep bowls for the candy melts', u'aisle': u'Bread', u'name': u'bread bowls', u'metaInformation': [u'for the candy melts'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-bowl.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 99169, u'unit': u''}, {u'originalString': u'1 12 oz. bag red candy melts', u'aisle': u'Baking', u'name': u'candy melts', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 93775, u'unit': u'oz'}, {u'originalString': u'About \xbc cup shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'1 8 oz. block cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese block', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1186, u'unit': u'oz'}, {u'originalString': u'20 mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 19116, u'unit': u''}, {u'originalString': u'36 OREO cookies', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 36.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'About \xbc cup white sparkling sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.neighborfoodblog.com/2013/12/oreo-cookie-ball-santa-hats.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pulverize the OREOS in a food processor until they’re in fine crumbs. Alternatively, place them in a ziplock bag and crush them with a rolling pin. Stir in the cream cheese until thick and combined.Shape the truffles. I found the easiest way to do this was to take about a 1-1\xbd inch ball of the truffle mix then roll it in between my hands, making one side thinner than the other (that will be the point of the hat). Then press the larger side down onto a piece of wax paper to form the base of the hat. Freeze the truffles for 30 minutes.Meanwhile, melt the candy melts in two different bowls. I usually do mine in 1 minute intervals on 60% power until smooth.', u'length': {u'number': 31, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 93775, u'name': u'candy melts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the coconut and sparkling sugar together in a small bowl.Assemble your supplies. Lay the wax paper out on a flat surface. Gather your marshmallow, toothpicks, a wet rag, and bowl of candy melts and coconut.Dip the truffles. Dip the tips of the truffles in the red candy almost to the bottom, then set them upright on the wax paper. While they’re still wet, place a mini marshmallow at the peak. Repeat with remaining truffles.Once marshmallows are dried and stuck to the top of the truffles, dip the tops of them in the white candy melts then immediately into the coconut mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 93775, u'name': u'candy melts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Place them back on the wax paper.Once the tops are dry, dip the bottoms in the white candy until they meet and slightly overlap the red space. Then, immediately dip them into the coconut mixture, spinning them around to cover. Set them flat on the wax paper. You may want to give them a little shove so the bottoms puff out and around the hat.Allow to dry flat on wax paper for 5-10 minutes. Store at room temperature for up to a week.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 118, u'instructions': u'Pulverize the OREOS in a food processor until they’re in fine crumbs. Alternatively, place them in a ziplock bag and crush them with a rolling pin. Stir in the cream cheese until thick and combined.Shape the truffles. I found the easiest way to do this was to take about a 1-1\xbd inch ball of the truffle mix then roll it in between my hands, making one side thinner than the other (that will be the point of the hat). Then press the larger side down onto a piece of wax paper to form the base of the hat. Freeze the truffles for 30 minutes.Meanwhile, melt the candy melts in two different bowls. I usually do mine in 1 minute intervals on 60% power until smooth. Mix the coconut and sparkling sugar together in a small bowl.Assemble your supplies. Lay the wax paper out on a flat surface. Gather your marshmallow, toothpicks, a wet rag, and bowl of candy melts and coconut.Dip the truffles. Dip the tips of the truffles in the red candy almost to the bottom, then set them upright on the wax paper. While they’re still wet, place a mini marshmallow at the peak. Repeat with remaining truffles.Once marshmallows are dried and stuck to the top of the truffles, dip the tops of them in the white candy melts then immediately into the coconut mixture. Place them back on the wax paper.Once the tops are dry, dip the bottoms in the white candy until they meet and slightly overlap the red space. Then, immediately dip them into the coconut mixture, spinning them around to cover. Set them flat on the wax paper. You may want to give them a little shove so the bottoms puff out and around the hat.Allow to dry flat on wax paper for 5-10 minutes. Store at room temperature for up to a week.', u'spoonacularSourceUrl': u'https://spoonacular.com/oreo-cookie-ball-santa-hats-479803', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}