{u'recipes': [{u'sourceName': u'Emily Bites', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/615967-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 615967, u'veryPopular': True, u'lowFodmap': False, u'title': u'Meatball Pizza', u'diets': [], u'pricePerServing': 141.97, u'creditText': u'Emily Bites', u'extendedIngredients': [{u'originalString': u'4 teaspoons plain dried breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'dried', u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 18079, u'unit': u'teaspoons'}, {u'originalString': u'1 large egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'A pinch of garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'pinch'}, {u'originalString': u'1 \xbe teaspoons Italian seasoning, divided', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.75, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'teaspoons'}, {u'originalString': u'1 Boboli 12” Whole Wheat Pizza Crust', u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93770, u'unit': u''}, {u'originalString': u'\xbd cup pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'\xbe cup shredded 2% Mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'2 teaspoons skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'teaspoons'}, {u'originalString': u'4 oz uncooked ground turkey breast (99% fat free)', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [u'fat free', u'99%', u'uncooked', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 5662, u'unit': u'oz'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.emilybites.com/2014/09/meatball-pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pre-heat the oven to 450.In a large bowl, combine the ground turkey, garlic powder, Parmesan, breadcrumbs,  teaspoon of the Italian seasoning, egg white and milk. Using your hands (or a spoon), mush all the ingredients together until well combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 5662, u'name': u'ground turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Mixture will be somewhat wet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll meat mixture into 20 separate (3/4  1) mini meatballs.In a large skillet, bring the olive oil over medium heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the meatballs to the oil and cook them, stirring occasionally until all sides are browned and meatballs are cooked through.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Remove meatballs to a dish and set aside. You may want to cut the meatballs in half so that they lay flatter on the pizza (I did with most of them).', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Spread pizza sauce evenly across the top surface of the pizza crust, leaving at least a  inch edge around the outside. Sprinkle the shredded mozzarella evenly over the top and spread the meatballs out across the surface. Finish the pizza by sprinkling the remaining teaspoon of Italian seasoning over top.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001026, u'name': u'shredded mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93770, u'name': u'prepared pizza crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-stone.jpg', u'id': 406907, u'name': u'pizza stone'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place pizza on a foil covered baking sheet, a preheated pizza stone (my preference) or straight onto the oven rack (depending on how you like your crust) and bake for 8-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are great choices for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Story Winery, Sangiovese, Estate, Shenandoah Valley with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Aromas of raspberry, cherry, pie crust, tobacco and oak greet the nose. Dark cherries and raspberry predominate the palate with mild tannins and nice acidity. The finish is gentle and lasting Enjoy!', u'title': u'Story Winery, Sangiovese, Estate, Shenandoah Valley', u'price': u'$19.0', u'id': 469504, u'link': u'https://www.amazon.com/Story-Winery-Sangiovese-California-Shenandoah/dp/B00NMXHFNC', u'imageUrl': u'https://spoonacular.com/productImages/469504-312x231.jpg'}]}, u'aggregateLikes': 1131, u'instructions': u'Pre-heat the oven to 450.In a large bowl, combine the ground turkey, garlic powder, Parmesan, breadcrumbs,  teaspoon of the Italian seasoning, egg white and milk. Using your hands (or a spoon), mush all the ingredients together until well combined. Mixture will be somewhat wet. Roll meat mixture into 20 separate (3/4  1) mini meatballs.In a large skillet, bring the olive oil over medium heat. Add the meatballs to the oil and cook them, stirring occasionally until all sides are browned and meatballs are cooked through. Remove meatballs to a dish and set aside. You may want to cut the meatballs in half so that they lay flatter on the pizza (I did with most of them).Spread pizza sauce evenly across the top surface of the pizza crust, leaving at least a  inch edge around the outside. Sprinkle the shredded mozzarella evenly over the top and spread the meatballs out across the surface. Finish the pizza by sprinkling the remaining teaspoon of Italian seasoning over top.Place pizza on a foil covered baking sheet, a preheated pizza stone (my preference) or straight onto the oven rack (depending on how you like your crust) and bake for 8-10 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatball-pizza-615967', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}