{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/764006-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 764006, u'veryPopular': False, u'lowFodmap': False, u'title': u'Organic Chicken and Asparagus Flatbread', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 322.06, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'6 ounces organic goat cheese (or fresh mozarella)', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'organic', u'(or fresh mozarella)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'1 bunch Foster Farms Organic boneless, skinless chicken breasts 1 bunch organic asparagus trimmed', u'aisle': u'Frozen', u'name': u'morningstar farms patty', u'metaInformation': [u'boneless', u'skinless', u'organic', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 16147, u'unit': u'bunch'}, {u'originalString': u'organic olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 organic pizza crust or pita breads', u'aisle': u'Bakery/Bread', u'name': u'pita breads', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18413, u'unit': u''}, {u'originalString': u'4 organic Roma tomatoes sliced', u'aisle': u'Produce', u'name': u'roma tomatoes', u'metaInformation': [u'organic', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon organic Italian seasoning blend', u'aisle': u'Spices and Seasonings', u'name': u'seasoning blend', u'metaInformation': [u'italian', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'teaspoon'}, {u'originalString': u'2 Foster Farms\xae Organic boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'organic', u'foster farms\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://wearychef.com/chicken-and-asparagus-flatbread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Lightly brush both sides of chicken breasts and the asparagus with olive oil, and sprinkle with salt and pepper. Cook chicken and asparagus in a hot skillet or on a hot grill. Cook asparagus approximately 5 minutes, turning once. Cook chicken approximately 10 minutes per side or until internal temperature reaches 165 degrees F.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Cut the asparagus and chicken into bite-sized pieces.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Brush pizza crust with oil, and sprinkle lightly with Italian herbs and a very small amount of salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Spread chicken and asparagus evenly over the crust. Top with sliced tomatoes and crumbled cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place pizza on the hot grill, close the lid, and cook for 3-5 minutes. (If you are cooking indoors, bake in 400 degree oven for 10 minutes.)Slice and serve.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Downton Abbey Countess of Grantham Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 135, u'instructions': u'Lightly brush both sides of chicken breasts and the asparagus with olive oil, and sprinkle with salt and pepper. Cook chicken and asparagus in a hot skillet or on a hot grill. Cook asparagus approximately 5 minutes, turning once. Cook chicken approximately 10 minutes per side or until internal temperature reaches 165 degrees F.Cut the asparagus and chicken into bite-sized pieces.Brush pizza crust with oil, and sprinkle lightly with Italian herbs and a very small amount of salt. Spread chicken and asparagus evenly over the crust. Top with sliced tomatoes and crumbled cheese.Place pizza on the hot grill, close the lid, and cook for 3-5 minutes. (If you are cooking indoors, bake in 400 degree oven for 10 minutes.)Slice and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/organic-chicken-and-asparagus-flatbread-764006', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}