{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/758651-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758651, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Radicchio with Creamy Walnut Sauce', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 72.49, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'2 tsp. balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tsp'}, {u'originalString': u'1 clove garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3 small radicchio heads, halved lengthwise', u'aisle': u'Produce', u'name': u'radicchio', u'metaInformation': [u'small', u'halved lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11952, u'unit': u''}, {u'originalString': u'\xbd cup quartered red or green seedless grapes', u'aisle': u'Produce', u'name': u'red grapes', u'metaInformation': [u'green', u'red', u'seedless', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9132, u'unit': u'cup'}, {u'originalString': u'2 Tbs. plain unsweetened soymilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soymilk', u'metaInformation': [u'plain', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 16235, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. vegan sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'vegan sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 93608, u'unit': u'Tbs'}, {u'originalString': u'\xbc cup walnut halves, plus more for garnish, optional', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnut halves', u'metaInformation': [u'plus more for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'\xbc tsp. vegan Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 6971, u'unit': u'tsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/grilled-radicchio-with-creamy-walnut-sauce/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place radicchio halves cut-side up on grill. Close, and grill 10 to 12 minutes, or until pronounced grill marks appear and radicchio is just tender.  2. Meanwhile, chop 1/4 cup walnut halves with garlic in mini food processor or blender.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnut halves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'id': 11952, u'name': u'radicchio'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add soymilk, sour cream, and Worcestershire sauce, and blend until smooth and creamy. Season with salt and pepper, if desired.  3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'id': 16235, u'name': u'soymilk'}]}, {u'equipment': [], u'step': u'Place 3 radicchio halves cut-side up on each plate. Sprinkle each serving with 1 tsp. balsamic vinegar.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radicchio.jpg', u'id': 11952, u'name': u'radicchio'}]}, {u'equipment': [], u'step': u'Serve with walnut sauce, and garnish with grapes and walnut halves, if using.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnut halves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 42, u'instructions': u'1. Place radicchio halves cut-side up on grill. Close, and grill 10 to 12 minutes, or until pronounced grill marks appear and radicchio is just tender.  2. Meanwhile, chop 1/4 cup walnut halves with garlic in mini food processor or blender. Add soymilk, sour cream, and Worcestershire sauce, and blend until smooth and creamy. Season with salt and pepper, if desired.  3. Place 3 radicchio halves cut-side up on each plate. Sprinkle each serving with 1 tsp. balsamic vinegar. Serve with walnut sauce, and garnish with grapes and walnut halves, if using.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-radicchio-with-creamy-walnut-sauce-758651', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}