{u'recipes': [{u'sourceName': u'Gal on a Mission', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/675962-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 675962, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Vegetarian Chipotle Chili', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 134.48, u'creditText': u'Gal on a Mission', u'extendedIngredients': [{u'originalString': u'2 tablespoons adobo chipotle sauce', u'aisle': u'Ethnic Foods', u'name': u'adobo sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6979, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup Silk Almond Milk, optional for creaminess', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'for creaminess'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'1 cup lager-style beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'lager-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'cup'}, {u'originalString': u'2 15-ounce can tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounce'}, {u'originalString': u'28-ounce can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoons'}, {u'originalString': u'2 chipotle peppers in adobo sauce, diced', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle peppers in adobo', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'1 tablespoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 15-ounce can dark red kidney beans, drained', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red kidney beans', u'metaInformation': [u'dark', u'red', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 45.0, u'consistency': u'solid', u'id': 16033, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 medium yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.galonamission.com/slow-cooker-vegetarian-chipotle-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the onion, garlic cloves, beef, tomato sauce, diced tomatoes, dark red kidney beans, chipotle peppers, adobo chipotle sauce, chili powder, cumin, salt, pepper, and almond milk into a 4-quart or larger slow cooker.Cook on high for 4 hours or on low for 8 hours. Stir occasionally.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'id': 16033, u'name': u'red kidney beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with your favorite toppings.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili works really well with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Bohigas Brut Reserva Cava with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale yellow colour. Constant and small bubble. Foam of great persistence. Very fruity aromas, especially of white fruit (acid apple and pear) on shades of peel of citrics and white flowers. In the background, some spicy notes owed to ageing (cinnamon) and cookies. It is a well-structured "cava" in the mouth. Well picked up over its acidity that tenses it overall from beginning to end. The bubble lends a creamy feeling, and it gives volume and softness to the structure that returns acidity and widens the aromas of white fruits and spices that are repeated in the mouth. Its balanced end harmonizes its acidity, and leaves a memory of freshness and volume owing to its light sugar content', u'title': u'Bohigas Brut Reserva Cava', u'price': u'$16.99', u'id': 440298, u'link': u'https://www.wine.com/product/bohigas-brut-reserva-cava/131248', u'imageUrl': u'https://spoonacular.com/productImages/440298-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Place the onion, garlic cloves, beef, tomato sauce, diced tomatoes, dark red kidney beans, chipotle peppers, adobo chipotle sauce, chili powder, cumin, salt, pepper, and almond milk into a 4-quart or larger slow cooker.Cook on high for 4 hours or on low for 8 hours. Stir occasionally.Serve with your favorite toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-vegetarian-chipotle-chili-675962', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}