{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/618677-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 618677, u'veryPopular': True, u'lowFodmap': False, u'title': u'Trail Mix Protein Bar Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 64.32, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'3/4 cup light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 cup old-fashioned whole rolled oats (not quick-cook or instant)', u'aisle': u'Cereal', u'name': u'old fashioned rolled oats', u'metaInformation': [u'whole', u'(not quick-cook or instant)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'1/2 cup pumpkin seeds (or use sunflower seeds, slivered almonds, etc.)', u'aisle': u'Savory Snacks', u'name': u'pumpkin seeds', u'metaInformation': [u'(or use sunflower seeds, slivered almonds, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12014, u'unit': u'cup'}, {u'originalString': u'1/4 cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'pinch salt, optional and to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'about 4.25 ounces protein bars, diced small (about 1 scant cup)', u'aisle': u'Health Foods', u'name': u'pea protein', u'metaInformation': [u'diced', u'small', u'( 1 scant cup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.25, u'consistency': u'solid', u'id': 98890, u'unit': u'ounces'}, {u'originalString': u'1/2 cup unsalted butter, softened (1 stick)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon cornstach', u'aisle': u'?', u'name': u'cornstach', u'metaInformation': [], u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.averiecooks.com/2014/10/trail-mix-protein-bar-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u'To the bowl of a stand mixer fitted with the paddle attachment (or large mixing bowl and electric mixer) combine the butter, brown sugar, egg, vanilla, and beat on medium-high speed until creamed and well combined, about 4 minutes. Stop, scrape down the sides of the bowl, and add theflour, oats, cornstarch,baking soda, optional salt, and beat on low speed until just combined, about 1 minute. Stop, scrape down the sides of the bowl, and add the protein bars, cranberries, seeds, raisins,and beat on low speed until just combined, about 30 seconds. Using alarge cookie scoop, 1/4-cup measure, or your hands, form approximately 12 equal-sized mounds of dough, roll into balls, and flatten slightly. Tip - Strategically place dried fruit or protein bars on top of each mound by taking dried fruit or protein barsfrom the underside and adding them on top. Do not allow protein bar pieces to bake directly on baking sheets; shield them with dough or move them to the top/sides of cookies.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place mounds on a large plate or tray, cover with plasticwrap, and refrigerate for at least 2 hours, up to 5 days. Do not bake with unchilled dough because cookies will bake thinner, flatter, and be more prone to spreading. Preheat oven to 350F, line a baking sheet with aSilpator spray with cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Place dough mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet)and bake for about 11 minutes, or until edges have set and tops are just set, even if slightly undercooked, pale, and glossy in the center; don't overbake. Cookies will be pale and look un-done, but firm up as they cool. Allow cookies to cool on baking sheet for about 10 minutes before serving. I let them cool on the baking sheet and don't use a rack. Cookies will keep airtight at room temperature for up to 1 week or in the freezer for up to 6 months. Alternatively, unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days, or in the freezer for up to 4 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.", u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 3042, u'instructions': u"To the bowl of a stand mixer fitted with the paddle attachment (or large mixing bowl and electric mixer) combine the butter, brown sugar, egg, vanilla, and beat on medium-high speed until creamed and well combined, about 4 minutes. Stop, scrape down the sides of the bowl, and add theflour, oats, cornstarch,baking soda, optional salt, and beat on low speed until just combined, about 1 minute. Stop, scrape down the sides of the bowl, and add the protein bars, cranberries, seeds, raisins,and beat on low speed until just combined, about 30 seconds. Using alarge cookie scoop, 1/4-cup measure, or your hands, form approximately 12 equal-sized mounds of dough, roll into balls, and flatten slightly. Tip - Strategically place dried fruit or protein bars on top of each mound by taking dried fruit or protein barsfrom the underside and adding them on top. Do not allow protein bar pieces to bake directly on baking sheets; shield them with dough or move them to the top/sides of cookies. Place mounds on a large plate or tray, cover with plasticwrap, and refrigerate for at least 2 hours, up to 5 days. Do not bake with unchilled dough because cookies will bake thinner, flatter, and be more prone to spreading. Preheat oven to 350F, line a baking sheet with aSilpator spray with cooking spray. Place dough mounds on baking sheet, spaced at least 2 inches apart (I bake 8 cookies per sheet)and bake for about 11 minutes, or until edges have set and tops are just set, even if slightly undercooked, pale, and glossy in the center; don't overbake. Cookies will be pale and look un-done, but firm up as they cool. Allow cookies to cool on baking sheet for about 10 minutes before serving. I let them cool on the baking sheet and don't use a rack. Cookies will keep airtight at room temperature for up to 1 week or in the freezer for up to 6 months. Alternatively, unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days, or in the freezer for up to 4 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/trail-mix-protein-bar-cookies-618677', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}