{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/493828-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 493828, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken & Beef Satays with Peanut Sauce', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 200, u'pricePerServing': 50.87, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'24 bamboo skewers, soaked in water for one hour', u'aisle': u'Ethnic Foods', u'name': u'bamboo shoots', u'metaInformation': [u'for one hour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bamboo-shoots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 11028, u'unit': u''}, {u'originalString': u'1 10 oz can coconut milk', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'oz'}, {u'originalString': u'1/4 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'2 lbs boneless skinless chicken, and/or sirloin, chilled in freezer for two hours', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'boneless', u'skinless', u'chilled', u'for two hours'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'lbs'}, {u'originalString': u'1/2 cup chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'6 tbsp cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'2 tsp cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 tbsp garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tbsp'}, {u'originalString': u'2 garlic cloves smashed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tsp grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'1/2 tbsp Harissa', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1006972, u'unit': u'tbsp'}, {u'originalString': u'1 pinch kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinch'}, {u'originalString': u'3 tbsp light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp lime zest', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup peanut butter, smooth', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'2 large shallots, minced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1/4 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'1 cup tomato, skinned, seeded and cut into 1/4-inch dice', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'seeded', u'cut into 1/4-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}, {u'originalString': u'3 tsp turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.foodrepublic.com/2011/09/29/chicken-beef-satays-peanut-sauce', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make satays, using a very sharp carving knife, cut the chicken and/or beef into 1/4-inch-thick slices, 6 inches long by 2 inches wide. In a medium bowl, combine the soy sauce, oil, shallots, lime zest, ginger, garlic, turmeric, cumin and cilantro. If using only chicken or beef, transfer the mixture to a gallon-size sealable plastic bag and add the chicken or beef. If using both chicken and beef, divide the marinade between two gallon-size bags and add the chicken to one and the beef to the other. Seal the bag(s) and marinate refrigerated for at least 1 hour or up to a day ahead. Meanwhile, make the peanut sauce. In a large saucepan, combine the coconut milk, peanut butter and chicken stock and whisk to blend. Cook over medium heat until the mixture simmers, stirring often to prevent scorching, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add the tomato, turmeric, cumin, garlic, curry paste, if using, and sugar and mix well. Simmer until the flavors have blended, about 15 minutes. Season with salt. If the sauce is too thick, add up to a cup of water and blend. Cover and refrigerate the sauce for up to 2 days, or keep at room temperature if making the satays immediately. Just before serving, reheat and blend in the lime juice and cilantro. Thread the strips accordion-style onto the skewers, one type of meat for each. Preheat and outdoor grill or the broiler or heat a grill pan or large heavy skillet over high heat. If using a skillet or grill pan, spray the interior with nonstick cooking spray or spray the outdoor grill rack; if broiling, line a baking sheet with foil and spray. Broil or grill, turning once, until the meat is just cooked through, 4 to 6 minutes total.', u'length': {u'number': 19, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Transfer skewers to a warm platter and serve with the sauce.   Reprinted with permission from Kosher Revolution, by Geila Hocherman & Arthur Boehm', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'butterscotch , citrus , vanilla', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 336, u'instructions': u'To make satays, using a very sharp carving knife, cut the chicken and/or beef into 1/4-inch-thick slices, 6 inches long by 2 inches wide. In a medium bowl, combine the soy sauce, oil, shallots, lime zest, ginger, garlic, turmeric, cumin and cilantro. If using only chicken or beef, transfer the mixture to a gallon-size sealable plastic bag and add the chicken or beef. If using both chicken and beef, divide the marinade between two gallon-size bags and add the chicken to one and the beef to the other. Seal the bag(s) and marinate refrigerated for at least 1 hour or up to a day ahead. Meanwhile, make the peanut sauce. In a large saucepan, combine the coconut milk, peanut butter and chicken stock and whisk to blend. Cook over medium heat until the mixture simmers, stirring often to prevent scorching, about 5 minutes. Add the tomato, turmeric, cumin, garlic, curry paste, if using, and sugar and mix well. Simmer until the flavors have blended, about 15 minutes. Season with salt. If the sauce is too thick, add up to a cup of water and blend. Cover and refrigerate the sauce for up to 2 days, or keep at room temperature if making the satays immediately. Just before serving, reheat and blend in the lime juice and cilantro. Thread the strips accordion-style onto the skewers, one type of meat for each. Preheat and outdoor grill or the broiler or heat a grill pan or large heavy skillet over high heat. If using a skillet or grill pan, spray the interior with nonstick cooking spray or spray the outdoor grill rack; if broiling, line a baking sheet with foil and spray. Broil or grill, turning once, until the meat is just cooked through, 4 to 6 minutes total. Transfer skewers to a warm platter and serve with the sauce.   Reprinted with permission from Kosher Revolution, by Geila Hocherman & Arthur Boehm', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-beef-satays-with-peanut-sauce-493828', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 230, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}