{u'recipes': [{u'sourceName': u'Cookin Canuck', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/584599-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 584599, u'veryPopular': False, u'lowFodmap': False, u'title': u'Almond Joy Chocolate & Coconut Ice Cream', u'diets': [u'gluten free'], u'pricePerServing': 312.95, u'creditText': u'Cookin Canuck', u'extendedIngredients': [{u'originalString': u'4.8 oz. Almond Joy bars (8 mini bars), chopped', u'aisle': u'Sweet Snacks', u'name': u'almond joy bar', u'metaInformation': [u'mini', u'chopped', u'(8 bars)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-joy.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.8, u'consistency': u'solid', u'id': 19065, u'unit': u'oz'}, {u'originalString': u'1 1/2 oz. bittersweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'solid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'1/4 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/2 cup sweetened coconut flakes', u'aisle': u'Baking', u'name': u'sweetened coconut flakes', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12109, u'unit': u'cup'}, {u'originalString': u'1 quart high-quality vanilla ice cream, softened', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'quart'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.cookincanuck.com/2011/08/almond-joy-chocolate-coconut-ice-cream-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 81, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat cream in a small saucepan set over medium heat, stirring frequently.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Remove from heat when hot, but not boiling.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place chopped chocolate in a medium bowl.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour hot cream over chocolate and whisk until a smooth chocolate sauce forms.  Set aside to cool.In a medium frying pan set over medium heat, toast coconut until light golden brown, stirring frequently, about 5 minutes.  Set aside to cool.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place softened ice cream in a large bowl.  Stir in coconut flakes and Almond Joy pieces.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Drizzle in 2 tablespoons chocolate sauce and stir in slightly.  Do not stir in all the way or it will turn the ice cream brown.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Transfer ice cream to a freezer-safe container.  Cover and place in freezer until ice cream re-freezes, at least 4 hours.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 302, u'instructions': u'Heat cream in a small saucepan set over medium heat, stirring frequently.  Remove from heat when hot, but not boiling.Place chopped chocolate in a medium bowl.  Pour hot cream over chocolate and whisk until a smooth chocolate sauce forms.  Set aside to cool.In a medium frying pan set over medium heat, toast coconut until light golden brown, stirring frequently, about 5 minutes.  Set aside to cool.Place softened ice cream in a large bowl.  Stir in coconut flakes and Almond Joy pieces.Drizzle in 2 tablespoons chocolate sauce and stir in slightly.  Do not stir in all the way or it will turn the ice cream brown.Transfer ice cream to a freezer-safe container.  Cover and place in freezer until ice cream re-freezes, at least 4 hours.  Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/almond-joy-chocolate-coconut-ice-cream-584599', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}