{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/209994-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 209994, u'veryPopular': True, u'lowFodmap': False, u'title': u'Steak and Eggs Rancheros', u'diets': [u'gluten free'], u'pricePerServing': 172.16, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1 cup cooked lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'cooked lentils', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16070, u'unit': u'cup'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'8 ounces flank steak', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'ounces'}, {u'originalString': u'2 thin slices pepper-jack cheese', u'aisle': u'Cheese', u'name': u'pepper jack cheese', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 1025, u'unit': u'slices'}, {u'originalString': u'4 tablespoons salsa, divided', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 small whole-grain soft tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [u'small', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Steak-and-Eggs-Rancheros-51150400', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a skillet over high heat. Sprinkle steak with salt; coat bothsides with cooking spray and place in skillet. Reduce heat to low;cook, turning once or twice, until steak is well browned andcenter is pink, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer to a cutting board.Carefully wipe skillet; coat with cooking spray. Cook eggs overhigh heat sunny-side up, 3 minutes. Toast tortillas in a toasteroven; transfer 1 tortilla to each of 4 plates. Top each with 1/4 cuplentils, 1/2 slice cheese, 1 tablespoon salsa and 1 egg. Thinly slice steak;divide evenly among plates and serve.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Per serving: 352 calories, 12 g fat, 5 g saturated fat, 35 g carbohydrate,12 g fiber, 30 g protein', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Nutritional analysis provided by', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Self', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Beringer Howell Mountain Bancroft Ranch Merlot with a 4.2 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"The 2006 Bancroft Ranch Merlot is a rich garnet color, and brims with flavors of ripe black fruits, brown spices and a hint of orange zest. Its refined tannins and depth of flavor make it one of Beringer's most memorable wines from Howell Mountain.Blend: 93% Merlot, 4% Cabernet Sauvignon, and 3% Cabernet Franc View More", u'title': u'Beringer Howell Mountain Bancroft Ranch Merlot', u'price': u'$34.99', u'id': 438453, u'link': u'https://www.wine.com/product/beringer-howell-mountain-bancroft-ranch-merlot-2006/116574', u'imageUrl': u'https://spoonacular.com/productImages/438453-312x231.jpg'}]}, u'aggregateLikes': 599, u'instructions': u'Preparation                                                        Heat a skillet over high heat. Sprinkle steak with salt; coat bothsides with cooking spray and place in skillet. Reduce heat to low;cook, turning once or twice, until steak is well browned andcenter is pink, about 15 minutes. Transfer to a cutting board.Carefully wipe skillet; coat with cooking spray. Cook eggs overhigh heat sunny-side up, 3 minutes. Toast tortillas in a toasteroven; transfer 1 tortilla to each of 4 plates. Top each with 1/4 cuplentils, 1/2 slice cheese, 1 tablespoon salsa and 1 egg. Thinly slice steak;divide evenly among plates and serve.                                                                         Per serving: 352 calories, 12 g fat, 5 g saturated fat, 35 g carbohydrate,12 g fiber, 30 g protein                            Nutritional analysis provided by                                        Self', u'spoonacularSourceUrl': u'https://spoonacular.com/steak-and-eggs-rancheros-209994', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}