{u'recipes': [{u'sourceName': u"What's for Lunch Honey", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/617873-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 617873, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fennel Seed and Cardamom Spiced Carrot Rice Pudding', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 163.02, u'creditText': u"What's for Lunch Honey", u'extendedIngredients': [{u'originalString': u'700 - 750 ml almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 700.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'ml'}, {u'originalString': u'5-6 cardamom pods, lightly crushed', u'aisle': u'Spices and Seasonings', u'name': u'cardamom pods', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1002006, u'unit': u''}, {u'originalString': u'3 medium sized carrots, grated', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated', u'medium sized'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'430 ml coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 430.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'ml'}, {u'originalString': u'1 teaspoon fennel seeds', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2018, u'unit': u'teaspoon'}, {u'originalString': u'200g long grained white rice, uncooked', u'aisle': u'Pasta and Rice', u'name': u'long-grain rice', u'metaInformation': [u'white', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'g'}, {u'originalString': u'50 g palm sugar / Muscovado sugar', u'aisle': u'Baking', u'name': u'palm sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 93831, u'unit': u'g'}, {u'originalString': u'75 g pistachios, coarsely chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 12151, u'unit': u'g'}, {u'originalString': u'250 g Indian or Iranian raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 9299, u'unit': u'g'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.whatsforlunchhoney.net/2014/10/spiced-carrot-rice-pudding.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a heavy-bottomed pot set over high heat, bring about 500 ml almond milk, coconut milk, rice, whole spices and salt to a boil, stirring often. Reduce heat to low; add carrot and simmer, stirring often and slowly adding the remaining milk, until rice is tender but not mushy, 20-25 minutes. Once the rice is cooked remove from heat and stir in the sugar and the raisins. Allow to cool slightly as the rice pudding will thicken further as it rests. The rice can be served warm or at room temperature.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with a good sprinkling of pistachios.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 23, u'instructions': u'In a heavy-bottomed pot set over high heat, bring about 500 ml almond milk, coconut milk, rice, whole spices and salt to a boil, stirring often. Reduce heat to low; add carrot and simmer, stirring often and slowly adding the remaining milk, until rice is tender but not mushy, 20-25 minutes. Once the rice is cooked remove from heat and stir in the sugar and the raisins. Allow to cool slightly as the rice pudding will thicken further as it rests. The rice can be served warm or at room temperature. Serve with a good sprinkling of pistachios.', u'spoonacularSourceUrl': u'https://spoonacular.com/fennel-seed-and-cardamom-spiced-carrot-rice-pudding-617873', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}