{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/755641-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 755641, u'veryPopular': False, u'lowFodmap': False, u'title': u'White Bean Waffles', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 51.51, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoons'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 (15-ounce) cans cooked canellini beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'canellini beans', u'metaInformation': [u'cooked', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 10716050, u'unit': u'ounce'}, {u'originalString': u'1 cup chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'6 tablespoons pure olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon gray salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'Gray salt or course sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2 teaspoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons chopped thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thyme', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}], u'healthScore': 7.0, u'imageType': u'jpeg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/michael-chiarello/white-bean-waffles-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'For the beans:;', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'For the waffles:;', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u'Preheat waffle iron.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain and rinse the canned beans. In a small pot combine the beans, thyme, and chicken stock. Season with gray salt and pepper and bring to a simmer for about 5 minutes over medium-high heat.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Remove from the heat and allow to cool to room temperature. Meanwhile in a large mixing bowl combine the flour, sugar, baking powder, and teaspoon salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the beans and their cooking liquid to a food processor and pulse to puree.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the eggs, milk, and olive oil to the bean mixture and puree until smooth.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the wet mixture into the dry slowly to avoid any lumps.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u"Let the batter rest briefly and griddle the waffles according manufacturer's instructions.", u'number': 9, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 87, u'instructions': u"For the beans:;                          For the waffles:;                          Preheat waffle iron.                          Drain and rinse the canned beans. In a small pot combine the beans, thyme, and chicken stock. Season with gray salt and pepper and bring to a simmer for about 5 minutes over medium-high heat. Remove from the heat and allow to cool to room temperature. Meanwhile in a large mixing bowl combine the flour, sugar, baking powder, and teaspoon salt.                          Add the beans and their cooking liquid to a food processor and pulse to puree. Add the eggs, milk, and olive oil to the bean mixture and puree until smooth. Whisk the wet mixture into the dry slowly to avoid any lumps. Let the batter rest briefly and griddle the waffles according manufacturer's instructions.", u'spoonacularSourceUrl': u'https://spoonacular.com/white-bean-waffles-755641', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}