{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/521861-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 521861, u'veryPopular': False, u'lowFodmap': False, u'title': u'Yellow rice with fresh mussels and mixed vegetables', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 87.89, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'1 large bell pepper, diced', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 carrot, cubed', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 to 4 tbsps. of chili sauce', u'aisle': u'Ethnic Foods', u'name': u'chili sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6972, u'unit': u'tbsps'}, {u'originalString': u'4 to 6 c. of rice cooked with the least amount of water possible', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'with the least amount of water possible', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'c'}, {u'originalString': u'4 to 6 tbsps. of cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsps'}, {u'originalString': u'a generous pinch of whole cumin seeds', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'pinch'}, {u'originalString': u'4 to 6 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'a knob of ginger, minced', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11216, u'unit': u'servings'}, {u'originalString': u'1 kaffir lime leaf, thinly sliced', u'aisle': u'Ethnic Foods', u'name': u'kaffir lime leaves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93633, u'unit': u''}, {u'originalString': u'1/2 k. of fresh mussels, rinsed and debearded', u'aisle': u'Seafood', u'name': u'mussels', u'metaInformation': [u'fresh', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 15164, u'unit': u''}, {u'originalString': u'1 onion, thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'patis (fish sauce), to taste', u'aisle': u'Ethnic Foods', u'name': u'patis', u'metaInformation': [u'to taste', u'(fish sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'servings'}, {u'originalString': u'about 100 g. of Baguio (French) beans, stringed and cut into one-inch lengths', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'french', u'cut into one-inch lengths', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 16033, u'unit': u'g'}, {u'originalString': u'2 tbsps. of tumeric powder', u'aisle': u'Spices and Seasonings', u'name': u'tumeric powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2043, u'unit': u'tbsps'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://casaveneracion.com/yellow-rice-with-fresh-mussels-and-mixed-vegetables/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat the cooking oil in a wok or other shallow pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Saute the garlic, ginger, onion, cumin seeds and kaffir lime leaf just until fragrant.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the carrot cubes, beans and diced bell pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Saute for about a minute.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the mussels to the pan, pour in half a cup of water and season with patis and black pepper. Cover the pan tightly and let the mussels cook in the steam for about four minutes. You want the shells to partially open but the mussels should only be half-cooked at this point.Turn off the heat and pick out the mussels. Pry open the shells (careful, they are hot) and discard the empty half shells.Turn on the heat once again.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}]}, {u'equipment': [], u'step': u'Add the turmeric powder and chili sauce to the vegetables. Stir. Taste.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 6972, u'name': u'chili sauce'}]}, {u'equipment': [], u'step': u'Add more patis and pepper, if needed.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the rice to the vegetables. Stir until the coloring is even. Stir in the half-cooked mussels. Cover the pan, set the heat to the lowest setting and let everything finish cooking in the hot steam for five to seven minutes.Fluff up the rice before serving.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 12, u'instructions': u'InstructionsHeat the cooking oil in a wok or other shallow pan. Saute the garlic, ginger, onion, cumin seeds and kaffir lime leaf just until fragrant. Add the carrot cubes, beans and diced bell pepper. Saute for about a minute.Add the mussels to the pan, pour in half a cup of water and season with patis and black pepper. Cover the pan tightly and let the mussels cook in the steam for about four minutes. You want the shells to partially open but the mussels should only be half-cooked at this point.Turn off the heat and pick out the mussels. Pry open the shells (careful, they are hot) and discard the empty half shells.Turn on the heat once again. Add the turmeric powder and chili sauce to the vegetables. Stir. Taste. Add more patis and pepper, if needed.Add the rice to the vegetables. Stir until the coloring is even. Stir in the half-cooked mussels. Cover the pan, set the heat to the lowest setting and let everything finish cooking in the hot steam for five to seven minutes.Fluff up the rice before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/yellow-rice-with-fresh-mussels-and-mixed-vegetables-521861', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}