{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610288-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 610288, u'veryPopular': True, u'lowFodmap': False, u'title': u'Warm Up with Double Carrot Stew', u'diets': [u'dairy free'], u'pricePerServing': 273.52, u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'500 grams (17.6 ounces) beef chuck cut into 2” pieces', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'cut into 2” pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 17.6, u'consistency': u'solid', u'id': 13786, u'unit': u'ounces'}, {u'originalString': u'650 grams (22.9 ounces) carrots ( - 4 medium carrots)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'( - 4 carrots)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 22.9, u'consistency': u'solid', u'id': 11124, u'unit': u'ounces'}, {u'originalString': u'chopped flat leaf parsley for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'leaf'}, {u'originalString': u'1 tablespoon flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'18 grams (0.6 ounces) garlic ( - 2 cloves), minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'( - 2 cloves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.6, u'consistency': u'solid', u'id': 11215, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'175 grams (6.2 ounces) onion ( - 1 medium onion), thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'thinly sliced', u'( - 1 onion)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.2, u'consistency': u'solid', u'id': 11282, u'unit': u'ounces'}, {u'originalString': u'1 cup red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'400 grams (14.1 ounces) stewed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'stewed tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.1, u'consistency': u'solid', u'id': 11533, u'unit': u'ounces'}, {u'originalString': u'1 1/2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.pbs.org/food/fresh-tastes/double-carrot-stew/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404631, u'name': u'grater'}], u'step': u'Peel the carrots. Using a grater or food processor puree a quarter of the carrots (about 160 grams). Slice the rest of the carrots into -inch thick chunks.Generously salt and pepper the beef and then dust with the flour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}], u'step': u'Heat a pressure cooker over high heat until hot.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the olive oil followed by the beef in a single layer. Brown on one side until a peak underneath reveals a dark brown crust. Flip the beef and brown the other side.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the beef to a bowl and turn down the heat to medium low.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the garlic and onions to the pot.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute until tender and starting to brown.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the carrot puree and continue sauteing until the carrot puree has started to brown.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the wine and deglaze the pan, scraping up all the browned bits from the bottom of the pan.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}], u'step': u'Add the stewed tomatoes, water, bay leaves, salt and pepper and return the beef to the pot. Seal the pressure cooker and set the pressure to high. Bring the cooker up to pressure over high heat until you hear a steady whistle. Turn down the heat to maintain a steady whistle and set a timer for 15 minutes. When the timer is up, place the pressure cooker in a sink and run some cold water on the lid until the pressure releases. Once youre certain the pressure has released, open the lid, add the carrots and give it a stir. Seal the lid again and place the cooker over high heat until it comes back up to pressure. Adjust the heat down to maintain a steady whistle and set the timer for 20 minutes. When the timer is up, place the pressure cooker in the sink and run some cold water on the lid to release the pressure. Open up the cooker and test the beef for tenderness (it should fall apart when prodded with a fork). If its still not as tender as youd like, simmer uncovered until it reaches your desired level of tenderness. Taste the stew and add salt as needed, garnish with flat-leaf parsley.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'flat leaf parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'id': 11533, u'name': u'stewed tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 800, u'instructions': u'<p>DirectionsPeel the carrots. Using a grater or food processor puree a quarter of the carrots (about 160 grams). Slice the rest of the carrots into -inch thick chunks.Generously salt and pepper the beef and then dust with the flour. Heat a pressure cooker over high heat until hot. Add the olive oil followed by the beef in a single layer. Brown on one side until a peak underneath reveals a dark brown crust. Flip the beef and brown the other side. Transfer the beef to a bowl and turn down the heat to medium low. Add the garlic and onions to the pot. Saute until tender and starting to brown. Add the carrot puree and continue sauteing until the carrot puree has started to brown. Add the wine and deglaze the pan, scraping up all the browned bits from the bottom of the pan. Add the stewed tomatoes, water, bay leaves, salt and pepper and return the beef to the pot. Seal the pressure cooker and set the pressure to high. Bring the cooker up to pressure over high heat until you hear a steady whistle. Turn down the heat to maintain a steady whistle and set a timer for 15 minutes. When the timer is up, place the pressure cooker in a sink and run some cold water on the lid until the pressure releases. Once youre certain the pressure has released, open the lid, add the carrots and give it a stir. Seal the lid again and place the cooker over high heat until it comes back up to pressure. Adjust the heat down to maintain a steady whistle and set the timer for 20 minutes. When the timer is up, place the pressure cooker in the sink and run some cold water on the lid to release the pressure. Open up the cooker and test the beef for tenderness (it should fall apart when prodded with a fork). If its still not as tender as youd like, simmer uncovered until it reaches your desired level of tenderness. Taste the stew and add salt as needed, garnish with flat-leaf parsley.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/warm-up-with-double-carrot-stew-610288', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}