{u'recipes': [{u'sourceName': u'Grumpys Honey Bunch', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/689838-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 689838, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mom’s Buttermilk Biscuits #SundaySupper', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 27.98, u'creditText': u'Grumpys Honey Bunch', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'\xbe teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'3 cups flour (sift flour before measuring)', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'(sift flour before measuring)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.grumpyshoneybunch.com/2015/11/moms-buttermilk-biscuits.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 450. In large mixing bowl stir together the flour, baking powder, baking soda, salt, sugar, and cream of tartar.Using a pastry blender or your hands (as mom recommends) quickly cut the butter into the flour mixture until it resembles pea like crumbs.Make a well in the center of your flour and butter mixture.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the buttermilk and stir until just combined.Turn dough out onto floured board. Knead 5-6 times to bring dough together. Flatten to about 1" thick using your hands.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Cut with a biscuit cutter and place on baking sheet, being sure to have the biscuits touch each other slightly.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 10-14 minutes or until biscuits are golden.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Zinfandel, Riesling, and Sparkling Wine are my top picks for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Seghesio Cortina Zinfandel. It has 4.3 out of 5 stars and a bottle costs about 40 dollars.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'Bright aromas of dark cherry and black raspberry. Upfront fruit appeal supported with underpinnings of complexity and slight white pepper spice. Soft entry develops into warm, full mid-palateFinish strikes ideal balance of tannins, fruit and acidity. View More', u'title': u'Seghesio Cortina Zinfandel', u'price': u'$39.99', u'id': 446505, u'link': u'https://www.wine.com/product/seghesio-cortina-zinfandel-2012/149900', u'imageUrl': u'https://spoonacular.com/productImages/446505-312x231.jpg'}]}, u'aggregateLikes': 565, u'instructions': u'Preheat oven to 450. In large mixing bowl stir together the flour, baking powder, baking soda, salt, sugar, and cream of tartar.Using a pastry blender or your hands (as mom recommends) quickly cut the butter into the flour mixture until it resembles pea like crumbs.Make a well in the center of your flour and butter mixture. Add the buttermilk and stir until just combined.Turn dough out onto floured board. Knead 5-6 times to bring dough together. Flatten to about 1" thick using your hands. Cut with a biscuit cutter and place on baking sheet, being sure to have the biscuits touch each other slightly.Bake 10-14 minutes or until biscuits are golden.', u'spoonacularSourceUrl': u'https://spoonacular.com/moms-buttermilk-biscuits-sundaysupper-689838', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}