{u'recipes': [{u'sourceName': u'Running with Spoons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/828176-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 828176, u'veryPopular': False, u'lowFodmap': True, u'title': u'pumpkin snickerdoodle mug cake', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 86.15, u'creditText': u'Running with Spoons', u'extendedIngredients': [{u'originalString': u'1 Tbsp (7 g) almond flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 93740, u'unit': u'g'}, {u'originalString': u'1/4 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp (7 g) coconut flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 93747, u'unit': u'g'}, {u'originalString': u'1 Tbsp (12 g) coconut palm sugar**', u'aisle': u'Baking', u'name': u'coconut palm sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 12.0, u'consistency': u'solid', u'id': 93831, u'unit': u'g'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp (5 g) quick oats*', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 5.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'2 Tbsp (30 g) pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 30.0, u'consistency': u'solid', u'id': 11424, u'unit': u'g'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.runningwithspoons.com/2016/11/08/pumpkin-snickerdoodle-mug-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Add the coconut flour, almond flour, oats, sugar, cinnamon, and baking powder to a microwave-safe mug or ramekin, mixing until all the dry ingredients are well combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'id': 93747, u'name': u'coconut flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'id': 93740, u'name': u'almond flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u"Add the egg and pumpkin, stirring gently until no clumps remain and all the ingredients are fully incorporated. Sprinkle the top with a little bit of extra cinnamon and sugar.Microwave on high for 2 to 3 minutes, depending on microwave strength and the size of your dish.***Carefully remove from the microwave (it's hot!) and enjoy!", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 39, u'instructions': u"Add the coconut flour, almond flour, oats, sugar, cinnamon, and baking powder to a microwave-safe mug or ramekin, mixing until all the dry ingredients are well combined.Add the egg and pumpkin, stirring gently until no clumps remain and all the ingredients are fully incorporated. Sprinkle the top with a little bit of extra cinnamon and sugar.Microwave on high for 2 to 3 minutes, depending on microwave strength and the size of your dish.***Carefully remove from the microwave (it's hot!) and enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-snickerdoodle-mug-cake-828176', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 7, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}