{u'recipes': [{u'sourceName': u'Sallys Baking Addiction', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573509-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 573509, u'veryPopular': True, u'lowFodmap': False, u'title': u'White Chocolate Lucky Charms Treats', u'diets': [], u'pricePerServing': 63.15, u'creditText': u'Sallys Baking Addiction', u'extendedIngredients': [{u'originalString': u'16 ounces melting white chocolate* (or almond bark or candy melts)', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'white', u'(or almond bark or candy melts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 19081, u'unit': u'ounces'}, {u'originalString': u'6 cups Lucky Charms cereal', u'aisle': u'Cereal', u'name': u'lucky charms cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lucky-charms.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 8050, u'unit': u'cups'}, {u'originalString': u'10 ounce bag of marshmallows + 1 cup (extra cup is strongly recommended)', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'(extra cup is strongly recommended)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 19116, u'unit': u'ounce'}, {u'originalString': u'4 Tablespoons (1/2 stick) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1/2 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://sallysbakingaddiction.com/2013/03/13/white-chocolate-lucky-charms-treats/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Spray 9x13 baking pan with nonstick spray. Set aside.Melt the butter in a large saucepan over low heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the marshmallows until they are just about fully melted into the butter. Some chunks of marshmallow may remain.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Add in the Lucky Charms cereal and stir until the cereal is fully coated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lucky-charms.png', u'id': 8050, u'name': u'lucky charms cereal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour mixture into prepared baking pan and gently spread out evenly. I sprayed the back of a large spatula with non-stick spray and gently pressed the mixture without packing it down.\xa0Allow to set for 2 hours at room temperature before cutting into rectangles or squares, whichever shape/size you prefer.Line a large baking sheet with parchment paper or a silicone baking mat. Set aside. Melt the white chocolate according to package instructions. Hold the treat and dip the bottom into white chocolate, making sure to coat it generously.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place treats white chocolate side up on prepared baking sheet. Allow chocolate to set at room temperature for about 10 minutes. Store treats at room temperature for up to 1 week.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Treat. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 30158, u'instructions': u'Spray 9x13 baking pan with nonstick spray. Set aside.Melt the butter in a large saucepan over low heat. Add the marshmallows until they are just about fully melted into the butter. Some chunks of marshmallow may remain. Add in the Lucky Charms cereal and stir until the cereal is fully coated.Pour mixture into prepared baking pan and gently spread out evenly. I sprayed the back of a large spatula with non-stick spray and gently pressed the mixture without packing it down.\xa0Allow to set for 2 hours at room temperature before cutting into rectangles or squares, whichever shape/size you prefer.Line a large baking sheet with parchment paper or a silicone baking mat. Set aside. Melt the white chocolate according to package instructions. Hold the treat and dip the bottom into white chocolate, making sure to coat it generously. Place treats white chocolate side up on prepared baking sheet. Allow chocolate to set at room temperature for about 10 minutes. Store treats at room temperature for up to 1 week.', u'spoonacularSourceUrl': u'https://spoonacular.com/white-chocolate-lucky-charms-treats-573509', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}