{u'recipes': [{u'sourceName': u'Desserts with Benefits', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/523414-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 523414, u'veryPopular': False, u'lowFodmap': True, u'title': u'White Chocolate Macadamia Nut Krispy Treats', u'diets': [u'gluten free', u'fodmap friendly'], u'pricePerServing': 114.05, u'creditText': u'Desserts with Benefits', u'extendedIngredients': [{u'originalString': u'5 cups Crispy Brown Rice Cereal', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'crispy'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 20040, u'unit': u'cups'}, {u'originalString': u'210g (1/2 cup + 2 Tbs) Brown Rice Syrup', u'aisle': u'Health Foods;Baking', u'name': u'brown rice syrup', u'metaInformation': [u'(1/2 cup + 2 Tbs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 210.0, u'consistency': u'solid', u'id': 93784, u'unit': u'g'}, {u'originalString': u'1/2 tsp Butter Extract', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'tsp'}, {u'originalString': u'2 Tbs Flaxseed Meal', u'aisle': u'Health Foods;Baking', u'name': u'flaxseed meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 12220, u'unit': u'Tbs'}, {u'originalString': u'1 tsp Grapeseed Oil (or any other neutral oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [u'or any other neutral oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'tsp'}, {u'originalString': u'128g (1/2 cup) Raw Macadamia Nut Butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nut butter', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12195, u'unit': u'cup'}, {u'originalString': u'1/2 cup Old Fashioned Rolled Oats', u'aisle': u'Cereal', u'name': u'old fashioned rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'1/4 tsp Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tsp Stevia Extract', u'aisle': u'Baking', u'name': u'stevia extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93628, u'unit': u'tsp'}, {u'originalString': u'1 Tbs Vanilla Paste', u'aisle': u'Gourmet', u'name': u'vanilla paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 93813, u'unit': u'Tbs'}, {u'originalString': u'64g (2 scoops) Vanilla Protein Powder', u'aisle': u'Health Foods', u'name': u'vanilla protein powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'scoops', u'unitShort': u'scoops', u'amount': 2.0, u'consistency': u'solid', u'id': 99076, u'unit': u'scoops'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://dessertswithbenefits.com/white-chocolate-macadamia-nut-krispy-treats/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line a brownie pan with parchment paper both ways.In a large mixing bowl, stir together the cereal, oats, flax and salt.In a large microwave-safe bowl, stir together the rice syrup, nut butter, vanilla paste and extract.  Microwave at 30-second intervals, stirring between each one, until runny.Stir in the protein powder one spoonful at a time.  Scoop over the dry ingredients and fold together.  Scoop this into the pan and flatten.In a small microwave-safe bowl, add the white chocolate and oil and microwave at 30-second intervals, stirring between each one, until melted.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 93813, u'name': u'vanilla paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 12195, u'name': u'nut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 93784, u'name': u'brown rice syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'id': 10012220, u'name': u'flaxseed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drizzle into desired pattern.  Refrigerate for 30 minutes then slice and serve!', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Treat. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'Line a brownie pan with parchment paper both ways.In a large mixing bowl, stir together the cereal, oats, flax and salt.In a large microwave-safe bowl, stir together the rice syrup, nut butter, vanilla paste and extract.  Microwave at 30-second intervals, stirring between each one, until runny.Stir in the protein powder one spoonful at a time.  Scoop over the dry ingredients and fold together.  Scoop this into the pan and flatten.In a small microwave-safe bowl, add the white chocolate and oil and microwave at 30-second intervals, stirring between each one, until melted.  Drizzle into desired pattern.  Refrigerate for 30 minutes then slice and serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/white-chocolate-macadamia-nut-krispy-treats-523414', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}