{u'recipes': [{u'sourceName': u'Noob Cook', u'cuisines': [u'asian', u'korean'], u'image': u'https://spoonacular.com/recipeImages/565093-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 565093, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kimchi Pork Stir-fry', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 291.16, u'creditText': u'Noob Cook', u'extendedIngredients': [{u'originalString': u'3 cloves garlic peeled and minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 slices thinly sliced ginger cut to long thin strips', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'thinly sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'slices'}, {u'originalString': u'A Marinade', u'aisle': u'Ethnic Foods', u'name': u'korean marinade', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 99000, u'unit': u'servings'}, {u'originalString': u'1/2 tsp light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 10216124, u'unit': u'tsp'}, {u'originalString': u'100 grams kimchi cut to bite-sized pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'pecan pieces', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 10012142, u'unit': u'grams'}, {u'originalString': u'2 dashes white pepper powder', u'aisle': u'Spices and Seasonings', u'name': u'red pepper powder', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 2.0, u'consistency': u'solid', u'id': 2031, u'unit': u'dashes'}, {u'originalString': u'1 tsp sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tsp'}, {u'originalString': u'2 stalks spring onions (green leafy part) cut to 5 cm (2 inch) length', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'green', u'( leafy part)', u'(2 inch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'stalks'}, {u'originalString': u'100 grams thinly sliced pork belly sukiyaki or shabu shabu cut', u'aisle': u'Cereal', u'name': u'steel cut oats', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/steel-cut-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 93695, u'unit': u'grams'}, {u'originalString': u'gochujang solution whisk 1/2 tsp gochuhang in 1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'tsp'}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.noobcook.com/kimchi-pork/2/', u'glutenFree': False, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Marinade pork belly with (A) for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat oil in wok, stir fry ginger and garlic for 30 seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add pork belly and stir fry until cooked on the surface.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add kimchi and gochujang solution. Cover with lid and simmer for 1 minute. Turn off the heat and stir in the spring onions while the contents are still hot.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Gewurztraminer, and Riesling are great choices for Kimchi. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The L'Ecole 41 Chenin Blanc with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish.', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Marinade pork belly with (A) for 5 minutes.Heat oil in wok, stir fry ginger and garlic for 30 seconds. Add pork belly and stir fry until cooked on the surface.Add kimchi and gochujang solution. Cover with lid and simmer for 1 minute. Turn off the heat and stir in the spring onions while the contents are still hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/kimchi-pork-stir-fry-565093', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}