{u'recipes': [{u'sourceName': u'Normal Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/682030-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 682030, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Apple Cider Pork Chops', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 203.59, u'creditText': u'Normal Cooking', u'extendedIngredients': [{u'originalString': u'1\xbd c. apple cider', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1009016, u'unit': u'c'}, {u'originalString': u'4 bone-in pork chops, about 1 inch thick', u'aisle': u'Meat', u'name': u'bone-in pork chops', u'metaInformation': [u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chop-bone-in.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 10036, u'unit': u''}, {u'originalString': u'2 Tbsp. brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Tbsp'}, {u'originalString': u'2 tsp. chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp. Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'\xbc c. maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'c'}, {u'originalString': u'1 Tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'\xbd tsp. pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://normalcooking.com/2015/10/07/grilled-apple-cider-pork-chops/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Light your gas or charcoal grill and heat to medium high heat.In a small saucepan, prepare the glaze by combining the apple cider, maple syrup, Dijon mustard, crushed red pepper flakes, and salt. Bring to a simmer. While the cider comes to a simmer, prepare the pork rub. In a small bowl combine the brown sugar, chili powder, garlic powder, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'id': 1009016, u'name': u'apple cider'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix thoroughly with a fork.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Add the oil.Pat the pork chops dry with paper towels, and then rub the chops on all sides with the spice mixture.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Place pork chops on the heated grill, and thoroughly brush with the cider glaze. Grill for about 6 minutes. Flip the chops and thoroughly brush with the glaze on the other side. Grill for about 2 more minutes, flip and brush again. Repeat this process until the chops cook for 10-12 minutes total, and reach an internal temperature of 145 degrees. If you're also grilling apples, brush the halved apples with glaze and grill for about 5-6 minutes. No need to flip.", u'length': {u'number': 26, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve along with the chops.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Riesling are my top picks for Pork Chops. Chardonnay suits simple chops or chops in a butter or cream sauce, dry riesling complements sweet additions like honey mustard or apples, and pinot noir is a safe bet for pork dishes in general. You could try Waterbrook Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'riesling'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u"Light your gas or charcoal grill and heat to medium high heat.In a small saucepan, prepare the glaze by combining the apple cider, maple syrup, Dijon mustard, crushed red pepper flakes, and salt. Bring to a simmer. While the cider comes to a simmer, prepare the pork rub. In a small bowl combine the brown sugar, chili powder, garlic powder, salt and pepper. Mix thoroughly with a fork. Add the oil.Pat the pork chops dry with paper towels, and then rub the chops on all sides with the spice mixture.Place pork chops on the heated grill, and thoroughly brush with the cider glaze. Grill for about 6 minutes. Flip the chops and thoroughly brush with the glaze on the other side. Grill for about 2 more minutes, flip and brush again. Repeat this process until the chops cook for 10-12 minutes total, and reach an internal temperature of 145 degrees. If you're also grilling apples, brush the halved apples with glaze and grill for about 5-6 minutes. No need to flip. Serve along with the chops.", u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-apple-cider-pork-chops-682030', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}