{u'recipes': [{u'sourceName': u'Minimalist Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/500217-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 500217, u'veryPopular': True, u'lowFodmap': False, u'title': u'6 Ingredient Vegan Chocolate Silk Pie', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 116.26, u'creditText': u'Minimalist Baker', u'extendedIngredients': [{u'originalString': u'1/3 cup unsweetened cocoa or cacao powder', u'aisle': u'Baking', u'name': u'cacao powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 3/4 cups dairy-free semisweet chocolate chips', u'aisle': u'Health Foods;Baking', u'name': u'dairy free chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 98848, u'unit': u'cups'}, {u'originalString': u'1 heaping (packed) cup pitted dates, soaked for 10 minutes in warm water and drained', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'packed', u'pitted', u'drained', u'for 10 minutes in warm water and ', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9087, u'unit': u'cup'}, {u'originalString': u'1/2 cup light or full fat coconut milk (or another dairy-free milk)', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [u'light', u'(or another dairy-free milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'12 ounces silken tofu, drained, patted dry', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'silken tofu', u'metaInformation': [u'dry', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 16161, u'unit': u'ounces'}, {u'originalString': u'1.5 cups raw walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://minimalistbaker.com/6-ingredient-vegan-chocolate-silk-pie/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Prepare the crust by pulsing walnuts and cocoa powder in a food processor until it reaches a fine meal.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}, {u'equipment': [], u'step': u'Remove and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place soaked dates in the food processor and process until small bits remain and it’s sticky.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [], u'step': u'Add back in the walnut-cocoa meal and process until well combined.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Transfer to a glass pie pan lightly oiled with coconut oil. Alternatively, place parchment in the bottom for easy removal.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place a piece of plastic wrap over the crumbs and press with your hands to form a uniform crust that goes up the sides (see photo). Pop in the freezer to set.Melt the chocolate chips over a double boiler or in the microwave in 30 second increments. Once melted, work quickly to add to a blender along with the tofu and coconut (or other dairy free) milk. Blend until smooth, about 1 minute, scraping down the sides as needed.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over crust and smooth. Cover and freeze until set. Alternatively, refrigerate for at least 2 hours or until pretty firm. For easiest serving and longer storage, freeze.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve and top with coconut whipped cream. Will keep in the fridge for several days, though best when fresh. Freeze for up to a few weeks, covered well.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Vin Santo, Late Harvest Riesling, and Lambrusco Dolce are great choices for Silk Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The McFadden Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'vin santo', u'late harvest riesling', u'lambrusco dolce'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 1792, u'instructions': u'Prepare the crust by pulsing walnuts and cocoa powder in a food processor until it reaches a fine meal. Remove and set aside.Place soaked dates in the food processor and process until small bits remain and it’s sticky. Add back in the walnut-cocoa meal and process until well combined.Transfer to a glass pie pan lightly oiled with coconut oil. Alternatively, place parchment in the bottom for easy removal. Place a piece of plastic wrap over the crumbs and press with your hands to form a uniform crust that goes up the sides (see photo). Pop in the freezer to set.Melt the chocolate chips over a double boiler or in the microwave in 30 second increments. Once melted, work quickly to add to a blender along with the tofu and coconut (or other dairy free) milk. Blend until smooth, about 1 minute, scraping down the sides as needed.Pour over crust and smooth. Cover and freeze until set. Alternatively, refrigerate for at least 2 hours or until pretty firm. For easiest serving and longer storage, freeze.Serve and top with coconut whipped cream. Will keep in the fridge for several days, though best when fresh. Freeze for up to a few weeks, covered well.', u'spoonacularSourceUrl': u'https://spoonacular.com/6-ingredient-vegan-chocolate-silk-pie-500217', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}