{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/599067-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 599067, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chinese Five-Spice Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 11.61, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'2 1/2 teaspoons Chinese five-spice powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'5 spice powder', u'metaInformation': [u'chinese'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chinese-five-spice-powder.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 1002002, u'unit': u'teaspoons'}, {u'originalString': u'1 large egg, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups unsifted all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup superfine sugar (see LC Note)', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'(see LC Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 stick (4 ounces) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://leitesculinaria.com/7504/recipes-chinese-five-spice-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Dump the flour, Chinese five-spice powder, and salt in a small bowl and whisk thoroughly. Set aside.2. Using a handheld electric mixer, beat the sugar and butter in a large bowl until creamy and well combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the egg and vanilla extract and mix until fluffy, about 1 minute.3. Stir in the flour-spice mixture just until incorporated. Form the dough into a disk, wrap it in plastic, and refrigerate for 1 hour.4. Position a rack in the middle of the oven and heat the oven to 375\xb0F (190\xb0C). Unwrap the dough, place it on a new piece of plastic wrap, and roll the dough to 1/4-inch thickness. Slide the wrap and the dough onto a baking sheet and place the whole shebang in the freezer for 5 minutes to firm it slightly.5.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Remove the sheet and the cookies from the freezer and quickly cut out the spice cookies with a 2 1/2-inch round cookie or biscuit cutter, spacing them 1/2-inch apart on a parchment-lined baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake until the edges are golden brown, 12 to 15 minutes. Immediately transfer the spice cookies to a wire rack to cool. (The cookies will keep in an airtight container for up to 1 week.)', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'1. Dump the flour, Chinese five-spice powder, and salt in a small bowl and whisk thoroughly. Set aside.2. Using a handheld electric mixer, beat the sugar and butter in a large bowl until creamy and well combined. Add the egg and vanilla extract and mix until fluffy, about 1 minute.3. Stir in the flour-spice mixture just until incorporated. Form the dough into a disk, wrap it in plastic, and refrigerate for 1 hour.4. Position a rack in the middle of the oven and heat the oven to 375\xb0F (190\xb0C). Unwrap the dough, place it on a new piece of plastic wrap, and roll the dough to 1/4-inch thickness. Slide the wrap and the dough onto a baking sheet and place the whole shebang in the freezer for 5 minutes to firm it slightly.5. Remove the sheet and the cookies from the freezer and quickly cut out the spice cookies with a 2 1/2-inch round cookie or biscuit cutter, spacing them 1/2-inch apart on a parchment-lined baking sheet. Bake until the edges are golden brown, 12 to 15 minutes. Immediately transfer the spice cookies to a wire rack to cool. (The cookies will keep in an airtight container for up to 1 week.)', u'spoonacularSourceUrl': u'https://spoonacular.com/chinese-five-spice-cookies-599067', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}