{u'recipes': [{u'sourceName': u'Seeded at the Table', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528121-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 528121, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pinterest Party: Red Velvet Cake Pie', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 60.2, u'creditText': u'Seeded at the Table', u'extendedIngredients': [{u'originalString': u'1/2 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1/2 cup miniature chocolate chips, for garnish (optional)', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'miniature', u'for garnish '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 box red velvet cake mix', u'aisle': u'Baking', u'name': u'red velvet cake mix', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-velvet-cake.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 10018099, u'unit': u'box'}, {u'originalString': u'1 bag (12 oz.) semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'oz'}, {u'originalString': u'1 can (14 oz.) sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'2 unbaked refrigerated pie crusts (such as Pillsbury)', u'aisle': u'Refrigerated', u'name': u'unbaked pie crusts', u'metaInformation': [u'refrigerated', u'(such as Pillsbury)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'1\xbc Cups Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'Cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.seededatthetable.com/2014/02/24/pinterest-party-red-velvet-cake-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Remove pie crusts from packaging and allow to rest on the counter at room temperature for 10-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Roll the pie crusts into the bottom of two ungreased 9-inch pie plates. Meanwhile, preheat oven to 350 degrees F.In a medium mixing bowl, prepare the cake mix according to the box directions.  Evenly divide the batter into the two pie crusts.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 30 to 35 minutes, or until the pie crusts are golden and a toothpick inserted into the middle of each cake comes out clean.  If one cake is done before the other, simply remove that cake from the oven and allow a few more minutes for the other to bake through.  Watch the pie crusts.  If they start to brown too much, cover the edges loosely with foil to prevent burning.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove cakes from the oven and let cool.In a medium pot, heat the butter, chocolate chips and sweetened condensed milk over medium heat, stirring until melted together and smooth.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Pour evenly over both pie crusts.  Immediately sprinkle with miniature chocolate chips for garnish (optional).  Work quickly, as the chocolate icing sets fast!Allow the cake to cool completely (at least 2 hours for best results) before slicing.  You can store covered at room temperature or in the fridge for up to 2 days.Recipe Source:  Pizzazzerie', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'mini chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Angel Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 107, u'instructions': u'<p>Remove pie crusts from packaging and allow to rest on the counter at room temperature for 10-15 minutes.  Roll the pie crusts into the bottom of two ungreased 9-inch pie plates. Meanwhile, preheat oven to 350 degrees F.</p><p>In a medium mixing bowl, prepare the cake mix according to the box directions.  Evenly divide the batter into the two pie crusts.  Bake for 30 to 35 minutes, or until the pie crusts are golden and a toothpick inserted into the middle of each cake comes out clean.  If one cake is done before the other, simply remove that cake from the oven and allow a few more minutes for the other to bake through.  Watch the pie crusts.  If they start to brown too much, cover the edges loosely with foil to prevent burning.  Remove cakes from the oven and let cool.</p><p>In a medium pot, heat the butter, chocolate chips and sweetened condensed milk over medium heat, stirring until melted together and smooth.  Pour evenly over both pie crusts.  Immediately sprinkle with miniature chocolate chips for garnish (optional).  Work quickly, as the chocolate icing sets fast!</p><p>Allow the cake to cool completely (at least 2 hours for best results) before slicing.  You can store covered at room temperature or in the fridge for up to 2 days.</p><p>Recipe Source:  Pizzazzerie</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/pinterest-party-red-velvet-cake-pie-528121', u'dishTypes': [u'dessert'], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}