{u'recipes': [{u'sourceName': u'A Farm Girls Dabbles', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/497635-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 497635, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow Cooker Coconut Curry Beef', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 262.05, u'creditText': u'A Farm Girls Dabbles', u'extendedIngredients': [{u'originalString': u'3-1/2 to 4 lbs. beef chuck roast, cut into 6 pieces, trimmed of obvious excess fat', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'trimmed', u'cut into 6 pieces,  of obvious excess fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 13786, u'unit': u'lbs'}, {u'originalString': u'freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 T. brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'T'}, {u'originalString': u'1 T. coconut or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'T'}, {u'originalString': u'1 15-oz. can regular coconut milk (not the light version)', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'light', u'canned', u'(not the version)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'oz'}, {u'originalString': u'1 tsp. cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1/2 c. chopped fresh cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'c'}, {u'originalString': u'2 T. minced fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'T'}, {u'originalString': u'8 oz. fresh mushrooms, thinly sliced', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'4 large cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'zest and juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'lime wedges', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'1 red bell pepper, cut into 1" pieces', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cut into 1" pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/4 tsp. red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'4 large scallions, thinly sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 T. Thai fish sauce', u'aisle': u'Ethnic Foods', u'name': u'thai fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'T'}, {u'originalString': u'2 T. green Thai curry paste (located in the Asian foods section at the grocery store)', u'aisle': u'Ethnic Foods', u'name': u'thai red curry paste', u'metaInformation': [u'green', u'(located in the Asian foods section at the grocery store)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93605, u'unit': u'T'}, {u'originalString': u'1 yellow bell pepper, cut into 1" pieces', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'cut into 1" pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}, {u'originalString': u'1 large yellow onion, cut into 1" pieces', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'cut into 1" pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.afarmgirlsdabbles.com/2014/01/06/slow-cooker-coconut-curry-beef-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'I own a multicooker that allows me to both brown and slow cook in the same appliance. If you do not have this functionality, start by heating a large heavy pot or French oven over medium-high heat. Sprinkle beef pieces fairly generously with salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add oil to the pan. When oil is hot and shimmery, add the beef pieces and brown so that each side has a beautiful browned crust to it.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Remove beef to slow cooker and turn heat to the low setting. If you own a multicooker, turn heat to the brown/saut setting and let it heat up for a minute or two.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add oil. When oil is hot and shimmery, add the beef pieces and brown so that each side has a beautiful browned crust to it.To the slow cooker, add the coconut milk, curry paste, lime zest and juice, fish sauce, brown sugar, cumin, and red pepper flakes. Stir to combine. Then add onion, bell peppers, mushrooms, garlic, ginger, and black pepper. Stir to coat all of the veggies with the coconut milk mixture. Cover slow cooker and turn heat setting to high. Cook for 4 to 5 hours, or until beef is fork tender and falling apart.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'id': 93605, u'name': u'curry paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Remove beef to a cutting board and pull apart using two forks.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add beef back to the slow cooker.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Serve over hot rice, with scallions, cilantro, and lime wedges on the side.Notes:Feel free to experiment with your favorite veggies in this dish. To mix it up, I also like to include more bell peppers, thinly sliced carrots, halved fresh pea pods, and minced fresh jalapeo. If you aren't fond of cilantro, try thinly sliced fresh basil, as Stephanie includes in her original braised recipe. Change it up to your family's taste buds...that's what great cooking is all about!For braising preparation instructions using a French oven, please visit theoriginal braised recipefrom Stephanie at fresh tart.", u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'aggregateLikes': 3114, u'instructions': u"I own a multicooker that allows me to both brown and slow cook in the same appliance. If you do not have this functionality, start by heating a large heavy pot or French oven over medium-high heat. Sprinkle beef pieces fairly generously with salt. Add oil to the pan. When oil is hot and shimmery, add the beef pieces and brown so that each side has a beautiful browned crust to it. Remove beef to slow cooker and turn heat to the low setting. If you own a multicooker, turn heat to the brown/saut setting and let it heat up for a minute or two. Add oil. When oil is hot and shimmery, add the beef pieces and brown so that each side has a beautiful browned crust to it.To the slow cooker, add the coconut milk, curry paste, lime zest and juice, fish sauce, brown sugar, cumin, and red pepper flakes. Stir to combine. Then add onion, bell peppers, mushrooms, garlic, ginger, and black pepper. Stir to coat all of the veggies with the coconut milk mixture. Cover slow cooker and turn heat setting to high. Cook for 4 to 5 hours, or until beef is fork tender and falling apart. Remove beef to a cutting board and pull apart using two forks. Add beef back to the slow cooker. Serve over hot rice, with scallions, cilantro, and lime wedges on the side.Notes:Feel free to experiment with your favorite veggies in this dish. To mix it up, I also like to include more bell peppers, thinly sliced carrots, halved fresh pea pods, and minced fresh jalapeo. If you aren't fond of cilantro, try thinly sliced fresh basil, as Stephanie includes in her original braised recipe. Change it up to your family's taste buds...that's what great cooking is all about!For braising preparation instructions using a French oven, please visit theoriginal braised recipefrom Stephanie at fresh tart.", u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-coconut-curry-beef-497635', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}