{u'recipes': [{u'sourceName': u'The First Year Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/628792-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 628792, u'veryPopular': False, u'lowFodmap': False, u'title': u'Over the Top Chocolate Cheesecake Oreo Parfaits', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 33.12, u'creditText': u'The First Year Blog', u'extendedIngredients': [{u'originalString': u'oreo fluff: 1 box white chocolate pudding + 2 cups milk + 1 sleeve crushed oreos + 1/2 container cool whip', u'aisle': u'Sweet Snacks;Health Foods', u'name': u'chocolate soy pudding', u'metaInformation': [u'white', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'liquid', u'id': 93700, u'unit': u'box'}, {u'originalString': u'chocolate cheesecake filling : 1/2 cup heavy cream + 12 oz chocolate chips + 8 oz cream cheese, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 handful of mini marshmallows per parfait', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini', u'per parfait'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u'handful'}, {u'originalString': u'cool whip, to top each parfait', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'to top each parfait'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1200, u'unit': u'servings'}, {u'originalString': u'oreo, to top each parfait', u'aisle': u'Sweet Snacks', u'name': u'oreo', u'metaInformation': [u'to top each parfait'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u'servings'}, {u'originalString': u'1 & 1/2 sleeves of oreos, crushed for the bottom of the parfaits', u'aisle': u'?', u'name': u'&', u'metaInformation': [u'crushed', u'for the bottom of the parfaits'], u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://thefirstyearblog.com/over-the-top-chocolate-cheesecake-oreo-parfaits/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine 1 box of white chocolate pudding mix with 2 cups of milk. Beat using an electric mixture until smooth and combined with pudding. Allow the pudding to set in the fridge for 10 minutes. Once set, take half of the crushed oreos and half a container of cool whip and mix them into the white chocolate pudding until combined. Return the oreo fluff to the fridge until needed.To make the chocolate cheesecake: In a small saucepan over low heat, combine the chocolate chips and heavy cream. Stir occasionally, until the chips are melted and smooth. This may take up to 10 minutes, but keep the heat on low or a little higher than low.Once melted, remove the pan from the heat and allow it to cool on the counter for 10 minutes.Once the chocolate is cool, combine the melted chocolate and softened cream cheese in a mixing bowl. Beat using an electric mixer until the mixture is smooth and no lumps remain.To assemble the parfaits: Put 3 tbsp of oreo crumbs in the bottom of each parfait glass.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [], u'step': u'Place a handful of mini marshmallows on top of the oreo layer. Next, add about 3 spoonfuls of oreo fluff to each glass, use the spoon to smooth the oreo fluff into an even layer. On top of the oreo fluff add a layer of chocolate cheesecake filling, using about 3 spoonfuls, then use the spoon to smooth the cheesecake filling into an even layer. Top the parfaits with cool whip. I like to transfer the cool whip into a piping bag and pipe the cool whip on top of each parfait. Top each parfait with an oreo.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [], u'step': u'Serve and enjoy!', u'number': 3, u'ingredients': []}], u'name': u'Crush 2 & 1/2 sleeves of Oreos. I like to stick the oreos in a ziploc bag and crush them using my rolling pin, they dont necessarily have to be oreo crumbs, but not large chunks. Set aside.To make the oreo fluff'}], u'winePairing': {u'pairingText': u"Cookies can be paired with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 226, u'instructions': u'Crush 2 & 1/2 sleeves of Oreos. I like to stick the oreos in a ziploc bag and crush them using my rolling pin, they dont necessarily have to be oreo crumbs, but not large chunks. Set aside.To make the oreo fluff: Combine 1 box of white chocolate pudding mix with 2 cups of milk. Beat using an electric mixture until smooth and combined with pudding. Allow the pudding to set in the fridge for 10 minutes. Once set, take half of the crushed oreos and half a container of cool whip and mix them into the white chocolate pudding until combined. Return the oreo fluff to the fridge until needed.To make the chocolate cheesecake: In a small saucepan over low heat, combine the chocolate chips and heavy cream. Stir occasionally, until the chips are melted and smooth. This may take up to 10 minutes, but keep the heat on low or a little higher than low.Once melted, remove the pan from the heat and allow it to cool on the counter for 10 minutes.Once the chocolate is cool, combine the melted chocolate and softened cream cheese in a mixing bowl. Beat using an electric mixer until the mixture is smooth and no lumps remain.To assemble the parfaits: Put 3 tbsp of oreo crumbs in the bottom of each parfait glass. Place a handful of mini marshmallows on top of the oreo layer. Next, add about 3 spoonfuls of oreo fluff to each glass, use the spoon to smooth the oreo fluff into an even layer. On top of the oreo fluff add a layer of chocolate cheesecake filling, using about 3 spoonfuls, then use the spoon to smooth the cheesecake filling into an even layer. Top the parfaits with cool whip. I like to transfer the cool whip into a piping bag and pipe the cool whip on top of each parfait. Top each parfait with an oreo.Serve and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/over-the-top-chocolate-cheesecake-oreo-parfaits-628792', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}