{u'recipes': [{u'sourceName': u'Jo Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/628306-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 628306, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweetie Cherry Pie Lollipops', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 6.68, u'creditText': u'Jo Cooks', u'extendedIngredients': [{u'originalString': u'\xbd cup cherry pie filling', u'aisle': u'Baking', u'name': u'cherry pie filling', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-pie-filling.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19314, u'unit': u'cup'}, {u'originalString': u'1 egg beaten, for egg wash', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten', u'for egg wash'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 pkg puff pastry (2 sheets)', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'(2 sheets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'pkgsheet', u'unitShort': u'pkgsheets', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'pkgsheets'}, {u'originalString': u'turbinado sugar, optional', u'aisle': u'Health Foods;Baking', u'name': u'turbinado sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 30.0, u'consistency': u'solid', u'id': 19908, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.jocooks.com/bakery/pies-bakery/sweetie-cherry-pie-lollipops/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 F degrees. Line a baking sheet with parchment paper.Dust your working area with a bit of flour.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u"Roll out a pastry sheet so that it's about 12 inches by 12 inches. Using a 2 inch heart shaped cookie cutter, cut pastry into hearts, I did about 5 per row and 4 rows per sheet. Pull up the remaining pastry and set aside.", u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u"Place a cherry or a tsp of the cherry filling into 10 of the hearts. You don't want to use too much cherry filling because it will be hard to top with pastry.", u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place a lollipop stick in each heart pastry. Top with 10 remaining heart pastries and press the edges with a fork to seal.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on prepared baking sheet.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush with egg wash, and sprinkle some turbinado sugar on each lollipop.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'id': 19908, u'name': u'turbinado sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut a small slit into each lollipop with a small knife.Repeat with remaining puff pastry sheet. Take the remaining dough and knead it a couple times then roll it out into a square just like with the other sheets. Repeat step 2.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [], u'step': u'Bake for about 20 to 25 minutes or until golden brown.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try McFadden Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 60, u'instructions': u"Preheat oven to 350 F degrees. Line a baking sheet with parchment paper.Dust your working area with a bit of flour. Roll out a pastry sheet so that it's about 12 inches by 12 inches. Using a 2 inch heart shaped cookie cutter, cut pastry into hearts, I did about 5 per row and 4 rows per sheet. Pull up the remaining pastry and set aside.Place a cherry or a tsp of the cherry filling into 10 of the hearts. You don't want to use too much cherry filling because it will be hard to top with pastry. Place a lollipop stick in each heart pastry. Top with 10 remaining heart pastries and press the edges with a fork to seal. Place on prepared baking sheet. Brush with egg wash, and sprinkle some turbinado sugar on each lollipop. Cut a small slit into each lollipop with a small knife.Repeat with remaining puff pastry sheet. Take the remaining dough and knead it a couple times then roll it out into a square just like with the other sheets. Repeat step 2.Bake for about 20 to 25 minutes or until golden brown.", u'spoonacularSourceUrl': u'https://spoonacular.com/sweetie-cherry-pie-lollipops-628306', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 30, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}