{u'recipes': [{u'sourceName': u'My Kitchenes Capades', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/628781-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 628781, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Best Cinnamon Rolls', u'diets': [], u'pricePerServing': 50.82, u'creditText': u'My Kitchenes Capades', u'extendedIngredients': [{u'originalString': u'Glaze', u'aisle': u'Ethnic Foods;Condiments', u'name': u'teriyaki glaze', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 6112, u'unit': u'servings'}, {u'originalString': u'6 Tb butter, soft', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tb'}, {u'originalString': u'1 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 1/4 C dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 10019334, u'unit': u'C'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Dough', u'aisle': u'Refrigerated;Frozen', u'name': u'filo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 18338, u'unit': u'servings'}, {u'originalString': u'3 1/2 C flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'solid', u'id': 20081, u'unit': u'C'}, {u'originalString': u'2 Tb ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Tb'}, {u'originalString': u'1/2 tsp ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1 Tb + 2 tsp whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tb'}, {u'originalString': u'1 C powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'C'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1/3 C sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'C'}, {u'originalString': u'1/4 tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 C whole milk (yes, use whole milk!)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'(yes, use milk!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'C'}, {u'originalString': u'2 1/4 tsp yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.mykitchenescapades.com/2015/02/best-cinnamon-rolls.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In your stand mixer with your paddle attachment, mix together the flour, yeast and sugar.  In a medium microwave safe bowl, heat the milk and butter for 1 1/2 minutes on high so the butter melts.  Turn the mixer on and slowly add the milk to the bowl, then the eggs, cinnamon and salt.  Beat for 2 minutes, then stop the mixer to scrape down the sides of the bowl.  Beat again for another 3 minutes then transfer the very soft and very sticky dough into a large greased bowl and cover with plastic wrap.  Allow it to rise in a warm, draft free place for 2 hours.  I stick mine inside the microwave :)', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the brown sugar, cinnamon and nutmeg together in a small bowl.  Once the dough has risen, roll it out onto a floured counter top to a 16 x 12 inch rectangle.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread the soft butter over the dough then sprinkle the filling evenly over the butter.  Starting at the long edge, roll the dough tightly into a log and pinch the seam closed with your fingers.  With the seam side down, cut dough into 16 equal pieces with a very sharp, thin knife.Grease two 9 inch round cake pans and evenly place the rolls in the pans.  Cover with plastic wrap and allow to rise for 45-60 minutes until almost doubled in volume.  Preheat oven to 375 degrees and bake the rolls until golden brown on top, about 18 minutes.', u'length': {u'number': 78, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Mix together the glaze.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and invert immediately onto a cooling rack.  Cool for 10 minutes and then invert onto a plate so the right side is up.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle the rolls with the glaze and serve immediately.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 46, u'instructions': u'In your stand mixer with your paddle attachment, mix together the flour, yeast and sugar.  In a medium microwave safe bowl, heat the milk and butter for 1 1/2 minutes on high so the butter melts.  Turn the mixer on and slowly add the milk to the bowl, then the eggs, cinnamon and salt.  Beat for 2 minutes, then stop the mixer to scrape down the sides of the bowl.  Beat again for another 3 minutes then transfer the very soft and very sticky dough into a large greased bowl and cover with plastic wrap.  Allow it to rise in a warm, draft free place for 2 hours.  I stick mine inside the microwave :)Mix the brown sugar, cinnamon and nutmeg together in a small bowl.  Once the dough has risen, roll it out onto a floured counter top to a 16 x 12 inch rectangle.  Spread the soft butter over the dough then sprinkle the filling evenly over the butter.  Starting at the long edge, roll the dough tightly into a log and pinch the seam closed with your fingers.  With the seam side down, cut dough into 16 equal pieces with a very sharp, thin knife.Grease two 9 inch round cake pans and evenly place the rolls in the pans.  Cover with plastic wrap and allow to rise for 45-60 minutes until almost doubled in volume.  Preheat oven to 375 degrees and bake the rolls until golden brown on top, about 18 minutes.  Mix together the glaze.  Remove from the oven and invert immediately onto a cooling rack.  Cool for 10 minutes and then invert onto a plate so the right side is up.  Drizzle the rolls with the glaze and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-best-cinnamon-rolls-628781', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}