{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/215769-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 215769, u'veryPopular': True, u'lowFodmap': False, u'title': u'Summer sausage rolls', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 42.36, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'3 rashers streaky bacon, thinly sliced', u'aisle': u'Meat', u'name': u'bacon rashers', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'2 large skinless chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'skinless', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1 egg yolk, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'handful basil leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'handful'}, {u'originalString': u'1 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'375g 13oz pack ready-rolled puff pastry', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 375.0, u'consistency': u'solid', u'id': 18337, u'unit': u'g'}, {u'originalString': u'25g sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 12023, u'unit': u'g'}, {u'originalString': u'4 sundried tomatoes, chopped', u'aisle': u'Canned and Jarred;Produce', u'name': u'sundried tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11955, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/11610/summer-sausage-rolls', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Whizz the chicken and garlic in aprocessor until the chicken is minced.Tip in the bacon, sundried tomatoesand basil. Pulse for 5 secs to just mixthrough. Season well.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Roll the pastry sheet on a lightly flouredsurface and cut in half lengthways.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Spreadhalf the chicken mixture along the middleof one of the pastry strips, then roll upthe pastry, pinching the ends together toseal. Using a sharp knife, cut into 2.5cmlong pieces. Repeat with the remainingpastry strip. Can be frozen, uncooked,for up to 1 month.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the rolls on a large baking sheet.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush with the egg, then sprinkle withseeds.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 20 mins until golden.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Viva Diva Moscato Colada. Reviewers quite like it with a 4.9 out of 5 star rating and a price of about 11 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Sweet Moscato wine infused with natural coconut & pineapple flavor. Light orange in color. Fruity, typical of coconut & pineapple with light hints of Moscato. Excellent as an aperitif or mixing with cocktails.   View More', u'title': u'Viva Diva Moscato Colada', u'price': u'$10.99', u'id': 465263, u'link': u'https://www.wine.com/product/viva-diva-moscato-colada/138557', u'imageUrl': u'https://spoonacular.com/productImages/465263-312x231.jpg'}]}, u'aggregateLikes': 3467, u'instructions': u'Whizz the chicken and garlic in aprocessor until the chicken is minced.Tip in the bacon, sundried tomatoesand basil. Pulse for 5 secs to just mixthrough. Season well.Roll the pastry sheet on a lightly flouredsurface and cut in half lengthways. Spreadhalf the chicken mixture along the middleof one of the pastry strips, then roll upthe pastry, pinching the ends together toseal. Using a sharp knife, cut into 2.5cmlong pieces. Repeat with the remainingpastry strip. Can be frozen, uncooked,for up to 1 month.Heat oven to 200C/180C fan/gas 6.Place the rolls on a large baking sheet.Brush with the egg, then sprinkle withseeds. Bake for 20 mins until golden.', u'spoonacularSourceUrl': u'https://spoonacular.com/summer-sausage-rolls-215769', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}