{u'recipes': [{u'sourceName': u'The Kitchen Magpie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/571237-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 571237, u'veryPopular': False, u'lowFodmap': False, u'title': u'Red Wine & Mushroom Pork Tenderloin', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 12, u'pricePerServing': 711.34, u'creditText': u'The Kitchen Magpie', u'extendedIngredients': [{u'originalString': u'1 cup of beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cup'}, {u'originalString': u'1 package of brown gravy mix', u'aisle': u'Canned and Jarred', u'name': u'brown gravy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 6998, u'unit': u'package'}, {u'originalString': u'1-2 lbs of tenderloin', u'aisle': u'Meat', u'name': u'elk tenderloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10017166, u'unit': u'lbs'}, {u'originalString': u'1 cup sliced fresh mushrooms', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'\xbd tsp of garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 Tbs margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 4073, u'unit': u'Tbs'}, {u'originalString': u'1 tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 cup of red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.thekitchenmagpie.com/red-wine-mushroom-pork-tenderloin', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Sprinkle the garlic and pepper over the tenderloin, then melt your margarine in a pan. When it’s nice and hot, quickly sear the tenderloin on all sides.Open your red wine and pour yourself a glass. I used a pinot noir, I think most reds will work just fine with this recipe.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place your seared roast(s) in a baking pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the wine, beef broth, and gravy mix together. I know it’s weird to use beef broth, but it really does work well.Wash and slice your mushrooms, I had about a cup and a half.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Pour the red wine mix over the pork.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in a 350 degree oven and cook until the internal temperature reaches 160. Pull it out of the oven and remove the roast. Cover it on the plate with foil to keep the heat in.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the remaining sauce into a pot. Now, I used a 9\xd79 pan, which means that I had less evaporation with my juices, so I needed to boil it off a bit. I would rather have to do this, than have too much evaporate in the oven and have no gravy at the end!And as always, you can add a bit of cornstarch and water to thicken it up if you are pressed for time.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve, and enjoy!', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pork Tenderloin on the menu? Try pairing with Malbec, Pinot Noir, and Sangiovese. Pinot noir's light body is great for lean cuts, medium bodied sangiovese complement meaty sauces, stews, and other multi-ingredient dishes, and full-bodied tannic malbec pairs with fatty cuts and barbecue. You could try Ernesto Catena Padrillos Malbec. Reviewers quite like it with a 4.8 out of 5 star rating and a price of about 15 dollars per bottle.", u'pairedWines': [u'malbec', u'pinot noir', u'sangiovese'], u'productMatches': [{u'description': u'Ripe, concentrated dark fruit aromas with hints of chocolate, black cherry and red currant fruit flavors with notes of sweet spices, soft, supple tannins and balanced bright acidity.', u'title': u'Ernesto Catena Padrillos Malbec', u'price': u'$14.99', u'id': 438162, u'link': u'https://www.wine.com/product/ernesto-catena-padrillos-malbec-2013/134759', u'imageUrl': u'https://spoonacular.com/productImages/438162-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'Sprinkle the garlic and pepper over the tenderloin, then melt your margarine in a pan. When it’s nice and hot, quickly sear the tenderloin on all sides.Open your red wine and pour yourself a glass. I used a pinot noir, I think most reds will work just fine with this recipe.Place your seared roast(s) in a baking pan.Mix the wine, beef broth, and gravy mix together. I know it’s weird to use beef broth, but it really does work well.Wash and slice your mushrooms, I had about a cup and a half.Pour the red wine mix over the pork. Place in a 350 degree oven and cook until the internal temperature reaches 160. Pull it out of the oven and remove the roast. Cover it on the plate with foil to keep the heat in.Pour the remaining sauce into a pot. Now, I used a 9\xd79 pan, which means that I had less evaporation with my juices, so I needed to boil it off a bit. I would rather have to do this, than have too much evaporate in the oven and have no gravy at the end!And as always, you can add a bit of cornstarch and water to thicken it up if you are pressed for time.Serve, and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/red-wine-mushroom-pork-tenderloin-571237', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}