{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/578685-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 578685, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beef and Vegetable Hand Pies', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 69.18, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'1/2 cup beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6008, u'unit': u'cup'}, {u'originalString': u'black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 26.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 cup carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1/2 cup chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 1/2 cups green cabbage', u'aisle': u'Produce', u'name': u'green cabbage', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11109, u'unit': u'cups'}, {u'originalString': u'1 pound ground sirloin', u'aisle': u'Meat', u'name': u'ground sirloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023567, u'unit': u'pound'}, {u'originalString': u'1/2 cup guinness draught', u'aisle': u'Alcoholic Beverages', u'name': u'guinness', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 93619, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup parsnip, diced', u'aisle': u'Produce', u'name': u'parsnip', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11298, u'unit': u'cup'}, {u'originalString': u'4 refrigerated pie crusts', u'aisle': u'Refrigerated', u'name': u'refrigerated pie crusts', u'metaInformation': [u'refrigerated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'1 large red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 cup russet potato, peeled and diced', u'aisle': u'Produce', u'name': u'russet potato', u'metaInformation': [u'diced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u'cup'}, {u'originalString': u'salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 26.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.foodfanatic.com/recipes/beef-and-vegetable-hand-pies-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, heat olive oil over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add garlic and stir for 1 minute or until just fragrant.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add onion, carrot, and celery; cook, stirring frequently, until vegetables start to become soft.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add parsnip, potato and cabbage and cook for 5-7 minutes, stirring often, until potatoes and cabbage begin to brown.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add ground sirloin and stir, breaking up meat with a wooden spoon, until it is evenly browned; about 5 more minutes.To the pan, add tomato paste, Worcestershire sauce, and thyme. Cook for 2 minutes or until tomato paste begins to take on a golden hue.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023567, u'name': u'ground sirloin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Pour in Guinness and beef broth; cover and allow mixture to simmer for 15 minutes or until all the vegetables are tender. Season mixture with salt and pepper to taste.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'id': 93619, u'name': u'guinness'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place a heaping tablespoon (close to two tablespoons) of beef mixture in the center of one dough round. Using a wet finger, lightly wet the edges of the dough.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place a second dough round on top of the mixture and gently press dough around and down to meet the bottom crust. Use your fingers or a fork to crimp the edges of the two dough rounds together, sealing in the beef filling. Repeat with remaining dough rounds and beef filling.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place assembled pies on prepared baking sheets. Using the sharp tip of a pairing knife, make three small slits or vents in the top of each pie.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake pies for 12-15 minutes, or until golden brown, rotating sheets half way through baking time.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u'Remove from heat and use a potato masher to mash the mixture slightly. Allow the beef mixture to cool slightly while you prepare the crust.Preheat oven to 400 degrees. Make sure oven racks are positioned in the upper and lower thirds of the oven. Line 2 baking sheets with parchment paper and set aside.On a lightly floured work surface, roll out the first pie crust until you have about a 14 inch circle. Use a 3-inch round cutter to cut rounds out of the dough, re-rolling the dough as needed. You should be able to get about 12-15 rounds out of each pie crust. Repeat with remaining pie crusts. Keep small rounds of dough under a slightly damp kitchen towel until ready to use.Assemble the Pies'}], u'winePairing': {}, u'aggregateLikes': 30, u'instructions': u'In a large skillet, heat olive oil over medium heat. Add garlic and stir for 1 minute or until just fragrant. Add onion, carrot, and celery; cook, stirring frequently, until vegetables start to become soft. Add parsnip, potato and cabbage and cook for 5-7 minutes, stirring often, until potatoes and cabbage begin to brown. Add ground sirloin and stir, breaking up meat with a wooden spoon, until it is evenly browned; about 5 more minutes.To the pan, add tomato paste, Worcestershire sauce, and thyme. Cook for 2 minutes or until tomato paste begins to take on a golden hue. Pour in Guinness and beef broth; cover and allow mixture to simmer for 15 minutes or until all the vegetables are tender. Season mixture with salt and pepper to taste. Remove from heat and use a potato masher to mash the mixture slightly. Allow the beef mixture to cool slightly while you prepare the crust.Preheat oven to 400 degrees. Make sure oven racks are positioned in the upper and lower thirds of the oven. Line 2 baking sheets with parchment paper and set aside.On a lightly floured work surface, roll out the first pie crust until you have about a 14 inch circle. Use a 3-inch round cutter to cut rounds out of the dough, re-rolling the dough as needed. You should be able to get about 12-15 rounds out of each pie crust. Repeat with remaining pie crusts. Keep small rounds of dough under a slightly damp kitchen towel until ready to use.Assemble the Pies:Place a heaping tablespoon (close to two tablespoons) of beef mixture in the center of one dough round. Using a wet finger, lightly wet the edges of the dough. Place a second dough round on top of the mixture and gently press dough around and down to meet the bottom crust. Use your fingers or a fork to crimp the edges of the two dough rounds together, sealing in the beef filling. Repeat with remaining dough rounds and beef filling. Place assembled pies on prepared baking sheets. Using the sharp tip of a pairing knife, make three small slits or vents in the top of each pie.Bake pies for 12-15 minutes, or until golden brown, rotating sheets half way through baking time.', u'spoonacularSourceUrl': u'https://spoonacular.com/beef-and-vegetable-hand-pies-578685', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 26, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}