{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/209691-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 209691, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eggnog French Toast with Cranberry-Apple Compote', u'diets': [], u'pricePerServing': 112.46, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'Cranberry-Apple Compote', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 9003, u'unit': u'servings'}, {u'originalString': u'1 14.5-ounce country white bread loaf, halved horizontally, each half cut crosswise into 8 slices (do not use ends)', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'white', u'halved', u'(do not use ends)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 18064, u'unit': u'ounce'}, {u'originalString': u'4 cups purchased eggnog', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggnog', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-nog.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1057, u'unit': u'cups'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'Powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'1/4 cup (1/2 stick) unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'(1/2 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Eggnog-French-Toast-with-Cranberry-Apple-Compote-105976', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk first 4 ingredients in large bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place bread slices in single layer in two 13x9x2-inch glass baking dishes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Pour custard over bread, dividing equally. Cover dishes and refrigerate at least 6 hours or overnight.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450\xb0F. Butter 2 large rimmed baking sheets with some melted butter. Using spatula, transfer bread slices to prepared baking sheets.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Brush bread with remaining melted butter.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Bake 10 minutes. Turn over bread slices and bake until golden brown and crisp on the outside but soft on the inside, about 6 minutes longer.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Place 2 French toast slices on each of 8 plates. Dust generously with powdered sugar; serve with Cranberry-Apple Compote', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'aggregateLikes': 338, u'instructions': u'Preparation                                                        Whisk first 4 ingredients in large bowl. Place bread slices in single layer in two 13x9x2-inch glass baking dishes. Pour custard over bread, dividing equally. Cover dishes and refrigerate at least 6 hours or overnight.                                                                Preheat oven to 450\xb0F. Butter 2 large rimmed baking sheets with some melted butter. Using spatula, transfer bread slices to prepared baking sheets. Brush bread with remaining melted butter. Bake 10 minutes. Turn over bread slices and bake until golden brown and crisp on the outside but soft on the inside, about 6 minutes longer. Place 2 French toast slices on each of 8 plates. Dust generously with powdered sugar; serve with Cranberry-Apple Compote', u'spoonacularSourceUrl': u'https://spoonacular.com/eggnog-french-toast-with-cranberry-apple-compote-209691', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}