{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'european', u'irish'], u'image': u'https://spoonacular.com/recipeImages/221997-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 221997, u'veryPopular': False, u'lowFodmap': False, u'title': u'Loin of bacon with colcannon butter sauce', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 179.6, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'small knob of butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'50g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'5 Savoy cabbages leaves, finely shredded', u'aisle': u'Produce', u'name': u'savoy cabbage leaves', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/savoy-cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10011114, u'unit': u''}, {u'originalString': u'8 cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'3 tbsp clear honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'clear honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'200ml double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'1 medium egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 leeks, trimmed, green and white parts separted and both finely sliced', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'white', u'green', u'trimmed', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'chopped parsley, to serve', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1 tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'1 small potato, finely diced', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'diced', u'small', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'3 potatoes, boiled and mashed', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'boiled', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'4 tbsp white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'tbsp'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2664/loin-of-bacon-with-colcannon-butter-sauce', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the bacon in one tier of a steamer, cover and steam for 45 mins, then allow to cool. Once cooled, slice into 4 thick chops and set aside. To make the potato cakes, fry the dark green part of the leek in a little butter, and mix well with the potato, flour, cream and egg yolk, then mould into four small round discs. Set aside until ready to serve. To make the sauce, melt half the butter in a pan and add the cabbage and potato. Cook slowly for 5 mins, then pour in the white wine and reduce by half.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Add the cream and reduce by half. Season and remove from the heat. Stir the rest of the butter into the sauce and keep warm until ready to serve.When ready to serve, heat oven to 220C/fan 200C/gas 7. Lay the bacon on a roasting tray and brush with the honey. Roast for 10-15 mins, until the honey caramelises, brushing the chops with the sticky juices halfway through. Sweat the remaining white part of the leeks and tomatoes in some butter for 3 mins, then season. Fry the potato cakes in the remaining butter for 2 mins on each side. To serve, place a potato cake on each plate with a spoonful of leek and cherry tomatoes. Lay a bacon chop over the top, drizzle the sauce on the plate, scatter over a little chopped parsley and serve.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 11, u'instructions': u'Place the bacon in one tier of a steamer, cover and steam for 45 mins, then allow to cool. Once cooled, slice into 4 thick chops and set aside. To make the potato cakes, fry the dark green part of the leek in a little butter, and mix well with the potato, flour, cream and egg yolk, then mould into four small round discs. Set aside until ready to serve. To make the sauce, melt half the butter in a pan and add the cabbage and potato. Cook slowly for 5 mins, then pour in the white wine and reduce by half. Add the cream and reduce by half. Season and remove from the heat. Stir the rest of the butter into the sauce and keep warm until ready to serve.When ready to serve, heat oven to 220C/fan 200C/gas 7. Lay the bacon on a roasting tray and brush with the honey. Roast for 10-15 mins, until the honey caramelises, brushing the chops with the sticky juices halfway through. Sweat the remaining white part of the leeks and tomatoes in some butter for 3 mins, then season. Fry the potato cakes in the remaining butter for 2 mins on each side. To serve, place a potato cake on each plate with a spoonful of leek and cherry tomatoes. Lay a bacon chop over the top, drizzle the sauce on the plate, scatter over a little chopped parsley and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/loin-of-bacon-with-colcannon-butter-sauce-221997', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}