{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/668-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 668, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow-roasted Cherry Tomato Bruschetta', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 43.0, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'Anchovy fillets, Kalamata olives or sliced fresh basil, for garnish', u'aisle': u'Seafood', u'name': u'anchovy fillets', u'metaInformation': [u'fresh', u'sliced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 60.0, u'consistency': u'solid', u'id': 15001, u'unit': u'servings'}, {u'originalString': u'14 slices baguette, (preferably whole-wheat), toasted', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'whole-wheat', u'toasted', u'(preferably )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 14.0, u'consistency': u'solid', u'id': 18033, u'unit': u'slices'}, {u'originalString': u'3 pints cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 3.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'pints'}, {u'originalString': u'1/4 cup sliced fresh basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'3 cloves minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 Tbsp extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1/2 tsp freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp red-wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'Tbsp'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/slow_roasted_cherry_tomato_bruschetta.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325F.Toss tomatoes with oil, garlic, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on a baking sheet and roast until broken down, 45 to 55 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the roasted tomatoes with basil and vinegar.Top baguette slices with the roasted tomato mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Garnish with anchovy fillets, Kalamata olives or sliced fresh basil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovy fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Mionetto Cuvee Sergio Prosecco. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'A cuvee that successfully introduces emotions and the special unmistakable flavor of wine skillfully produced to enhance the characteristics of the native grape varieties of a unique area, at the foot of the Pre-alps of Veneto, where Mionetto has been based since 1887. These flavors and aromas have disappeared over the years but now Mionetto are reintroducing them in this excellent cuv\xe9e.A delicate pale yellow color, with a characteristic aroma that blends with hints of honey and crab apples. It is dry and pleasantly slightly bitter on the palate. Lean due to the right level of acidity, it is moderately full-bodied with a fine and intense perlage.A balanced, smooth and refreshing sparkling wine that is ideal for any occasion, thanks to its moderate alcohol content and versatility. It is best served with simple light fish or vegetable dishes. It is an excellent aperitif accompanied by savory tarts or more delicate finger food such as shrimp vol-au-vent. View More', u'title': u'Mionetto Cuvee Sergio Prosecco', u'price': u'$17.99', u'id': 454770, u'link': u'https://www.wine.com/product/mionetto-cuvee-sergio-prosecco/58520', u'imageUrl': u'https://spoonacular.com/productImages/454770-312x231.jpg'}]}, u'aggregateLikes': 35, u'instructions': u'Preheat oven to 325F.Toss tomatoes with oil, garlic, salt and pepper. Place on a baking sheet and roast until broken down, 45 to 55 minutes.Combine the roasted tomatoes with basil and vinegar.Top baguette slices with the roasted tomato mixture. Garnish with anchovy fillets, Kalamata olives or sliced fresh basil.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-roasted-cherry-tomato-bruschetta-668', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 67, u'servings': 60, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}