{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/596972-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 596972, u'veryPopular': False, u'lowFodmap': True, u'title': u'Sage Brown Butter', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 33.32, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'12 fresh sage leaves', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'2 teaspoons freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'10 tablespoons (5 ounces) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://leitesculinaria.com/82737/recipes-sage-brown-butter.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the butter in a small saucepan over medium heat until it begins to foam and turn golden brown. Turn off the heat and carefully add the sage leaves (they will sputter a little).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the lemon juice, tilt the pan to swirl the lemon juice and butter together, and set aside to cool slightly or until needed. (Yup. You’re done. It’s that simple.)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 61, u'instructions': u'1. Heat the butter in a small saucepan over medium heat until it begins to foam and turn golden brown. Turn off the heat and carefully add the sage leaves (they will sputter a little). Add the lemon juice, tilt the pan to swirl the lemon juice and butter together, and set aside to cool slightly or until needed. (Yup. You’re done. It’s that simple.)', u'spoonacularSourceUrl': u'https://spoonacular.com/sage-brown-butter-596972', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}