{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/461410-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 461410, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tiropetes', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 45, u'pricePerServing': 20.53, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 cup butter, melted and divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'3 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 pound feta cheese, crumbled', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1019, u'unit': u'pound'}, {u'originalString': u'2 tablespoons chopped Italian flat leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'italian', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 cups hot milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 cup shredded Monterey Jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'1 (16 ounce) package frozen phyllo dough, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 18338, u'unit': u'ounce'}, {u'originalString': u'salt and white pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'white', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 100.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Tiropetes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt the butter in a saucepan over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the flour until smooth. Gradually stir in the hot milk so that no lumps form. Cook, stirring constantly, until the sauce thickens enough to coat a metal spoon. Season with salt and white pepper, remove from the heat and set aside to cool.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'When the sauce is cooled, stir in the feta cheese, egg yolks, Monterey jack cheese, 3 tablespoons melted butter and parsley.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001025, u'name': u'monterey jack cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F (190 degrees C).', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the sheets of phyllo dough into strips about 3 inches wide. Use one stack at a time, covering the rest with a damp towel to keep them from drying out.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'id': 18338, u'name': u'filo pastry'}]}, {u'equipment': [], u'step': u'Lay out one piece of phyllo at a time.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Brush with butter, and place about 1 teaspoon of the cheese mixture on one end. Fold one corner up to match the other edge. Continue folding in triangle shape until you reach the end of the strip.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on a baking sheet, and continue with the remaining strips of dough.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 15 to 20 minutes in the preheated oven, or until golden brown. These can also be prepared ahead of time, and frozen after folding.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Bake when ready to serve.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 27, u'instructions': u'Melt the butter in a saucepan over medium heat. Whisk in the flour until smooth. Gradually stir in the hot milk so that no lumps form. Cook, stirring constantly, until the sauce thickens enough to coat a metal spoon. Season with salt and white pepper, remove from the heat and set aside to cool.                            When the sauce is cooled, stir in the feta cheese, egg yolks, Monterey jack cheese, 3 tablespoons melted butter and parsley.                            Preheat the oven to 375 degrees F (190 degrees C). Cut the sheets of phyllo dough into strips about 3 inches wide. Use one stack at a time, covering the rest with a damp towel to keep them from drying out.                            Lay out one piece of phyllo at a time. Brush with butter, and place about 1 teaspoon of the cheese mixture on one end. Fold one corner up to match the other edge. Continue folding in triangle shape until you reach the end of the strip. Place on a baking sheet, and continue with the remaining strips of dough.                            Bake for 15 to 20 minutes in the preheated oven, or until golden brown. These can also be prepared ahead of time, and frozen after folding. Bake when ready to serve.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/tiropetes-461410', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 100, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}