{u'recipes': [{u'sourceName': u'An Edible Mosaic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/810084-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 810084, u'veryPopular': True, u'lowFodmap': False, u'title': u'Caramelized Pineapple Grilled Cheese with Honeyed Walnuts', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 134.85, u'creditText': u'An Edible Mosaic', u'extendedIngredients': [{u'originalString': u'8 slices GO Veggie! Lactose Free Mozzarella Slices', u'aisle': u'Cheese', u'name': u'fat-free mozzarella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-(white).jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 42304, u'unit': u'slices'}, {u'originalString': u'3 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'6 (1/4-inch thick) slices of fresh pineapple (peel the pineapple before slicing it cross-wise)', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'fresh', u'(1/)', u'(peel the pineapple before slicing it cross-wise)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 9266, u'unit': u'slices'}, {u'originalString': u'8 teaspoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'teaspoons'}, {u'originalString': u'8 tablespoons GO Veggie! Vegan Classic Plain Cream Cheese', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'vegan cream cheese', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 93634, u'unit': u'tablespoons'}, {u'originalString': u'4 tablespoons chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 12155, u'unit': u'tablespoons'}, {u'originalString': u'1 to 3 teaspoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'teaspoons'}, {u'originalString': u'8 slices of your favorite sandwich bread', u'aisle': u'Bakery/Bread', u'name': u'white sandwich bread', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slices'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.anediblemosaic.com/caramelized-pineapple-grilled-cheese-with-honeyed-walnuts/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut each pineapple slice in half. Preheat a large dry nonstick skillet over medium to medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Add the pineapple slices and cook until slightly softened and browned in spots, about 2 minutes per side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the pineapple to a plate.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Spread 1 teaspoon butter on 1 side of each slice of bread.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Place 4 slices of bread (butter side down) on a cutting board.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Spread 2 tablespoons cream cheese on top of each, and then top each with 3 slices of caramelized pineapple and 2 slices of mozzarella cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the remaining slices of bread on top (butter side up).Grill the sandwiches in a large skillet (or on a griddle) over low heat until the cheese is melted and the bread is golden on both sides.For the honeyed walnuts, add the walnuts, honey, and enough water to slightly thin it out to small saucepan. Bring up to a simmer over medium heat and cook 1 minute.To serve, transfer each sandwich', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 5878, u'instructions': u'Cut each pineapple slice in half. Preheat a large dry nonstick skillet over medium to medium-high heat. Add the pineapple slices and cook until slightly softened and browned in spots, about 2 minutes per side. Transfer the pineapple to a plate.Spread 1 teaspoon butter on 1 side of each slice of bread.Place 4 slices of bread (butter side down) on a cutting board. Spread 2 tablespoons cream cheese on top of each, and then top each with 3 slices of caramelized pineapple and 2 slices of mozzarella cheese. Place the remaining slices of bread on top (butter side up).Grill the sandwiches in a large skillet (or on a griddle) over low heat until the cheese is melted and the bread is golden on both sides.For the honeyed walnuts, add the walnuts, honey, and enough water to slightly thin it out to small saucepan. Bring up to a simmer over medium heat and cook 1 minute.To serve, transfer each sandwich', u'spoonacularSourceUrl': u'https://spoonacular.com/caramelized-pineapple-grilled-cheese-with-honeyed-walnuts-810084', u'dishTypes': [], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}