{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/447517-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 447517, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breakfast Pizza', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 194.11, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 pound bulk pork sausage', u'aisle': u'Meat', u'name': u'bulk pork sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7063, u'unit': u'pound'}, {u'originalString': u'4-1/2 teaspoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'2 tubes (12 ounces each) refrigerated buttermilk biscuits, separated into 20 biscuits', u'aisle': u'Refrigerated', u'name': u'buttermilk biscuits', u'metaInformation': [u'refrigerated', u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 18009, u'unit': u'ounces'}, {u'originalString': u'12 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cans (4 ounces each) mushroom stems and pieces, drained', u'aisle': u'Produce', u'name': u'mushroom', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'1 large onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 cups (12 ounces) shredded part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1028, u'unit': u'ounces'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/breakfast-pizza-7', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Cover the bottom of a greased 13-in. x 9-in. baking pan with biscuits; set aside. Crumble sausage into large skillet; cook over medium heat until no longer pink.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain; place sausage in a bowl and set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In the same skillet, saute mushrooms and onion in butter for 3-5 minutes or until tender; add to the sausage.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, whisk eggs. Coat skillet with cooking spray.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add eggs; cook and stir over medium heat until nearly set.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add sausage and vegetable mixture; cook and stir until completely set.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Spread egg mixture over biscuits. Sprinkle with cheese. Cover and bake at 400\xb0 for 12 minutes. Uncover; bake 10-13 minutes longer or until cheese is melted and biscuits are golden brown.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Breakfast Pizzan on the menu? Try pairing with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Madsen Family Cellars Sangiovese Wine with a 5 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This wine has a pronounced nose with a hint of coffee while your mouth is invaded with spices; clove, licorice, and cinnamon.The palate features cherries and notes of clove which continue on to a smooth, long finish with subtle oak, slight pepper and berry flavors. The tartness of the wine works well with food as Sangiovese is a food wine, but can be enjoyed on its own as well. Columbia Valley AVA from the vineyards of Jordan Reed.', u'title': u'Madsen Family Cellars Sangiovese Wine', u'price': u'$26.0', u'id': 431618, u'link': u'https://www.amazon.com/2009-Madsen-Family-Cellars-Sangiovese/dp/B00I0F3FJA', u'imageUrl': u'https://spoonacular.com/productImages/431618-312x231.jpg'}]}, u'aggregateLikes': 30, u'instructions': u'Directions                                                                                Cover the bottom of a greased 13-in. x 9-in. baking pan with biscuits; set aside. Crumble sausage into large skillet; cook over medium heat until no longer pink. Drain; place sausage in a bowl and set aside.                                                                                            In the same skillet, saute mushrooms and onion in butter for 3-5 minutes or until tender; add to the sausage.                                                                                           In a large bowl, whisk eggs. Coat skillet with cooking spray. Add eggs; cook and stir over medium heat until nearly set. Add sausage and vegetable mixture; cook and stir until completely set.                                                                                           Spread egg mixture over biscuits. Sprinkle with cheese. Cover and bake at 400\xb0 for 12 minutes. Uncover; bake 10-13 minutes longer or until cheese is melted and biscuits are golden brown.                                        Yield: 6-8 servings.                                                                                                                         Originally published as Breakfast Pizza in  Country WomanMarch/April 2003, p31                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 piece) equals 428 calories, 27 g fat (12 g saturated fat), 370 mg cholesterol, 826 mg sodium, 18 g carbohydrate, 1 g fiber, 26 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-pizza-447517', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}