{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/446068-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 446068, u'veryPopular': False, u'lowFodmap': False, u'title': u'Marinated Pork Loin', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 227.17, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 boneless whole pork loin roast (2 pounds)', u'aisle': u'Meat', u'name': u'boneless pork loin roast', u'metaInformation': [u'whole', u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10225, u'unit': u'pounds'}, {u'originalString': u'2 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/8 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons cider viengar', u'aisle': u'Alcoholic Beverages', u'name': u'dry cider', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cider.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93807, u'unit': u'tablespoons'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'1/2 cup reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoons'}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/marinated-pork-loin', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, combine the first nine ingredients. Bring to a boil. Reduce heat; simmer, uncovered, for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heat; cool slightly.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place 2/3 cup marinade in a bowl for basting; cover and chill.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Pour remaining marinade into a large resealable plastic bag.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut pork into five slices, about 1 in. each; add to bag. Seal and turn to coat; refrigerate overnight.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and discard marinade. Broil 4-5 in. from the heat for 10 minutes on each side or until juices run clear, brushing with reserved marinade occasionally.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 88, u'instructions': u'Directions                                                                                In a large saucepan, combine the first nine ingredients. Bring to a boil. Reduce heat; simmer, uncovered, for 5 minutes. Remove from the heat; cool slightly. Place 2/3 cup marinade in a bowl for basting; cover and chill. Pour remaining marinade into a large resealable plastic bag. Cut pork into five slices, about 1 in. each; add to bag. Seal and turn to coat; refrigerate overnight.                                                                                           Drain and discard marinade. Broil 4-5 in. from the heat for 10 minutes on each side or until juices run clear, brushing with reserved marinade occasionally.                                        Yield: 5 servings.                                                                                                                         Originally published as Marinated Pork Loin in  Light & TastyFebruary/March 2001, p7                                                                                                                                                                                                         Nutritional Facts                                                                             One serving (1 slice) equals 310 calories, 10 g fat (3 g saturated fat), 100 mg cholesterol, 570 mg sodium, 14 g carbohydrate, trace fiber, 40 g protein. Diabetic Exchanges: 5 lean meat, 1 fruit.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/marinated-pork-loin-446068', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}