{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474989-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 474989, u'veryPopular': False, u'lowFodmap': False, u'title': u'Green Beans with Ginger and Soy {and a giveaway!}', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 53.22, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'1 tablespoon fresh minced ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3/4 pound fresh green beans, trimmed', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'fresh', u'green', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 11052, u'unit': u'pound'}, {u'originalString': u'1 tablespoon toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon toasted sesame seeds, optional', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.tasteandtellblog.com/green-beans-with-ginger-soy-giveaway/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine the soy sauce, water, ginger and garlic.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the pan until hot, and add the soy sauce mixture.  Cook until the garlic and ginger are softened, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add in the green beans and stir to combine.  Cover the pan and cook until steam starts to escape from under the lid, about 5 minutes.Spin the lid to engage the vapor seal, immediately reduce the heat to low, and cook for 5 minutes, until the green beans are tender.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in the sesame oil.  Sprinkle with the sesame seeds, if desired.**This recipe was developed for use with the 360 Cookware 3.5 qt.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Saute Pan.  It can probably be made using another brand of cookware, but water will probably need to be adjusted, and fat may need to be added.**----------------adapted from 360 Cookware', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 51, u'instructions': u'Combine the soy sauce, water, ginger and garlic.  Heat the pan until hot, and add the soy sauce mixture.  Cook until the garlic and ginger are softened, about 3 minutes.  Add in the green beans and stir to combine.  Cover the pan and cook until steam starts to escape from under the lid, about 5 minutes.Spin the lid to engage the vapor seal, immediately reduce the heat to low, and cook for 5 minutes, until the green beans are tender.  Remove from heat and stir in the sesame oil.  Sprinkle with the sesame seeds, if desired.**This recipe was developed for use with the 360 Cookware 3.5 qt. Saute Pan.  It can probably be made using another brand of cookware, but water will probably need to be adjusted, and fat may need to be added.**----------------adapted from 360 Cookware', u'spoonacularSourceUrl': u'https://spoonacular.com/green-beans-with-ginger-and-soy-and-a-giveaway-474989', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}