{u'recipes': [{u'sourceName': u'Amandas Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/527054-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 527054, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesy Chicken & Ham Chowder', u'diets': [], u'pricePerServing': 192.23, u'creditText': u'Amandas Cooking', u'extendedIngredients': [{u'originalString': u'14-oz can chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'oz'}, {u'originalString': u'1 cup cooked ham, diced', u'aisle': u'Meat', u'name': u'diced ham', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/diced-ham.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 99186, u'unit': u'cup'}, {u'originalString': u'1/4 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 1/2 cups 1% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'1%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/2 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 medium Russet potatoes', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup shredded cheese', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'cup'}, {u'originalString': u'1 cup cooked chicken, shredded', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://amandascookin.com/2012/02/cheesy-chicken-ham-chowder.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Wash potatoes and pierce the skin with a fork. Microwave for 5 minutes. Rotate them, and cook for another 5 minutes, or until done.Meanwhile, in a stock pot over medium heat, melt the butter.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the garlic and onion, and let cook until tender and garlic is just beginning to brown, stirring frequently.Sprinkle the flour over the onion mixture in the pan and stir together with a wooden spoon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Let the mixture cook for 1 minute, stirring regularly. Slowly add the milk a little at a time while whisking constantly.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the chicken broth, and whisk well. Bring mixture to a simmer, and heat until thickened, about 5 minutes.While your soup is thickening, cut the microwaved potatoes in half length-wise and scoop out the flesh.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [], u'step': u'Cut or mash into small pieces. Measure out your chicken, ham and cheese.Turn the heat to medium-low, and add the potatoes. Sprinkle the soup with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Add the cheese, chicken, and ham. Warm through and serve hot!', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 12, u'instructions': u'Wash potatoes and pierce the skin with a fork. Microwave for 5 minutes. Rotate them, and cook for another 5 minutes, or until done.Meanwhile, in a stock pot over medium heat, melt the butter. Add the garlic and onion, and let cook until tender and garlic is just beginning to brown, stirring frequently.Sprinkle the flour over the onion mixture in the pan and stir together with a wooden spoon. Let the mixture cook for 1 minute, stirring regularly. Slowly add the milk a little at a time while whisking constantly. Add the chicken broth, and whisk well. Bring mixture to a simmer, and heat until thickened, about 5 minutes.While your soup is thickening, cut the microwaved potatoes in half length-wise and scoop out the flesh. Cut or mash into small pieces. Measure out your chicken, ham and cheese.Turn the heat to medium-low, and add the potatoes. Sprinkle the soup with salt and pepper. Add the cheese, chicken, and ham. Warm through and serve hot!', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-chicken-ham-chowder-527054', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}