{u'recipes': [{u'sourceName': u'Cookin Canuck', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/624629-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 624629, u'veryPopular': True, u'lowFodmap': False, u'title': u'Hot Cranberry & Whiskey Lemonade', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 69.49, u'creditText': u'Cookin Canuck', u'extendedIngredients': [{u'originalString': u'6 tbsp agave nectar (or more to taste)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'to taste', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'tbsp'}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'\xbd cup fresh cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9078, u'unit': u'cup'}, {u'originalString': u'\xbe cup fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'Lemon wedges, for garnish', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.cookincanuck.com/2014/12/hot-cranberry-whiskey-lemonade/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Stir together the water, lemon juice and agave nectar in a medium saucepan and set over medium heat. Cook, stirring, until the agave nectar dissolves.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the whiskey, cinnamon stick and cranberries. Turn down the heat slightly and simmer until the cranberries have popped, about 30 minutes. Taste and stir in more agave nectar, if desired.Divide into 4 glasses or mugs, and serve with lemon wedges.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1192, u'instructions': u'Stir together the water, lemon juice and agave nectar in a medium saucepan and set over medium heat. Cook, stirring, until the agave nectar dissolves.Add the whiskey, cinnamon stick and cranberries. Turn down the heat slightly and simmer until the cranberries have popped, about 30 minutes. Taste and stir in more agave nectar, if desired.Divide into 4 glasses or mugs, and serve with lemon wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/hot-cranberry-whiskey-lemonade-624629', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}