{u'recipes': [{u'sourceName': u'The Beeroness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/483808-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 483808, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pineapple Habanero IPA Shrimp', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 204.91, u'creditText': u'The Beeroness', u'extendedIngredients': [{u'originalString': u'2/3 cup, plus 2 Tbs IPA beer, divided', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 14006, u'unit': u'cup'}, {u'originalString': u'2 Tbs cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'Tbs'}, {u'originalString': u'2 Tbs green onions, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbs'}, {u'originalString': u'3 Tbs olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'\xbd tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 habanero peppers, chopped, stem and seeds removed', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'seeds removed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'1 cup chopped fresh pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u'cup'}, {u'originalString': u'\xbd lbs raw shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'raw shrimp', u'metaInformation': [u'raw', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 15152, u'unit': u'lbs'}, {u'originalString': u'1 red pepper, diced (stem and seeds removed)', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red', u'seeds removed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'Rice for serving', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 20444, u'unit': u'servings'}, {u'originalString': u'3 Tbs rice wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 3.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'Tbs'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbd cup white onions, diced', u'aisle': u'Produce', u'name': u'white onions', u'metaInformation': [u'diced', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://thebeeroness.com/2014/04/30/pineapple-habanero-ipa-shrimp/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a pan over medium high heat. Sprinkle the shrimp all over with salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add to the pan, cook until pink on all sides, remove from pan, set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onions and red pepper, cook until softened and slightly caramelized, about 8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the pineapple, pepper, 2/3 cup beer, honey, vinegar, and cornstarch, cook over a low simmer until pineapple has broken down and sauce has thickened, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [], u'step': u'Add the shrimp back in as well as the remaining 2 tablespoons beer, stir until combined, remove from heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [], u'step': u'Serve over rice, sprinkle with green onions prior to serving.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Santa Cristina by Antinori Pinot Grigio. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 12 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish. View More', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 194, u'instructions': u'Heat the olive oil in a pan over medium high heat. Sprinkle the shrimp all over with salt and pepper. Add to the pan, cook until pink on all sides, remove from pan, set aside.Add the onions and red pepper, cook until softened and slightly caramelized, about 8 minutes. Add the pineapple, pepper, 2/3 cup beer, honey, vinegar, and cornstarch, cook over a low simmer until pineapple has broken down and sauce has thickened, about 10 minutes. Add the shrimp back in as well as the remaining 2 tablespoons beer, stir until combined, remove from heat. Serve over rice, sprinkle with green onions prior to serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/pineapple-habanero-ipa-shrimp-483808', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}