{u'recipes': [{u'sourceName': u'Beyond Frosting', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/590845-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 590845, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salted Caramel Hot Chocolate Cupcakes', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 85.87, u'creditText': u'Beyond Frosting', u'extendedIngredients': [{u'originalString': u'2 tbsp Caramel sauce (Smuckers or other)', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'(Smuckers or other)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19364, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp Caramel sauce', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19364, u'unit': u'tbsp'}, {u'originalString': u'1 Box Chocolate cake mix', u'aisle': u'Gluten Free', u'name': u'gf chocolate cake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-cake.jpg', u'unitLong': u'Box', u'unitShort': u'Box', u'amount': 1.0, u'consistency': u'solid', u'id': 99040, u'unit': u'Box'}, {u'originalString': u'5 Large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'3 Large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 C plus 2 tbsp Granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'C'}, {u'originalString': u'3 tbsp Heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tbsp'}, {u'originalString': u'\xbd C Caramel hot chocolate mix', u'aisle': u'Beverages', u'name': u'hot chocolate mix', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 14197, u'unit': u'C'}, {u'originalString': u'2 C Marshmallow fluff', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'marshmallow fluff', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93644, u'unit': u'C'}, {u'originalString': u'1 C Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'C'}, {u'originalString': u'2 C Powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'C'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'\xbe C Sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1056, u'unit': u'C'}, {u'originalString': u'1 C Unsalted butter (at room temperature)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'C'}, {u'originalString': u'1 lb (4 sticks) Unsalted butter (at room temperature)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature', u'(4 sticks)', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'lb'}, {u'originalString': u'1 tsp Pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'\xbd C Vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'C'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://beyondfrosting.com/2013/12/18/salted-caramel-hot-chocolate-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine cake mix with hot chocolate mix.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 14197, u'name': u'hot cocoa mix'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Add milk ,eggs, vegetable oil, sour cream, vanilla extract and caramel sauce. Beat on medium speed until all ingredients are well combined.Line a cupcake pan with liners and fill each one  full.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake at 350F for 12-16 minutes. Check for doneness by inserting a toothpick in the middle of the cupcake. If the toothpick comes out clean, your cupcakes are done.Allow cupcakes to cool completely.Allow butter to soften to room temperature.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Combine butter and marshmallow fluff and beat on medium-high speed until well combined and fluffy.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 93644, u'name': u'marshmallow cream'}]}, {u'equipment': [], u'step': u'Add powered sugar, one cup at a time. Beat on slow speed and increase to medium speed once some of the powdered sugar has been absorbed into the butter.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Mixture will be very thick.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add a pinch of salt and 3 tablespoons of heavy whipping cream. Beat on medium high speed for 3-5 minutes until filling is fluffy.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour marshmallow filling in a large piping bag or Ziploc bag and cut off the bottom edge of the bag.Core out the center of your cooled cupcakes with a knife or spoon, making a small hole. Fill each cupcake with the marshmallow filling.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Drizzle caramel over top of marshmallow filling and swirl into marshmallow with a toothpick. Set aside.Allow butter to come to room temperature. This is important! Do not try to rush it by microwaving it. I recommend cutting the butter into smaller sections to help it thaw quicker.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine sugar and egg whites in your stainless steel mixer bowl (or any heat proof bowl). Attach your candy thermometer to the side of the bowl.Set your bowl over top of a pot with water, just enough water to cover the bottom of the pot. You do not want the water to boil and touch the bottom of your mixing bowl.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Heat on medium temperature.Stir the egg whites and sugar constantly until the mixture reaches 150 F. This is the most important part; you do not want to egg whites to cook- so keep stirring! I have read that you can heat it be anywhere between 120 F  160 F. When it reaches 150 F, the sugar should be dissolved in the egg whites. You can test this by placing a drop on your fingertips and rubbing them together. The mixture should be completely smooth.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place the mixing bowl on your stand. Using the wire whisk attachment beat the eggs. Start on low speed and increase the speed to medium after 2 minutes.Beat for another 3 minutes on medium speed. At this point, your frosting should have turned white as the egg whites are whipped and the body of the meringue starts to form.After the first 5 minutes, increase speed to high. You will notice that as you increase the speed, the body of your meringue will also increase. It will start to look glossy as the peaks begin to form. Beat for another 5 minutes.After you have beaten the meringue for a total of about 10 minutes, the bottom of your mixing bowl should be cooled completely. Your SMB should look kind of like whipped cream. Scrape down all sides and bottom of the bowl.Turn your mixer down to medium-low. Slowly add your softened butter, about 1 tbsp at a time, ensuring it is mixed well after each addition. Once you have added all your butter, add vanilla extract.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix for another minute and scrape down the sides of the bowl.Switch to the paddle attachment and continue beating on medium to allow all the air bubbles to escape.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Add caramel sauce into frosting.  Beat for about 2-3 minutes until the frosting is smooth. If your frosting has not formed yet, continue to beat until it is light and fluffy.Frost the marshmallow filled cupcakes and sprinkle top with sea salt. You can drizzle with additional caramel if desired.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}], u'name': u''}], u'aggregateLikes': 4767, u'instructions': u'Preheat oven to 350 F.Combine cake mix with hot chocolate mix. Add milk ,eggs, vegetable oil, sour cream, vanilla extract and caramel sauce. Beat on medium speed until all ingredients are well combined.Line a cupcake pan with liners and fill each one  full.Bake at 350F for 12-16 minutes. Check for doneness by inserting a toothpick in the middle of the cupcake. If the toothpick comes out clean, your cupcakes are done.Allow cupcakes to cool completely.Allow butter to soften to room temperature. Combine butter and marshmallow fluff and beat on medium-high speed until well combined and fluffy.Add powered sugar, one cup at a time. Beat on slow speed and increase to medium speed once some of the powdered sugar has been absorbed into the butter. Mixture will be very thick.Add a pinch of salt and 3 tablespoons of heavy whipping cream. Beat on medium high speed for 3-5 minutes until filling is fluffy.Pour marshmallow filling in a large piping bag or Ziploc bag and cut off the bottom edge of the bag.Core out the center of your cooled cupcakes with a knife or spoon, making a small hole. Fill each cupcake with the marshmallow filling.Drizzle caramel over top of marshmallow filling and swirl into marshmallow with a toothpick. Set aside.Allow butter to come to room temperature. This is important! Do not try to rush it by microwaving it. I recommend cutting the butter into smaller sections to help it thaw quicker.Combine sugar and egg whites in your stainless steel mixer bowl (or any heat proof bowl). Attach your candy thermometer to the side of the bowl.Set your bowl over top of a pot with water, just enough water to cover the bottom of the pot. You do not want the water to boil and touch the bottom of your mixing bowl. Heat on medium temperature.Stir the egg whites and sugar constantly until the mixture reaches 150 F. This is the most important part; you do not want to egg whites to cook- so keep stirring! I have read that you can heat it be anywhere between 120 F  160 F. When it reaches 150 F, the sugar should be dissolved in the egg whites. You can test this by placing a drop on your fingertips and rubbing them together. The mixture should be completely smooth.Place the mixing bowl on your stand. Using the wire whisk attachment beat the eggs. Start on low speed and increase the speed to medium after 2 minutes.Beat for another 3 minutes on medium speed. At this point, your frosting should have turned white as the egg whites are whipped and the body of the meringue starts to form.After the first 5 minutes, increase speed to high. You will notice that as you increase the speed, the body of your meringue will also increase. It will start to look glossy as the peaks begin to form. Beat for another 5 minutes.After you have beaten the meringue for a total of about 10 minutes, the bottom of your mixing bowl should be cooled completely. Your SMB should look kind of like whipped cream. Scrape down all sides and bottom of the bowl.Turn your mixer down to medium-low. Slowly add your softened butter, about 1 tbsp at a time, ensuring it is mixed well after each addition. Once you have added all your butter, add vanilla extract. Mix for another minute and scrape down the sides of the bowl.Switch to the paddle attachment and continue beating on medium to allow all the air bubbles to escape. Add caramel sauce into frosting.  Beat for about 2-3 minutes until the frosting is smooth. If your frosting has not formed yet, continue to beat until it is light and fluffy.Frost the marshmallow filled cupcakes and sprinkle top with sea salt. You can drizzle with additional caramel if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/salted-caramel-hot-chocolate-cupcakes-590845', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}