{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219685-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 612, u'id': 219685, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pork & peach kebabs with Little Gem salad', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 309.31, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tbsp clear honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'clear honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'1 tsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tsp'}, {u'originalString': u'2 Little Gem lettuces', u'aisle': u'Produce', u'name': u'gem squash', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gem-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10111641, u'unit': u''}, {u'originalString': u'1 lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 peaches', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'500g lean pork fillet, trimmed of any fat', u'aisle': u'Meat', u'name': u'lean pork fillet', u'metaInformation': [u'lean', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10060, u'unit': u'g'}, {u'originalString': u'100g bag watercress', u'aisle': u'Produce', u'name': u'watercress', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 11591, u'unit': u'g'}], u'healthScore': 85.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/4415/pork-and-peach-kebabs-with-little-gem-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}], u'step': u'Soak eight wooden skewers in cold water for at least 5 mins.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Cut the pork into large cubes. Halve and stone the peaches, then cut into chunks. Grate the zest from half the lemon and squeeze out the juice. Reserve 1 tbsp of the juice, then mix the remainder with the zest and honey. Alternately thread the pork and peach slices onto the skewers.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush all over with the honey and lemon mix, then grill or barbecue for 10-12 mins, turning regularly, until cooked.Separate the lettuce leaves and mix with the watercress.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watercress.jpg', u'id': 11591, u'name': u'watercress'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the reserved lemon juice with the olive oil, mustard and a little seasoning. Toss with the salad leaves and serve with the kebabs.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 66, u'instructions': u'Soak eight wooden skewers in cold water for at least 5 mins. Cut the pork into large cubes. Halve and stone the peaches, then cut into chunks. Grate the zest from half the lemon and squeeze out the juice. Reserve 1 tbsp of the juice, then mix the remainder with the zest and honey. Alternately thread the pork and peach slices onto the skewers. Brush all over with the honey and lemon mix, then grill or barbecue for 10-12 mins, turning regularly, until cooked.Separate the lettuce leaves and mix with the watercress. Whisk the reserved lemon juice with the olive oil, mustard and a little seasoning. Toss with the salad leaves and serve with the kebabs.', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-peach-kebabs-with-little-gem-salad-219685', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}