{u'recipes': [{u'sourceName': u'How Sweet Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/525378-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 525378, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Movie Nachos with Fontina Queso + Candied Jalape\xf1os', u'diets': [], u'pricePerServing': 263.52, u'creditText': u'How Sweet Eats', u'extendedIngredients': [{u'originalString': u'1/4 cup apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'1 teaspoon flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces fontina cheese, freshly grated', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1020, u'unit': u'ounces'}, {u'originalString': u'1 small garlic clove, minced or pressed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced', u'small', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'3/4 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'4 jalape\xf1o peppers, stems removed and sliced into rounds', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'sliced into rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'candied jalape\xf1os', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u'servings'}, {u'originalString': u'the juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1/3 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'queso', u'aisle': u'Canned and Jarred', u'name': u'queso dip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheez-whiz.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1188, u'unit': u'servings'}, {u'originalString': u'a pinch of salt + pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 tablespoons diced sweet onion', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'diced', u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u'tablespoons'}, {u'originalString': u'a bunch of your favorite tortilla chips (I used organic yellow corn)', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [u'yellow', u'organic', u'your favorite', u'(I used corn)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 19056, u'unit': u'bunch'}, {u'originalString': u'2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.howsweeteats.com/2013/06/easy-movie-nachos-with-fontina-queso-candied-jalapenos/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'To prepare jalape\xf1os, combine vinegar, water, lime juice and sugar in a small saucepan. Bring to a boil, whisking to dissolve the sugar then reduce to a simmer and cook until syrupy, about 3-4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u"Add the sliced peppers to the mixture, increasing the heat once more so it's bubbling and cook for another 3-4 minutes, until peppers are wilting and no longer bright green.", u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"Remove the peppers with a slotted spoon and place in a refrigerater-safe jar or container. Simmer the syrup for another 2-3 minutes, then pour it over top of the peppers. Store in the fridge. You can make these ahead of time and pull them from the fridge when ready.If you'd like to properly can them or preserve them, you can find directions here.For the queso, heat a small saucepan over medium heat and add oil.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add onions, jalapeno and garlic, cooking for 2-3 minutes or until vegetables are soft.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Whisk in flour and let cook for a minute, then add in milk and fontina, stirring until melted. I like to spread the tortilla chips on a baking sheet and warm them in the oven for a few minutes. Immediately pour the cheese over nachos then cover with jalape\xf1os.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'aggregateLikes': 1141, u'instructions': u"To prepare jalape\xf1os, combine vinegar, water, lime juice and sugar in a small saucepan. Bring to a boil, whisking to dissolve the sugar then reduce to a simmer and cook until syrupy, about 3-4 minutes. Add the sliced peppers to the mixture, increasing the heat once more so it's bubbling and cook for another 3-4 minutes, until peppers are wilting and no longer bright green. Remove the peppers with a slotted spoon and place in a refrigerater-safe jar or container. Simmer the syrup for another 2-3 minutes, then pour it over top of the peppers. Store in the fridge. You can make these ahead of time and pull them from the fridge when ready.If you'd like to properly can them or preserve them, you can find directions here.For the queso, heat a small saucepan over medium heat and add oil. Add onions, jalapeno and garlic, cooking for 2-3 minutes or until vegetables are soft. Whisk in flour and let cook for a minute, then add in milk and fontina, stirring until melted. I like to spread the tortilla chips on a baking sheet and warm them in the oven for a few minutes. Immediately pour the cheese over nachos then cover with jalape\xf1os.", u'spoonacularSourceUrl': u'https://spoonacular.com/easy-movie-nachos-with-fontina-queso-+-candied-jalapeos-525378', u'dishTypes': [u'fingerfood', u'antipasti', u'lunch', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u"hor d'oeuvre", u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}