{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/668373-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 668373, u'veryPopular': False, u'lowFodmap': True, u'title': u'Duck Breasts with Green Peppercorn Sauce', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 414.87, u'extendedIngredients': [{u'originalString': u'2 teaspoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon cognac', u'aisle': u'Alcoholic Beverages', u'name': u'cognac', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cognac.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10414037, u'unit': u'tablespoon'}, {u'originalString': u'1 duck breast', u'aisle': u'Meat', u'name': u'duck breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/duck-raw.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 98912, u'unit': u''}, {u'originalString': u'2 teaspoons green peppercorns in brine, drained', u'aisle': u'Canned and Jarred;Spices and Seasonings', u'name': u'green peppercorns', u'metaInformation': [u'green', u'in brine', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93836, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup veal stock', u'aisle': u'Canned and Jarred', u'name': u'veal stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6170, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpeg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.cookingchanneltv.com/recipes/laura-calder/duck-breasts-with-green-peppercorn-sauce.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oven to 400 degrees F/200 degrees C.Score the duck breast and render the fat in a saute pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/duck-raw.jpg', u'id': 98912, u'name': u'duck breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour off the fat, and transfer to the oven to finish, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the duck, and set aside to rest while you make the sauce.Deglaze the saute pan with the wine and cognac and reduce by half.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cognac.jpg', u'id': 10414037, u'name': u'cognac'}]}, {u'equipment': [], u'step': u'Add the veal stock and peppercorns and reduce by half again.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6170, u'name': u'veal stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove from the heat and whisk in the butter.Carve the duck breast. Spoon over the sauce and serve.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/duck-raw.jpg', u'id': 98912, u'name': u'duck breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 89, u'instructions': u'Heat the oven to 400 degrees F/200 degrees C.Score the duck breast and render the fat in a saute pan. Pour off the fat, and transfer to the oven to finish, about 10 minutes. Remove the duck, and set aside to rest while you make the sauce.Deglaze the saute pan with the wine and cognac and reduce by half. Add the veal stock and peppercorns and reduce by half again. Remove from the heat and whisk in the butter.Carve the duck breast. Spoon over the sauce and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/duck-breasts-with-green-peppercorn-sauce-668373', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}