{u'recipes': [{u'sourceName': u'Closet Cooking', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/247495-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 247495, u'veryPopular': True, u'lowFodmap': False, u'title': u'Jalapeno Popper Pizza', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 854.73, u'creditText': u'Closet Cooking', u'extendedIngredients': [{u'originalString': u'4 slices bacon, cut into 1 inch pieces and cooked', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cooked', u'cut into 1 inch pieces and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'3 tablespoons cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1017, u'unit': u'tablespoons'}, {u'originalString': u'2 jalapeno peppers, sliced **', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 pizza dough', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93610, u'unit': u''}, {u'originalString': u'5 tablespoon jalapeno ranch dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4639, u'unit': u'tablespoon'}, {u'originalString': u'1 cup cheddar, shredded', u'aisle': u'Cheese', u'name': u'shredded cheddar', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'1 cup mozzarella, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.closetcooking.com/2012/06/jalapeno-popper-pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 92, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Mix the cream cheese into the jalapeno ranch dressing.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}]}, {u'equipment': [], u'step': u'Roll the dough out into a circle roughly 12 inches across and spread the creamy jalapeno ranch dressing over it.Sprinkle the jalapeno peppers, bacon, and cheeses onto the pizza.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 500.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake in a preheated 500F oven until golden brown on top, about 5-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are great choices for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Di Majo Norante Sangiovese with a 4.1 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Vivid ruby red in color with a fresh bouquet of violets and woodland berries. Smooth and refreshing with loads of ripe fruit. An excellent accompaniment to antipasti, first courses and grilled white meats', u'title': u'Di Majo Norante Sangiovese', u'price': u'$8.99', u'id': 434381, u'link': u'https://www.wine.com/product/di-majo-norante-sangiovese-2000/38435', u'imageUrl': u'https://spoonacular.com/productImages/434381-312x231.jpg'}]}, u'aggregateLikes': 3971, u'instructions': u'Mix the cream cheese into the jalapeno ranch dressing.Roll the dough out into a circle roughly 12 inches across and spread the creamy jalapeno ranch dressing over it.Sprinkle the jalapeno peppers, bacon, and cheeses onto the pizza.Bake in a preheated 500F oven until golden brown on top, about 5-10 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/jalapeno-popper-pizza-247495', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}