{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/526946-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 526946, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shrimp, Avocado & Roasted Corn Salad', u'diets': [u'gluten free'], u'pricePerServing': 631.76, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'1 avocado, peeled, pitted and diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'pitted', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'3 strips of bacon, diced', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'1/2 cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'2 ears of sweet corn, shaved off the cob', u'aisle': u'Produce', u'name': u'ears of corn', u'metaInformation': [u'sweet', u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'1/3 cup grated Fontina cheese (optional)', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1020, u'unit': u'cup'}, {u'originalString': u'1/2 cup mayo or Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 Tbsp. lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup pesto, homemade or storebought', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93698, u'unit': u'cup'}, {u'originalString': u'buttermilk pesto dressing (see below)', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'(see below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 93698, u'unit': u'servings'}, {u'originalString': u'4 cups chopped Romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'pinch of salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'pinch'}, {u'originalString': u'1 small shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1/2 lb. large shrimp, peeled with tails on or off', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'with tails on or off', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 15152, u'unit': u'lb'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.gimmesomeoven.com/shrimp-roasted-corn-and-avocado-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a skillet over high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the corn kernels and let them dry-roast for about 6-8 minutes, stirring occasionally, until their edges begin to brown and caramelize.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the corn to a plate to set aside.Reduce heat to medium-high. In the same skillet, add the bacon. Fry for about 6 minutes, stirring ocassionally, until crispy.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the bacon with a slotted spoon, leaving the grease in the skillet.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add the shrimp and saute until cooked and pink, about 2 minutes per side (depending on the size of your shrimp).', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Remove shrimp and set aside. (You're now done with your multi-tasking skillet!)Assemble your salads by tossing together the Romaine, corn, bacon, shrimp and avocado.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Drizzle with dressing and serve.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together all ingredients until blended. Season with salt and pepper.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'aggregateLikes': 482, u'instructions': u"Heat a skillet over high heat. Add the corn kernels and let them dry-roast for about 6-8 minutes, stirring occasionally, until their edges begin to brown and caramelize. Transfer the corn to a plate to set aside.Reduce heat to medium-high. In the same skillet, add the bacon. Fry for about 6 minutes, stirring ocassionally, until crispy. Remove the bacon with a slotted spoon, leaving the grease in the skillet. Add the shrimp and saute until cooked and pink, about 2 minutes per side (depending on the size of your shrimp). Remove shrimp and set aside. (You're now done with your multi-tasking skillet!)Assemble your salads by tossing together the Romaine, corn, bacon, shrimp and avocado. Drizzle with dressing and serve.Whisk together all ingredients until blended. Season with salt and pepper.", u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-avocado-roasted-corn-salad-526946', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}