{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479455-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479455, u'veryPopular': False, u'lowFodmap': False, u'title': u'Meatless Monday: Ramp and Mushroom Omelets', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 502.9, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'6 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd cup coarsely grated mild cheddar cheese', u'aisle': u'Cheese', u'name': u'mild cheddar cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1009, u'unit': u'cup'}, {u'originalString': u'8 ounces mixed mushrooms (cremini, Portobello, shitakes), finely sliced', u'aisle': u'Produce', u'name': u'mixed mushrooms', u'metaInformation': [u'mixed', u'finely sliced', u'(cremini, Portobello, shitakes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-mushrooms.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10011238, u'unit': u'ounces'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 bunch ramps, trimmed of their root, white and green parts cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'ramps', u'metaInformation': [u'white', u'green', u'trimmed', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ramson-or-wild-leeks.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 93793, u'unit': u'bunch'}, {u'originalString': u'Sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://feedmephoebe.com/2013/05/meatless-monday-ramp-and-mushroom-omelets/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tablespoons of olive oil in a medium non-stick skillet over high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the mushrooms and saut\xe9, stirring occasionally, until they’ve released their moisture and begun to deeply brown, about 6-8 minutes. Stir in the ramps and cook for another 2 minutes, until the greens are very wilted and the whites are al dente. Set aside. Wipe out the skillet and return to medium heat.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ramson-or-wild-leeks.jpg', u'id': 93793, u'name': u'ramps'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1 tablespoon of olive oil and swirl it to coat the pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in half the egg mixture. Using a spatula or fork slowly scramble the eggs – waiting for large curds to form on the bottom before redistributing into an even layer. When there is only a slight layer of uncooked egg, sprinkle half the omelet with half the mushroom mixture and top with half the cheese. Slide your spatula around the edges to loosen the omelet. Tilt the pan and tap it against the stove or counter top to loosen even more. Tilting the pan, slide the naked side of the omelet towards you and gently fold in half to sandwich the filling side.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a plate over the pan and invert the omelet onto it. Repeat with the remaining ingredients.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Serve alongside mixed greens and/or skillet home fries.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 40, u'instructions': u'Heat 2 tablespoons of olive oil in a medium non-stick skillet over high heat. Add the mushrooms and saut\xe9, stirring occasionally, until they’ve released their moisture and begun to deeply brown, about 6-8 minutes. Stir in the ramps and cook for another 2 minutes, until the greens are very wilted and the whites are al dente. Set aside. Wipe out the skillet and return to medium heat. Add 1 tablespoon of olive oil and swirl it to coat the pan. Pour in half the egg mixture. Using a spatula or fork slowly scramble the eggs – waiting for large curds to form on the bottom before redistributing into an even layer. When there is only a slight layer of uncooked egg, sprinkle half the omelet with half the mushroom mixture and top with half the cheese. Slide your spatula around the edges to loosen the omelet. Tilt the pan and tap it against the stove or counter top to loosen even more. Tilting the pan, slide the naked side of the omelet towards you and gently fold in half to sandwich the filling side. Place a plate over the pan and invert the omelet onto it. Repeat with the remaining ingredients. Serve alongside mixed greens and/or skillet home fries.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatless-monday-ramp-and-mushroom-omelets-479455', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}