{u'recipes': [{u'sourceName': u'How Sweet Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/525777-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 525777, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skillet Brussels Bacon Mac', u'diets': [], u'pricePerServing': 314.92, u'creditText': u'How Sweet Eats', u'extendedIngredients': [{u'originalString': u'6 slices of bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'2 tablespoons fine breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18079, u'unit': u'tablespoons'}, {u'originalString': u'1/2 pound of brussels sprouts, stems removed and sliced/chopped', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11098, u'unit': u'pound'}, {u'originalString': u'1 pound of cooked pasta, smaller noodles desired', u'aisle': u'Pasta and Rice', u'name': u'cooked pasta', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20421, u'unit': u'pound'}, {u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces fontina cheese, freshly grated', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1020, u'unit': u'ounces'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup panko bread crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'2 ounces parmesan cheese, freshly grated', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'ounces'}, {u'originalString': u'1 shallot, diced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces white cheddar cheese, freshly grated', u'aisle': u'Cheese', u'name': u'white cheddar cheese', u'metaInformation': [u'white', u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-block.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1011009, u'unit': u'ounces'}, {u'originalString': u'2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.howsweeteats.com/2013/11/fontina-and-white-cheddar-skillet-brussels-bacon-mac/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat a large, 12-inch oven-safe skillet oven medium-low heat and add bacon. Cook until the fat is just rendered, then removed about 1/4 of the bacon and set it aside in a bowl. Cook the remaining bacon until completely crispy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Add in the shallot, garlic and brussels spouts, stirring well to coat. Cook until the brussels soften, about 5 minutes. Turn off the heat and toss the pasta in with the brussels.To make the cheese sauce. heat a small saucepan over medium heat and add the butter. Once it's sizzling, whisk in the flour to create a roux and cook until it is golden brown, about 2 to 3 minutes.", u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in the milk and the half and half, stirring the entire time and cook until it is slightly thickened, about 5 minutes. Stir in the fontina, cheddar and parm, stirring until the cheese is melted. Stir in the nutmeg. Once the cheese is melted, pour it over the pasta in the skillet and toss well to coat.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add the panko and fine breadcrumbs over top of the pasta and sprinkle on the bacon that your set aside earlier.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}]}, {u'equipment': [], u'step': u'Bake for 30 to 35 minutes, or until the top is golden and bubbly.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 4897, u'instructions': u"Preheat oven to 375 degrees F.Heat a large, 12-inch oven-safe skillet oven medium-low heat and add bacon. Cook until the fat is just rendered, then removed about 1/4 of the bacon and set it aside in a bowl. Cook the remaining bacon until completely crispy. Add in the shallot, garlic and brussels spouts, stirring well to coat. Cook until the brussels soften, about 5 minutes. Turn off the heat and toss the pasta in with the brussels.To make the cheese sauce. heat a small saucepan over medium heat and add the butter. Once it's sizzling, whisk in the flour to create a roux and cook until it is golden brown, about 2 to 3 minutes. Pour in the milk and the half and half, stirring the entire time and cook until it is slightly thickened, about 5 minutes. Stir in the fontina, cheddar and parm, stirring until the cheese is melted. Stir in the nutmeg. Once the cheese is melted, pour it over the pasta in the skillet and toss well to coat. Add the panko and fine breadcrumbs over top of the pasta and sprinkle on the bacon that your set aside earlier.Bake for 30 to 35 minutes, or until the top is golden and bubbly.", u'spoonacularSourceUrl': u'https://spoonacular.com/skillet-brussels-bacon-mac-525777', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}