{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600439-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 600439, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stuffed Manicotti – just like Mom used to make', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 674.79, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 tablespoon sweet basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoon'}, {u'originalString': u'1 cup beef gravy', u'aisle': u'Canned and Jarred', u'name': u'beef gravy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6997, u'unit': u'cup'}, {u'originalString': u'1 cup breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 pounds ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'1 pound mozzarella cheese, chopped', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'pound'}, {u'originalString': u'2 8 ounce packages manicotti Romano cheese', u'aisle': u'Cheese', u'name': u'romano cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1038, u'unit': u'ounce'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'2 cup tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.copykat.com/2009/05/10/stuffed-manicotti-just-like-mom-used-to-make/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 51, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Combine tomato sauce, gravy, garlic, sugar, basil, and 4 cups water. Bring to boil and simmer until thick and set aside. Brown beef in large skillet and add salt, pepper, breadcrumbs, and mozzarella cheese. Stir over heat until cheese is soft, cool.Prepare 16 Manicotti's fill each with meat mixture.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'id': 6997, u'name': u'gravy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place in single layers in a baking dish. Cover completely with sauce.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350 degrees for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with remaining sauce and sprinkle grated Romano cheese on top.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'romano cheese'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 99, u'instructions': u"Combine tomato sauce, gravy, garlic, sugar, basil, and 4 cups water. Bring to boil and simmer until thick and set aside. Brown beef in large skillet and add salt, pepper, breadcrumbs, and mozzarella cheese. Stir over heat until cheese is soft, cool.Prepare 16 Manicotti's fill each with meat mixture. Place in single layers in a baking dish. Cover completely with sauce. Bake at 350 degrees for 20 minutes. Serve with remaining sauce and sprinkle grated Romano cheese on top.", u'spoonacularSourceUrl': u'https://spoonacular.com/stuffed-manicotti-just-like-mom-used-to-make-600439', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}