{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/741131-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 741131, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eggplant Parmesan Hero', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 382.95, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 large eggplant, sliced into 1/4-inch-thick rounds', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'large', u'sliced into 1/4-inch-thick rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'3 eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 pound fresh mozzarella, sliced', u'aisle': u'Cheese', u'name': u'fresh mozzarella', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'pound'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 cups marinara sauce, warmed', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'cups'}, {u'originalString': u'Oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'2 cups panko breadcrumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cups'}, {u'originalString': u'1/2 cup grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'4 hoagie rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}], u'healthScore': 21.0, u'imageType': u'jpeg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/amanda-freitag/eggplant-parmesan-hero.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a skillet or cast-iron pan over medium-high heat and fill with 1/2-inch oil. Preheat the broiler.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the eggs in a shallow bowl. In a separate shallow bowl, mix the breadcrumbs, Parmesan and some salt and pepper. Coat each slice of eggplant with the eggs, and then dredge through the breadcrumbs, pressing to adhere. (The eggplant slices can be frozen at this point for later use.)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Fry the eggplant slices in batches until brown and crispy, about 3 minutes per side.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [], u'step': u'Remove to a paper-towel-lined plate and repeat for the remaining slices.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the bottom half of a roll with 1/4 cup of the marinara.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place 3 slices of the fried eggplant on top, another 1/4 cup of the marinara and finish with one-quarter of the mozzarella. Repeat for the remaining rolls. Broil the sandwiches until the cheese melts, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 28, u'instructions': u'Heat a skillet or cast-iron pan over medium-high heat and fill with 1/2-inch oil. Preheat the broiler.                          Place the eggs in a shallow bowl. In a separate shallow bowl, mix the breadcrumbs, Parmesan and some salt and pepper. Coat each slice of eggplant with the eggs, and then dredge through the breadcrumbs, pressing to adhere. (The eggplant slices can be frozen at this point for later use.)                          Fry the eggplant slices in batches until brown and crispy, about 3 minutes per side. Remove to a paper-towel-lined plate and repeat for the remaining slices. Spread the bottom half of a roll with 1/4 cup of the marinara. Place 3 slices of the fried eggplant on top, another 1/4 cup of the marinara and finish with one-quarter of the mozzarella. Repeat for the remaining rolls. Broil the sandwiches until the cheese melts, 2 to 3 minutes. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/eggplant-parmesan-hero-741131', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}