{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/199999-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199999, u'veryPopular': False, u'lowFodmap': True, u'title': u'Chicken Heart Yakitori', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 294.34, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 chicken carcasses cut into 6 to 8 pieces', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'cut into 6 to 8 pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1025006, u'unit': u''}, {u'originalString': u'1 pound chicken hearts', u'aisle': u'Meat', u'name': u'chicken hearts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-hearts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 5025, u'unit': u'pound'}, {u'originalString': u'1 cup mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93830, u'unit': u'cup'}, {u'originalString': u'1 cup sake', u'aisle': u'Alcoholic Beverages', u'name': u'sake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 43479, u'unit': u'cup'}, {u'originalString': u'1 to 1/2 cups soy sauce, depending on darkness', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'cups'}, {u'originalString': u'3 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/05/chicken-heart-yakitori-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread the bones in a saute pan and roast until the bones are brown and the fond at the bottom of the pan is beginning to darken, about one hour.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the oven and put on a stovetop.  Deglaze the pan with about 1/3 cup of the sake, scraping up the browned bits until the bottom of the pan is clean.  Then add in the rest of the sake, mirin, sugar, and soy sauce. Bring to a boil, then simmer until the sauce is thickened, about one hour. Season with black pepper.   Leftover sauce will keep in the refrigerator indefinitely if reheated once a week.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'id': 93830, u'name': u'mirin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'id': 43479, u'name': u'sake'}]}, {u'equipment': [], u'step': u'3', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'To grill: skewer chicken hearts and set over a medium high flame.  When the chicken hearts are almost cooked through, about 2 minutes, baste with the sauce and grill again until sauce is dried, about 20 seconds. Baste again and grill just until the sauce is starting to dry, about 10 seconds.  Sprinkle with sansho pepper if desired.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-hearts.jpg', u'id': 5025, u'name': u'chicken hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Serve with wedges of lemon, salt, and mustard on the side.', u'number': 7, u'ingredients': []}], u'name': u'To make the sauce'}], u'winePairing': {u'pairingText': u'Yakitori works really well with Riesling, Sake, and Sauvignon Blanc. Sak\xe9 is an obvious choice when it comes to Japanese food. If you want to stick to grape wine, though, you might opt for sauvignon blanc or riesling. The Chateau Ste. Michelle Cold Creek Vineyard Riesling with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'riesling', u'sake', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Cold Creek Riesling is made from 40-year-old vines which contribute fruit intensity and concentration. This is a ripe, lush style of Riesling with aromas of ripe peaches, dried apricots and spice notes. It displays beautiful ripe fruit flavors with a crisp finish.', u'title': u'Chateau Ste. Michelle Cold Creek Vineyard Riesling', u'price': u'$14.99', u'id': 438970, u'link': u'https://www.wine.com/product/chateau-ste-michelle-cold-creek-vineyard-riesling-2013/132851', u'imageUrl': u'https://spoonacular.com/productImages/438970-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'Procedures                                                                              1                                                                            To make the sauce: Heat oven to 400 degrees.  Spread the bones in a saute pan and roast until the bones are brown and the fond at the bottom of the pan is beginning to darken, about one hour.                                                                                                                             2                                                                            Remove the pan from the oven and put on a stovetop.  Deglaze the pan with about 1/3 cup of the sake, scraping up the browned bits until the bottom of the pan is clean.  Then add in the rest of the sake, mirin, sugar, and soy sauce. Bring to a boil, then simmer until the sauce is thickened, about one hour. Season with black pepper.   Leftover sauce will keep in the refrigerator indefinitely if reheated once a week.                                                                                                                              3                                                                            To grill: skewer chicken hearts and set over a medium high flame.  When the chicken hearts are almost cooked through, about 2 minutes, baste with the sauce and grill again until sauce is dried, about 20 seconds. Baste again and grill just until the sauce is starting to dry, about 10 seconds.  Sprinkle with sansho pepper if desired.  Serve with wedges of lemon, salt, and mustard on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-heart-yakitori-199999', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}