{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522500-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 522500, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salmon and vegetables pot pie', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 361.21, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'1 bell pepper (whatever color), seeded and roughly chopped', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'seeded', u'roughly chopped', u'(whatever color)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'3 tbsps. of butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsps'}, {u'originalString': u'1 carrot, cut into 3/4-inch cubes', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'cut into 3/4-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 large onion, roughly chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'400 g. of salmon fillet, cut into one-inch cubes', u'aisle': u'Seafood', u'name': u'salmon fillet', u'metaInformation': [u'cut into one-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 15076, u'unit': u'g'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 c. of sour cream (substitute yogurt is you prefer less fat in the filling)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour', u'(substitute yogurt is you prefer less fat in the filling)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1056, u'unit': u'c'}, {u'originalString': u'10 to 12 beans (Baguio beans or something similar like French beans), stringed and cut into one-inch lengths', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'french', u'cut into one-inch lengths', u'(Baguio beans or something similar like beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 16033, u'unit': u''}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://casaveneracion.com/salmon-and-vegetables-pot-pie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Gather the pie crust dough into a ball, wrap with cling film and chill in the fridge while you make the filling.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tbsp. of butter in a pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the carrot cubes and cook, stirring, for about 30 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Add the beans, bell pepper and onion. Season lightly with salt and pepper. Cook for a minute, stirring often. Scoop out with a slotted spoon and set aside.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining butter to the pan. When the butter is hot, add the salmon. Season with salt and pepper. Cook just until the fish cubes turn opaque.Return the vegetables to the pan. Stir. Cook just until heated through.Turn off the heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [], u'step': u'Pour in the sour cream. Stir.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Transfer to a shallow bowl or plate and cool.Preheat the oven to 400F.Take the pie crust dough out of the fridge and unwrap.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Roll between two sheets of baking paper until less than 1/4 inch in thickness.Divide the salmon and vegetables filling among three ramekins.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Cut the dough into circles about two inches larger than the rim of the ramekins. Cover the ramekins with the dough pressing the edges on the sides of the ramekin.Pierce the crust with a fork, about four times for each pie, then brush the top with the beaten egg. If you need a visual guide for this part of the process, refer to the photos and instructions in the basic pie crust recipe.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bake the pot pies at 400F for 20 minutes or until the tops are nicely browned.The pot pies can be served as soon as they come out of the oven. BUT be careful when you start eating because the pie, especially the filling, is very, very hot and can scorch your mouth.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Luna Nuda Pinot Grigio with a 4.4 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste.', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 34, u'instructions': u'InstructionsGather the pie crust dough into a ball, wrap with cling film and chill in the fridge while you make the filling.Heat 1 tbsp. of butter in a pan. Add the carrot cubes and cook, stirring, for about 30 seconds. Add the beans, bell pepper and onion. Season lightly with salt and pepper. Cook for a minute, stirring often. Scoop out with a slotted spoon and set aside.Add the remaining butter to the pan. When the butter is hot, add the salmon. Season with salt and pepper. Cook just until the fish cubes turn opaque.Return the vegetables to the pan. Stir. Cook just until heated through.Turn off the heat. Pour in the sour cream. Stir. Transfer to a shallow bowl or plate and cool.Preheat the oven to 400F.Take the pie crust dough out of the fridge and unwrap. Roll between two sheets of baking paper until less than 1/4 inch in thickness.Divide the salmon and vegetables filling among three ramekins.Cut the dough into circles about two inches larger than the rim of the ramekins. Cover the ramekins with the dough pressing the edges on the sides of the ramekin.Pierce the crust with a fork, about four times for each pie, then brush the top with the beaten egg. If you need a visual guide for this part of the process, refer to the photos and instructions in the basic pie crust recipe.Bake the pot pies at 400F for 20 minutes or until the tops are nicely browned.The pot pies can be served as soon as they come out of the oven. BUT be careful when you start eating because the pie, especially the filling, is very, very hot and can scorch your mouth.', u'spoonacularSourceUrl': u'https://spoonacular.com/salmon-and-vegetables-pot-pie-522500', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}