{u'recipes': [{u'sourceName': u'Green Lite Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/506371-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 506371, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quick Spicy Butternut Black Beans and Peas', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'pricePerServing': 100.76, u'creditText': u'Green Lite Bites', u'extendedIngredients': [{u'originalString': u'250g of cubed Butternut Squash ( - 2 cups)', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'8 oz can of tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'oz'}, {u'originalString': u'1 tsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'1 tsp cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 tsp dried minced onion (I was just too lazy to use fresh)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'dried', u'fresh', u'minced', u'(I was just too lazy to use )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'tsp'}, {u'originalString': u'1 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'1 dried hot pepper chopped (or red pepper flakes to taste)', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'dried', u'red', u'hot', u'chopped', u'to taste', u'(or pepper flakes )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 can of Black Bean drained and rinsed', u'aisle': u'Produce', u'name': u'yam bean', u'metaInformation': [u'black', u'drained and rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jicama.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11603, u'unit': u'can'}], u'healthScore': 85.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://greenlitebites.com/2012/12/12/spicy-butternut-black-beans-peas/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a medium sized pot over medium-high heat. Spray with non-stick cooking spray and add the cubed squash. Brown them on one side before tossing. The goal is to get a little caramelization.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [], u'step': u'Add the beans, sauce, hot pepper, garlic powder, chili powder, and cumin. Bring to a boil and then lower to a simmer.Simmer until the squash is tender, about 20 minutes.Once the squash is cooked to your liking, add the frozen peas.Stir in and serve!Sorry about the photos. It gets so dark so early! It’s one of the reasons I haven’t been sharing dinner ideas. Here’s the one I instagram-ed.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 29, u'instructions': u'Heat a medium sized pot over medium-high heat. Spray with non-stick cooking spray and add the cubed squash. Brown them on one side before tossing. The goal is to get a little caramelization.Add the beans, sauce, hot pepper, garlic powder, chili powder, and cumin. Bring to a boil and then lower to a simmer.Simmer until the squash is tender, about 20 minutes.Once the squash is cooked to your liking, add the frozen peas.Stir in and serve!Sorry about the photos. It gets so dark so early! It’s one of the reasons I haven’t been sharing dinner ideas. Here’s the one I instagram-ed.', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-spicy-butternut-black-beans-and-peas-506371', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}