{u'recipes': [{u'sourceName': u'Beyond Frosting', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/813823-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 813823, u'veryPopular': True, u'lowFodmap': False, u'title': u'No-Churn Fudgy Brownie Batter Ice Cream', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 95.96, u'creditText': u'Beyond Frosting', u'extendedIngredients': [{u'originalString': u'1 C Brownie mix, dry', u'aisle': u'Baking', u'name': u'brownie mix', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18632, u'unit': u'C'}, {u'originalString': u'\xbd C Hot fudge sauce', u'aisle': u'Frozen', u'name': u'hot fudge sauce', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019348, u'unit': u'C'}, {u'originalString': u'1 containers Cool Whip (8 oz each), thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'2 C Brownie chunks (brownies prepared in advance)', u'aisle': u'Health Foods', u'name': u'soy chunks', u'metaInformation': [u'prepared', u'(brownies in advance)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tvp.png', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 98854, u'unit': u'C'}, {u'originalString': u'1can Sweetened condensed milk (14 oz)', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://beyondfrosting.com/2015/07/01/no-churn-fudgy-brownie-batter-ice-cream/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Prepare a batch of brownies and allow to cool.In a large mixing bowl, combine sweetened condensed milk and dry brownie mix. Beat until well incorporated.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'id': 18632, u'name': u'brownie mix'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Add thawed container of Cool Whip. Filling must be well mixed; use a spatula to overturn the mixture from the bottom to the top if necessary.Break brownies into chunks and mix into ice cream. Save a handful to sprinkle on top.Microwave hot fudge sauce for 30 seconds. Spoon some onto the top of the ice cream and swirl with a knife.Freeze for 4-6 hours until firm.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'id': 10019348, u'name': u'hot fudge sauce'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 3270, u'instructions': u'Prepare a batch of brownies and allow to cool.In a large mixing bowl, combine sweetened condensed milk and dry brownie mix. Beat until well incorporated. Add thawed container of Cool Whip. Filling must be well mixed; use a spatula to overturn the mixture from the bottom to the top if necessary.Break brownies into chunks and mix into ice cream. Save a handful to sprinkle on top.Microwave hot fudge sauce for 30 seconds. Spoon some onto the top of the ice cream and swirl with a knife.Freeze for 4-6 hours until firm.', u'spoonacularSourceUrl': u'https://spoonacular.com/no-churn-fudgy-brownie-batter-ice-cream-813823', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}