{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/214464-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 214464, u'veryPopular': False, u'lowFodmap': False, u'title': u"Goat's cheese & cranberry tartlets", u'diets': [], u'pricePerServing': 43.18, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u"3 x 120g goat's cheese logs (such as Soignon Petit Sainte-Maure), at room temperature", u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'at room temperature', u'(such as Soignon Petit Sainte-Maure)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1159, u'unit': u''}, {u'originalString': u'3 tbsp cranberry sauce or a good-quality chutney', u'aisle': u'Condiments', u'name': u'mint chutney', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint-chutney.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 98991, u'unit': u'tbsp'}, {u'originalString': u'extra-virgin olive oil, for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'375-425g pack ready-rolled puff pastry or 500g pack ready-made pastry rolled 5mm thick', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 375.0, u'consistency': u'solid', u'id': 18337, u'unit': u'g'}, {u'originalString': u'rocket leaves, to serve', u'aisle': u'Produce', u'name': u'rocket', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'leaves'}, {u'originalString': u'1 tbsp fresh thyme leaf', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tbsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1602/goats-cheese-and-cranberry-tartlets', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Preheat oven to fan 200C/conventional 220C/gas 7. Lay pastry on a floured work surface. Using a round 7.5cm round pastry cutter, cut out as many circles as possible.Sit them on oiled baking sheets and score a circle about 2.5cm in from the edge of each disc by pressing gently with a 5cm cutter. Pierce the middle of each with a fork, brush with egg and top with a little cranberry sauce or chutney.Slice the cheese 5mm thick so you have a slice per disc (discard end rinds). Lay a slice on each tartlet, then top with thyme leaves, a drizzle of oil and a twist of black pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 10-15 minutes until the cheese is golden and the pastry crispy. Cool for 5 minutes and serve warm, garnished with rocket leaves.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Mumm Napa Cuvee M with a 4.1 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"The naturally ripened fruit selected from more than 50 separate vineyards, reveals layers of crisp and creamy textures that are rich and lingering. Individually selected lots were kept separate during initial fermentation in order to highlight their vineyard differences and extract the quintessence of their specific strengths. The resulting blend is a soft and elegant wine that highlights the delicious and powerful ripe fruit flavors that characterize the world-class grapes of the Napa Valley.Cuv\xe9e M exhibits a graceful stream of very fine bubbles gently rising to a persistent mousse cordon with a light peach rose color. The aromas are elegant, rich and complex, showing fresh white and yellow stone fruits with subtle hints of wild strawberry. A light touch of fresh brioche, with hints of vanilla and honey add to the wine's complex bouquet. On the palate, full flavors of peach and pear combine with a creamy caramel character, which lingers into a long satisfying finish.Mumm Napa's Cuv\xe9e M is the perfect sparkling wine for champagne cocktails or as an ap\xe9ritif to pair with hors d'oeuvres. It is also a perfect match with creamy desserts and spicy foods. View More", u'title': u'Mumm Napa Cuvee M', u'price': u'$19.99', u'id': 451872, u'link': u'https://www.wine.com/product/mumm-napa-cuvee-m/80229', u'imageUrl': u'https://spoonacular.com/productImages/451872-312x231.jpg'}]}, u'aggregateLikes': 362, u'instructions': u'Preheat oven to fan 200C/conventional 220C/gas 7. Lay pastry on a floured work surface. Using a round 7.5cm round pastry cutter, cut out as many circles as possible.Sit them on oiled baking sheets and score a circle about 2.5cm in from the edge of each disc by pressing gently with a 5cm cutter. Pierce the middle of each with a fork, brush with egg and top with a little cranberry sauce or chutney.Slice the cheese 5mm thick so you have a slice per disc (discard end rinds). Lay a slice on each tartlet, then top with thyme leaves, a drizzle of oil and a twist of black pepper.Bake for 10-15 minutes until the cheese is golden and the pastry crispy. Cool for 5 minutes and serve warm, garnished with rocket leaves.', u'spoonacularSourceUrl': u'https://spoonacular.com/goats-cheese-cranberry-tartlets-214464', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}