{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/443665-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 443665, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sage Polenta', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 38.69, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 teaspoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'1 cup cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 35137, u'unit': u'cup'}, {u'originalString': u'1 cup fat-free milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free milk', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'2 tablespoons minced fresh sage', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2038, u'unit': u'tablespoons'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup chopped sweet red pepper', u'aisle': u'Produce', u'name': u'red sweet pepper', u'metaInformation': [u'sweet', u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/sage-polenta', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a large nonstick saucepan, saute the onion, red pepper and garlic in butter until tender. Stir in water and milk; bring to a boil over medium heat. Gradually whisk in cornmeal, whisking constantly to prevent lumping. Reduce heat; cover and simmer for 8-10 minutes or until cornmeal is tender.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Stir in the Parmesan cheese, sage, salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread into a 13-in. x 9-in. pan coated with cooking spray. Cover and refrigerate for 30-45 minutes or until firm.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut into 12 squares. In a large nonstick skillet, cook polenta in batches in oil over medium-high heat for 3-4 minutes on each side or until lightly browned.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6, u'instructions': u'Directions                                                                                In a large nonstick saucepan, saute the onion, red pepper and garlic in butter until tender. Stir in water and milk; bring to a boil over medium heat. Gradually whisk in cornmeal, whisking constantly to prevent lumping. Reduce heat; cover and simmer for 8-10 minutes or until cornmeal is tender.                                                                                            Stir in the Parmesan cheese, sage, salt and pepper. Spread into a 13-in. x 9-in. pan coated with cooking spray. Cover and refrigerate for 30-45 minutes or until firm.                                                                                           Cut into 12 squares. In a large nonstick skillet, cook polenta in batches in oil over medium-high heat for 3-4 minutes on each side or until lightly browned. Serve warm.                                        Yield: 6 servings.                                                                                                                         Originally published as Sage Polenta in  Light & TastyApril/May 2005, p55                                                                                                                                                                                                        Nutritional Facts                                                                             2 squares equals 143 calories, 4 g fat (1 g saturated fat), 5 mg cholesterol, 386 mg sodium, 22 g carbohydrate, 2 g fiber, 5 g protein. Diabetic Exchanges: 1-1/2 starch, 1/2 fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/sage-polenta-443665', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}