{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/35256-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 35256, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Peanut Butter No-Bake Cake', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 79.75, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1/4 cup creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'1 pkg. (4-serving size) JELL-O Chocolate Flavor Instant Pudding', u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [u'(4-serving size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 19184, u'unit': u'pkg'}, {u'originalString': u'1 cup cold milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u"2 oz. BAKER'S Semi-Sweet Chocolate", u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'2 cups whole strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'55 vanilla wafers, divided', u'aisle': u'Sweet Snacks', u'name': u'vanilla wafers', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-wafers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 55.0, u'consistency': u'solid', u'id': 18609, u'unit': u''}, {u'originalString': u'1-1/2 cups thawed COOL WHIP Whipped Topping', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 42135, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/nilla-chocolate-peanut-butter-75985.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add milk to peanut butter in medium bowl, beating with wire whisk until well blended.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add dry pudding mix.  Beat 2  min. or until well blended.  Stir in the whipped topping.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}]}, {u'equipment': [], u'step': u'Reserve 5 of the wafers for later use.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Spread about 1 tsp. of the pudding mixture onto each of the remaining 50 wafers.  Stack wafers together, standing them on edge around outer edge of round serving platter to form a ring.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Spread with the remaining pudding mixture. Refrigerate 6 hours or overnight.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Crush remaining 5 wafers; sprinkle over dessert. Make chocolate curls. Top with the chocolate curls.  Fill center of ring with strawberries. Store leftover dessert in refrigerator.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'id': 10119903, u'name': u'chocolate curls'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Add milk to peanut butter in medium bowl, beating with wire whisk until well blended.  Add dry pudding mix.  Beat 2  min. or until well blended.  Stir in the whipped topping.                                              Reserve 5 of the wafers for later use.  Spread about 1 tsp. of the pudding mixture onto each of the remaining 50 wafers.  Stack wafers together, standing them on edge around outer edge of round serving platter to form a ring.  Spread with the remaining pudding mixture. Refrigerate 6 hours or overnight.                                            Crush remaining 5 wafers; sprinkle over dessert. Make chocolate curls. Top with the chocolate curls.  Fill center of ring with strawberries. Store leftover dessert in refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-peanut-butter-no-bake-cake-35256', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 380, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}