{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/247251-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 247251, u'veryPopular': True, u'lowFodmap': False, u'title': u'Baked Stuffed Clams', u'diets': [u'pescatarian'], u'pricePerServing': 94.97, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1 cup bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1/2 cup butter (1 stick)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 Tbsp clam juice (or cooking liquid from steaming the clams)', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'clam juice', u'metaInformation': [u'(or cooking liquid from steaming the clams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clam-juice.png', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14187, u'unit': u'Tbsp'}, {u'originalString': u'10 large chowder or quahog clams, rinsed, sand and grit removed', u'aisle': u'Seafood', u'name': u'clams', u'metaInformation': [u'large', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 15157, u'unit': u''}, {u'originalString': u'2 Tbsp chopped fresh parsley (or 2 teaspoons dried)', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'dried', u'fresh', u'chopped', u'(or 2 teaspoons )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 Tbsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11282, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Salt and freshly ground pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/baked_stuffed_clams/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'1 Fill a large pot with 1 1/2 to 2 inches of water.  Bring water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the clams to the boiling water. Reduce the heat to a simmer and let the clams steam for approximately 6-10 minutes, until the shells open.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Remove clams from the pot and let cool enough to handle.  Discard any clams that have not opened (if they haven't opened it means they were dead to begin with and should not be eaten).2", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove the clam meat from the clams (not the clam foot which is attached to the shell) and mince finely.  Break apart the clam shells from their hinges.  Rinse. Pick 10-12 of the cleanest, nicest looking clam shells and set aside.3 Preheat oven to 350\xb0F.  In a saut\xe9 pan, melt the butter on medium heat and add the minced onion.  Once the onions have softened (2-3 minutes), add the garlic.  Cook the garlic for 1 minute, then add the parsley, bread crumbs, minced clams, lemon juice, and clam juice.  Stir until the stuffing mixture is completely moistened.  (If too dry, add a bit more butter or clam juice; if too wet, add a bit more bread crumbs.) 4 Lay clam shells on a baking dish.  Scoop a little stuffing mixture onto each clam shell.  Sprinkle with grated Parmesan.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clam-juice.png', u'id': 14187, u'name': u'clam juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [], u'step': u'Bake for approximately 20-25 minutes, until Parmesan is lightly browned on top.Variation:Cook a few strips of bacon until fat renders but not brown or crispy, chop and mix in with the stuffing.  Use crumbled up Ritz crackers for the breadcrumbs. So good!', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'aggregateLikes': 764, u'instructions': u"1 Fill a large pot with 1 1/2 to 2 inches of water.  Bring water to a boil.  Add the clams to the boiling water. Reduce the heat to a simmer and let the clams steam for approximately 6-10 minutes, until the shells open.  Remove clams from the pot and let cool enough to handle.  Discard any clams that have not opened (if they haven't opened it means they were dead to begin with and should not be eaten).2 Remove the clam meat from the clams (not the clam foot which is attached to the shell) and mince finely.  Break apart the clam shells from their hinges.  Rinse. Pick 10-12 of the cleanest, nicest looking clam shells and set aside.3 Preheat oven to 350\xb0F.  In a saut\xe9 pan, melt the butter on medium heat and add the minced onion.  Once the onions have softened (2-3 minutes), add the garlic.  Cook the garlic for 1 minute, then add the parsley, bread crumbs, minced clams, lemon juice, and clam juice.  Stir until the stuffing mixture is completely moistened.  (If too dry, add a bit more butter or clam juice; if too wet, add a bit more bread crumbs.) 4 Lay clam shells on a baking dish.  Scoop a little stuffing mixture onto each clam shell.  Sprinkle with grated Parmesan.  Bake for approximately 20-25 minutes, until Parmesan is lightly browned on top.Variation:Cook a few strips of bacon until fat renders but not brown or crispy, chop and mix in with the stuffing.  Use crumbled up Ritz crackers for the breadcrumbs. So good!", u'spoonacularSourceUrl': u'https://spoonacular.com/baked-stuffed-clams-247251', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}