{u'recipes': [{u'sourceName': u'Saveur', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/722430-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 722430, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cr\xeapes', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 22.15, u'creditText': u'Saveur', u'extendedIngredients': [{u'originalString': u'2 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 1⁄4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 1⁄2 tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1⁄2 cup skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1 1⁄2 tsp. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}, {u'originalString': u'2 tbsp. unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'Vegetable oil, for greasing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'2 1⁄2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.saveur.com/jacques-torres-crepe-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [], u'winePairing': {u'pairingText': u'Zinfandel, Riesling, and Sparkling Wine are my top picks for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Rombauer California Zinfandel with a 4.6 out of 5 star rating seems like a good match. It costs about 30 dollars per bottle.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'Opening with a burst, this wine boasts aromas of blackberry and boysenberry jam. On the palate, rich, juicy fruit loaded with ripe wild berries, plum, fig and black cherry flavors. Supple tannins and smooth oak notes show in the lush, mouth-filling finish. Our favorite pairings for this wine include braised short ribs over wild mushroom risotto, pizza, and pork tenderloin. View More', u'title': u'Rombauer California Zinfandel', u'price': u'$29.99', u'id': 440433, u'link': u'https://www.wine.com/product/rombauer-california-zinfandel-2008/103442', u'imageUrl': u'https://spoonacular.com/productImages/440433-312x231.jpg'}]}, u'aggregateLikes': 122, u'instructions': u'Instructions', u'spoonacularSourceUrl': u'https://spoonacular.com/crpes-722430', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}