{u'recipes': [{u'sourceName': u'Cup Cake Project', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/518546-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 518546, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hemp Tarts – Cupcake Style', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 60.14, u'creditText': u'Cup Cake Project', u'extendedIngredients': [{u'originalString': u'Fresh berries for topping', u'aisle': u'Produce', u'name': u'berries', u'metaInformation': [u'fresh', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'servings'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 C flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'C'}, {u'originalString': u'1 2/3 C hemp milk, scalded (just before boiling)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hemp milk', u'metaInformation': [u'boiling', u'(just before )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hemp-milk.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.6666666666666665, u'consistency': u'liquid', u'id': 98874, u'unit': u'C'}, {u'originalString': u'10 oz hemp seeds', u'aisle': u'Health Foods', u'name': u'hemp seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shelled-hemp-seeds.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 93602, u'unit': u'oz'}, {u'originalString': u'zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'a pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1/2 C sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'C'}, {u'originalString': u'1/2 C unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'C'}, {u'originalString': u'1/2 tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.cupcakeproject.com/2011/05/hemp-tarts-cupcake-style.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Mix all ingredients in a medium-sized mixing bowl.    Refrigerate for at least ten minutes.    Divide the crust evenly between 24 cupcake liners.  Press the crust up the sides of the liners all the way to the top.  The crust should be at least 1/8 inch thick at all points.  If it is too thin, the crust may burn.In a medium-sized bowl, beat eggs thoroughly.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix in sugar, salt, vanilla, and lemon zest.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix in hemp milk a little bit at a time (too much hot milk at once could start to cook the eggs).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hemp-milk.jpg', u'id': 98874, u'name': u'hemp milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Spoon custard into prepared crusts.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350 F for 25 minutes.    Top with fresh berries.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'id': 1009054, u'name': u'berries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cupcakes. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 126, u'instructions': u'Mix all ingredients in a medium-sized mixing bowl.    Refrigerate for at least ten minutes.    Divide the crust evenly between 24 cupcake liners.  Press the crust up the sides of the liners all the way to the top.  The crust should be at least 1/8 inch thick at all points.  If it is too thin, the crust may burn.In a medium-sized bowl, beat eggs thoroughly.    Mix in sugar, salt, vanilla, and lemon zest.    Mix in hemp milk a little bit at a time (too much hot milk at once could start to cook the eggs).     Spoon custard into prepared crusts.    Bake at 350 F for 25 minutes.    Top with fresh berries.', u'spoonacularSourceUrl': u'https://spoonacular.com/hemp-tarts-cupcake-style-518546', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}