{u'recipes': [{u'sourceName': u'Eat at Home Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/504716-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 504716, u'veryPopular': False, u'lowFodmap': False, u'title': u'Asian Chicken Lettuce Wraps', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 123.25, u'creditText': u'Eat at Home Cooks', u'extendedIngredients': [{u'originalString': u'1-2 lbs.boneless chicken breasts or tenders', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5062, u'unit': u'lbs'}, {u'originalString': u'cooked rice (I made 2 cups of rice, which results in a lot of rice)', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cups'}, {u'originalString': u'green onions, sliced (2-4, depending on how much rice you use)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced', u'(2-4, depending on how much rice you use)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'1 jar hoisin sauce', u'aisle': u'Ethnic Foods', u'name': u'hoisin sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 6175, u'unit': u'jar'}, {u'originalString': u'lettuce variety that has large leaves, cleaned and patted dry', u'aisle': u'Produce', u'name': u'lettuce leaves', u'metaInformation': [u'dry', u'large', u'cleaned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 93623, u'unit': u'leaves'}, {u'originalString': u'can of water chestnuts, roughly chopped', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'water chestnuts', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-chestnuts.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11590, u'unit': u'servings'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://eatathomecooks.com/2009/06/asian-chicken-lettuce-wraps.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Cook the rice according to the package directions.  Grill the chicken, basting it with hoisin sauce during the last few minutes of the grilling.  While the chicken grills, add the green onions and water chestnuts to the finished rice.  Slice the grilled chicken into thin slices. To assemble the wraps, lay a lettuce leaf on a plate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-chestnuts.jpg', u'id': 11590, u'name': u'water chestnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6175, u'name': u'hoisin sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce', u'id': 93623, u'name': u'lettuce leaf'}]}, {u'equipment': [], u'step': u'Add some rice to the middle of the lettuce.  Be careful not to use too much, or you won’t be able to wrap it.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add some chicken and top with hoisin sauce if you like extra flavor.  These are fun to eat, but messy.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6175, u'name': u'hoisin sauce'}]}, {u'equipment': [], u'step': u'Lettuce does not make a rip-proof wrap.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 183, u'instructions': u'Cook the rice according to the package directions.  Grill the chicken, basting it with hoisin sauce during the last few minutes of the grilling.  While the chicken grills, add the green onions and water chestnuts to the finished rice.  Slice the grilled chicken into thin slices. To assemble the wraps, lay a lettuce leaf on a plate.  Add some rice to the middle of the lettuce.  Be careful not to use too much, or you won’t be able to wrap it.  Add some chicken and top with hoisin sauce if you like extra flavor.  These are fun to eat, but messy.  Lettuce does not make a rip-proof wrap.', u'spoonacularSourceUrl': u'https://spoonacular.com/asian-chicken-lettuce-wraps-504716', u'dishTypes': [u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}