{u'recipes': [{u'sourceName': u'The Culinary Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626251-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 626251, u'veryPopular': False, u'lowFodmap': True, u'title': u'Wintertime Spiced Cranberry Jam', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 45, u'pricePerServing': 14.55, u'creditText': u'The Culinary Life', u'extendedIngredients': [{u'originalString': u'1/4 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoon'}, {u'originalString': u'2 pounds cranberries, frozen or fresh', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 9078, u'unit': u'pounds'}, {u'originalString': u'1/2 teaspoon ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon ground cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons lemon juice from 2 medium lemons', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup orange zest, from 5 large oranges', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9216, u'unit': u'cup'}, {u'originalString': u'1 pound of sugar, divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pound'}, {u'originalString': u'1/4 teaspoon table salt (or 1/2 teaspoon kosher salt)', u'aisle': u'Spices and Seasonings', u'name': u'table salt', u'metaInformation': [u'(or 1/2 teaspoon kosher salt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'https://www.theculinarylife.com/2015/wintertime-spiced-cranberry-jam/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Make sure your jars are sterilized and ready to go. Defrost the cranberries, if using frozen berries. Wash and dry the cranberries, then chop them coarsely with a sharp knife.Sprinkle chopped berries with 1/4 cup of sugar. Stir, cover, and let sit for 30 minutes.While the cranberries are basking in their sugary bath, place a small plate in the freezer so you can test the jam for proper thickness later.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the cranberries, orange zest, lemon juice, cinnamon, allspice, nutmeg, cayenne, and salt to a food processor and pulse a few times until the cranberries are chunky, maintaining a bit of texture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the fruit into a large, deep, heavy-bottomed pot.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/skimmer-spoon.jpg', u'id': 405894, u'name': u'skimmer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add brown sugar, butter, and remaining white sugar, stirring well to combine. Cook over medium heat, stirring occasionally, until the fruit begins to bubble and spit. Use a skimmer to skim off any foam that forms. Cook for about 20 minutes, stirring frequently to keep the fruit from sticking to the bottom of the pot.Begin testing the jam for doneness.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Spread 1/2 teaspoon of cooked fruit on the cold plate and place it back in the freezer. Wait 30 seconds, then run your finger through the fruit. It should be thick enough to maintain a path when you ran your finger through it. If youd like thicker jam, place the plate back in the freezer and cook the fruit for another 3 minutes and test again. Repeat until desired thickness is achieved, but be careful about cooking too long or you will alter the taste and texture of your jam.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove pot from heat and use a spoon to skim any foam from the surface of the fruit. Ladle jam into sterilized jars, leaving 1/2-inch of headroom, and process them in a hot water bath for 10 minutes. Unopened jars will keep at room temperature for up to 6 months. Opened jam should be refrigerated and will last two weeks.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 15, u'instructions': u'Make sure your jars are sterilized and ready to go. Defrost the cranberries, if using frozen berries. Wash and dry the cranberries, then chop them coarsely with a sharp knife.Sprinkle chopped berries with 1/4 cup of sugar. Stir, cover, and let sit for 30 minutes.While the cranberries are basking in their sugary bath, place a small plate in the freezer so you can test the jam for proper thickness later.Add the cranberries, orange zest, lemon juice, cinnamon, allspice, nutmeg, cayenne, and salt to a food processor and pulse a few times until the cranberries are chunky, maintaining a bit of texture.Pour the fruit into a large, deep, heavy-bottomed pot. Add brown sugar, butter, and remaining white sugar, stirring well to combine. Cook over medium heat, stirring occasionally, until the fruit begins to bubble and spit. Use a skimmer to skim off any foam that forms. Cook for about 20 minutes, stirring frequently to keep the fruit from sticking to the bottom of the pot.Begin testing the jam for doneness. Spread 1/2 teaspoon of cooked fruit on the cold plate and place it back in the freezer. Wait 30 seconds, then run your finger through the fruit. It should be thick enough to maintain a path when you ran your finger through it. If youd like thicker jam, place the plate back in the freezer and cook the fruit for another 3 minutes and test again. Repeat until desired thickness is achieved, but be careful about cooking too long or you will alter the taste and texture of your jam.Remove pot from heat and use a spoon to skim any foam from the surface of the fruit. Ladle jam into sterilized jars, leaving 1/2-inch of headroom, and process them in a hot water bath for 10 minutes. Unopened jars will keep at room temperature for up to 6 months. Opened jam should be refrigerated and will last two weeks.', u'spoonacularSourceUrl': u'https://spoonacular.com/wintertime-spiced-cranberry-jam-626251', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 135, u'servings': 60, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}