{u'recipes': [{u'sourceName': u'Pineapple and Coconut', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/588714-556x370.gif', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 588714, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Shredded Chicken Tacos', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 217.17, u'creditText': u'Pineapple and Coconut', u'extendedIngredients': [{u'originalString': u'Sliced black olives', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'servings'}, {u'originalString': u'6” corn tortilla shells (100% gluten free) and or butter lettuce leaves', u'aisle': u'Produce', u'name': u'butter lettuce leaves', u'metaInformation': [u'gluten free', u'100%', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Butter-or-Boston-Bibb-lettuce.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 10011250, u'unit': u'leaves'}, {u'originalString': u'1 – 15 ounce can organic chopped tomatoes with green chilies (Trader Joes Brand)', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'with green chilies (trader joes brand)', u'organic', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'Coconut oil (or olive oil)', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'(or olive oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'servings'}, {u'originalString': u'Cotija cheese (or other crumbly cheese like Feta)', u'aisle': u'Cheese', u'name': u'cotija cheese', u'metaInformation': [u'(or other crumbly cheese like Feta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1001019, u'unit': u'servings'}, {u'originalString': u'\xbd tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'Limes', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'Pickled red onions (I used this recipe here)', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'red', u'(I used this recipe here)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11282, u'unit': u'servings'}, {u'originalString': u'1 C Salsa (green or red, homemade or store-bought)', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'green', u'red', u'homemade', u'store-bought', u'( or , or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6164, u'unit': u'C'}, {u'originalString': u'1 tsp sea salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'2lbs boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lbs'}], u'healthScore': 12.0, u'imageType': u'gif', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.pineappleandcoconut.com/recipes/easy-shredded-chicken-tacos/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Rinse the chicken breasts and place in a saucepan. Fill with cold water so its 1” over the chicken and place on medium-low heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Add in \xbd teaspoon salt and poach until just done, about 20 minutes. The water will be clear until they are close to being cooked and then it will have a white film on the water. Check the thickest and thinnest breasts by removing them and slicing through their thickest parts. Keep checking every few minutes until they are done. You don’t want to overcook them.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Drain the chicken using a colander in the sink and then place the chicken in the bowl of a stand mixer with the paddle attachment in place. Season the chicken with the remaining \xbd teaspoon of salt, the cumin and ground pepper and add in the can of tomatoes with chilies. Start the mixer and bring up the speed to medium-low and mix until the chicken is shredded, about one minute. If there are still some larger pieces remaining, remove the more shredded chicken and leave the larger pieces and turn the mixer back on for another 30 seconds. Keep chicken warm until ready to assemble. It can be kept in a glass bowl in a low oven, 200 Deg F, if desired.These can also be served in lettuce leaves, such as butter lettuce, if going the lower-carb route.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Butter-or-Boston-Bibb-lettuce.jpg', u'id': 11250, u'name': u'butter lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 848, u'instructions': u'Rinse the chicken breasts and place in a saucepan. Fill with cold water so its 1” over the chicken and place on medium-low heat. Add in \xbd teaspoon salt and poach until just done, about 20 minutes. The water will be clear until they are close to being cooked and then it will have a white film on the water. Check the thickest and thinnest breasts by removing them and slicing through their thickest parts. Keep checking every few minutes until they are done. You don’t want to overcook them. Drain the chicken using a colander in the sink and then place the chicken in the bowl of a stand mixer with the paddle attachment in place. Season the chicken with the remaining \xbd teaspoon of salt, the cumin and ground pepper and add in the can of tomatoes with chilies. Start the mixer and bring up the speed to medium-low and mix until the chicken is shredded, about one minute. If there are still some larger pieces remaining, remove the more shredded chicken and leave the larger pieces and turn the mixer back on for another 30 seconds. Keep chicken warm until ready to assemble. It can be kept in a glass bowl in a low oven, 200 Deg F, if desired.These can also be served in lettuce leaves, such as butter lettuce, if going the lower-carb route.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-shredded-chicken-tacos-588714', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}