{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/516815-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 516815, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peanut Butter- Oatmeal Chocolate Chunk Cookies', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 19.5, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'9 ounces bittersweet chocolate, chopped into chunks', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 cup granulated white sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 teaspoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1 cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'3 cups old- fashioned oats', u'aisle': u'Cereal', u'name': u'old fashioned oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'1 cup peanut butter (chunky or smooth)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [u'(chunky or smooth)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup (2 sticks) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.recipegirl.com/2008/08/10/peanut-butter-oatmeal-chocolate-chunk-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Position racks in oven to divide the oven into thirds. Preheat oven to 350\xb0F. Line two baking sheets with parchment paper or silicone mats.2. In a medium bowl, whisk together oats, flour, baking soda, spices and salt. Set aside.3. In a large bowl, beat butter, peanut butter, sugar and brown sugar on medium speed until smooth and creamy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add the eggs one at a time, beating for 1 minute after each addition, then beat in the vanilla. Reduce mixer speed to low and gradually add dry ingredients, mixing just until blended. Stir in chocolate. If you have time, chill dough for about 2 hours, or for up to 1 day (chilling the dough will give you more evenly shaped cookies.)4. If the dough is not chilled, drop rounded Tablespoonfuls 2 inches apart onto the baking sheets. If the dough is chilled, scoop up rounded Tablespoons, roll the balls between your palms and place them 2 inches apart on the sheets. Press the chilled balls gently with the heel of your hand until they are about 1/2-inch thick.5.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Bake for 13 to 15 minutes, rotating the sheets from top to bottom and front to back after 7 minutes. The cookies should be golden and just firm around the edges. Lift the cookies onto cooling racks with a wide metal spatula- they'll firm as they cool.6. Repeat with remaining dough, cooling the baking sheets between batches.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u"1. Position racks in oven to divide the oven into thirds. Preheat oven to 350\xb0F. Line two baking sheets with parchment paper or silicone mats.2. In a medium bowl, whisk together oats, flour, baking soda, spices and salt. Set aside.3. In a large bowl, beat butter, peanut butter, sugar and brown sugar on medium speed until smooth and creamy. Add the eggs one at a time, beating for 1 minute after each addition, then beat in the vanilla. Reduce mixer speed to low and gradually add dry ingredients, mixing just until blended. Stir in chocolate. If you have time, chill dough for about 2 hours, or for up to 1 day (chilling the dough will give you more evenly shaped cookies.)4. If the dough is not chilled, drop rounded Tablespoonfuls 2 inches apart onto the baking sheets. If the dough is chilled, scoop up rounded Tablespoons, roll the balls between your palms and place them 2 inches apart on the sheets. Press the chilled balls gently with the heel of your hand until they are about 1/2-inch thick.5. Bake for 13 to 15 minutes, rotating the sheets from top to bottom and front to back after 7 minutes. The cookies should be golden and just firm around the edges. Lift the cookies onto cooling racks with a wide metal spatula- they'll firm as they cool.6. Repeat with remaining dough, cooling the baking sheets between batches.", u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-oatmeal-chocolate-chunk-cookies-516815', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 43, u'servings': 60, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}