{u'recipes': [{u'sourceName': u'Sugar Free Mom', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/557420-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 557420, u'veryPopular': True, u'lowFodmap': False, u'title': u'Dairy Free Mango Sorbet {No Sugar Added}', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 76.36, u'creditText': u'Sugar Free Mom', u'extendedIngredients': [{u'originalString': u'\xbd cup unsweetened almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'Juice of 1 orange', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u''}, {u'originalString': u'2 droppers full orange liquid stevia or plain', u'aisle': u'Baking', u'name': u'liquid stevia', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia-drops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10811111, u'unit': u''}, {u'originalString': u'2 ripe mangoes, peeled,', u'aisle': u'Produce', u'name': u'mangoes', u'metaInformation': [u'ripe', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.sugarfreemom.com/recipes/dairy-free-mango-sorbet-no-sugar-added/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Blend all ingredients in a blender until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}], u'step': u'Pour mixture into an ice cream machine and follow manufacturers directions.Enjoy immediately.Without ice cream machine, pour into a shallow container and freeze for 6 hours or overnight.Thaw on counter for 15 minutes before serving. Makes 2 cups.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 443, u'instructions': u'Blend all ingredients in a blender until smooth.Pour mixture into an ice cream machine and follow manufacturers directions.Enjoy immediately.Without ice cream machine, pour into a shallow container and freeze for 6 hours or overnight.Thaw on counter for 15 minutes before serving. Makes 2 cups.', u'spoonacularSourceUrl': u'https://spoonacular.com/dairy-free-mango-sorbet-no-sugar-added-557420', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}