{u'recipes': [{u'sourceName': u'The Gracious Pantry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/794443-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 794443, u'veryPopular': False, u'lowFodmap': False, u'title': u'Clean Eating Slow Cooker Balsamic Blackberry Chicken', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 197.12, u'creditText': u'The Gracious Pantry', u'extendedIngredients': [{u'originalString': u'3 tbsp. balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tbsp'}, {u'originalString': u'6 oz. package fresh blackberries', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 9042, u'unit': u'oz'}, {u'originalString': u'1/4 tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'2 boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.thegraciouspantry.com/clean-eating-slow-cooker-balsamic-blackberry-chicken%e2%80%a8-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'If serving to guests, reserve 2-3 blackberries as garnish for the plate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}]}, {u'equipment': [], u'step': u'Place the chicken breasts in the bottom of the crock.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Pour in the vinegar, sprinkle on the garlic powder and then add the blackberries last. Cover and let cook on low for 4 hours. This recipe is formulate for a small yield. It is best prepared in a small, 1 or 1.5 qt slow cooker. If your slow cooker is larger, double or triple the recipe to accommodate.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}]}], u'name': u''}], u'aggregateLikes': 229, u'instructions': u'If serving to guests, reserve 2-3 blackberries as garnish for the plate. Place the chicken breasts in the bottom of the crock. Pour in the vinegar, sprinkle on the garlic powder and then add the blackberries last. Cover and let cook on low for 4 hours. This recipe is formulate for a small yield. It is best prepared in a small, 1 or 1.5 qt slow cooker. If your slow cooker is larger, double or triple the recipe to accommodate.', u'spoonacularSourceUrl': u'https://spoonacular.com/clean-eating-slow-cooker-balsamic-blackberry-chicken-794443', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}