{u'recipes': [{u'sourceName': u'Simple Nourished Living', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/525241-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 525241, u'veryPopular': False, u'lowFodmap': False, u'title': u'Weight Watchers Taco Soup {Slow Cooker or Stovetop}', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 431.9, u'creditText': u'Simple Nourished Living', u'extendedIngredients': [{u'originalString': u'- chopped avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 9037, u'unit': u'servings'}, {u'originalString': u'2 cans (14 to 15 ounces) beans (kidney, pinto, black or chili), rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned', u'(kidney, pinto, or chili)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounces'}, {u'originalString': u'1 can (11 to 15 ounces) corn, undrained', u'aisle': u'Canned and Jarred', u'name': u'canned corn', u'metaInformation': [u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 11177, u'unit': u'ounces'}, {u'originalString': u'1 can (10 ounces) tomatoes with chiles, undrained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'with chiles, undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounces'}, {u'originalString': u'- fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'1 pound lean ground beef (at least 93% lean)', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'93%', u'lean', u'(at least )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'- light sour cream or nonfat plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain', u'light', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'servings'}, {u'originalString': u'1 cup chopped onion (1 medium-size onion)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium-size', u'chopped', u'(1 onion)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'- pico de gallo or salsa', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'pico de gallo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pico-de-gallo.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 27027, u'unit': u'servings'}, {u'originalString': u'1 package (1 ounce) ranch dressing mix', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 93733, u'unit': u'ounce'}, {u'originalString': u'- reduced fat shredded cheese', u'aisle': u'Cheese', u'name': u'reduced fat cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1168, u'unit': u'servings'}, {u'originalString': u'1 package (1.25 ounces) reduced sodium taco seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.25, u'consistency': u'solid', u'id': 2073, u'unit': u'ounces'}, {u'originalString': u'- tortilla chips', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 19056, u'unit': u'servings'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://simple-nourished-living.com/2014/03/weight-watchers-taco-soup-slow-cooker-stove-top/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Ideal slow cooker size: 4-Quart', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spray a skillet with cooking spray and place it over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add the ground beef and break it up with a wooden spoon, stirring for about 1 minute. Stir in the onion and continue to cook, stirring often, until the ground beef is brown all over and the onion is soft, about 4 to 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drain the excess fat.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Transfer the browned beef and onions to the slow cooker (or a soup pot).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Add the tomatoes, beans, corn, water, taco seasoning, and ranch dressing mix. Cover and cook on LOW for 6 to 8 hours (or simmer over low heat on the stove for 30 minutes to 1 hour.)', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'id': 93733, u'name': u'dry ranch dressing mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve with optional garnishes as desired.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Argyle Reserve Pinot Noir. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 100, u'instructions': u'Ideal slow cooker size: 4-QuartSpray a skillet with cooking spray and place it over medium-high heat. Add the ground beef and break it up with a wooden spoon, stirring for about 1 minute. Stir in the onion and continue to cook, stirring often, until the ground beef is brown all over and the onion is soft, about 4 to 5 minutes. Drain the excess fat.Transfer the browned beef and onions to the slow cooker (or a soup pot). Add the tomatoes, beans, corn, water, taco seasoning, and ranch dressing mix. Cover and cook on LOW for 6 to 8 hours (or simmer over low heat on the stove for 30 minutes to 1 hour.)Serve with optional garnishes as desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/weight-watchers-taco-soup-slow-cooker-or-stovetop-525241', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 380, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}