{u'recipes': [{u'sourceName': u'Shes Cookin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570461-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 570461, u'veryPopular': False, u'lowFodmap': True, u'title': u'7-Layer Mediterranean Dip', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'preparationMinutes': 35, u'pricePerServing': 92.46, u'creditText': u'Shes Cookin', u'extendedIngredients': [{u'originalString': u'4 Persian cucumbers, seeded and diced small', u'aisle': u'Produce', u'name': u'cucumbers', u'metaInformation': [u'diced', u'small', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1 tbsp fresh flat leaf parsley or basil, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat leaf parsley', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'4 ounces crumbled goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'1/2 cup pitted Kalamata olives, sliced', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'pitted', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1009195, u'unit': u'cup'}, {u'originalString': u'2 tbsp freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'4 tomatoes, seeded and diced small', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'small', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'3/4 cup labneh (Greek yogurt cheese) or Greek yogurt, or a combination of the two', u'aisle': u'?', u'name': u'a combination of the two', u'metaInformation': [u'(Greek yogurt cheese)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://shescookin.com/2014/01/31/super-bowl-party-7-layer-mediterranean-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'To make salad layer, combine diced cucumbers, tomatoes,and parsley in a small mixing bowl. Toss to combine, then transfer to a colander and allow the mixture to drain (for at least 30 minutes,stirring occasionally) while you prepare the hummus and other ingredients. When the salad is fully drained, spread the 1-1/2 cups of hummus evenly into the bottom of your serving dish. Then spread the labneh or Greek yogurt over the top of the hummus. Spoon the drained salad mixture on top of the labneh/Greek yogurt.Sprinkle the olives and goat cheese crumbles on top.Just before serving, sprinkle on your fresh lemon juice and chopped parsley or basil. This dip is great with pita chips!', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Dip. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 65, u'instructions': u'To make salad layer, combine diced cucumbers, tomatoes,and parsley in a small mixing bowl. Toss to combine, then transfer to a colander and allow the mixture to drain (for at least 30 minutes,stirring occasionally) while you prepare the hummus and other ingredients. When the salad is fully drained, spread the 1-1/2 cups of hummus evenly into the bottom of your serving dish. Then spread the labneh or Greek yogurt over the top of the hummus. Spoon the drained salad mixture on top of the labneh/Greek yogurt.Sprinkle the olives and goat cheese crumbles on top.Just before serving, sprinkle on your fresh lemon juice and chopped parsley or basil. This dip is great with pita chips!', u'spoonacularSourceUrl': u'https://spoonacular.com/7-layer-mediterranean-dip-570461', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}