{u'recipes': [{u'sourceName': u'The Lemon Bowl', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/483733-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 483733, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry Sunrise Breakfast Smoothie', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 203.44, u'creditText': u'The Lemon Bowl', u'extendedIngredients': [{u'originalString': u'1 banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'\xbd teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons flax seed meal', u'aisle': u'Health Foods;Baking', u'name': u'flax seed meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tablespoons'}, {u'originalString': u'2 handfuls ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 2.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'handfuls'}, {u'originalString': u'1 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'2 cups strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'1 cup vanilla yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'vanilla yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1119, u'unit': u'cup'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://thelemonbowl.com/2013/06/strawberry-sunrise-breakfast-smoothie.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all ingredients in a high speed blender and puree until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Serve in a large glass and enjoy.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Siduri Sta. Rita Hills Pinot Noir. It has 4.2 out of 5 stars and a bottle costs about 33 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The 2014 Sta. Rita Hills Pinot Noir is a blend of fruit from the John Sebastiano, Clos Pepe, Cargasacchi, and Lindley Vineyards.  The actual blend is 64% John Sebastiano Vineyard Pinot Noir, 22% Clos Pepe, 9% Lindley, and 6% Cargasacchi. Clonally, this wine is a blend of 8 different clones which also provides for a wide range of flavors within one wine. The 2014 Pinot Noir Sta. Rita Hills should be a classic expression of the region, showing lots of spice, red fruit and dried soils aromas and flavors. Balanced, polished and elegant with plenty of fruit, it should certainly be an outstanding wine, and at the price, is an excellent value in Pinot Noir. View More', u'title': u'Siduri Sta. Rita Hills Pinot Noir', u'price': u'$32.99', u'id': 454206, u'link': u'https://www.wine.com/product/siduri-sta-rita-hills-pinot-noir-2014/168102', u'imageUrl': u'https://spoonacular.com/productImages/454206-312x231.jpg'}]}, u'aggregateLikes': 1760, u'instructions': u'Place all ingredients in a high speed blender and puree until smooth.Serve in a large glass and enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-sunrise-breakfast-smoothie-483733', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}