{u'recipes': [{u'sourceName': u'Bright Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542470-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 542470, u'veryPopular': False, u'lowFodmap': False, u'title': u'Confession # 75: Sometimes Simple Doesn’t Cut It… S’mores Ice Cream Sandwiches', u'diets': [], u'pricePerServing': 324.36, u'creditText': u'Bright Eyed Baker', u'extendedIngredients': [{u'originalString': u'1 cup bittersweet chopped chocolate or chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'5 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'8 graham cracker squares', u'aisle': u'', u'name': u'graham cracker squares', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10218617, u'unit': u''}, {u'originalString': u'2 cups chopped graham crackers, divided', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [u'divided', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18617, u'unit': u'cups'}, {u'originalString': u'1/3 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'Toasted Marshmallow and Graham Cracker Ice Cream', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'servings'}, {u'originalString': u'4 cups large marshmallows (pack in to measure)', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'large', u'(pack in to measure)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19116, u'unit': u'cups'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.brighteyedbaker.com/2012/07/14/confession-75-sometimes-simple-doesnt-cut-it-smores-ice-cream-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 77, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place the marshmallows on a parchment-lined baking sheet and place under a broiler to toast. Once they're toasted and brown on top, flip them over and place under broiler again to brown other side. Depending on the marshmallows you use and how hot they get, you may be able to easily flip them with tongs or they may get melty, in which case you can just use a spatula to turn the browned side under as best as possible. The more toasted you can make the marshmallows, the better they'll show up in the final flavor of the ice cream, but don't let them start to smoke; watch closely while they broil. You can also use a kitchen torch to toast the marshmallows. Once toasted, put the marshmallows in a blender. Warm the milk in a medium saucepan over medium-low heat, stirring occasionally. In a separate bowl, whisk together the egg yolks, sugar, and salt. Slowly pour the warm milk into the egg mixture, whisking constantly, and then scrape the mixture back into the saucepan. Return to the stove and cook at medium-low heat, stirring constantly and scraping the bottom of the saucepan, until the mixture has thickened into a custard that coats the back of a spatula.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the custard base from the heat and pour through a strainer into a heat-proof bowl. Allow to cool for about 15 minutes, whisking frequently.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the cooled custard to the blender with the marshmallows, along with one cup of the chopped graham crackers. Blend the ingredients together until smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Add the heavy cream and vanilla and blend for an additional 30 seconds to a minute.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the mixture into a bowl, cover, and place in the fridge to cool thoroughly, about 6 hours or overnight.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Remove the cool ice cream mixture from the fridge and whisk until smooth and pourable; it may be spongy on top or it may have set like a bowl of jello. Freeze in your ice cream maker according to manufacturer's instructions. I churned mine for longer than I normally would because of the marshmallow consistency of the mixture. Use a spatula to fold the remaining cup of chopped graham crackers into the ice cream once it has finished churning.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Place in an airtight, freezer-safe container and freeze thoroughly before serving, preferably overnight.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Place the graham crackers on a baking sheet lined with parchment paper or plastic wrap. Melt the chocolate over a double broiler on medium heat, stirring often as soon as the chocolate starts to melt. Once melted smooth, reduce the heat to low. Dip each graham cracker into the melted chocolate to cover both top and bottom, or, holding a graham cracker with your fingertips, spoon a bit of chocolate onto each side and spread smooth with an icing spatula. Either way, make sure to coat each graham cracker entirely with chocolate. Return to the lined baking sheet and use an icing spatula to add chocolate to any missed areas, if necessary.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place the baking sheet in the freezer to allow the chocolate to harden, for about an hour at least. Once the chocolate on the graham crackers has hardened, remove from the freezer two at a time to make the ice cream sandwiches. Use a knife to shave of any uneven chocolate edges on each graham cracker.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Place a scoop of ice cream on the bottom side of one graham cracker and use a wide, flat spatula to press the ice cream down into a flat layer.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Add more ice cream as needed to fill in any gaps, so that the ice cream covers the entire base of the graham cracker.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place another chocolate-covered graham cracker on top, pressing down firmly. Use a spoon to add more ice cream as needed to the sides of the sandwich, and then use the back of the spoon or a knife to clean up the sides for a smooth finish. Wrap sandwich tightly in saran wrap and return to freezer. Repeat with remaining graham crackers. Allow ice cream sandwiches to freeze until firm before enjoying.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}], u'name': u''}], u'aggregateLikes': 144, u'instructions': u"Place the marshmallows on a parchment-lined baking sheet and place under a broiler to toast. Once they're toasted and brown on top, flip them over and place under broiler again to brown other side. Depending on the marshmallows you use and how hot they get, you may be able to easily flip them with tongs or they may get melty, in which case you can just use a spatula to turn the browned side under as best as possible. The more toasted you can make the marshmallows, the better they'll show up in the final flavor of the ice cream, but don't let them start to smoke; watch closely while they broil. You can also use a kitchen torch to toast the marshmallows. Once toasted, put the marshmallows in a blender. Warm the milk in a medium saucepan over medium-low heat, stirring occasionally. In a separate bowl, whisk together the egg yolks, sugar, and salt. Slowly pour the warm milk into the egg mixture, whisking constantly, and then scrape the mixture back into the saucepan. Return to the stove and cook at medium-low heat, stirring constantly and scraping the bottom of the saucepan, until the mixture has thickened into a custard that coats the back of a spatula. Remove the custard base from the heat and pour through a strainer into a heat-proof bowl. Allow to cool for about 15 minutes, whisking frequently. Add the cooled custard to the blender with the marshmallows, along with one cup of the chopped graham crackers. Blend the ingredients together until smooth. Add the heavy cream and vanilla and blend for an additional 30 seconds to a minute. Pour the mixture into a bowl, cover, and place in the fridge to cool thoroughly, about 6 hours or overnight. Remove the cool ice cream mixture from the fridge and whisk until smooth and pourable; it may be spongy on top or it may have set like a bowl of jello. Freeze in your ice cream maker according to manufacturer's instructions. I churned mine for longer than I normally would because of the marshmallow consistency of the mixture. Use a spatula to fold the remaining cup of chopped graham crackers into the ice cream once it has finished churning. Place in an airtight, freezer-safe container and freeze thoroughly before serving, preferably overnight. Place the graham crackers on a baking sheet lined with parchment paper or plastic wrap. Melt the chocolate over a double broiler on medium heat, stirring often as soon as the chocolate starts to melt. Once melted smooth, reduce the heat to low. Dip each graham cracker into the melted chocolate to cover both top and bottom, or, holding a graham cracker with your fingertips, spoon a bit of chocolate onto each side and spread smooth with an icing spatula. Either way, make sure to coat each graham cracker entirely with chocolate. Return to the lined baking sheet and use an icing spatula to add chocolate to any missed areas, if necessary. Place the baking sheet in the freezer to allow the chocolate to harden, for about an hour at least. Once the chocolate on the graham crackers has hardened, remove from the freezer two at a time to make the ice cream sandwiches. Use a knife to shave of any uneven chocolate edges on each graham cracker. Place a scoop of ice cream on the bottom side of one graham cracker and use a wide, flat spatula to press the ice cream down into a flat layer. Add more ice cream as needed to fill in any gaps, so that the ice cream covers the entire base of the graham cracker. Place another chocolate-covered graham cracker on top, pressing down firmly. Use a spoon to add more ice cream as needed to the sides of the sandwich, and then use the back of the spoon or a knife to clean up the sides for a smooth finish. Wrap sandwich tightly in saran wrap and return to freezer. Repeat with remaining graham crackers. Allow ice cream sandwiches to freeze until firm before enjoying.", u'spoonacularSourceUrl': u'https://spoonacular.com/confession-75-sometimes-simple-doesnt-cut-it-smores-ice-cream-sandwiches-542470', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}