{u'recipes': [{u'sourceName': u'Creme de la Crumb', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/827318-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 827318, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Swiss Steak', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 824.1, u'creditText': u'Creme de la Crumb', u'extendedIngredients': [{u'originalString': u'1 cup beef stock', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'cup'}, {u'originalString': u'\xbc cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fresh parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon dried Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'dried', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'1 cup thinly sliced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'2 tablespoons oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'salt & pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'6 medium very thin steaks (chicken steaks, blade steaks, or round steaks work well)', u'aisle': u'Meat', u'name': u'steaks', u'metaInformation': [u'medium', u'very thin', u'well', u'(chicken steaks, blade steaks, or round steaks work )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 23232, u'unit': u''}, {u'originalString': u'1 medium white or yellow onion, thinly sliced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'white', u'yellow', u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.lecremedelacrumb.com/2016/11/slow-cooker-swiss-steak.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place steaks in slow cooker. In a oiled skillet saute mushrooms, onions, and garlic over medium heat for 2-3 minutes until tender and fragrant.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to slow cooker on top of steaks. Sprinkle salt and pepper of the top to taste.In a medium bowl whisk beef stock, flour, oil, and Italian seasoning.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6170, u'name': u'beef stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Pour into slow cooker. Cover and cook on low for 6-8 hours or on high for 4-6 hours.Stir in heavy cream, cover and cook on high for another 10-15 minutes or so until the heavy cream has heated through and gravy is hot.Taste, add salt and pepper to taste as needed. Sprinkle with parsley, garnish with freshly cracked black pepper, and serve.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are my top picks for Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Duckhorn Napa Valley Merlot with a 4.2 out of 5 star rating seems like a good match. It costs about 58 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'This wine shows aromas of sweet plum sauce, vanilla, chocolate, cedar and butterscotch with big, forward black cherry and black berry fruit in the mouth. A balanced middle with a hint of toasty oak is paired with a nice bite from rounded tannins, and a long pleasant finish. This wine pairs well with grilled meats and wild game with herb-infused, wild-berry sauces, hearty pasta dishes and Pacific Northwest Salmon.', u'title': u'Duckhorn Napa Valley Merlot', u'price': u'$57.99', u'id': 435309, u'link': u'https://www.wine.com/product/duckhorn-napa-valley-merlot-1995/26649', u'imageUrl': u'https://spoonacular.com/productImages/435309-312x231.jpg'}]}, u'aggregateLikes': 116, u'instructions': u'Place steaks in slow cooker. In a oiled skillet saute mushrooms, onions, and garlic over medium heat for 2-3 minutes until tender and fragrant. Transfer to slow cooker on top of steaks. Sprinkle salt and pepper of the top to taste.In a medium bowl whisk beef stock, flour, oil, and Italian seasoning. Pour into slow cooker. Cover and cook on low for 6-8 hours or on high for 4-6 hours.Stir in heavy cream, cover and cook on high for another 10-15 minutes or so until the heavy cream has heated through and gravy is hot.Taste, add salt and pepper to taste as needed. Sprinkle with parsley, garnish with freshly cracked black pepper, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-swiss-steak-827318', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}