{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [], u'cheap': False, u'gaps': u'no', u'id': 835091, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pretzel Turtles (3 Ingredients)', u'diets': [u'dairy free'], u'pricePerServing': 11.52, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u"1 (11 oz) bag Rolo candies (50 Rolo's)", u'aisle': u'Sweet Snacks', u'name': u'm&m candies', u'metaInformation': [u"(50 Rolo's)"], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 19157, u'unit': u'oz'}, {u'originalString': u'50 pecan halves', u'aisle': u'Nuts;Baking', u'name': u'pecan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 50.0, u'consistency': u'solid', u'id': 12142, u'unit': u''}, {u'originalString': u'50 mini pretzels', u'aisle': u'Savory Snacks', u'name': u'pretzels', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 50.0, u'consistency': u'solid', u'id': 19047, u'unit': u''}], u'healthScore': 0.0, u'spoonacularScore': 3.0, u'sourceUrl': u'http://www.cookingclassy.com/pretzel-turtles-3-ingredients/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 300 degrees. Line an 18 by 13-inch baking sheet with parchment paper. Lay pretzels in a single layer on baking sheet then place one Rolo candy in the center of each pretzel. Warm in preheated oven just until chocolate and caramel have softened, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven then press 1 pecan into each rolo candy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer baking sheet to refrigerator and chill until chocolate has set. Store in an airtight container at room temperature (preferably in a single layer - the chocolate softens up just a little at room temperature).', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Piper-Heidsieck Brut Cuvee. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 40 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Piper-Heidsieck Cuv\xe9e Brut is a classic, structured, full-bodied and bursting with fruit Champagne. The blend is composed of a majority of Pinots Noirs, incorporating more than 100 crus from around the Champagne region and Pinots Meuniers from the Grande et Petite Montagne de Reims region.On the palate:A structured, full-bodied and franc wine. A juicy, fleshy pear and golden grape texture. The finish narrows to citrus and grapefruit flavors. A wine with great fruit, a good mouthfeel and a harmonious balance.', u'title': u'Piper-Heidsieck Brut Cuvee', u'price': u'$39.99', u'id': 450714, u'link': u'https://www.wine.com/product/piper-heidsieck-brut-cuvee/20128', u'imageUrl': u'https://spoonacular.com/productImages/450714-312x231.jpg'}]}, u'aggregateLikes': 201, u'instructions': u'Preheat oven to 300 degrees. Line an 18 by 13-inch baking sheet with parchment paper. Lay pretzels in a single layer on baking sheet then place one Rolo candy in the center of each pretzel. Warm in preheated oven just until chocolate and caramel have softened, about 4 minutes. Remove from oven then press 1 pecan into each rolo candy. Transfer baking sheet to refrigerator and chill until chocolate has set. Store in an airtight container at room temperature (preferably in a single layer - the chocolate softens up just a little at room temperature).', u'spoonacularSourceUrl': u'https://spoonacular.com/pretzel-turtles-3-ingredients-835091', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 50, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}