{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626041-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 626041, u'veryPopular': False, u'lowFodmap': False, u'title': u'No-Bake Crunch Bars and a GIVEAWAY', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 34.0, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'1 cup shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'\xbe cup hard margarine or butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [u'hard', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 4073, u'unit': u'cup'}, {u'originalString': u'8 cups mini marshmallows, divided', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 19116, u'unit': u'cups'}, {u'originalString': u'1 cup large flake oatmeal', u'aisle': u'Cereal', u'name': u'oatmeal', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/porridge-or-cream-of-wheat-isolated.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8121, u'unit': u'cup'}, {u'originalString': u'1\xbd cups Rice Krispies', u'aisle': u'Cereal', u'name': u'rice krispies cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 8065, u'unit': u'cups'}, {u'originalString': u'2 cups semisweet chocolate chips, divided', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.thereciperebel.com/no-bake-crunch-bars-2/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt together  cup margarine and 4 cups marshmallows. Stir in  cup chocolate chips until melted. Stir in coconut, Rice Krispies, and oatmeal.Press into a 9x13" pan that\'s lined with tin foil (to save on washing!) and sprayed with non-stick spray.Melt together remaining margarine, marshmallows and chocolate chips.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8121, u'name': u'oatmeal'}]}, {u'equipment': [], u'step': u"Spread on top of coconut layer. Set aside to set completely (I like to leave it in the fridge).They are fine sitting at room temperature, but I like to store them in the refrigerator or freezer so they don't get too soft and stick together.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 170, u'instructions': u'Melt together  cup margarine and 4 cups marshmallows. Stir in  cup chocolate chips until melted. Stir in coconut, Rice Krispies, and oatmeal.Press into a 9x13" pan that\'s lined with tin foil (to save on washing!) and sprayed with non-stick spray.Melt together remaining margarine, marshmallows and chocolate chips. Spread on top of coconut layer. Set aside to set completely (I like to leave it in the fridge).They are fine sitting at room temperature, but I like to store them in the refrigerator or freezer so they don\'t get too soft and stick together.', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-crunch-bars-and-a-giveaway-626041', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}