{u'recipes': [{u'sourceName': u'Panini Happy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/252250-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 252250, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken, Brie, Fig & Arugula Panini', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 215.6, u'creditText': u'Panini Happy', u'extendedIngredients': [{u'originalString': u'1/2 cup arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11959, u'unit': u'cup'}, {u'originalString': u'1 baguette, divided into 4 servings', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'1/2 pound Brie, sliced', u'aisle': u'Cheese', u'name': u'brie', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1006, u'unit': u'pound'}, {u'originalString': u'1/2 pound carved or sliced chicken breast', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 5062, u'unit': u'pound'}, {u'originalString': u'1/3 cup fig jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'fig jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fig-preserves.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11519297, u'unit': u'cup'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://paninihappy.com/chicken-brie-fig-arugula-panini/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/panini-maker.jpg', u'id': 415613, u'name': u'panini press'}], u'step': u'Heat the panini maker according to the manufacturer’s directions.For each sandwich: Slice off the dome of the baguette to create a flat grilling surface. Divide the baguette in half lengthwise to create top and bottom halves.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Spread a few tablespoons of fig jam inside each baguette half. On one side, layer a few slices of Brie, a small handful of arugula and a few slices of chicken. Close the sandwich with the other baguette half.Grill the panini until the cheese is melted and bread is toasted, 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fig-preserves.jpg', u'id': 11519297, u'name': u'fig jam'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Raymond Reserve Selection Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 1408, u'instructions': u'Heat the panini maker according to the manufacturer’s directions.For each sandwich: Slice off the dome of the baguette to create a flat grilling surface. Divide the baguette in half lengthwise to create top and bottom halves. Spread a few tablespoons of fig jam inside each baguette half. On one side, layer a few slices of Brie, a small handful of arugula and a few slices of chicken. Close the sandwich with the other baguette half.Grill the panini until the cheese is melted and bread is toasted, 3 to 5 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-brie-fig-arugula-panini-252250', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}