{u'recipes': [{u'sourceName': u'A Teaspoon of Happiness', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/591381-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 591381, u'veryPopular': False, u'lowFodmap': False, u'title': u'Simple Tomato Basil Bruschetta', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 37.1, u'creditText': u'A Teaspoon of Happiness', u'extendedIngredients': [{u'originalString': u'8 fresh basil leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'2 large cloves garlic, minced (or 3 small cloves)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'small', u'large', u'(or 3 cloves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbc cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 cup red onion, minced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'Salt & pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'8 cups diced tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cups'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.ateaspoonofhappiness.com/2012/10/08/simple-tomato-basil-bruschetta/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, mix together all of the ingredients. Allow the bruschetta to marinate for at least 30 minutes for the flavors to blend.In a large bowl, mix together all of the ingredients. Allow the bruschetta to marinate for at least 30 minutes for the flavors to blend.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Bruschetta can be paired with Chianti, Sparkling ros\xe9, and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Santa Margherita Chianti Classico Riserva. It has 4.2 out of 5 stars and a bottle costs about 27 dollars.", u'pairedWines': [u'chianti', u'sparkling rose', u'sparkling wine', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The aromas of this complex red wine range from cherries and plums to gladiolus flowers and earthy flint. The tannic, oak-aged flavors are bright and round, with a dry, warm, earthy finish. Recommended for barbecued meat, like sliced Chianina steak, or with game, such as pheasant stuffed with truffles. It is also excellent with mature cheese.', u'title': u'Santa Margherita Chianti Classico Riserva', u'price': u'$26.99', u'id': 436659, u'link': u'https://www.wine.com/product/santa-margherita-chianti-classico-riserva-2013/167314', u'imageUrl': u'https://spoonacular.com/productImages/436659-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'In a large bowl, mix together all of the ingredients. Allow the bruschetta to marinate for at least 30 minutes for the flavors to blend.In a large bowl, mix together all of the ingredients. Allow the bruschetta to marinate for at least 30 minutes for the flavors to blend.', u'spoonacularSourceUrl': u'https://spoonacular.com/simple-tomato-basil-bruschetta-591381', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}