{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/212483-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 212483, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted sprout gratin with bacon-cheese sauce', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 201.13, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'85g bacon lardons', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'g'}, {u'originalString': u'85g fresh breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 18079, u'unit': u'g'}, {u'originalString': u'800g Brussels sprouts', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 800.0, u'consistency': u'solid', u'id': 11098, u'unit': u'g'}, {u'originalString': u'25g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'100g Gruy\xe8re, grated', u'aisle': u'Cheese', u'name': u'gruyere', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1023, u'unit': u'g'}, {u'originalString': u'400ml milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 400.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'2 tsp English mustard powder', u'aisle': u'Spices and Seasonings', u'name': u'mustard powder', u'metaInformation': [u'english'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'tsp'}, {u'originalString': u'25g Parmesan, grated', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'50g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1 tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/roasted-sprout-gratin-bacon-cheese-sauce', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6. Halve any large sprouts and toss them with the oil and some seasoning in a roasting tin or ovenproof dish. Roast for 20 mins until the sprouts are tender and turning golden.Meanwhile, put the bacon lardons in a cold frying pan and place over a medium-low heat. Gently fry the lardons so the fat melts out into the pan as they crisp. When golden brown and crisp, remove from the pan with a slotted spoon.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add the breadcrumbs and crisp up in the bacon fat until golden and crunchy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove from the pan to cool, then clean the pan.Melt the butter in the pan with 2 tbsp of the milk, then stir in the flour and mustard powder for 2 mins to make a paste. Gradually whisk in remaining milk, until you have a smooth sauce. Use a spoon again to stir and cook until the sauce comes to the boil and thickens. Turn off the heat and stir in the cheese until melted. Taste and season.Tip the sprouts into a baking dish, scatter with the crisp bacon lardons, then spoon over the sauce and scatter with the crispy crumbs. Can be cooled, covered and chilled for up to 48 hrs before baking.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'id': 1002024, u'name': u'mustard powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Bake gratin for 10 mins (or 20 mins from chilled) at 200C/180C fan/gas 6 until piping hot and bubbling.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 40, u'instructions': u'Heat oven to 200C/180C fan/gas 6. Halve any large sprouts and toss them with the oil and some seasoning in a roasting tin or ovenproof dish. Roast for 20 mins until the sprouts are tender and turning golden.Meanwhile, put the bacon lardons in a cold frying pan and place over a medium-low heat. Gently fry the lardons so the fat melts out into the pan as they crisp. When golden brown and crisp, remove from the pan with a slotted spoon. Add the breadcrumbs and crisp up in the bacon fat until golden and crunchy. Remove from the pan to cool, then clean the pan.Melt the butter in the pan with 2 tbsp of the milk, then stir in the flour and mustard powder for 2 mins to make a paste. Gradually whisk in remaining milk, until you have a smooth sauce. Use a spoon again to stir and cook until the sauce comes to the boil and thickens. Turn off the heat and stir in the cheese until melted. Taste and season.Tip the sprouts into a baking dish, scatter with the crisp bacon lardons, then spoon over the sauce and scatter with the crispy crumbs. Can be cooled, covered and chilled for up to 48 hrs before baking. Bake gratin for 10 mins (or 20 mins from chilled) at 200C/180C fan/gas 6 until piping hot and bubbling.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-sprout-gratin-with-bacon-cheese-sauce-212483', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}