{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549534-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 549534, u'veryPopular': True, u'lowFodmap': False, u'title': u'Popovers', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 18.35, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'2 large eggs, at room temperature*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1 cup whole milk, at room temperature*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.halfbakedharvest.com/popovers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Position a rack in the lower third of the oven; preheat to 450 degrees. Grease a standard popover pan. Using a blender, mix the eggs, milk, flour and salt at low speed until just combined, about 20 seconds.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the melted butter; blend for 10 seconds.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour about 1/3 cup of the batter into each prepared cup (filling about halfway).', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 20 minutes. Lower the oven temperature to 350 degrees.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Bake until puffed, golden and crisp, 15 to 20 minutes. Using a small, sharp knife, carefully cut around the sides of each popover to release.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 695, u'instructions': u'Position a rack in the lower third of the oven; preheat to 450 degrees. Grease a standard popover pan. Using a blender, mix the eggs, milk, flour and salt at low speed until just combined, about 20 seconds. Add the melted butter; blend for 10 seconds.Pour about 1/3 cup of the batter into each prepared cup (filling about halfway). Bake for 20 minutes. Lower the oven temperature to 350 degrees. Bake until puffed, golden and crisp, 15 to 20 minutes. Using a small, sharp knife, carefully cut around the sides of each popover to release. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/popovers-549534', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}