{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/224983-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 224983, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sausage & apple Toad-in-the-hole', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 35.35, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 apple, quartered, cored and sliced', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'cored', u'sliced', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 half-fat sausages', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low-fat half n half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 98909, u'unit': u''}, {u'originalString': u'50g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'150ml skimmed milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'semi-skimmed milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1174, u'unit': u'ml'}, {u'originalString': u'1 tsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tsp'}, {u'originalString': u'2 tsp wholegrain mustard', u'aisle': u'Condiments', u'name': u'wholegrain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3029/sausage-and-apple-toadinthehole', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 240.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 240C/fan 220C/gas 9.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Brush a 4-hole Yorkshire pudding tray with oil, then place a sausage in each mould. Brown the sausages all over in the tray over a high heat for 5 mins. Meanwhile, tip the flour into a large bowl, season and make a well in the centre.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the milk, mustard and egg together, then pour a third of the mix into the well. Gradually draw the flour into the milk to form a paste, then whisk in the rest of the milk to make a smooth batter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}], u'step': u'Cut the sausages in half with a pair of kitchen scissors, scatter the apple slices between the sausages, then pour the batter over. Take off the heat, then bake for 20 mins until risen, crisp and golden.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Serve with mashed potato, peas and gravy.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 165, u'instructions': u'Heat oven to 240C/fan 220C/gas 9. Brush a 4-hole Yorkshire pudding tray with oil, then place a sausage in each mould. Brown the sausages all over in the tray over a high heat for 5 mins. Meanwhile, tip the flour into a large bowl, season and make a well in the centre. Whisk the milk, mustard and egg together, then pour a third of the mix into the well. Gradually draw the flour into the milk to form a paste, then whisk in the rest of the milk to make a smooth batter.Cut the sausages in half with a pair of kitchen scissors, scatter the apple slices between the sausages, then pour the batter over. Take off the heat, then bake for 20 mins until risen, crisp and golden. Serve with mashed potato, peas and gravy.', u'spoonacularSourceUrl': u'https://spoonacular.com/sausage-apple-toad-in-the-hole-224983', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}