{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/493320-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 493320, u'veryPopular': False, u'lowFodmap': False, u'title': u'Greek Lamb And Haloumi Burgers', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 600.71, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 small crusty square rolls', u'aisle': u'Bakery/Bread', u'name': u'crusty rolls', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-roll-or-crusty-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18349, u'unit': u''}, {u'originalString': u'2 teaspoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons chopped flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'9 ounces haloumi, cut into 4 slices', u'aisle': u'Cheese', u'name': u'haloumi', u'metaInformation': [u'cut into 4 slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halloumi.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 93624, u'unit': u'ounces'}, {u'originalString': u'1/3 cup pitted kalamata olives, coarsely chopped', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'pitted', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1009195, u'unit': u'cup'}, {u'originalString': u'1 pound, 5 ounces minced (ground) lamb', u'aisle': u'Meat', u'name': u'lamb', u'metaInformation': [u'minced', u'(ground)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10017224, u'unit': u'pound'}, {u'originalString': u'1/2 Lebanese (short) cucumber, deseeded and finely diced', u'aisle': u'Produce', u'name': u'lebanese cucumber', u'metaInformation': [u'diced', u'deseeded', u'finely', u'(short)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber-Lebanese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10211205, u'unit': u''}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon finely chopped mint', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons finely chopped mint', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons finely chopped oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoons'}, {u'originalString': u'1/4 red onion, finely diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1/2 small red onion, finely chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'4 baby romaine lettuce leaves, torn', u'aisle': u'Produce', u'name': u'romaine lettuce leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10111251, u'unit': u''}, {u'originalString': u'sea salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2 vine-ripened tomatoes, finely diced', u'aisle': u'Produce', u'name': u'vine ripened tomatoes', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1/2 cup Greek-style yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'greek-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1116, u'unit': u'cup'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.foodrepublic.com/2013/09/25/greek-lamb-and-haloumi-burgers-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the yogurt, cucumber, mint, lemon juice and garlic in a small bowl. To make the salsa, combine the tomato, onion, olives and parsley in a small bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add the olive oil, lemonjuice and oregano and stir to combine. Season with freshly ground black pepper.  For assembly:  Preheat a griller (broiler) to high. Preheat a flat grill plate or large frying pan over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [], u'step': u'Drizzle with oil and cook the burgers for 4 minutes on each side, for medium, or until cooked to your liking. Cook the haloumi for 30 seconds on each side, or until golden-brown.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halloumi.png', u'id': 93624, u'name': u'halloumi'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Cut the rolls in half horizontally and toast the cut sidesunder the grill. Arrange the lettuce leaves and salsa on the roll bases.', u'number': 4, u'ingredients': []}], u'name': u'Combine the lamb, onion, garlic, oregano and mint in a medium-sized bowl. Season with salt and pepper. Shape into 4 even-sized patties. Put ona plate, cover and refrigerate for 30 minutes.  For the tzatziki'}, {u'steps': [{u'equipment': [], u'step': u'Baked Eggs With Tomato And Feta Recipe Easy Tzatziki Sauce Recipe Fried Soft Shell Crab Po Boy Recipe', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u'Place the burgers and haloumi on top, spoon on tzatziki, cover with the lids and serve.  Try out these Greek recipes on Food Republic'}, {u'steps': [], u'name': u'For the burgers'}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are great choices for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Nieto Senetiner Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Wine of well defined profile, deep red color and great intensity. Aromas of small red fruits and plums dominate the nose; the vanilla scents from the oak barrel add elegance. Mouthfeel shows a great personality, great body and is fruity, well balanced and sensual.This wine pairs well with grilled meats, pasta with red sauce, salmon and veal. View More', u'title': u'Nieto Senetiner Malbec', u'price': u'$14.99', u'id': 440601, u'link': u'https://www.wine.com/product/nieto-senetiner-malbec-2011/124685', u'imageUrl': u'https://spoonacular.com/productImages/440601-312x231.jpg'}]}, u'aggregateLikes': 174, u'instructions': u'For the burgers:  Combine the lamb, onion, garlic, oregano and mint in a medium-sized bowl. Season with salt and pepper. Shape into 4 even-sized patties. Put ona plate, cover and refrigerate for 30 minutes.  For the tzatziki:  Combine the yogurt, cucumber, mint, lemon juice and garlic in a small bowl. To make the salsa, combine the tomato, onion, olives and parsley in a small bowl. Add the olive oil, lemonjuice and oregano and stir to combine. Season with freshly ground black pepper.  For assembly:  Preheat a griller (broiler) to high. Preheat a flat grill plate or large frying pan over medium heat. Drizzle with oil and cook the burgers for 4 minutes on each side, for medium, or until cooked to your liking. Cook the haloumi for 30 seconds on each side, or until golden-brown. Cut the rolls in half horizontally and toast the cut sidesunder the grill. Arrange the lettuce leaves and salsa on the roll bases. Place the burgers and haloumi on top, spoon on tzatziki, cover with the lids and serve.  Try out these Greek recipes on Food Republic:  Baked Eggs With Tomato And Feta Recipe Easy Tzatziki Sauce Recipe Fried Soft Shell Crab Po Boy Recipe', u'spoonacularSourceUrl': u'https://spoonacular.com/greek-lamb-and-haloumi-burgers-493320', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}