{u'recipes': [{u'sourceName': u'Sarahs Cucina Bella', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/534224-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 534224, u'veryPopular': False, u'lowFodmap': False, u'title': u'Loaded Guacamole Onion Ring Burger', u'diets': [], u'pricePerServing': 325.16, u'creditText': u'Sarahs Cucina Bella', u'extendedIngredients': [{u'originalString': u'4 beef burger patties', u'aisle': u'Frozen;Meat', u'name': u'beef patties', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 23507, u'unit': u''}, {u'originalString': u'10 grape tomatoes, quartered', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 10111529, u'unit': u''}, {u'originalString': u'1/2 cup-1 cup guacamole, to taste', u'aisle': u'Refrigerated', u'name': u'guacamole', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1009037, u'unit': u'cup'}, {u'originalString': u'8 onion rings (suggested: Alexia Multi-Grain Onion Rings), plus additional for a side dish', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'for a side dish', u'(suggested: Alexia Multi-Grain Onion Rings)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 slices sharp cheddar', u'aisle': u'Cheese', u'name': u'sharp cheddar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'slices'}, {u'originalString': u'4 kaiser rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://sarahscucinabella.com/2012/10/29/loaded-guacamole-onion-ring-burger/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat the grill. Cook burgers to desired doneness.Slice open the kaiser rolls. Top each one with a slice of sharp cheddar cheese, the piping hot burger, two onion rings, 1/4 of the grape tomatoes and desired amount of guacamole.Devour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1031009, u'name': u'sharp cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10111529, u'name': u'grape tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Tikal Amorio Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 28 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Aromas of smoky oak and cherry. Mouthwatering, penetrating flavors of ripe red and black cherries, red berries. Quite rich and velvety on the palate, and finishes with just enough grip to make it a real winner with food. This is some seriously sexy Malbec. Pairs well with grilled or smoked meats such as beef, pork, and lamb. Also complements dishes prepared with cheese or cream sauces.', u'title': u'Tikal Amorio Malbec', u'price': u'$27.99', u'id': 444771, u'link': u'https://www.wine.com/product/tikal-amorio-malbec-2008/104742', u'imageUrl': u'https://spoonacular.com/productImages/444771-312x231.jpg'}]}, u'aggregateLikes': 50, u'instructions': u'Preheat the grill. Cook burgers to desired doneness.Slice open the kaiser rolls. Top each one with a slice of sharp cheddar cheese, the piping hot burger, two onion rings, 1/4 of the grape tomatoes and desired amount of guacamole.Devour.', u'spoonacularSourceUrl': u'https://spoonacular.com/loaded-guacamole-onion-ring-burger-534224', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}