{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/760954-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 760954, u'veryPopular': False, u'lowFodmap': False, u'title': u'Curried Potatoes, Cauliflower and Peas', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 127.12, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 \xbd Tbs. Bragg Liquid Aminos', u'aisle': u'Health Foods;Condiments', u'name': u"bragg's liquid aminos", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 1.5, u'consistency': u'liquid', u'id': 93767, u'unit': u'Tbs'}, {u'originalString': u'1 medium-sized head cauliflower, broken into florets (about 6 cups)', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'medium-sized'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 11135, u'unit': u'cups'}, {u'originalString': u'1 cup boiling vegetarian “chicken” stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'1 tsp. Madras curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2015, u'unit': u'tsp'}, {u'originalString': u'\xbc cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 Tbs. grated fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'Tbs'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tsp. ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'Juice of 1 lime (3 Tbs.)', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'\xbd cup mirin', u'aisle': u'Ethnic Foods', u'name': u'mirin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93830, u'unit': u'cup'}, {u'originalString': u'1 Tbs. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1 medium-sized onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium-sized', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 \xbd cups frozen peas, thawed', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11304, u'unit': u'cups'}, {u'originalString': u'2 \xbd lb. small red-skinned potatoes, unpeeled and cut into \xbc-inch-thick slices (about 5 cups)', u'aisle': u'Produce', u'name': u'red-skinned potatoes', u'metaInformation': [u'small', u'unpeeled', u'cut into \xbc-inch-thick slices ( 5 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 10011355, u'unit': u'lb'}, {u'originalString': u'2 medium-sized serrano chiles, seeded and chopped', u'aisle': u'Produce', u'name': u'serrano chiles', u'metaInformation': [u'medium-sized', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/serrano-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11977, u'unit': u''}, {u'originalString': u'1 large shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/curried-potatoes-cauliflower-and-peas/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spray a Dutch oven or skillet with olive oil cooking spray, add olive oil and heat over medium-high heat for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add ginger, chiles, garlic, onions and shallot, and cook for 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add potatoes, and cook, stirring frequently, for 8 minutes, or until browned and softened.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add cauliflower, and cook for 3 minutes, stirring occasionally. Reduce heat to low, and add mirin. Stir in peas, curry powder, cumin, cilantro, lime juice, stock and Bragg Liquid Aminos. Stir to mix thoroughly, and cook for 10 minutes, or until potatoes are cooked through and liquid is reduced to about 1/2 cup.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 2015, u'name': u'curry powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mirin.jpg', u'id': 93830, u'name': u'mirin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Remove from heat, and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7, u'instructions': u'Spray a Dutch oven or skillet with olive oil cooking spray, add olive oil and heat over medium-high heat for 1 minute. Add ginger, chiles, garlic, onions and shallot, and cook for 3 minutes. Add potatoes, and cook, stirring frequently, for 8 minutes, or until browned and softened. Add cauliflower, and cook for 3 minutes, stirring occasionally. Reduce heat to low, and add mirin. Stir in peas, curry powder, cumin, cilantro, lime juice, stock and Bragg Liquid Aminos. Stir to mix thoroughly, and cook for 10 minutes, or until potatoes are cooked through and liquid is reduced to about 1/2 cup. Remove from heat, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/curried-potatoes-cauliflower-and-peas-760954', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}