{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/198052-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 198052, u'veryPopular': False, u'lowFodmap': False, u'title': u"The Spotted Pig's Chargrilled Burger at Home", u'diets': [], u'pricePerServing': 134.58, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'10 ounces beef brisket, preferably second-cut, cut into 1-inch pieces', u'aisle': u'Meat', u'name': u'beef brisket', u'metaInformation': [u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-brisket.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 13023, u'unit': u'ounces'}, {u'originalString': u'4 Spotted Pig Burger Buns', u'aisle': u'Bakery/Bread', u'name': u'burger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'8 ounces Roquefort cheese, room temperature', u'aisle': u'Cheese', u'name': u'roquefort cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roquefort.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1039, u'unit': u'ounces'}, {u'originalString': u'10 ounces well-marbled boneless short rib, cut into 1-inch pieces (or 8 ounces short rib and 2 ounces beef suet—see note)', u'aisle': u'Meat', u'name': u'short ribs', u'metaInformation': [u'boneless', u'cut into 1-inch pieces (or 8 ounces short rib and 2 ounces beef suet—see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-short-ribs.jpg', u'unitLong': u'ouncesribs', u'unitShort': u'ouncesrib', u'amount': 10.0, u'consistency': u'liquid', u'id': 10013147, u'unit': u'ouncesrib'}, {u'originalString': u'12 ounces well-marbled chuck roast or chuck stew meat, cut into 1-inch pieces', u'aisle': u'Meat', u'name': u'stew meat', u'metaInformation': [u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10013411, u'unit': u'ounces'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2010/04/the-spotted-pigs-chargrilled-burger-at-home-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-grinder.jpg', u'id': 404700, u'name': u'meat grinder'}], u'step': u'Place feed shaft, blade, and 3/8ths-inch grinding plate of meat grinder in freezer for at least 30 minutes before grinding.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine well-chilled meat in large bowl and grind, passing through grinder twice, re-chilling grinder and meat in between grinds if necessary (i.e. if fat starts to smear).', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}], u'name': u'IF USING A MEAT GRINDER'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Spread meat on sheet tray and place in freezer until firm and just starting to freeze, but still malleable, about 15 minutes. Working in four batches, grind meat in 12-cup food processor, processing with 8-10 one-second pulses, redistributing meat between pulses as necessary.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer batches to large bowl and combine.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Form meat into four patties, about 4 1/2 inches wide and 1 inch tall, making slight depression in center of each patty.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Light large chimney starter filled with charcoal (5-6 quarts, about 100 briquettes), and burn until coals are coated in thin layer of gray ash, about 20 minutes. Empty coals and spread evenly over half of grates. Position grill grate on top of grill, cover grill, and heat until grate is hot, about 5 minutes. Scrub grill clean with grill brush if necessary. Season burger patties generously with salt and pepper on all sides.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place on hot side of grill and cook for 1 minute. Flip burgers and cook for 1 minute longer. Flip burgers again, adjusting as necessary to create cross-hatched grill pattern on first side. Cook for 1 minute longer. Flip once more, adjusting as necessary to create cross-hatched grill pattern on second side and cook for 1 minute longer.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Transfer burgers to cool side of grill, cover, and cook until desired temperature is achieved, about 1 minute for rare (120\xb0F on an instant read thermometer), or 2 1/2 minutes for medium (140\xb0F on an instant read thermometer).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer burgers to cutting board, top each with 2 ounces Roquefort cheese, tent loosely with foil, and allow to rest 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roquefort.jpg', u'id': 1039, u'name': u'roquefort cheese'}]}, {u'equipment': [], u'step': u'5', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Meanwhile, cut buns in half. Toast cut sides on hot side of grill, pressing down gently, until golden-brown grill marks are formed, about 45 seconds to 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Transfer bun bottoms to cool side of grill to keep warm. Toast top sides of top buns over hot side of grilled, pressing buns into grill grates to form cross-hatched grill pattern about 1 minute total.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Place burgers on bun bottoms, top with bun tops, and serve immediately.', u'number': 13, u'ingredients': []}], u'name': u'IF USING A FOOD PROCESSOR'}], u'winePairing': {u'pairingText': u'Burger can be paired with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Terrazas de los Andes Reserva Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 22 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Bright red color with purple shades. Intense floral and fruity notes. Presence of violets, ripe black cherry and plum aromas. ReIts sweet and juicy mouthfeel delivers finesse, delicate tannins and an elegant finish of black fruits. veals a toasty and spicy character of black pepper and chocolate.Pair with Tuna Carpaccio and Red Fruits Vinaigrette, Tenderloin served with MediterraneanRatatouille and Moist Semisweet Chocolate Cake over Mascarpone and Red Fruits Ice Cream.', u'title': u'Terrazas de los Andes Reserva Malbec', u'price': u'$21.99', u'id': 438817, u'link': u'https://www.wine.com/product/terrazas-de-los-andes-reserva-malbec-2014/162923', u'imageUrl': u'https://spoonacular.com/productImages/438817-312x231.jpg'}]}, u'aggregateLikes': 76, u'instructions': u'Procedures                                                                              1                                                                            IF USING A MEAT GRINDER: Place feed shaft, blade, and 3/8ths-inch grinding plate of meat grinder in freezer for at least 30 minutes before grinding. Combine well-chilled meat in large bowl and grind, passing through grinder twice, re-chilling grinder and meat in between grinds if necessary (i.e. if fat starts to smear).                                                                                                                            2                                                                            IF USING A FOOD PROCESSOR: Spread meat on sheet tray and place in freezer until firm and just starting to freeze, but still malleable, about 15 minutes. Working in four batches, grind meat in 12-cup food processor, processing with 8-10 one-second pulses, redistributing meat between pulses as necessary. Transfer batches to large bowl and combine.                                                                                                                            3                                                                            Form meat into four patties, about 4 1/2 inches wide and 1 inch tall, making slight depression in center of each patty.                                                                                                                            4                                                                            Light large chimney starter filled with charcoal (5-6 quarts, about 100 briquettes), and burn until coals are coated in thin layer of gray ash, about 20 minutes. Empty coals and spread evenly over half of grates. Position grill grate on top of grill, cover grill, and heat until grate is hot, about 5 minutes. Scrub grill clean with grill brush if necessary. Season burger patties generously with salt and pepper on all sides. Place on hot side of grill and cook for 1 minute. Flip burgers and cook for 1 minute longer. Flip burgers again, adjusting as necessary to create cross-hatched grill pattern on first side. Cook for 1 minute longer. Flip once more, adjusting as necessary to create cross-hatched grill pattern on second side and cook for 1 minute longer. Transfer burgers to cool side of grill, cover, and cook until desired temperature is achieved, about 1 minute for rare (120\xb0F on an instant read thermometer), or 2 1/2 minutes for medium (140\xb0F on an instant read thermometer). Transfer burgers to cutting board, top each with 2 ounces Roquefort cheese, tent loosely with foil, and allow to rest 5 minutes.                                                                                                                            5                                                                            Meanwhile, cut buns in half. Toast cut sides on hot side of grill, pressing down gently, until golden-brown grill marks are formed, about 45 seconds to 1 minute. Transfer bun bottoms to cool side of grill to keep warm. Toast top sides of top buns over hot side of grilled, pressing buns into grill grates to form cross-hatched grill pattern about 1 minute total. Place burgers on bun bottoms, top with bun tops, and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-spotted-pigs-chargrilled-burger-at-home-198052', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}