{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/246736-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 246736, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken with Mushroom Cream Sauce', u'diets': [], u'pricePerServing': 251.86, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1 cup grapeseed oil, or canola oil (or other high smoke point oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'(or other high smoke point oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1/4 cup rich chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'Flour, salt and pepper', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 20081, u'unit': u'servings'}, {u'originalString': u'1/2 pound fresh mushrooms, sliced', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11260, u'unit': u'pound'}, {u'originalString': u'1 clove of garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/2 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 5-pound roasting chicken, cut into serving pieces (bone-in, skin on)', u'aisle': u'Meat', u'name': u'roasting chicken', u'metaInformation': [u'bone-in', u', skin on', u'cut into serving pieces ()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 5.0, u'consistency': u'liquid', u'id': 5109, u'unit': u'pound'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/chicken_with_mushroom_cream_sauce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'1 Put a cup of flour, a teaspoon of salt and half a teaspoon of pepper in a brown paper bag.  Piece by piece, put a piece of chicken in the bag and shake to coat the chicken with flour mixture.  2 Preheat the oven to 350\xb0F.  On the stovetop, in a large frying pan, heat oil to medium high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place the chicken pieces in the pan.  Watch the oil carefully, you don't want the oil to be so hot as to burn the chicken, you just want to lightly brown it.  Brown the chicken pieces on all sides, turning when necessary.3 Butter a roasting pan generously.  Arrange the chicken pieces in it, pour broth over it, and bake at 350\xb0F until the chicken is tender and cooked, about 40-50 minutes for pieces from a 5-pound chicken.  You know that the chicken is done by poking a thigh with a meat fork (the thigh meat is dark meat and takes longer to cook than white breast meat).  If pink or red juice runs out of the hole made by the fork, the chicken is not done.  If only clear juice runs out, the chicken is done. 4 About 20 minutes before the chicken is expected to be done, start cooking the onions and mushrooms.  In the same frying pan as was used to cook the chicken, empty the pan of all but 2 Tbsp of oil.", u'length': {u'number': 70, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the onions to the pan and saut\xe9 on medium  heat until softened.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the crushed garlic clove and the mushrooms and cook until mushrooms are no longer crisp.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove and discard the garlic, and add the sour cream and the heavy cream to the onions and mushrooms.  Lower the heat.  Keep warm, but do not boil.  Salt and pepper to taste.5 When the chicken is done, remove from oven.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Serve on a platter with the mushroom sauce spooned over it, or served on the side.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Serve with noodles, rice, or Spanish rice.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 952, u'instructions': u"1 Put a cup of flour, a teaspoon of salt and half a teaspoon of pepper in a brown paper bag.  Piece by piece, put a piece of chicken in the bag and shake to coat the chicken with flour mixture.  2 Preheat the oven to 350\xb0F.  On the stovetop, in a large frying pan, heat oil to medium high heat.  Place the chicken pieces in the pan.  Watch the oil carefully, you don't want the oil to be so hot as to burn the chicken, you just want to lightly brown it.  Brown the chicken pieces on all sides, turning when necessary.3 Butter a roasting pan generously.  Arrange the chicken pieces in it, pour broth over it, and bake at 350\xb0F until the chicken is tender and cooked, about 40-50 minutes for pieces from a 5-pound chicken.  You know that the chicken is done by poking a thigh with a meat fork (the thigh meat is dark meat and takes longer to cook than white breast meat).  If pink or red juice runs out of the hole made by the fork, the chicken is not done.  If only clear juice runs out, the chicken is done. 4 About 20 minutes before the chicken is expected to be done, start cooking the onions and mushrooms.  In the same frying pan as was used to cook the chicken, empty the pan of all but 2 Tbsp of oil.  Add the onions to the pan and saut\xe9 on medium  heat until softened.  Add the crushed garlic clove and the mushrooms and cook until mushrooms are no longer crisp.  Remove and discard the garlic, and add the sour cream and the heavy cream to the onions and mushrooms.  Lower the heat.  Keep warm, but do not boil.  Salt and pepper to taste.5 When the chicken is done, remove from oven.  Serve on a platter with the mushroom sauce spooned over it, or served on the side.Serve with noodles, rice, or Spanish rice.", u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-with-mushroom-cream-sauce-246736', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}