{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/381403-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 381403, u'veryPopular': False, u'lowFodmap': False, u'title': u'Moroccan Spiced Chickpea Soup', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 160.8, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 (5-ounce) package pre-washed baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11457, u'unit': u'ounce'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'3 (15-ounce) cans chickpeas, drained and rinsed well', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained and rinsed well', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 45.0, u'consistency': u'solid', u'id': 16058, u'unit': u'ounce'}, {u'originalString': u'1 (14.5-ounce) can chopped tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1/8 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'6 to 8 cloves garlic, pressed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 quart vegetable broth or reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'quart'}, {u'originalString': u'1/4 cup extra-virgin olive oil, plus more for garnish', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 large onion, medium diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 heaping teaspoon sweet paprika', u'aisle': u'Spices and Seasonings', u'name': u'sweet paprika', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002028, u'unit': u'teaspoon'}], u'healthScore': 80.0, u'imageType': u'jpeg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/dave-lieberman/moroccan-spiced-chickpea-soup-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat olive oil in a large pot over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onion and garlic and saute until the onions begin to turn translucent; lower heat if browning starts to occur.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add spices and saute a minute or so.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add tomatoes, chickpeas, broth, and sugar. Season with a couple pinches of salt and 10 grinds fresh pepper. Stir well. Chickpeas should be just covered with liquid. If level is shy, add some water so the chickpeas are just covered.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bring to a simmer, then lower heat to low and gently simmer for 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove soup from heat. Use a potato masher to mash up some of the chickpeas right in the pot. Stir in the spinach and let heat through until wilted, just a couple minutes.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Season again, to taste, with salt and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve soup, drizzled lightly with extra-virgin olive oil, if desired.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}]}], u'name': u''}], u'aggregateLikes': 109, u'instructions': u'Heat olive oil in a large pot over medium-high heat. Add onion and garlic and saute until the onions begin to turn translucent; lower heat if browning starts to occur. Add spices and saute a minute or so. Add tomatoes, chickpeas, broth, and sugar. Season with a couple pinches of salt and 10 grinds fresh pepper. Stir well. Chickpeas should be just covered with liquid. If level is shy, add some water so the chickpeas are just covered.                          Bring to a simmer, then lower heat to low and gently simmer for 45 minutes.                          Remove soup from heat. Use a potato masher to mash up some of the chickpeas right in the pot. Stir in the spinach and let heat through until wilted, just a couple minutes.                          Season again, to taste, with salt and pepper.                          Serve soup, drizzled lightly with extra-virgin olive oil, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/moroccan-spiced-chickpea-soup-381403', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}