{u'recipes': [{u'sourceName': u'Peanut Butter and Peepers', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/510954-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 510954, u'veryPopular': True, u'lowFodmap': False, u'title': u'BBQ Chicken Potstickers', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 12.36, u'creditText': u'Peanut Butter and Peepers', u'extendedIngredients': [{u'originalString': u'1/4 cup Stubbs Spicy BBQ Sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'1 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp. scallions, finely chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tbsp'}, {u'originalString': u'4 oz chicken, cooked, shredded small', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded', u'small', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'oz'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'20 small square wonton wrappers', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'squares', u'unitShort': u'square', u'amount': 20.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'square'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.peanutbutterandpeppers.com/2014/01/10/bbq-chicken-potstickers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl add chicken, scallions, and BBQ sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix together until well blended.In a tiny bowl, add some water. This is for sealing the edges of your Won Tons.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place 1 tsp. of mixture in WonTon wrapper, take your finger and dip in water and place along the edges of the wrapper (this will be the glue to seal the wrappers together. Fold each Won Ton corner to corner, and then fold outside edges to corner. Do the same for the remaining wrappers.Spray a large skillet with cooking spray and add the olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place skillet over medium heat. Once hot, add the dumplings to the pan. Make sure they are not touching or crowded together.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let the dumplings cook, for 2 minutes, or until bottom is golden in color.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1/4 cup of the water and cover. Reduce the heat to low, and allow the dumplings to finish cooking by steaming, another 2 to 3 minutes. Once done, gently remove the dumplings from the pan. This may have to be done in batches, but no need to add additional oil, just add more water when ready to steam.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve with Stubbs Spicy BBQ Sauce or Ranch Dressing', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 731, u'instructions': u'In a medium bowl add chicken, scallions, and BBQ sauce. Mix together until well blended.In a tiny bowl, add some water. This is for sealing the edges of your Won Tons.Place 1 tsp. of mixture in WonTon wrapper, take your finger and dip in water and place along the edges of the wrapper (this will be the glue to seal the wrappers together. Fold each Won Ton corner to corner, and then fold outside edges to corner. Do the same for the remaining wrappers.Spray a large skillet with cooking spray and add the olive oil. Place skillet over medium heat. Once hot, add the dumplings to the pan. Make sure they are not touching or crowded together. Let the dumplings cook, for 2 minutes, or until bottom is golden in color. Add 1/4 cup of the water and cover. Reduce the heat to low, and allow the dumplings to finish cooking by steaming, another 2 to 3 minutes. Once done, gently remove the dumplings from the pan. This may have to be done in batches, but no need to add additional oil, just add more water when ready to steam.Serve with Stubbs Spicy BBQ Sauce or Ranch Dressing', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-chicken-potstickers-510954', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}