{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/445319-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 445319, u'veryPopular': False, u'lowFodmap': False, u'title': u'Meatless Chili', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 168.78, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (15 ounces) black beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounces'}, {u'originalString': u'1 can (14-1/2 ounces) Mexican stewed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounces'}, {u'originalString': u'1 can (16 ounces) hot chili beans, undrained', u'aisle': u'Canned and Jarred', u'name': u'chili beans', u'metaInformation': [u'hot', u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 43112, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoons'}, {u'originalString': u'1 cup frozen corn, thawed', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'1/2 cup coarsely chopped green pepper', u'aisle': u'Produce', u'name': u'green pepper', u'metaInformation': [u'green', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'1 tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'4 tablespoons shredded reduced-fat cheddar cheese', u'aisle': u'Cheese', u'name': u'low fat shredded cheddar cheese', u'metaInformation': [u'shredded', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1001168, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup coarsely chopped sweet red pepper', u'aisle': u'Produce', u'name': u'red sweet pepper', u'metaInformation': [u'sweet', u'red', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'1/2 cup chunky salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'4 tablespoons fat-free sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'fat-free', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'tablespoons'}], u'healthScore': 46.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/meatless-chili', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, combine the first nine ingredients. Bring to a boil. Reduce heat; cover and simmer for 15 minutes or until vegetables are crisp-tender. Top each serving with sour cream and cheese.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili can be paired with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Campo Viejo Cava Brut ros\xe9 with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'A bright sparkling pink color. Pleasant and powerful on the nose with a strong presence of ripe red berries.With has a rounded, pleasant feel in the mouth.', u'title': u'Campo Viejo Cava Brut Rose', u'price': u'$11.99', u'id': 468840, u'link': u'https://www.wine.com/product/campo-viejo-cava-brut-rose/132863', u'imageUrl': u'https://spoonacular.com/productImages/468840-312x231.jpg'}]}, u'aggregateLikes': 167, u'instructions': u'Directions                                                                                In a large saucepan, combine the first nine ingredients. Bring to a boil. Reduce heat; cover and simmer for 15 minutes or until vegetables are crisp-tender. Top each serving with sour cream and cheese.                                        Yield: 4 servings.                                                                                                                         Originally published as Meatless Chili in  Light & TastyDecember/January 2005, p33                                                                                                                                                                                                        Nutritional Facts                                                                             One serving (1-1/2 cups) equals 313 calories, 3 g fat (2 g saturated fat), 8 mg cholesterol, 1,049 mg sodium, 61 g carbohydrate, 15 g fiber, 17 g protein. Diabetic Exchanges: 3 vegetable, 2 starch, 2 lean meat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/meatless-chili-445319', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}