{u'recipes': [{u'sourceName': u'My Colombian Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/226265-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 226265, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken and Rice (Arroz con Pollo)', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 252.94, u'creditText': u'My Colombian Recipes', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'\xbd cup frozen diced carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 chicken bouillon tablet', u'aisle': u'Canned and Jarred', u'name': u'chicken bouillon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6480, u'unit': u''}, {u'originalString': u'2 whole chicken breast, bone in and skinless', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'whole', u'bone in', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 5062, u'unit': u''}, {u'originalString': u'2 \xbd cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'Chicken and Stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'servings'}, {u'originalString': u'\xbc cup chopped fresh cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbc cup chopped green pepper', u'aisle': u'Produce', u'name': u'green pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'\xbd tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'1 cup long- grain white rice', u'aisle': u'Pasta and Rice', u'name': u'long-grain rice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'\xbd cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'\xbc cup chopped red bell pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'Rice', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 20444, u'unit': u'servings'}, {u'originalString': u'Salt and Pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'\xbd tablespoon sazon Goya with azafran', u'aisle': u'Spices and Seasonings', u'name': u'sazon', u'metaInformation': [u'with azafran'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 98999, u'unit': u'tablespoon'}, {u'originalString': u'1 scallion', u'aisle': u'Produce', u'name': u'scallion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'\xbd cup frozen diced green beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'diced', u'green', u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16033, u'unit': u'cup'}, {u'originalString': u'1 tablespoon tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoon'}, {u'originalString': u'\xbd white onion', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.mycolombianrecipes.com/chicken-and-rice-arroz-con-pollo', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the chicken breast, 5 cups water and the remaining ingredients for the stock in a medium pot. Bring to a boil, cover and reduce the heat to medium low. Cook for 20 to 25 minutes. Turn the heat off and let the chicken rest in the pot for about 15 minutes covered.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Let it cool, shred and set aside. Strain stock and measure 2  cups and set aside.In a medium pot, heat the olive oil over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onions, green peppers, garlic and red bell pepper. Cook until the onions are translucent, about 4 to 5 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the rice, tomato paste, chicken bouillon and sazon goya. Stir until the rice is well coated about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'id': 6480, u'name': u'chicken bouillon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'id': 98999, u'name': u'sazon completa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Add the chicken stock and bring to a boil. Then reduce the heat to low. Cover and simmer for about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [], u'step': u'Add the peas, carrots and green beans and cook for and additional 7 minutes, add the shredded chicken and cilantro, mix well with a fork, cover and cook for 5 minutes more.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Serve and Enjoy!', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 3099, u'instructions': u'Place the chicken breast, 5 cups water and the remaining ingredients for the stock in a medium pot. Bring to a boil, cover and reduce the heat to medium low. Cook for 20 to 25 minutes. Turn the heat off and let the chicken rest in the pot for about 15 minutes covered. Let it cool, shred and set aside. Strain stock and measure 2  cups and set aside.In a medium pot, heat the olive oil over medium-high heat. Add the onions, green peppers, garlic and red bell pepper. Cook until the onions are translucent, about 4 to 5 minutes.Add the rice, tomato paste, chicken bouillon and sazon goya. Stir until the rice is well coated about 3 minutes. Add the chicken stock and bring to a boil. Then reduce the heat to low. Cover and simmer for about 15 minutes. Add the peas, carrots and green beans and cook for and additional 7 minutes, add the shredded chicken and cilantro, mix well with a fork, cover and cook for 5 minutes more.Serve and Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-and-rice-arroz-con-pollo-226265', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}