{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/749543-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 749543, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pate Bites and Herb Brie Board', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 289.58, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/2 pound herb brie', u'aisle': u'Cheese', u'name': u'brie', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1006, u'unit': u'pound'}, {u'originalString': u'4 tablespoons capers, drained', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoons'}, {u'originalString': u'4 slices dark bread, pumpernickel or German whole grain, toasted', u'aisle': u'Pasta and Rice', u'name': u'grain blend', u'metaInformation': [u'dark', u'whole', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-wild-uncooked.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10020088, u'unit': u'slices'}, {u'originalString': u'1/2 pound country pate or mousse pate', u'aisle': u'Refrigerated;Frozen', u'name': u'pate brisee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dough.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10018338, u'unit': u'pound'}, {u'originalString': u'Cornichons or baby gherkin pickles', u'name': u'pickles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11937, u'unit': u'servings'}, {u'originalString': u'Red seedless grapes', u'aisle': u'Produce', u'name': u'red grapes', u'metaInformation': [u'red', u'seedless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9132, u'unit': u'servings'}, {u'originalString': u'1/4 red onion, finely chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'Water crackers', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}, {u'originalString': u'4 tablespoons whole grain mustard', u'aisle': u'Condiments', u'name': u'whole grain mustard', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tablespoons'}], u'healthScore': 11.0, u'imageType': u'jpeg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/rachael-ray/pate-bites-and-herb-brie-board-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Spread toasted bread lightly with mustard. Arrange pate in thin layer on top of mustard. Top with chopped onions and capers.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Cut each slice of bread into quarters. Arrange on a cheese board with a wedge of brie at room temperature, cornichons, crackers, grapes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Bordeaux, Champagne, and Sparkling ros\xe9 are great choices for Pate. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Mouton Cadet Bordeaux Rouge with a 4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'bordeaux', u'champagne', u'sparkling rose', u'sparkling wine', u'white burgundy'], u'productMatches': [{u'description': u"Through its balance, roundness and aging capacity, the fruits of generous nature and the work of human hands, Mouton Cadet Rouge express all the richness and diversity of one of the world's foremost winegrowing regions.", u'title': u'Mouton Cadet Bordeaux Rouge', u'price': u'$11.99', u'id': 436703, u'link': u'https://www.wine.com/product/mouton-cadet-bordeaux-rouge-2011/122961', u'imageUrl': u'https://spoonacular.com/productImages/436703-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Spread toasted bread lightly with mustard. Arrange pate in thin layer on top of mustard. Top with chopped onions and capers. Cut each slice of bread into quarters. Arrange on a cheese board with a wedge of brie at room temperature, cornichons, crackers, grapes.', u'spoonacularSourceUrl': u'https://spoonacular.com/pate-bites-and-herb-brie-board-749543', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}