{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/697104-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 697104, u'veryPopular': True, u'lowFodmap': False, u'title': u'Tarragon Chicken', u'diets': [u'gluten free'], u'preparationMinutes': 35, u'pricePerServing': 168.52, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'3 teaspoons extra-virgin olive oil, or canola oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'extra-virgin', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped fresh tarragon', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh tarragon', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon reduced-fat sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1179, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon freshly ground pepper, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground', u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup finely chopped shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11677, u'unit': u'cup'}, {u'originalString': u'4 boneless, skinless chicken breasts, trimmed of fat (1-1 1/4 pounds total)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'trimmed of fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/tarragon_chicken.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Season chicken on both sides with 1/4 teaspoon each salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 1/2 teaspoons oil in a large heavy skillet over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the chicken and cook until well browned, about 3 minutes per side.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer to a plate and tent with foil.Reduce heat to medium.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining 1 1/2 teaspoons oil to pan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add shallots; cook, stirring, until softened, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add broth and wine and bring to a simmer. Cook until reduced by half, about 3 minutes.Return the chicken and any accumulated juices to the pan; reduce heat to low. Simmer until the chicken is cooked through, about 4 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the chicken to a warmed platter. Stir mustard, sour cream and tarragon into sauce. Season to taste with salt and pepper and spoon over the chicken.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 407, u'instructions': u'Season chicken on both sides with 1/4 teaspoon each salt and pepper. Heat 1 1/2 teaspoons oil in a large heavy skillet over medium-high heat. Add the chicken and cook until well browned, about 3 minutes per side. Transfer to a plate and tent with foil.Reduce heat to medium. Add the remaining 1 1/2 teaspoons oil to pan. Add shallots; cook, stirring, until softened, 2 to 3 minutes. Add broth and wine and bring to a simmer. Cook until reduced by half, about 3 minutes.Return the chicken and any accumulated juices to the pan; reduce heat to low. Simmer until the chicken is cooked through, about 4 minutes. Transfer the chicken to a warmed platter. Stir mustard, sour cream and tarragon into sauce. Season to taste with salt and pepper and spoon over the chicken.', u'spoonacularSourceUrl': u'https://spoonacular.com/tarragon-chicken-697104', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}