{u'recipes': [{u'sourceName': u'Baked In', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/594466-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 594466, u'veryPopular': False, u'lowFodmap': True, u'title': u'Cranberry-Lime Infused Vodka', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 256.93, u'creditText': u'Baked In', u'extendedIngredients': [{u'originalString': u'1 bag of fresh cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 9078, u'unit': u'bag'}, {u'originalString': u'2 Tbsp granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}, {u'originalString': u'1 lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u"Vodka (I use Svedka for infusions these days. Most any brand will do, just don't pick from the bottom shelf)", u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [u"for infusions these days. most any brand will do, just don't pick from the bottom shelf)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 14051, u'unit': u'serving'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.baked-in.com/2013/12/23/cranberry-lime-infused-vodka/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Slice the lime into rounds and use a paring knife to cut into each round and remove the fruit so all you have left is the rind. Twist each piece of rind to make a spiral and set aside.Pierce each cranberry with the paring knife. Drop cranberries one by one into liter bottle.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'Add a piece of lime rind every couple of inches.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime peel'}]}, {u'equipment': [], u'step': u'Add sugar and shake to distribute.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Pour in vodka until bottle is completely full. Seal and shake gently to dissolve sugar.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'id': 14051, u'name': u'vodka'}]}, {u'equipment': [], u'step': u"Let sit in a cool dark place for at least five days (I just put mine in the fridge). You can still gift it if it's not done - just add a note to wait X days to use.", u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 32, u'instructions': u"Slice the lime into rounds and use a paring knife to cut into each round and remove the fruit so all you have left is the rind. Twist each piece of rind to make a spiral and set aside.Pierce each cranberry with the paring knife. Drop cranberries one by one into liter bottle. Add a piece of lime rind every couple of inches. Add sugar and shake to distribute.Pour in vodka until bottle is completely full. Seal and shake gently to dissolve sugar.Let sit in a cool dark place for at least five days (I just put mine in the fridge). You can still gift it if it's not done - just add a note to wait X days to use.", u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-lime-infused-vodka-594466', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}