{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/283036-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 160, u'id': 283036, u'veryPopular': False, u'lowFodmap': False, u'title': u'Marinated Fried Chicken', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 76.72, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'2-1/2 lb. chicken pieces', u'aisle': u'Meat', u'name': u'chicken pieces', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 1005006, u'unit': u'lb'}, {u'originalString': u'1 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 cups oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'cups'}, {u'originalString': u'1 Tbsp. hot pepper sauce', u'aisle': u'Condiments', u'name': u'pepper sauce', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'Tbsp'}, {u'originalString': u'1 env. GOOD SEASONS Italian Dressing Mix, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing mix', u'metaInformation': [u'italian', u'good', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93733, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/fried-chicken-51864.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place chicken in shallow baking dish.  Sprinkle with 1 Tbsp. of the dressing mix and the hot pepper sauce; turn to coat.  Cover.  Refrigerate 1 to 2 hours to marinate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Mix flour and remaining dressing mix in plastic bag.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add chicken, 1 piece at a time; close bag and shake to coat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in large skillet on medium-high heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add chicken; cook 10 min. or until browned on all sides.  Reduce heat to medium; cover. Cook 30 min. or until chicken is cooked through, turning occasionally.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'Place chicken in shallow baking dish.  Sprinkle with 1 Tbsp. of the dressing mix and the hot pepper sauce; turn to coat.  Cover.  Refrigerate 1 to 2 hours to marinate.                                            Mix flour and remaining dressing mix in plastic bag.  Add chicken, 1 piece at a time; close bag and shake to coat.                                            Heat oil in large skillet on medium-high heat.  Add chicken; cook 10 min. or until browned on all sides.  Reduce heat to medium; cover. Cook 30 min. or until chicken is cooked through, turning occasionally.  Drain on paper towels.', u'spoonacularSourceUrl': u'https://spoonacular.com/marinated-fried-chicken-283036', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 170, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}