{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/490339-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 490339, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry Pretzel Pie', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 66.71, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 packet plain gelatin (Knox)', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [u'plain', u'(Knox)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'packet', u'unitShort': u'packet', u'amount': 1.0, u'consistency': u'solid', u'id': 19177, u'unit': u'packet'}, {u'originalString': u'Cool Whip, for garnish', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1200, u'unit': u'servings'}, {u'originalString': u'1 1/2 cups crushed pretzels', u'aisle': u'Savory Snacks', u'name': u'pretzels', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19047, u'unit': u'cups'}, {u'originalString': u'1 cup diced strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}, {u'originalString': u'1 box strawberry jello (3 oz.)', u'aisle': u'Baking', u'name': u'strawberry jello', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jello-strawberry.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 10219172, u'unit': u'oz'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 cups vanilla ice cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'cups'}, {u'originalString': u'1 cup boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://insidebrucrewlife.com/2014/05/strawberry-pretzel-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine the pretzels, sugar, and butter and stir until combined. Press into the bottom and sides of a 9 inch pie plate. Refrigerate.Stir the boiling water and both gelatins together until dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the ice cream and stir until melted. Make sure to add the ice cream while the water is still very hot. The mixture will start to thicken quickly, so stir in the ice cream quickly. Stir in the diced strawberries. Spoon into the pretzel crust. Refrigerate a few hours. Top with Cool Whip before serving.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Cut into 10 slices.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Snake River Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'honey , minerality , lime', u'title': u'Snake River Late Harvest Riesling', u'price': u'$16.0', u'id': 431450, u'link': u'https://www.amazon.com/2010-Snake-River-Harvest-Riesling/dp/B00GWUM1A4', u'imageUrl': u'https://spoonacular.com/productImages/431450-312x231.jpg'}]}, u'aggregateLikes': 8136, u'instructions': u'Combine the pretzels, sugar, and butter and stir until combined. Press into the bottom and sides of a 9 inch pie plate. Refrigerate.Stir the boiling water and both gelatins together until dissolved. Add the ice cream and stir until melted. Make sure to add the ice cream while the water is still very hot. The mixture will start to thicken quickly, so stir in the ice cream quickly. Stir in the diced strawberries. Spoon into the pretzel crust. Refrigerate a few hours. Top with Cool Whip before serving. Cut into 10 slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-pretzel-pie-490339', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}