{u'recipes': [{u'sourceName': u'Roxanas Home Baking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547494-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 547494, u'veryPopular': False, u'lowFodmap': False, u'title': u'Orange Cranberry Bread', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 50.44, u'creditText': u'Roxanas Home Baking', u'extendedIngredients': [{u'originalString': u'1/2 cup (60 grams) bread flour / a high protein flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'grams'}, {u'originalString': u'3 1/2 cups (420 grams) bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 420.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'grams'}, {u'originalString': u'2/3 to 3/4 cup frozen cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 9078, u'unit': u'cup'}, {u'originalString': u'2 tsp ( 1 sachet/ 7 grams) dry yeast', u'aisle': u'Baking', u'name': u'dry yeast', u'metaInformation': [u'dry', u'( 1 sachet/ 7 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}, {u'originalString': u'1 tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp honey (add maple syrup for vegan version)', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [u'for vegan version)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'3/4 cup (180 ml) freshly squeezed orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 180.0, u'consistency': u'solid', u'id': 9206, u'unit': u'ml'}, {u'originalString': u'orange zest from 2 medium oranges', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/4 cup (60 ml) vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 60.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'ml'}, {u'originalString': u'1/2 cup lukewarm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'lukewarm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://roxanashomebaking.com/orange-cranberry-bread-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a mixing bowl, combine 1/2 cup bread flour with yeast and lukewarm water. It will become a thick paste. Leave at room temperature for a couple of minutes (5-7) until the mixture foams and have the consistency of a sponge.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the orange peel, salt, honey/maple syrup, vegetable oil and orange juice. With the dough hook on start mixing slowly adding 3 1/2 cups bread flour. The dough should clean itself from the sides of the bowl, will be elastic and very smooth. In a separate bowl mix the frozen cranberries with 1 tbsp flour, making sure they are well coated. Take the dough out of the bowl, place it on a working area, flatten it with your fingers and add the cranberries on top of it. With your hands, start kneading the dough until all the cranberries are incorporated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the dough ball into a greased bowl, cover with plastic wrap and let at room temperature until doubled in volume. Punch it down and shape it into a log.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place it into a greased bread pan (2 pound bread pan), cover and let rise again. Meanwhile, heat the oven to 375F.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake the bread in preheated oven for about 35-40 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Let cool slightly in the bread pan before removing it. Slice and enjoy!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dessert Bread can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 109, u'instructions': u'In a mixing bowl, combine 1/2 cup bread flour with yeast and lukewarm water. It will become a thick paste. Leave at room temperature for a couple of minutes (5-7) until the mixture foams and have the consistency of a sponge. Add the orange peel, salt, honey/maple syrup, vegetable oil and orange juice. With the dough hook on start mixing slowly adding 3 1/2 cups bread flour. The dough should clean itself from the sides of the bowl, will be elastic and very smooth. In a separate bowl mix the frozen cranberries with 1 tbsp flour, making sure they are well coated. Take the dough out of the bowl, place it on a working area, flatten it with your fingers and add the cranberries on top of it. With your hands, start kneading the dough until all the cranberries are incorporated. Place the dough ball into a greased bowl, cover with plastic wrap and let at room temperature until doubled in volume. Punch it down and shape it into a log. Place it into a greased bread pan (2 pound bread pan), cover and let rise again. Meanwhile, heat the oven to 375F. Bake the bread in preheated oven for about 35-40 minutes. Let cool slightly in the bread pan before removing it. Slice and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/orange-cranberry-bread-547494', u'dishTypes': [u'bread', u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}