{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/195976-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 195976, u'veryPopular': False, u'lowFodmap': False, u'title': u'White Chocolate and Raspberry Frozen Mousse Bombes', u'diets': [], u'pricePerServing': 298.32, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'8.25 ounces all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.25, u'consistency': u'solid', u'id': 20081, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001, u'unit': u'ounces'}, {u'originalString': u'8.5 ounces buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.5, u'consistency': u'solid', u'id': 1230, u'unit': u'ounces'}, {u'originalString': u'2 ounces cocoa', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'ounces'}, {u'originalString': u'2 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon gelatin, bloomed in 2 tablespoons water', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19177, u'unit': u'teaspoon'}, {u'originalString': u'4 ounces granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'ounces'}, {u'originalString': u'6 ounces heavy cream, whipped to soft peaks and chilled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'chilled', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'ounces'}, {u'originalString': u'16 ounces frozen raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 9302, u'unit': u'ounces'}, {u'originalString': u'1 pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'10 ounces sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 19335, u'unit': u'ounces'}, {u'originalString': u'5.25 ounces white chocolate', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.25, u'consistency': u'liquid', u'id': 19087, u'unit': u'ounces'}, {u'originalString': u'3 yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/02/white-chocolate-and-raspberry-frozen-mousse-bombes-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 48, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place the mousse in a piping bag.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the chilled mold from the fridge. Pipe the mousse into each of the shells, taking care to only fill it just to the top.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place a raspberry or two into each bombe and smooth mousse over the top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}, {u'equipment': [], u'step': u'Place a circle of cake over each and gently press the cake into the mousse.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Put the mold on a sheet tray in the freezer and allow it to freeze for at least 4 hours.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 6, u'ingredients': []}], u'name': u'Assemble the bombes'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the frozen raspberries and sugar in a saucepan over low heat, stirring occasionally. The raspberries will begin to melt, then they will liquefy. Stir to help break them up in the pot. When the fruit begins to simmer, remove from heat and force the juice through a fine mesh strainer. Discard the seeds, chill the sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'6', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Plate the dessert: Set out plates for portioning.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place a tablespoon of sauce on the plate, then drag the spoon through the spot to create a design. Loosen the edges of the bombes from the molds and turn the cavities inside out to unmold the bombes. Allow them to sit for 20 minutes so the cake can thaw, then carefully place the bombes on the plates and serve.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u'Make the sauce'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}], u'step': u'Place the dome mold sheet onto a sheet tray. Using a pastry brush, paint the melted, tempered chocolate evenly on the surface of each of the mold cavities, making sure that the chocolate goes straight to the edge.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place the molds in the fridge to set.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Prepare the cake: Preheat the oven to 350\xb0F. Make an X with butter on the surface of a sheet tray, and line the tray with parchment. In the bowl of a stand mixer fitted with a paddle attachment on high speed, cream the butter and sugar until they are light and fluffy, scraping down the sides of the bowl periodically.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the eggs and yolks one at a time and mix well after each addition. Sift dry ingredients together, turn the mixer down to low speed, and add half of the dry ingredients, followed by half the buttermilk.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix on low until just incorporated, then add the rest of the dry ingredients and buttermilk and mix until just incorporated.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the bowl from the stand mixer and finish mixing by hand with a large rubber spatula, then pour the batter into the prepared pan and spread it evenly with an offset spatula.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 15-20 minutes, rotating halfway through, until a tester inserted in the center comes out clean and the cake begins to pull away from the sides of the pan. Allow the cake to cool for 15 minutes in the pan, then run a knife around the edge and place a piece of parchment and an inverted sheet tray on top and turn the cake upside down onto the new parchment. Pull the parchment off the top gently and allow the cake to rest for 10 minutes before cutting cake circles with a cutter that is the same size as the cavities of the mold.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Prepare the mousse: In a large bowl set over boiling water, melt the white chocolate.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Add the 2 ounces of cream a little at a time, stirring until the mixture becomes smooth and warm to the touch. Melt the bloomed gelatin in the microwave (stop every 15 seconds to check it) and stir to add it to the mixture.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the egg yolks and the salt together, then add them to the chocolate mixture a little bit at a time, whisking as you go to prevent them from cooking into chunks.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the mixture for 1 minute over the double broiler, then remove it from the heat and place in the fridge to cool to room temperature, a point where the mixture is neither warm nor cold (about 20 minutes). At this point, the chocolate mixture will be firmer.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to make it smooth and supple.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Add 1/4 of the cold whipped cream to the chocolate mixture and stir to lighten it.', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Add the remaining cream and fold gently to incorporate it.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'4', u'number': 17, u'ingredients': []}], u'name': u'Prepare the mold'}], u'winePairing': {u'pairingText': u"Riesling, Sparkling Wine, and Zinfandel are great choices for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Columbia Winery Cellarmaster's Riesling. It has 4.7 out of 5 stars and a bottle costs about 12 dollars.", u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 116, u'instructions': u'Procedures                                                                              1                                                                            Prepare the mold: Place the dome mold sheet onto a sheet tray. Using a pastry brush, paint the melted, tempered chocolate evenly on the surface of each of the mold cavities, making sure that the chocolate goes straight to the edge. Place the molds in the fridge to set.                                                                                                                            2                                                                            Prepare the cake: Preheat the oven to 350\xb0F. Make an X with butter on the surface of a sheet tray, and line the tray with parchment. In the bowl of a stand mixer fitted with a paddle attachment on high speed, cream the butter and sugar until they are light and fluffy, scraping down the sides of the bowl periodically. Add the eggs and yolks one at a time and mix well after each addition. Sift dry ingredients together, turn the mixer down to low speed, and add half of the dry ingredients, followed by half the buttermilk. Mix on low until just incorporated, then add the rest of the dry ingredients and buttermilk and mix until just incorporated. Remove the bowl from the stand mixer and finish mixing by hand with a large rubber spatula, then pour the batter into the prepared pan and spread it evenly with an offset spatula. Bake for 15-20 minutes, rotating halfway through, until a tester inserted in the center comes out clean and the cake begins to pull away from the sides of the pan. Allow the cake to cool for 15 minutes in the pan, then run a knife around the edge and place a piece of parchment and an inverted sheet tray on top and turn the cake upside down onto the new parchment. Pull the parchment off the top gently and allow the cake to rest for 10 minutes before cutting cake circles with a cutter that is the same size as the cavities of the mold.                                                                                                                            3                                                                            Prepare the mousse: In a large bowl set over boiling water, melt the white chocolate. Add the 2 ounces of cream a little at a time, stirring until the mixture becomes smooth and warm to the touch. Melt the bloomed gelatin in the microwave (stop every 15 seconds to check it) and stir to add it to the mixture. Whisk the egg yolks and the salt together, then add them to the chocolate mixture a little bit at a time, whisking as you go to prevent them from cooking into chunks. Whisk the mixture for 1 minute over the double broiler, then remove it from the heat and place in the fridge to cool to room temperature, a point where the mixture is neither warm nor cold (about 20 minutes). At this point, the chocolate mixture will be firmer. Whisk to make it smooth and supple. Add 1/4 of the cold whipped cream to the chocolate mixture and stir to lighten it. Add the remaining cream and fold gently to incorporate it.                                                                                                                             4                                                                            Assemble the bombes: Place the mousse in a piping bag. Remove the chilled mold from the fridge. Pipe the mousse into each of the shells, taking care to only fill it just to the top. Place a raspberry or two into each bombe and smooth mousse over the top. Place a circle of cake over each and gently press the cake into the mousse. Put the mold on a sheet tray in the freezer and allow it to freeze for at least 4 hours.                                                                                                                            5                                                                            Make the sauce: Place the frozen raspberries and sugar in a saucepan over low heat, stirring occasionally. The raspberries will begin to melt, then they will liquefy. Stir to help break them up in the pot. When the fruit begins to simmer, remove from heat and force the juice through a fine mesh strainer. Discard the seeds, chill the sauce.                                                                                                                            6                                                                            Plate the dessert: Set out plates for portioning. Place a tablespoon of sauce on the plate, then drag the spoon through the spot to create a design. Loosen the edges of the bombes from the molds and turn the cavities inside out to unmold the bombes. Allow them to sit for 20 minutes so the cake can thaw, then carefully place the bombes on the plates and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/white-chocolate-and-raspberry-frozen-mousse-bombes-195976', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}