{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/200054-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 200054, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lemon Basil Chocolate Chip Ice Cream Sandwiches', u'diets': [], u'pricePerServing': 121.83, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'3 cups washed basil leaves and stems, lightly packed (about one large bunch)', u'aisle': u'Produce', u'name': u'basil leaves', u'metaInformation': [u'washed', u'packed', u'large', u'( one bunch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 2044, u'unit': u'cups'}, {u'originalString': u'2 1/4 cups cake flour', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 10020129, u'unit': u'cups'}, {u'originalString': u'3/4 cup dark brown sugar, packed', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'2 ounces dark chocolate, shaved fine with a vegetable peeler', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'with a vegetable peeler', u'shaved', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'6 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3 cups half-and-half (or 1 1/2 cups each cream and milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [u'(or 1 1/2 cups each cream and milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'1 1/2 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'Zest of three lemons', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 9156, u'unit': u'servings'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 pound (2 sticks) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'pound'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/06/lemon-basil-chocolate-chip-ice-cream-sandwich-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For basil chocolate chip ice cream: In a medium saucepan, bring half-and-half to a simmer, then add basil and salt. Cover and barely simmer for 10 to 15 minutes, stirring occasionally. Meanwhile, in a large bowl, whisk sugar into egg yolks until they lighten in color and become thick and ribbon-like.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Transfer dairy and basil to blender, and carefully blend until smooth. (If your blender has a stopper in the center of the lid for adding ingredients, remove it and cover the hole with a few sheets of paper towel—this will keep hot dairy from splashing out at you.)', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour pur\xe9e through a strainer into egg yolk mixture, whisking constantly until thoroughly combined.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Return custard to saucepan over low heat and stir constantly until it coats the back of a spoon and a finger swipe leaves a clean line.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u"Pour custard through strainer into an airtight container. Stir in lemon zest and refrigerate overnight, or at least 6 hours. The next day, churn in ice cream machine according to manufacturer's instructions. In last minute of churn, slowly pour in shaved chocolate (best kept in the freezer until you need it).", u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}]}, {u'equipment': [], u'step': u'Transfer ice cream back to container to freeze for two to three hours, or serve immediately as soft serve.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For lemon butter cookies: Preheat oven to 350\xb0F.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place oven racks in upper and lower thirds of oven. In the bowl of an electric mixer, cream butter with both sugars, lemon zest, and salt on high speed until very light with little graininess, scraping down bowl as needed. Reduce mixer to medium and add in egg and vanilla, scraping down sides of bowl until fully combined. Reduce mixer speed to low and add flour in three installments, scraping down bowl between each installment.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'5', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Using a two-tablespoon scoop, portion out 20 balls of dough on two parchment-lined cookie sheets, leaving as much room as possible for cookies to spread out. Lightly pat into flat disks, then transfer to freezer or refrigerator to firm up for 10 to 15 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 10 minutes, then rotate pans 180\xb0 and swap positions on racks.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Bake for another 10 minutes, or until edges are a firmer, darker brown and a spatula can easily lift a cookie without it drooping.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to cooling racks and cool completely.', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'6', u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Assembling sandwiches: For each sandwich, scoop three to four tablespoons of ice cream onto half the cookies. Use a small offset spatula or a knife to spread ice cream flat, then cover with remaining cookies.', u'number': 19, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Serve immediately or wrap tightly in plastic wrap and freeze. Sandwiches can be served straight from freezer, but ice cream benefits from a 5- to 10-minute thaw on the counter before eating.', u'number': 20, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 63, u'instructions': u"Procedures                                                                              1                                                                            For basil chocolate chip ice cream: In a medium saucepan, bring half-and-half to a simmer, then add basil and salt. Cover and barely simmer for 10 to 15 minutes, stirring occasionally. Meanwhile, in a large bowl, whisk sugar into egg yolks until they lighten in color and become thick and ribbon-like.                                                                                                                            2                                                                            Transfer dairy and basil to blender, and carefully blend until smooth. (If your blender has a stopper in the center of the lid for adding ingredients, remove it and cover the hole with a few sheets of paper towel—this will keep hot dairy from splashing out at you.) Pour pur\xe9e through a strainer into egg yolk mixture, whisking constantly until thoroughly combined.                                                                                                                            3                                                                            Return custard to saucepan over low heat and stir constantly until it coats the back of a spoon and a finger swipe leaves a clean line. Pour custard through strainer into an airtight container. Stir in lemon zest and refrigerate overnight, or at least 6 hours. The next day, churn in ice cream machine according to manufacturer's instructions. In last minute of churn, slowly pour in shaved chocolate (best kept in the freezer until you need it). Transfer ice cream back to container to freeze for two to three hours, or serve immediately as soft serve.                                                                                                                            4                                                                            For lemon butter cookies: Preheat oven to 350\xb0F. Place oven racks in upper and lower thirds of oven. In the bowl of an electric mixer, cream butter with both sugars, lemon zest, and salt on high speed until very light with little graininess, scraping down bowl as needed. Reduce mixer to medium and add in egg and vanilla, scraping down sides of bowl until fully combined. Reduce mixer speed to low and add flour in three installments, scraping down bowl between each installment.                                                                                                                             5                                                                            Using a two-tablespoon scoop, portion out 20 balls of dough on two parchment-lined cookie sheets, leaving as much room as possible for cookies to spread out. Lightly pat into flat disks, then transfer to freezer or refrigerator to firm up for 10 to 15 minutes. Bake for 10 minutes, then rotate pans 180\xb0 and swap positions on racks. Bake for another 10 minutes, or until edges are a firmer, darker brown and a spatula can easily lift a cookie without it drooping. Transfer to cooling racks and cool completely.                                                                                                                            6                                                                            Assembling sandwiches: For each sandwich, scoop three to four tablespoons of ice cream onto half the cookies. Use a small offset spatula or a knife to spread ice cream flat, then cover with remaining cookies. Serve immediately or wrap tightly in plastic wrap and freeze. Sandwiches can be served straight from freezer, but ice cream benefits from a 5- to 10-minute thaw on the counter before eating.", u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-basil-chocolate-chip-ice-cream-sandwiches-200054', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}