{u'recipes': [{u'sourceName': u'Vegan Yack Attack', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/668228-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 668228, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cauliflower Scramble', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'whole 30'], u'pricePerServing': 45.79, u'creditText': u'Vegan Yack Attack', u'extendedIngredients': [{u'originalString': u"1 Tablespoon coconut aminos, or Bragg's", u'aisle': u'Health Foods;Condiments', u'name': u'coconut aminos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 98929, u'unit': u'Tablespoon'}, {u'originalString': u'\xbd Tablespoon coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tablespoon'}, {u'originalString': u'\xbc teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 small head cauliflower or half a large', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [u'small', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 1049, u'unit': u'head'}, {u'originalString': u'1 Tablespoon nutritional yeast', u'aisle': u'Spices and Seasonings;Health Foods', u'name': u'nutritional yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutritional-yeast.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93690, u'unit': u'Tablespoon'}, {u'originalString': u'\xbd onion, diced (about \xbd cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 small red bell pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'\xbd teaspoon smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://veganyackattack.com/2014/05/25/cauliflower-scramble/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove stem from cauliflower and cut into florets, then cut into even smaller pieces, until its all finely chopped. Some larger pieces are okay for texture, but you want each piece to be about  inch. You may also pulse a few times in a food processor. In a large skillet over medium heat, melt coconut oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [], u'step': u'Add onion and saut for about 5 minutes, until translucent.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add pepper and cook for 2 to 3 minutes longer.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add cauliflower and spread in an even layer across the skillet. Cook for about 5 minutes without moving so that it may get a little browned on one side; it may take a little longer. Toss in the herbs and seasonings, except the nutritional yeast, and stir it all together to well coat.  The cauliflower should now be a beautiful golden color. Continue to cook for another 5 to 7 minutes, until soft, or your desired texture is reached. Stir in the nutritional yeast and well combine.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutritional-yeast.jpg', u'id': 93690, u'name': u'nutritional yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}]}, {u'equipment': [], u'step': u'Remove from heat and serve with your favorite sides, or wrap into a tortilla for a breakfast burrito.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine are great choices for Scramble. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. The Ruffino Prosecco with a 4.2 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'Ruffino Prosecco has been produced from grapes grown in the hilly area of Valdobbiadene, which is the most historically vocated region for the production of Prosecco.Bright straw yellow with fine bubbles. The bouquet is fragrant and intensely fruity. It shows clean notes of apples, pears and citrus, accompanied by slight hints of hawthorn, wisteria and elder. Crisp, clean and delicate with fine bubble caressing. Intense sensations of apples and peaches drive a pleasant aftertaste, that is reminiscent of fruity and floral aromas.Ideal as an aperitif; it is very versatile as a food companion. Ruffino Prosecco perfectly matches with pizza, fish and shellfish dishes as well as white meat dishes.', u'title': u'Ruffino Prosecco', u'price': u'$12.99', u'id': 447373, u'link': u'https://www.wine.com/product/ruffino-prosecco/111308', u'imageUrl': u'https://spoonacular.com/productImages/447373-312x231.jpg'}]}, u'aggregateLikes': 1345, u'instructions': u'Remove stem from cauliflower and cut into florets, then cut into even smaller pieces, until its all finely chopped. Some larger pieces are okay for texture, but you want each piece to be about  inch. You may also pulse a few times in a food processor. In a large skillet over medium heat, melt coconut oil. Add onion and saut for about 5 minutes, until translucent. Add pepper and cook for 2 to 3 minutes longer. Add cauliflower and spread in an even layer across the skillet. Cook for about 5 minutes without moving so that it may get a little browned on one side; it may take a little longer. Toss in the herbs and seasonings, except the nutritional yeast, and stir it all together to well coat.  The cauliflower should now be a beautiful golden color. Continue to cook for another 5 to 7 minutes, until soft, or your desired texture is reached. Stir in the nutritional yeast and well combine. Remove from heat and serve with your favorite sides, or wrap into a tortilla for a breakfast burrito.', u'spoonacularSourceUrl': u'https://spoonacular.com/cauliflower-scramble-668228', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': True}]}