{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/390769-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 390769, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pronto Vegetarian Peppers', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 173.1, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/3 cup Minute\xae Brown Rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'minute\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20040, u'unit': u'cup'}, {u'originalString': u'3/4 cup canned kidney beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned kidney beans', u'metaInformation': [u'canned', u'rinsed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 16034, u'unit': u'cup'}, {u'originalString': u'1/2 cup frozen corn, thawed', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'2 green onions, thinly sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tablespoon grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup shredded part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1028, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'2 large sweet red peppers', u'aisle': u'Produce', u'name': u'red sweet peppers', u'metaInformation': [u'sweet', u'red', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 cup canned stewed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'stewed tomatoes', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11533, u'unit': u'cup'}, {u'originalString': u'2 tablespoons hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 79.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/pronto-vegetarian-peppers', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut peppers in half lengthwise; remove seeds.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place peppers in an ungreased shallow microwave-safe dish. Cover and microwave on high for 3-4 minutes or until tender.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the tomatoes, rice and water in a small microwave-safe bowl. Cover and microwave on high for 5-6 minutes or until rice is tender. Stir in the beans, corn, onions and pepper flakes; spoon into peppers.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Sprinkle with cheeses. Microwave, uncovered, for 3-4 minutes or until heated through.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 150, u'instructions': u"Directions                                                                                Cut peppers in half lengthwise; remove seeds. Place peppers in an ungreased shallow microwave-safe dish. Cover and microwave on high for 3-4 minutes or until tender.                                                                                           Combine the tomatoes, rice and water in a small microwave-safe bowl. Cover and microwave on high for 5-6 minutes or until rice is tender. Stir in the beans, corn, onions and pepper flakes; spoon into peppers.                                                                                           Sprinkle with cheeses. Microwave, uncovered, for 3-4 minutes or until heated through.                                        Yield: 2 servings.                                                                                                     Editor's Note: This recipe was tested in a 1,100-watt microwave.                                                                                                Originally published as Pronto Vegetarian Peppers in  Taste of HomeJune/July 2009, p28                                                                                                                                                                                                        Nutritional Facts                                                                             2 stuffed pepper halves equals 341 calories, 7 g fat (3 g saturated fat), 19 mg cholesterol, 556 mg sodium, 56 g carbohydrate, 11 g fiber, 19 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/pronto-vegetarian-peppers-390769', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}