{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/772927-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 772927, u'veryPopular': True, u'lowFodmap': False, u'title': u"Sunny's Easy Chipotle Chicken Baked Mac and Cheese", u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 227.78, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 7-ounce can chipotle peppers in adobo sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle peppers in adobo', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 11632, u'unit': u'ounce'}, {u'originalString': u'1 cup crushed corn tortilla chips (just about the texture of sand)', u'aisle': u'Savory Snacks', u'name': u'corn tortilla chips', u'metaInformation': [u'crushed', u'(just the texture of sand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19056, u'unit': u'cup'}, {u'originalString': u'2 large eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/8 teaspoon coarsely ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'4 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'8 ounces shredded cheese blend (Mexican or taco blend)', u'aisle': u'Cheese', u'name': u'italian cheese blend', u'metaInformation': [u'shredded', u'(Mexican or taco blend)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93651, u'unit': u'ounces'}, {u'originalString': u'16 ounces shredded cheese blend (Mexican or taco blend)', u'aisle': u'Cheese', u'name': u'italian cheese blend', u'metaInformation': [u'shredded', u'(Mexican or taco blend)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 93651, u'unit': u'ounces'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 1/3 cups Mexican crema', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'mexican crema', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 93772, u'unit': u'cups'}, {u'originalString': u'16 ounces penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'ounces'}, {u'originalString': u'4 scallions, white and green parts, finely chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'white', u'green', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 boneless, skinless chicken breasts, split', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'split', u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'2 tablespoons all-purpose or wheat flour', u'aisle': u'Baking', u'name': u'wheat flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}], u'healthScore': 7.0, u'imageType': u'jpeg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/sunny-anderson/sunnys-easy-chipotle-chicken-baked-mac-and-cheese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove 4 to 5 chipotle peppers and a bit of adobo sauce from the can and rub it all over the chicken; measure out 2 tablespoons of the adobo sauce and set aside for later (reserve any remaining chiles and adobo sauce from the can for another use). Rest the chicken in a bowl or on a plate for 2 hours total, refrigerated first for 1 1/2 hours, then at room temperature for an additional 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot, add the garlic, chicken and the chipotle peppers from the marinade.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add just enough water to cover, then bring to a boil on medium high. Once boiling, turn the heat to the lowest setting and poach the chicken until cooked through, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the chicken to a plate and rest (reserve the poaching water for cooking the pasta). Fish out the peppers and discard them; place the garlic cloves in a large bowl and smash them with the back of a spoon or your hands. Once the chicken is cool enough to touch, shred it by hand into bite-size pieces.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F. Use the butter or cooking spray to coat the bottom and sides of a 13-by-9-inch casserole dish.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In the same pot used to poach the chicken, add more water to the poaching water and a nice pinch of salt and bring the pot back to a boil (watch the water; it may foam up a bit from the poaching process).', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the pasta and cook 1 minute less than the package suggests.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'Drain the pasta in a colander.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the sauce: In the large bowl with the garlic, add the heavy cream, cheese, crema, flour, pepper, scallions, eggs, reserved 2 tablespoons adobo sauce, shredded chicken and cooked pasta. Stir to combine.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 93772, u'name': u'mexican crema'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour into the prepared dish.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the topping: In a medium bowl, toss together the crushed chips and cheese. Sprinkle this mixture evenly over the dish.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Bake, uncovered, until golden brown on top, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}], u'name': u'For the chicken and pasta'}], u'aggregateLikes': 2117, u'instructions': u'Watch how to make this recipe.                    For the chicken and pasta: Remove 4 to 5 chipotle peppers and a bit of adobo sauce from the can and rub it all over the chicken; measure out 2 tablespoons of the adobo sauce and set aside for later (reserve any remaining chiles and adobo sauce from the can for another use). Rest the chicken in a bowl or on a plate for 2 hours total, refrigerated first for 1 1/2 hours, then at room temperature for an additional 30 minutes.                          In a large pot, add the garlic, chicken and the chipotle peppers from the marinade. Add just enough water to cover, then bring to a boil on medium high. Once boiling, turn the heat to the lowest setting and poach the chicken until cooked through, about 15 minutes. Remove the chicken to a plate and rest (reserve the poaching water for cooking the pasta). Fish out the peppers and discard them; place the garlic cloves in a large bowl and smash them with the back of a spoon or your hands. Once the chicken is cool enough to touch, shred it by hand into bite-size pieces.                          Preheat the oven to 375 degrees F. Use the butter or cooking spray to coat the bottom and sides of a 13-by-9-inch casserole dish.                          In the same pot used to poach the chicken, add more water to the poaching water and a nice pinch of salt and bring the pot back to a boil (watch the water; it may foam up a bit from the poaching process). Add the pasta and cook 1 minute less than the package suggests. Drain the pasta in a colander.                          For the sauce: In the large bowl with the garlic, add the heavy cream, cheese, crema, flour, pepper, scallions, eggs, reserved 2 tablespoons adobo sauce, shredded chicken and cooked pasta. Stir to combine. Pour into the prepared dish.                          For the topping: In a medium bowl, toss together the crushed chips and cheese. Sprinkle this mixture evenly over the dish. Bake, uncovered, until golden brown on top, about 30 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/sunnys-easy-chipotle-chicken-baked-mac-and-cheese-772927', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 200, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}