{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/215356-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 215356, u'veryPopular': False, u'lowFodmap': False, u'title': u'Raid-the-storecupboard side', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 119.39, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'280g jar artichokes in oil', u'aisle': u'Produce', u'name': u'artichokes', u'metaInformation': [u'in oil'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 280.0, u'consistency': u'solid', u'id': 11007, u'unit': u'g'}, {u'originalString': u'140g frozen broad beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'broad beans', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broad-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 16053, u'unit': u'g'}, {u'originalString': u'handful parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'3 garlic cloves, finely sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 onions, finely sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'150ml passata', u'aisle': u'Canned and Jarred', u'name': u'passata', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/passata.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'solid', u'id': 10011547, u'unit': u'ml'}, {u'originalString': u'140g frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}], u'healthScore': 77.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/13244/raidthestorecupboard-side', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large frying pan with 3 tbspof the artichoke oil. Fry the onionsand garlic until soft and golden, about15 mins.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Pour in the passata and wine(if using). Cook for around 5 mins untilthickened.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/passata.jpg', u'id': 10011547, u'name': u'passata'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the artichokes and tipin with the peas and broad beans. Gentlycook for 5 mins. Pop into a serving bowl,scatter with parsley and drizzle with alittle extra artichoke oil, if you like.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broad-beans.jpg', u'id': 16053, u'name': u'fava beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 10, u'instructions': u'Heat a large frying pan with 3 tbspof the artichoke oil. Fry the onionsand garlic until soft and golden, about15 mins. Pour in the passata and wine(if using). Cook for around 5 mins untilthickened.Drain the artichokes and tipin with the peas and broad beans. Gentlycook for 5 mins. Pop into a serving bowl,scatter with parsley and drizzle with alittle extra artichoke oil, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/raid-the-storecupboard-side-215356', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}