{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599354-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 599354, u'veryPopular': False, u'lowFodmap': True, u'title': u'Chicken with Tomato Pilaf', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 35, u'pricePerServing': 125.3, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 1/2 cups basmati or long-grain rice', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [u'long-grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020444, u'unit': u'cups'}, {u'originalString': u'4 tablespoons butter, cut in small pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'small', u'cut in  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 chicken bouillon cube', u'aisle': u'Canned and Jarred', u'name': u'chicken bouillon cube', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6080, u'unit': u''}, {u'originalString': u'2 tablespoons chopped flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 lemon, quartered; or sumac', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'Salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 boneless, skinless chicken pieces, breasts or thighs', u'aisle': u'Meat', u'name': u'skinless chicken pieces', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 5011, u'unit': u''}, {u'originalString': u'2 teaspoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tablespoon'}, {u'originalString': u'1 pound ripe tomatoes, peeled', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'ripe', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'pound'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://leitesculinaria.com/5378/recipes-chicken-with-tomato-pilaf.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Make the pilaf1. If using basmati, wash the rice by pouring cold water over it in a bowl, stir well, and leave to soak for a few minutes, then strain and rinse under cold water. If using a another long-grain rice, prepare according to package directions.2. Quarter the tomatoes, remove the hard white bits near the stem end, then liquefy the tomatoes in the food processor. Measure the resulting tomato juice and add enough water to make it up to 2 2/3 cups.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'id': 10220444, u'name': u'long grain rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour it into a pan, add the crumbled stock cube, the sugar, and a little salt and pepper, and bring to the boil.3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the rice and stir well. Simmer, covered, over low heat, for 18 to 20 minutes, until the rice is tender and the liquid absorbed. (Some brands that claim not to be parboiled or precooked now take as little as 8 to 10 minutes, so read the information on the package.) Do not stir during the cooking, but add a little extra water if it becomes too dry. Fold in the butter pieces. Taste and add salt and pepper if necessary.Make the chicken4. While the rice is cooking, cut the chicken into 1 1/2-inch pieces.', u'length': {u'number': 26, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil and butter in a skillet and saute the chicken for 6 to 8 minutes, until lightly browned, adding salt and pepper, turning the pieces over once.5. Sprinkle the chicken with parsley and serve with lemon quarters or with sumac to sprinkle over, accompanied by the rice.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Make the pilaf1. If using basmati, wash the rice by pouring cold water over it in a bowl, stir well, and leave to soak for a few minutes, then strain and rinse under cold water. If using a another long-grain rice, prepare according to package directions.2. Quarter the tomatoes, remove the hard white bits near the stem end, then liquefy the tomatoes in the food processor. Measure the resulting tomato juice and add enough water to make it up to 2 2/3 cups. Pour it into a pan, add the crumbled stock cube, the sugar, and a little salt and pepper, and bring to the boil.3. Add the rice and stir well. Simmer, covered, over low heat, for 18 to 20 minutes, until the rice is tender and the liquid absorbed. (Some brands that claim not to be parboiled or precooked now take as little as 8 to 10 minutes, so read the information on the package.) Do not stir during the cooking, but add a little extra water if it becomes too dry. Fold in the butter pieces. Taste and add salt and pepper if necessary.Make the chicken4. While the rice is cooking, cut the chicken into 1 1/2-inch pieces. Heat the oil and butter in a skillet and saute the chicken for 6 to 8 minutes, until lightly browned, adding salt and pepper, turning the pieces over once.5. Sprinkle the chicken with parsley and serve with lemon quarters or with sumac to sprinkle over, accompanied by the rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-with-tomato-pilaf-599354', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}