{u'recipes': [{u'sourceName': u'Roxanas Home Baking', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/547521-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 547521, u'veryPopular': True, u'lowFodmap': False, u'title': u'Italian Easter bread – Pane di Pasqua', u'diets': [u'gluten free'], u'preparationMinutes': 60, u'pricePerServing': 72.3, u'creditText': u'Roxanas Home Baking', u'extendedIngredients': [{u'originalString': u'6 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 bread dough substituting orange zest for lemon zest and adding a pinch of aniseed.', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'for lemon zest and adding a pinch of aniseed.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2 tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-chocolate.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'1 cup boiling water, food coloring, 1 tbsp vinegar', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://roxanashomebaking.com/italian-easter-bread-pane-di-pasqua-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl add the boiling water, food coloring and vinegar. Stir to combine.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place an egg inside a whisk and leave it in the water for about 5 minutes. Take the egg out and place it in a paper towel to dry. Do the same with the remaining 5 eggs, adding more food color if needed. Make the dough following the directions  and leave it to rise until doubled in volume. When the dough is risen, divide it in 12 small balls. Shape each ball into a 13-15" long rope. Take two ropes and braid them together, forming a ring by pinching the ends. Do the same with the remaining ropes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place the dough rings on a baking sheet, next a colored egg in the middle of each one, cover with plastic foil and leave to rise for another 30 minutes. Meanwhile heat the oven to 375F. Just before baking the rings, brush them with milk and top with sprinkles.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 22 minutes or until golden. Leave to cool completely. Enjoy!', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 2764, u'instructions': u'In a small bowl add the boiling water, food coloring and vinegar. Stir to combine. Place an egg inside a whisk and leave it in the water for about 5 minutes. Take the egg out and place it in a paper towel to dry. Do the same with the remaining 5 eggs, adding more food color if needed. Make the dough following the directions  and leave it to rise until doubled in volume. When the dough is risen, divide it in 12 small balls. Shape each ball into a 13-15" long rope. Take two ropes and braid them together, forming a ring by pinching the ends. Do the same with the remaining ropes. Place the dough rings on a baking sheet, next a colored egg in the middle of each one, cover with plastic foil and leave to rise for another 30 minutes. Meanwhile heat the oven to 375F. Just before baking the rings, brush them with milk and top with sprinkles. Bake for 22 minutes or until golden. Leave to cool completely. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-easter-bread-pane-di-pasqua-547521', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 300, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}