{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/759980-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 759980, u'veryPopular': False, u'lowFodmap': True, u'title': u'Green Coconut Curry', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 220.15, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 \xbd lb. frozen mixed Asian vegetables (mixes with peas are good here)', u'aisle': u'Frozen', u'name': u'asian vegetables', u'metaInformation': [u'mixed', u'frozen', u'with peas are good here)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-medley.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10111583, u'unit': u'lb'}, {u'originalString': u'4 cups cooked brown rice', u'aisle': u'Pasta and Rice', u'name': u'cooked brown rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20041, u'unit': u'cups'}, {u'originalString': u'1 tsp. green curry paste', u'aisle': u'Ethnic Foods', u'name': u'green curry paste', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-curry-paste.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10093605, u'unit': u'tsp'}, {u'originalString': u'1 cup reduced-fat coconut milk', u'aisle': u'Canned and Jarred', u'name': u'low fat coconut milk', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 99009, u'unit': u'cup'}, {u'originalString': u'2 Tbs. teriyaki sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'teriyaki sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 6112, u'unit': u'Tbs'}], u'healthScore': 48.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/green-coconut-curry/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Combine coconut milk and curry paste in wok or large saucepan over medium heat, and bring to a boil. Stir in frozen vegetables. Simmer over medium heat 10 minutes. Stir in teriyaki sauce, and serve over rice.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6112, u'name': u'teriyaki sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'id': 93605, u'name': u'curry paste'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are great choices for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Ken Forrester Old Vine Reserve Chenin Blanc with a 4.9 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This full-bodied Chenin harmoniously balances ripe fruit with delicate oak nuances. It flaunts a rich, luscious mouthfeel, with flavors of melon and tropical fruit enhanced by complex mineral notes and hints of spice. Extended lees contact imparts an alluring honeycomb character.  View More', u'title': u'Ken Forrester Old Vine Reserve Chenin Blanc', u'price': u'$15.99', u'id': 442201, u'link': u'https://www.wine.com/product/ken-forrester-old-vine-reserve-chenin-blanc-2010/112605', u'imageUrl': u'https://spoonacular.com/productImages/442201-312x231.jpg'}]}, u'aggregateLikes': 74, u'instructions': u'Combine coconut milk and curry paste in wok or large saucepan over medium heat, and bring to a boil. Stir in frozen vegetables. Simmer over medium heat 10 minutes. Stir in teriyaki sauce, and serve over rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/green-coconut-curry-759980', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}