{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/549322-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 549322, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skillet Italian Sausage and Peppers with Whole-Wheat Penne', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 203.29, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1 small green pepper, sliced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 pound Italian sausage links (1 package)', u'aisle': u'Meat', u'name': u'italian sausage links', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 7036, u'unit': u'package'}, {u'originalString': u'\xbd teaspoon Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'Parmesan Cheese for finishing', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'for finishing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1 small red pepper, sliced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'\xbd cup red wine (merlot or pinot noir)', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red', u'(merlot or pinot noir)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'6 ounces tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11887, u'unit': u'ounces'}, {u'originalString': u'8 ounces tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'12 ounces water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'ounces'}, {u'originalString': u'12 ounces whole-wheat penne pasta', u'aisle': u'Pasta and Rice', u'name': u'whole-wheat penne pasta', u'metaInformation': [u'whole-wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-penne.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 99182, u'unit': u'ounces'}, {u'originalString': u'1 small yellow onion, sliced thin', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'small', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2014/02/skillet-italian-sausage-peppers-penne.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot of salted water, cook pasta until al dente. Reserve starchy cooking water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a tablespoon of olive oil in a large skillet over a medium-high heat. Brown sausages on all sides, until almost cooked through, remove and cut into \xbc inch slices. You don’t have to worry about cooking them all the way through, they will finish cooking while the sauce simmers. In the same pan drizzle another teaspoon or so of olive oil and saut\xe9 the peppers and onions until slightly softened, about five minutes. Return sausage back to the pan and deglaze with red wine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add tomato paste, tomato sauce, water, Italian seasoning, sugar and salt.  Stir to combine. Bring to a boil and then reduce to a simmer. Simmer for ten minutes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add penne to the skillet, toss with sauce. If needed add starchy pasta water to loosen the sauce up.Season with salt and pepper and garnish with grated parmesan cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Ricasoli Castello di Brolio Chianti Classico. It has 4.3 out of 5 stars and a bottle costs about 46 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Dark ruby color, with lots of chocolate, berry and vanilla aromas, this is full-bodied and velvety, with lots of fruit and a long, succulent finish. A beauty from a great vintage. View More', u'title': u'Ricasoli Castello di Brolio Chianti Classico', u'price': u'$45.99', u'id': 433641, u'link': u'https://www.wine.com/product/ricasoli-castello-di-brolio-chianti-classico-1997/28225', u'imageUrl': u'https://spoonacular.com/productImages/433641-312x231.jpg'}]}, u'aggregateLikes': 4282, u'instructions': u'In a large pot of salted water, cook pasta until al dente. Reserve starchy cooking water. Heat a tablespoon of olive oil in a large skillet over a medium-high heat. Brown sausages on all sides, until almost cooked through, remove and cut into \xbc inch slices. You don’t have to worry about cooking them all the way through, they will finish cooking while the sauce simmers. In the same pan drizzle another teaspoon or so of olive oil and saut\xe9 the peppers and onions until slightly softened, about five minutes. Return sausage back to the pan and deglaze with red wine. Add tomato paste, tomato sauce, water, Italian seasoning, sugar and salt.  Stir to combine. Bring to a boil and then reduce to a simmer. Simmer for ten minutes. Add penne to the skillet, toss with sauce. If needed add starchy pasta water to loosen the sauce up.Season with salt and pepper and garnish with grated parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/skillet-italian-sausage-and-peppers-with-whole-wheat-penne-549322', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}