{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/210182-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 210182, u'veryPopular': False, u'lowFodmap': True, u'title': u"Mary's maple & orange glazed chicken", u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 0, u'pricePerServing': 164.44, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'3 tbsp maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tbsp'}, {u'originalString': u'grated zest of 1 orange', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'4 boneless skinless chicken breasts, about 500g 1lb 2oz total weight', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp wholegrain mustard', u'aisle': u'Condiments', u'name': u'wholegrain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tbsp'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2374/marys-maple-and-orange-glazed-chicken', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Make several diagonal slashes across each chicken breast. Tip the other ingredients into a wide shallow bowl and swirl them together until everything is well mixed.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add the chicken breasts and turn them in the mixture until they are evenly coated. At this point you can cover the dish with cling film and chill the chicken for 24 hours, but it’s also fine to cook them straight away.Preheat the grill or light the BBQ. Then cook the chicken for 5-6 minutes each side, turning once and brushing or spooning over more marinade as you go, until the chicken is browned and glossy.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Serve the chicken on a bed of dressed salad leaves.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Waterbrook Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 57, u'instructions': u'Make several diagonal slashes across each chicken breast. Tip the other ingredients into a wide shallow bowl and swirl them together until everything is well mixed. Add the chicken breasts and turn them in the mixture until they are evenly coated. At this point you can cover the dish with cling film and chill the chicken for 24 hours, but it’s also fine to cook them straight away.Preheat the grill or light the BBQ. Then cook the chicken for 5-6 minutes each side, turning once and brushing or spooning over more marinade as you go, until the chicken is browned and glossy. Serve the chicken on a bed of dressed salad leaves.', u'spoonacularSourceUrl': u'https://spoonacular.com/marys-maple-orange-glazed-chicken-210182', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}