{u'recipes': [{u'sourceName': u'Spicy Southern Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/519072-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 519072, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple and Pear Salad with Maple Pecan Bacon and Cranberry Vinaigrette', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 450.43, u'creditText': u'Spicy Southern Kitchen', u'extendedIngredients': [{u'originalString': u'8 slices thick bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'2 tablespoons balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoons'}, {u'originalString': u'1 large Bartlett pear, thinly sliced', u'aisle': u'Produce', u'name': u'bartlett pear', u'metaInformation': [u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pear.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9412, u'unit': u''}, {u'originalString': u'\xbc teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon grated fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'1 large gala apple, diced', u'aisle': u'Produce', u'name': u'gala apple', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'\xbd cup Gorgonzola cheese', u'aisle': u'Cheese', u'name': u'gorgonzola cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1011004, u'unit': u'cup'}, {u'originalString': u'\xbd tablespoon light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'8 cups mixed greens', u'aisle': u'Produce', u'name': u'mixed greens', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cups'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup fresh orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1\xbd cups finely chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'1 cup red seedless grapes', u'aisle': u'Produce', u'name': u'red grapes', u'metaInformation': [u'red', u'seedless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup canned whole berry cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole berry cranberry sauce', u'metaInformation': [u'whole', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9081, u'unit': u'cup'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://spicysouthernkitchen.com/apple-and-pear-salad-with-maple-pecan-bacon-and-cranberry-vinaigrette/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat\xa0oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a wire rack coated with cooking spray on a 15x10-inch jelly roll pan lined with aluminum foil.Dip bacon in maple syrup and then press pecans onto both sides of bacon.Arrange bacon slices on wire rack and bake for 20 minutes. Flip bacon slices and cook for another 5 minutes. Set aside.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place mixed greens in a large salad bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'mixed greens'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together all ingredients in a medium bowl.To serve: Top each serving of salad with 2 pieces of bacon and drizzle with vinaigrette.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u'Add pears, apple, grapes, and gorgonzola cheese. Toss together.To make Cranberry Vinaigrette'}], u'winePairing': {u'pairingText': u'Salad can be paired with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 89, u'instructions': u'Preheat\xa0oven to 400 degrees. Place a wire rack coated with cooking spray on a 15x10-inch jelly roll pan lined with aluminum foil.Dip bacon in maple syrup and then press pecans onto both sides of bacon.Arrange bacon slices on wire rack and bake for 20 minutes. Flip bacon slices and cook for another 5 minutes. Set aside.Place mixed greens in a large salad bowl. Add pears, apple, grapes, and gorgonzola cheese. Toss together.To make Cranberry Vinaigrette: Whisk together all ingredients in a medium bowl.To serve: Top each serving of salad with 2 pieces of bacon and drizzle with vinaigrette.', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-and-pear-salad-with-maple-pecan-bacon-and-cranberry-vinaigrette-519072', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}