{u'recipes': [{u'sourceName': u'Home Cooking Adventure', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551183-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 551183, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Chocolate Fudge', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 1133.48, u'creditText': u'Home Cooking Adventure', u'extendedIngredients': [{u'originalString': u'10 oz (300 g) bittersweet chocolate (minimum 55% cacao)', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'55%', u'(minimum cacao)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 19903, u'unit': u'g'}, {u'originalString': u'dried fruits, optional', u'aisle': u'Produce', u'name': u'kiwi fruits', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 9148, u'unit': u'serving'}, {u'originalString': u'orange or lemon zest, optional', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'serving'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'14 oz (400 g) sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 1095, u'unit': u'g'}, {u'originalString': u'1 tbsp unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1/2 cup toasted walnuts, chopped, optional', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'toasted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 59.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.homecookingadventure.com/recipes/easy-chocolate-fudge', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 163, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Line a 8X8 inch baking pan with foil. Break or chop the chocolate into small chunks.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the chocolate and condensed milk in a double base saucepan, over low heat, stirring occasionally. Once melted add vanilla extract, cocoa powder and pinch of salt and stir well to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add orange or lemon zest and fruits if used.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Remove from heat and transfer to the prepared baking pan. Press the toasted nuts over the top.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let it chill in the fridge for about 1 hour until set, and cut into squares.\xa0\xa0', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 73, u'instructions': u'Line a 8X8 inch baking pan with foil. Break or chop the chocolate into small chunks.Place the chocolate and condensed milk in a double base saucepan, over low heat, stirring occasionally. Once melted add vanilla extract, cocoa powder and pinch of salt and stir well to combine. Add orange or lemon zest and fruits if used.Remove from heat and transfer to the prepared baking pan. Press the toasted nuts over the top.Let it chill in the fridge for about 1 hour until set, and cut into squares.\xa0\xa0', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-chocolate-fudge-551183', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}