{u'recipes': [{u'sourceName': u'Amuse Your Bouche', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/578504-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 578504, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breakfast nachos', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 197.76, u'creditText': u'Amuse Your Bouche', u'extendedIngredients': [{u'originalString': u'1 avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'150g cooked black beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 16015, u'unit': u'g'}, {u'originalString': u'Black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'50g cheese, grated (I used cheddar)', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'grated', u'(I used cheddar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'g'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'5 mini flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u"3tbsp your favourite hot sauce (I used Nando's Medium Peri Peri Sauce)", u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'medium', u"(I used Nando's Peri Peri Sauce)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'tbsp'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 large tomato, diced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.amuse-your-bouche.com/breakfast-nachos/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Cut the mini tortillas into triangles (I cut each into 8), and lay them out on a baking tray. Keep them in a single layer if you can, but it's okay if they overlap a bit. Spray them lightly with oil, and add a pinch of salt and pepper.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place under a medium grill (broiler) for a couple of minutes, until golden brown. Then, flip each tortilla chip over and repeat with the other side.When the tortilla chips are ready, layer them up (on a baking tray covered in baking paper) with the cheese, tomato, black beans and hot sauce - I ended up with three layers of each.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Place back under the grill (don't have the temperature up too high - you want to try to melt the cheese all the way through, rather than just brown the top).While the nachos are grilling, fry your eggs to your preference - I did mine sunny side up. Also dice your avocado.When the nachos are hot and crispy, top them with the fried eggs and diced avocado.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 294, u'instructions': u"Cut the mini tortillas into triangles (I cut each into 8), and lay them out on a baking tray. Keep them in a single layer if you can, but it's okay if they overlap a bit. Spray them lightly with oil, and add a pinch of salt and pepper. Place under a medium grill (broiler) for a couple of minutes, until golden brown. Then, flip each tortilla chip over and repeat with the other side.When the tortilla chips are ready, layer them up (on a baking tray covered in baking paper) with the cheese, tomato, black beans and hot sauce - I ended up with three layers of each. Place back under the grill (don't have the temperature up too high - you want to try to melt the cheese all the way through, rather than just brown the top).While the nachos are grilling, fry your eggs to your preference - I did mine sunny side up. Also dice your avocado.When the nachos are hot and crispy, top them with the fried eggs and diced avocado. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-nachos-578504', u'dishTypes': [u'fingerfood', u'antipasti', u'lunch', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u"hor d'oeuvre", u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}