{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/681264-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 681264, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Roasted Tomato Orange Soup with Pesto', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'pricePerServing': 353.18, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'2 carrots, finely diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery stalks, finely diced', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'4 cups of chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'Homemade baked croutons (click on link up above for recipe)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'croutons', u'metaInformation': [u'homemade', u'for recipe)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'link', u'unitShort': u'link', u'amount': 1.0, u'consistency': u'solid', u'id': 18242, u'unit': u'link'}, {u'originalString': u'Dried basil, to taste', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2003, u'unit': u'servings'}, {u'originalString': u'1/4 cup fresh basil, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'2 large cloves of garlic, cut into slivers', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'large', u'cut into slivers'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'Drizzle of olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Dried oregano, to taste', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2027, u'unit': u'servings'}, {u'originalString': u'Freshly cracked black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'Pesto, to taste', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 93698, u'unit': u'servings'}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'Slow simmered tomatoes, and their juices', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u'servings'}, {u'originalString': u'15 miscellaneous tomatoes, cored & halved if large', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'cored', u'large', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1/2 sweet yellow onion, finely diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'sweet', u'yellow', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 66.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2015/10/slow-roasted-tomato-orange-soup-with-pesto.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 275 degrees. Line a baking sheet with tin foil then coat it with cooking spray.Core the tomatoes. Slice the larger tomatoes in half and leave the small ones whole.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on the baking sheet, cut side up. Slide the slivers of garlic into the tomato halves. Season with black pepper, dried basil, dried oregano, to taste.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2003, u'name': u'dried basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Drizzle the top of the tomatoes with a bit of olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into the oven and roast for 90 minutes then turn the tray. Return to the oven and continue to roast for 90-120 minutes, or until juicy and roasted.', u'length': {u'number': 210, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place on the counter to cool then season with sea salt, to taste. Once they are cool, put the tomatoes and their juices into a storage bowl with a lid and place into the refrigerator until needed.Coat a small Dutch oven with the olive oil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add the onions, carrots, and celery then place a lid on it. Cook, stirring occasionally, for 7-10minutes, or until the vegetables are tender; add the minced garlic and cook, stirring constantly, for 1 minute.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the roasted tomatoes, chicken broth, orange juice, and season with sea salt and freshly cracked pepper, to taste. Cover with a lid and let it simmer for 45-60 minutes.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add chopped basil and stir to combine.Make homemade baked croutons.Click this linkfor the directions.Blend the soup using an immersion blender until creamy and smooth. Taste and re-season with sea salt and freshly cracked pepper, to taste, if needed.Side Note: If you are in the mood for a smoother soup,pour it through a fine strainer. If you are in the mood for a thicker and heartier soup, skip this step.Ladle soup into serving bowls then drizzle the top with pesto.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18242, u'name': u'croutons'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [], u'step': u'Add a fewhomemade homemade baked croutonson top.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately. Enjoy.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 11, u'instructions': u'Preheat the oven to 275 degrees. Line a baking sheet with tin foil then coat it with cooking spray.Core the tomatoes. Slice the larger tomatoes in half and leave the small ones whole. Place on the baking sheet, cut side up. Slide the slivers of garlic into the tomato halves. Season with black pepper, dried basil, dried oregano, to taste. Drizzle the top of the tomatoes with a bit of olive oil.Place into the oven and roast for 90 minutes then turn the tray. Return to the oven and continue to roast for 90-120 minutes, or until juicy and roasted. Place on the counter to cool then season with sea salt, to taste. Once they are cool, put the tomatoes and their juices into a storage bowl with a lid and place into the refrigerator until needed.Coat a small Dutch oven with the olive oil. Add the onions, carrots, and celery then place a lid on it. Cook, stirring occasionally, for 7-10minutes, or until the vegetables are tender; add the minced garlic and cook, stirring constantly, for 1 minute. Add the roasted tomatoes, chicken broth, orange juice, and season with sea salt and freshly cracked pepper, to taste. Cover with a lid and let it simmer for 45-60 minutes. Add chopped basil and stir to combine.Make homemade baked croutons.Click this linkfor the directions.Blend the soup using an immersion blender until creamy and smooth. Taste and re-season with sea salt and freshly cracked pepper, to taste, if needed.Side Note: If you are in the mood for a smoother soup,pour it through a fine strainer. If you are in the mood for a thicker and heartier soup, skip this step.Ladle soup into serving bowls then drizzle the top with pesto. Add a fewhomemade homemade baked croutonson top. Serve immediately. Enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-roasted-tomato-orange-soup-with-pesto-681264', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}