{u'recipes': [{u'sourceName': u'Not Enough Cinnamon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542300-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 542300, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blue Cheese Pasta', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 56.57, u'creditText': u'Not Enough Cinnamon', u'extendedIngredients': [{u'originalString': u'3/4 cup blue cheese, crumbled (3.5 oz)', u'aisle': u'Cheese', u'name': u'blue cheese', u'metaInformation': [u'blue', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 1004, u'unit': u'oz'}, {u'originalString': u'1 bouillon cube (optional)', u'aisle': u'Canned and Jarred', u'name': u'bouillon cube', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1026076, u'unit': u''}, {u'originalString': u'2 tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'12 oz linguine (or any pasta you like) - 2 oz per person-', u'aisle': u'Pasta and Rice', u'name': u'linguine', u'metaInformation': [u'or any pasta you like) - 2 oz per person-'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10720420, u'unit': u'oz'}, {u'originalString': u'Freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 1/4 cups skim milk, heated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 1085, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://notenoughcinnamon.com/2013/01/08/blue-cheese-pasta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook pasta according to package direction, with a bouillon cube (stock).', u'number': 1, u'ingredients': [{u'image': None, u'id': 1026076, u'name': u'bouillon cube'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Drain and set aside.  Melt the butter in a heavy-bottomed saucepan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk in the flour and cook, whisking constantly, until the paste cooks and bubbles a bit, about 2 minutes. Don't let it brown!", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the hot milk, continuing to whisk as the sauce thickens. Bring it to a boil.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add blue cheese and pepper to taste, lower the heat, and cook, whisking for 2 to 3 minutes more.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'id': 1004, u'name': u'blue cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Remove from heat, pour over pasta and mix well to coat.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 61, u'instructions': u"Cook pasta according to package direction, with a bouillon cube (stock). Drain and set aside.  Melt the butter in a heavy-bottomed saucepan.  Whisk in the flour and cook, whisking constantly, until the paste cooks and bubbles a bit, about 2 minutes. Don't let it brown!  Add the hot milk, continuing to whisk as the sauce thickens. Bring it to a boil.  Add blue cheese and pepper to taste, lower the heat, and cook, whisking for 2 to 3 minutes more. Remove from heat, pour over pasta and mix well to coat. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/blue-cheese-pasta-542300', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}