{u'recipes': [{u'sourceName': u'Julies Eats and Treats', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/678735-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 678735, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian Cheese Stuffed Meatloaf', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 189.14, u'creditText': u'Julies Eats and Treats', u'extendedIngredients': [{u'originalString': u'2 (8 oz) cans tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11549, u'unit': u'oz'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 lb ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'1/8 tsp ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1/2 c. chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'c'}, {u'originalString': u'1/2 tsp oregano, dried', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'3/4 c. crushed saltine crackers', u'aisle': u'Savory Snacks', u'name': u'saltine crackers', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 18228, u'unit': u'c'}, {u'originalString': u'2 c. shredded Mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'c'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.julieseatsandtreats.com/italian-cheese-stuffed-meatloaf-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 34.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u"Preheat oven to 350 degrees.In a large mixing bowl combine all ingredients EXCEPT cheese and 1 can tomato sauce. Shape mixture into a 10'' x 12'' rectangle on a piece of wax paper. Sprinkle 1 1/34 c. cheese over the meat.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Roll up the meat, beginning on the long side of the rectangle and pulling back the wax paper as you go. Press ends to seal.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on large baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 1 hour.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Drain off grease.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour remaining tomato sauce over loaf and sprinkle with remaining cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}, {u'equipment': [], u'step': u'Bake 15 more minutes or until cheese is melted.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Meatloaf can be paired with Cabernet Sauvignon and Zinfandel. Meatloaf will work with many red wines. We recommend something bold and fruity, like a Cabernet Sauvignon or Zinfandel. You could try Spring Mountain Vineyard Estate Cabernet Sauvignon. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 52 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'zinfandel'], u'productMatches': [{u'description': u'Ripe and juicy, with plum, black cherry and blackberry flavors, picking up sage, anise and dusty notes, finishing with firm, complex tannins. View More', u'title': u'Spring Mountain Vineyard Estate Cabernet Sauvignon', u'price': u'$51.99', u'id': 438633, u'link': u'https://www.wine.com/product/spring-mountain-vineyard-estate-cabernet-sauvignon-2001/80772', u'imageUrl': u'https://spoonacular.com/productImages/438633-312x231.jpg'}]}, u'aggregateLikes': 338, u'instructions': u"Preheat oven to 350 degrees.In a large mixing bowl combine all ingredients EXCEPT cheese and 1 can tomato sauce. Shape mixture into a 10'' x 12'' rectangle on a piece of wax paper. Sprinkle 1 1/34 c. cheese over the meat. Roll up the meat, beginning on the long side of the rectangle and pulling back the wax paper as you go. Press ends to seal. Place on large baking sheet. Bake for 1 hour. Drain off grease. Pour remaining tomato sauce over loaf and sprinkle with remaining cheese. Bake 15 more minutes or until cheese is melted.", u'spoonacularSourceUrl': u'https://spoonacular.com/italian-cheese-stuffed-meatloaf-678735', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}