{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/795208-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 795208, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Bacon Ranch Flatbread Pizza', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 210.19, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'6 pieces cooked bacon, roughly chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cooked', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'pieces'}, {u'originalString': u'4 tablespoons chopped green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'2 cups shredded cheddar-jack cheese', u'aisle': u'Cheese', u'name': u'jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cups'}, {u'originalString': u'4 6-inch pre-made flatbreads', u'aisle': u'Bakery/Bread', u'name': u'wheat flatbreads', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10018042, u'unit': u''}, {u'originalString': u'extra ranch for dipping', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch', u'metaInformation': [u'for dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4639, u'unit': u'servings'}, {u'originalString': u'3/4 cup creamy ranch dressing, (approximate measure)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [u'(approximate measure)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4639, u'unit': u'cup'}, {u'originalString': u'2-3 large boneless skinless chicken breasts, cooked, cooled, and shredded', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'shredded', u'boneless', u'skinless', u'cooled', u'large', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://wearychef.com/chicken-bacon-ranch-flatbread-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 325.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place flatbreads on an extra-large, parchment-lined baking sheet. You may need to use more than one depending on the size of your breads and pans.Evenly distribute the chicken over the flatbreads, top with the ranch dressing, then the cheese, then the bacon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Bake at 325 for 10-12 minutes, or until cheese is melted and bubbly and the flatbread is warmed through.Top with chopped green onions, and serve with a little extra ranch for dipping.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are great choices for Flat Bread Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Cecchi Sangiovese di Toscana. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 9 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'The red wine is made according to traditional methods, along with the help of modern technology and with much care. It has a ruby red colour with purple lights, and a delicate fruity bouquet reminiscent of violets and irises. Its good structure, well combined with a moderate acidity, can be distinguished on the palate. Although lacking in sharp tannins, the generous taste of the Sangiovese guarantees a wine that ages well. This wine is pleasant with cold and hot meat dishes and when young should be served at a temperature of 16 \xb0C. View More', u'title': u'Cecchi Sangiovese di Toscana', u'price': u'$9.49', u'id': 439017, u'link': u'https://www.wine.com/product/cecchi-sangiovese-di-toscana-2000/48873', u'imageUrl': u'https://spoonacular.com/productImages/439017-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Preheat oven to 325.Place flatbreads on an extra-large, parchment-lined baking sheet. You may need to use more than one depending on the size of your breads and pans.Evenly distribute the chicken over the flatbreads, top with the ranch dressing, then the cheese, then the bacon.Bake at 325 for 10-12 minutes, or until cheese is melted and bubbly and the flatbread is warmed through.Top with chopped green onions, and serve with a little extra ranch for dipping.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-bacon-ranch-flatbread-pizza-795208', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}