{u'recipes': [{u'sourceName': u'Love and Olive Oil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/831531-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 831531, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Almond Shortbread Bars', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 26.08, u'creditText': u'Love and Olive Oil', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon McCormick\xae Pure Almond Extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [u'pure', u'mccormick\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon McCormick\xae Pure Almond Extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [u'pure', u'mccormick\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002050, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup dried cranberries, coarsely chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups (6.75 oz) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.75, u'consistency': u'solid', u'id': 20081, u'unit': u'oz'}, {u'originalString': u'3/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons milk or cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon McCormick Valencia Orange Peel', u'aisle': u'Produce', u'name': u'orange peel', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoon'}, {u'originalString': u'1 cup powdered sugar, sifted', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 cup (1 stick) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon McCormick\xae Pure Vanilla Extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure', u'mccormick\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.loveandoliveoil.com/2016/11/cranberry-almond-shortbread-bars.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F. Line an 8-by-8-inch baking pan with parchment paper. In a large mixing bowl or the bowl of stand mixer, beat butter and sugar together until light and fluffy. Beat in egg, followed by orange peel, almond and vanilla extracts, and salt, scraping down the sides of the bowl as needed.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Add flour and mix on low speed until mostly incorporated, then add cranberries and mix until evenly distributed. Press dough into prepared baking pan in an even layer. The dough is quite sticky, so it might help to lightly flour your fingertips so they don't stick to the dough; you can also use a piece of plastic wrap to help you press the dough into an even layer in the bottom of the pan.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Bake for 28 to 30 minutes or until top is puffed and matte in finish and the edges are just starting to turn a very light golden brown.', u'length': {u'number': 28, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and place on a wire rack to cool. For glaze, sift powdered sugar into a bowl.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add milk or cream and whisk until smooth; whisk in almond extract. If necessary you can add a bit more cream or powdered sugar as needed to acheive desired consistency.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 1002050, u'name': u'almond extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Drizzle over top of shortbread, then cut into squares or triangles. Cookies will keep in an airtight container for up to 5 days.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 281, u'instructions': u"Preheat oven to 350 degrees F. Line an 8-by-8-inch baking pan with parchment paper. In a large mixing bowl or the bowl of stand mixer, beat butter and sugar together until light and fluffy. Beat in egg, followed by orange peel, almond and vanilla extracts, and salt, scraping down the sides of the bowl as needed. Add flour and mix on low speed until mostly incorporated, then add cranberries and mix until evenly distributed. Press dough into prepared baking pan in an even layer. The dough is quite sticky, so it might help to lightly flour your fingertips so they don't stick to the dough; you can also use a piece of plastic wrap to help you press the dough into an even layer in the bottom of the pan. Bake for 28 to 30 minutes or until top is puffed and matte in finish and the edges are just starting to turn a very light golden brown. Remove from oven and place on a wire rack to cool. For glaze, sift powdered sugar into a bowl. Add milk or cream and whisk until smooth; whisk in almond extract. If necessary you can add a bit more cream or powdered sugar as needed to acheive desired consistency. Drizzle over top of shortbread, then cut into squares or triangles. Cookies will keep in an airtight container for up to 5 days.", u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-almond-shortbread-bars-831531', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}