{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/611971-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 611971, u'veryPopular': True, u'lowFodmap': False, u'title': u'Garlic Butter Mushroom Risotto', u'diets': [u'gluten free'], u'pricePerServing': 171.36, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'12 ounces uncooked arborio rice', u'aisle': u'Pasta and Rice', u'name': u'arborio rice', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10020052, u'unit': u'ounces'}, {u'originalString': u'4 tablespoons butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'4 cloves garlic, minced and divided', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'divided', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u"a tablespoon of lemon (that was Bjork's idea! nice work, boo)", u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u"(that was Bjork's idea! nice work, boo)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup shaved Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'12 ounces sliced baby portabella mushrooms', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11266, u'unit': u'ounces'}, {u'originalString': u'sea salt and freshly cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'2-3 cups spinach or other veggies if you want', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://pinchofyum.com/garlic-butter-mushroom-risotto', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tablespoons of butter in a large skillet over medium high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add two cloves of garlic and saute for 1-2 minutes until the smells of amazingness overtake your life.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the arborio rice and toss with the butter and garlic for a minute or two until coated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10020052, u'name': u'arborrio rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add a splash of white wine to get things all sizzly-hot.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add 1 cup of chicken broth and push the mixture around gently in the pan with a wooden spoon, letting it get all bubbly and nice. When most of the liquid has evaporated, add another half cup. Repeat this process over about 15-20 minutes until the arborio rice has cooked to the point where it's almost completely soft, and the whole thing takes on a creamy texture.In a separate little skillet, melt the remaining 2 tablespoons butter over medium high heat.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10020052, u'name': u'arborrio rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the garlic, saute for 1-2 minutes, and add the sliced mushrooms.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u"Saute for 5-10 minutes until they're browned to your liking - I like to add another splash of white wine here - yummy sizzle.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from heat, stir in the spinach until wilted, and transfer to the risotto pan (I just arranged it all over the top). Top generously with Parmesan, salt, pepper, and lemon if you want! Yummm.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Risotto. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Ruffino Riserva Ducale Oro Chianti Classico. It has 4.3 out of 5 stars and a bottle costs about 35 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Ruby red with garnet hues. The wine expresses a distinctive Tuscan bouquet of violet, cherry, and plum, with aromas of chocolate and spice. Intense aromas of violet, blackberry, cherry, and ripe plum with intriguing notes of cinnamon and clove. Classic elegance and structure in which the fruit, tannins, and spices form a tightly woven balance, with a lingering fi nish of chocolate and coffee.Pairs exquisitely with traditional Italian dishes such as a classic bisteca Fiorentina, pasta Bolognese, wild boar ragu, and eggplant Parmesan. It’s also wonderful with dishes such as grilled ribeye and roasted vegetables. View More', u'title': u'Ruffino Riserva Ducale Oro Chianti Classico', u'price': u'$34.99', u'id': 442701, u'link': u'https://www.wine.com/product/ruffino-riserva-ducale-oro-chianti-classico-2011/166890', u'imageUrl': u'https://spoonacular.com/productImages/442701-312x231.jpg'}]}, u'aggregateLikes': 3675, u'instructions': u"Heat 2 tablespoons of butter in a large skillet over medium high heat. Add two cloves of garlic and saute for 1-2 minutes until the smells of amazingness overtake your life. Add the arborio rice and toss with the butter and garlic for a minute or two until coated. Add a splash of white wine to get things all sizzly-hot.Add 1 cup of chicken broth and push the mixture around gently in the pan with a wooden spoon, letting it get all bubbly and nice. When most of the liquid has evaporated, add another half cup. Repeat this process over about 15-20 minutes until the arborio rice has cooked to the point where it's almost completely soft, and the whole thing takes on a creamy texture.In a separate little skillet, melt the remaining 2 tablespoons butter over medium high heat. Add the garlic, saute for 1-2 minutes, and add the sliced mushrooms. Saute for 5-10 minutes until they're browned to your liking - I like to add another splash of white wine here - yummy sizzle. Remove from heat, stir in the spinach until wilted, and transfer to the risotto pan (I just arranged it all over the top). Top generously with Parmesan, salt, pepper, and lemon if you want! Yummm.", u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-butter-mushroom-risotto-611971', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}