{u'recipes': [{u'sourceName': u'My Life as a Mrs', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/498389-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 498389, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sausage, Mozzarella, and Basil Pizza', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 958.39, u'creditText': u'My Life as a Mrs', u'extendedIngredients': [{u'originalString': u'5 basil leaves, chiffonaded', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'1 32 ounce can of whole peeled tomatoes (strain off some of the liquid if you prefer a thicker sauce)', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'whole', u'peeled', u'canned', u'(strain off some of the liquid if you prefer a thicker sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 links of hot italian sausage', u'aisle': u'Meat', u'name': u'italian sausage', u'metaInformation': [u'italian', u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'links', u'unitShort': u'links', u'amount': 3.0, u'consistency': u'solid', u'id': 7036, u'unit': u'links'}, {u'originalString': u'6 ounces fresh pearl mozzarella (if you can\'t find the pearl mozzarella - you can also just cube a regular ball of fresh mozzarella into little 1/2" cubes)', u'aisle': u'Cheese', u'name': u'mozzarella', u'metaInformation': [u'fresh', u'canned', u'(if you can\'t find the pearl mozzarella - you can also just cube a regular ball of mozzarella into little 1/2" cubes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1026, u'unit': u'ounces'}, {u'originalString': u'1 pound pizza dough', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93610, u'unit': u'pound'}, {u'originalString': u'3/4 - 1 cup pizza sauce (above recipe or jarred sauce if you prefer)', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'jarred', u'(above recipe or sauce if you prefer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'serving'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}], u'healthScore': 89.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.mylifeasamrs.com/2012/03/sausage-mozzarella-and-basil-pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 56, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add ingredients to Blendtec and puree until smooth and warm. If you do not have a Blendtec... puree ingredients in a food processor or blender and then heat in a saucepan until warmed through.*Note this makes enough for 3-4 pizzas. I like to make a big batch of pizza sauce and store it in the freezer in individual servings (pull out and defrost the morning you want to use them). For the Pizza:In a non stick skillet, cook sausages over medium high heat until browned on all sides (about 8-10 minutes).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove sausage links from skillet, and slice into thin rounds.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add sausage back to skillet and cook for another 3-5 minutes (until sausage is fully cooked and golden).', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove to a paper towel lined plate.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place mozzarella pearls on a second paper towel lined plate, and blot the excess moisture off of them.Preheat oven to 500\xbaF (if you have a convection oven - turn the convection feature on). Line a jelly roll pan with parchment paper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll pizza dough out thinly and place on the prepared jelly roll pan.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93610, u'name': u'pizza dough'}]}, {u'equipment': [], u'step': u'Add a thin layer of the pizza sauce (about 3/4 - 1 cup) followed by a thin layer of the cooked sausage slices. Top with the mozzarella pearls.The key is to not over load the pizza. A little goes a long way! Too many toppings make for soggy crusts!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place Pizza into hot oven and bake until golden and crispy. Using the convection option, it only took about 8-12 minutes (it will take a little longer using a regular oven).', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and top with fresh chiffonaded basil (and crushed red pepper flakes if desired). Slice and serve hot!', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u'For the Simple Pizza Sauce'}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are great choices for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. One wine you could try is Di Majo Norante Sangiovese. It has 4.1 out of 5 stars and a bottle costs about 9 dollars.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Vivid ruby red in color with a fresh bouquet of violets and woodland berries. Smooth and refreshing with loads of ripe fruit. An excellent accompaniment to antipasti, first courses and grilled white meats', u'title': u'Di Majo Norante Sangiovese', u'price': u'$8.99', u'id': 434381, u'link': u'https://www.wine.com/product/di-majo-norante-sangiovese-2000/38435', u'imageUrl': u'https://spoonacular.com/productImages/434381-312x231.jpg'}]}, u'aggregateLikes': 64, u'instructions': u'For the Simple Pizza Sauce:Add ingredients to Blendtec and puree until smooth and warm. If you do not have a Blendtec... puree ingredients in a food processor or blender and then heat in a saucepan until warmed through.*Note this makes enough for 3-4 pizzas. I like to make a big batch of pizza sauce and store it in the freezer in individual servings (pull out and defrost the morning you want to use them). For the Pizza:In a non stick skillet, cook sausages over medium high heat until browned on all sides (about 8-10 minutes). Remove sausage links from skillet, and slice into thin rounds. Add sausage back to skillet and cook for another 3-5 minutes (until sausage is fully cooked and golden). Remove to a paper towel lined plate. Place mozzarella pearls on a second paper towel lined plate, and blot the excess moisture off of them.Preheat oven to 500\xbaF (if you have a convection oven - turn the convection feature on). Line a jelly roll pan with parchment paper. Roll pizza dough out thinly and place on the prepared jelly roll pan.Add a thin layer of the pizza sauce (about 3/4 - 1 cup) followed by a thin layer of the cooked sausage slices. Top with the mozzarella pearls.The key is to not over load the pizza. A little goes a long way! Too many toppings make for soggy crusts!Place Pizza into hot oven and bake until golden and crispy. Using the convection option, it only took about 8-12 minutes (it will take a little longer using a regular oven). Remove from oven and top with fresh chiffonaded basil (and crushed red pepper flakes if desired). Slice and serve hot!', u'spoonacularSourceUrl': u'https://spoonacular.com/sausage-mozzarella-and-basil-pizza-498389', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}