{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497443-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 497443, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dark Chocolate and Raspberry Stuffed Crescent Rolls', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 75.32, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1 can of crescent rolls', u'aisle': u'Refrigerated', u'name': u'crescent rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 93618, u'unit': u'can'}, {u'originalString': u'1 cup of fresh raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'3/4 cup semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2014/03/dark-chocolate-and-raspberry-stuffed-crescent-rolls.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees. Line a baking sheet with a silpat mat.Unrolled the crescent dough.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place a few raspberries and chocolate chips at the wide end. Carefully roll the dough, starting from the wide end towards the small end. Wrap the left & right side up so they enclose the crescent roll - this will keep the chocolate and raspberries from leaking out. Repeat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Place into the oven and bake 12-13 minutes or until golden brown.While the crescent's are baking, melt the remaining chocolate chips in a glass dish in the microwave for 30 seconds.", u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove and stir then cook for an another 20 seconds; remove and stir until the remaining chips melt. DO NOT OVERCOOK. Spoon the melted chocolate into a small zip lock bag.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the crescents from the oven and place on a cooling rack.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}]}, {u'equipment': [], u'step': u'Cut a super small hole in the corner of the bag and drizzle the chocolate back and forth over each crescent roll.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}]}, {u'equipment': [], u'step': u'Serve with a glass of milk & enjoy.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 271, u'instructions': u"Preheat the oven to 375 degrees. Line a baking sheet with a silpat mat.Unrolled the crescent dough. Place a few raspberries and chocolate chips at the wide end. Carefully roll the dough, starting from the wide end towards the small end. Wrap the left & right side up so they enclose the crescent roll - this will keep the chocolate and raspberries from leaking out. Repeat.Place into the oven and bake 12-13 minutes or until golden brown.While the crescent's are baking, melt the remaining chocolate chips in a glass dish in the microwave for 30 seconds. Remove and stir then cook for an another 20 seconds; remove and stir until the remaining chips melt. DO NOT OVERCOOK. Spoon the melted chocolate into a small zip lock bag. Remove the crescents from the oven and place on a cooling rack. Cut a super small hole in the corner of the bag and drizzle the chocolate back and forth over each crescent roll. Serve with a glass of milk & enjoy.", u'spoonacularSourceUrl': u'https://spoonacular.com/dark-chocolate-and-raspberry-stuffed-crescent-rolls-497443', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}