{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598418-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 598418, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vinegar-Glossed Chicken', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 45, u'pricePerServing': 163.24, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'3/4 cup chicken broth, plus more as needed', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'as needed', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'5 1/2 pounds bone-in chicken pieces (large pieces, such as breast, should be cut in half)', u'aisle': u'Meat', u'name': u'chicken pieces', u'metaInformation': [u'bone-in', u' such as breast, should be cut in half)', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 5.5, u'consistency': u'liquid', u'id': 1005006, u'unit': u'pounds'}, {u'originalString': u'Coarse salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'3 sprigs of fresh rosemary (about 1 tablespoon minced)', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'2 to 3 garlic cloves, minced (about 2 tablespoons)', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'Extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 cup best-quality red-wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://leitesculinaria.com/27811/recipes-vinegar-glosse-chicken.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'At least 15 minutes and up to 2 hours before cooking, combine the vinegar, garlic, and rosemary in a small bowl and set aside.2. Thoroughly season the chicken pieces with salt and pepper.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a 14-inch skillet (or two smaller skillets) over high heat and swirl in enough olive oil to coat the bottom of the skillet.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the chicken in the skillet, skin side down. Don’t crowd the chicken; leave space around each piece. Work in batches if necessary. You should hear an immediate sizzle when the chicken pieces hit the pan. Don’t move them; it takes a couple of minutes to sear the chicken so it doesn’t stick. Brown all sides; this will take 10 minutes per batch. Regulate the heat so it stays high but does not burn the chicken.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place all the browned chicken back in the skillet.3.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken broth and scrape up any brown bits from the bottom of the pan. Lower the heat, simmer, and reduce for 15 to 20 minutes. Increase the heat to high and pour in the vinegar mixture. Swirl the pan and stir around as the vinegar evaporates to form a simmering glaze, 8 to 10 minutes.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [], u'step': u'Serve immediately or refrigerate overnight and reheat with a little extra broth.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 170, u'instructions': u'1. At least 15 minutes and up to 2 hours before cooking, combine the vinegar, garlic, and rosemary in a small bowl and set aside.2. Thoroughly season the chicken pieces with salt and pepper. Heat a 14-inch skillet (or two smaller skillets) over high heat and swirl in enough olive oil to coat the bottom of the skillet. Place the chicken in the skillet, skin side down. Don’t crowd the chicken; leave space around each piece. Work in batches if necessary. You should hear an immediate sizzle when the chicken pieces hit the pan. Don’t move them; it takes a couple of minutes to sear the chicken so it doesn’t stick. Brown all sides; this will take 10 minutes per batch. Regulate the heat so it stays high but does not burn the chicken. Place all the browned chicken back in the skillet.3. Add the chicken broth and scrape up any brown bits from the bottom of the pan. Lower the heat, simmer, and reduce for 15 to 20 minutes. Increase the heat to high and pour in the vinegar mixture. Swirl the pan and stir around as the vinegar evaporates to form a simmering glaze, 8 to 10 minutes. Serve immediately or refrigerate overnight and reheat with a little extra broth.', u'spoonacularSourceUrl': u'https://spoonacular.com/vinegar-glossed-chicken-598418', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}