{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/741475-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 741475, u'veryPopular': False, u'lowFodmap': False, u'title': u"El Cholo's Green Corn Tamales", u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 244.91, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/4 pound butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'pound'}, {u'originalString': u'12 (1-ounce) strips Cheddar', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1009, u'unit': u'ounce'}, {u'originalString': u'24-ounce can chiles (recommended: Ortega)', u'aisle': u'Produce', u'name': u'chiles', u'metaInformation': [u'canned', u'(recommended: Ortega)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 11819, u'unit': u'ounce'}, {u'originalString': u'1/2 pound cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 35137, u'unit': u'pound'}, {u'originalString': u'24 ears yellow corn', u'aisle': u'Produce', u'name': u'ears corn', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'1/2 cup half-and-half or cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 pound shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 4615, u'unit': u'pound'}, {u'originalString': u'3/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpeg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/el-cholos-green-corn-tamales-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Special equipment: Parchment paper', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut both ends of corn, remove husks and save for wrapping.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Cut corn kernels off the cob. In a food processor, grind the kernels with the cornmeal.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}]}, {u'equipment': [], u'step': u'Beat shortening and butter together until creamy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the sugar, half-and-half and salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the corn mixture and mix well.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'For each tamale, overlap 2 corn husks.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Spread some of the corn mixture onto the husks.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Place 1 cheese strip and 1 chile strip on top of the mixture. Top with more corn masa. Bring the edges of the corn husks over the filling to cover completely.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Place the husk on a piece of square parchment paper. Fold ends of corn husks, then fold sides of parchment over tamale and fold up ends. Tie string around ends to hold in place. Continue until all tamales are tied.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Place on a rack and steam approximately 35 to 45 minutes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 287, u'instructions': u'Special equipment: Parchment paper              Cut both ends of corn, remove husks and save for wrapping. Cut corn kernels off the cob. In a food processor, grind the kernels with the cornmeal.                          Beat shortening and butter together until creamy. Add the sugar, half-and-half and salt. Add the corn mixture and mix well.                          For each tamale, overlap 2 corn husks. Spread some of the corn mixture onto the husks. Place 1 cheese strip and 1 chile strip on top of the mixture. Top with more corn masa. Bring the edges of the corn husks over the filling to cover completely. Place the husk on a piece of square parchment paper. Fold ends of corn husks, then fold sides of parchment over tamale and fold up ends. Tie string around ends to hold in place. Continue until all tamales are tied. Place on a rack and steam approximately 35 to 45 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/el-cholos-green-corn-tamales-741475', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}