{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/211068-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 211068, u'veryPopular': False, u'lowFodmap': True, u'title': u'Crispy prawns with wasabi mayo & sweet chilli pepper dip', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'pescatarian'], u'preparationMinutes': 25, u'pricePerServing': 151.94, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'700ml groundnut oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'groundnut oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 700.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'ml'}, {u'originalString': u'1 tsp lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tsp'}, {u'originalString': u'6 tbsp mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tbsp'}, {u'originalString': u'100g potato flour (see tip, below)', u'aisle': u'Baking', u'name': u'Potato Starch Flour', u'metaInformation': [u'(see tip, below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 11413, u'unit': u'g'}, {u'originalString': u'1 roasted red pepper from a jar, sliced', u'aisle': u'Canned and Jarred', u'name': u'roasted red pepper', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11916, u'unit': u''}, {u'originalString': u'2 pinches caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pinches', u'unitShort': u'pinches', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pinches'}, {u'originalString': u'5 tbsp sweet chilli sauce', u'aisle': u'Ethnic Foods', u'name': u'sweet chilli sauce', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 98962, u'unit': u'tbsp'}, {u'originalString': u'24 raw tiger prawns, de-veined and tail removed', u'aisle': u'Seafood', u'name': u'tiger prawns', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 10115149, u'unit': u''}, {u'originalString': u'2 tsp wasabi powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'wasabi powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wasabi.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10111990, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/9102/crispy-prawns-with-wasabi-mayo-and-sweet-chilli-pe', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the mayo, mix the wasabi powderwith 1 tbsp water to form a paste. Stir in themayonnaise and sugar, then cover and chill.For the chilli dip, whizz the pepper, sweet chillisauce and lime juice together in a foodprocessor or blender until smooth. Set aside.In a bowl, whisk the egg and potato flourtogether with 4 tbsp very cold water to makea batter. Stir in the prawns.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wasabi.jpg', u'id': 11990, u'name': u'wasabi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the oil in a deep saucepan untila piece of bread browns in it after about15 secs. Line a tray with kitchen paper. Liftthe prawns out of the batter and fry, a fewat a time, until the batter is golden andprawns pink. Lift onto the kitchen paperto drain, then sprinkle with salt.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot,ready to dunk into the dips.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Santa Cristina by Antinori Pinot Grigio. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 12 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish.', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 23, u'instructions': u'To make the mayo, mix the wasabi powderwith 1 tbsp water to form a paste. Stir in themayonnaise and sugar, then cover and chill.For the chilli dip, whizz the pepper, sweet chillisauce and lime juice together in a foodprocessor or blender until smooth. Set aside.In a bowl, whisk the egg and potato flourtogether with 4 tbsp very cold water to makea batter. Stir in the prawns.Heat the oil in a deep saucepan untila piece of bread browns in it after about15 secs. Line a tray with kitchen paper. Liftthe prawns out of the batter and fry, a fewat a time, until the batter is golden andprawns pink. Lift onto the kitchen paperto drain, then sprinkle with salt. Serve hot,ready to dunk into the dips.', u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-prawns-with-wasabi-mayo-sweet-chilli-pepper-dip-211068', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}