{u'recipes': [{u'sourceName': u'The Baking Pan', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610504-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 610504, u'veryPopular': False, u'lowFodmap': False, u'title': u'Christmas Forest Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5760, u'pricePerServing': 121.9, u'creditText': u'The Baking Pan', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3 cups grated raw carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'raw', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cups'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2\xbc cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'3 to 4 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u"8 cups (2 pounds) sifted confectioner's sugar", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pounds'}, {u'originalString': u'1 cup (2 sticks) unsalted butter, melted and cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 cup (2 sticks) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'\xbd cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 tablespoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons clear vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1 cup vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://thebakingpan.com/recipes/cakes/christmas-forest-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 63, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a medium mixing bowl, combine flour, cocoa, baking powder, baking soda, salt, and cinnamon; sift or whisk together to mix. Set aside.In a bowl with a pourable spout, a 2 cup liquid measuring cup works well, combine the melted butter and vegetable oil; stir to mix. Set aside.In a large bowl of an electric mixer, add eggs; beat on medium-high speed for 2 minutes. With the mixer still on medium-high speed, slowly add the sugar to the eggs, either one tablespoon at a time, or in a very slow steady stream, taking 3 to 4 minutes to add all of the sugar, and beating until the eggs and sugar are fully incorporated, and the mixture looks light in color and thickened.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the vanilla and mix about another 30 seconds. Scrape down the sides and bottom of the bowl with a rubber spatula so the mixture blends evenly.Reduce mixer speed to medium, slowly pour the butter and oil mixture into the batter in a slow steady stream, and then beat for 1 minute longer.Reduce mixer speed to medium-low, and blend in the flour mixture all at once, mixing just until incorporated.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowl from the mixer. Using a balloon type whisk or large rubber spatula, fold in the carrots.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Bake: Spoon the batter into the prepared pans and smooth the surface with the back of a large spoon.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Bake 30 minutes or until a long toothpick, wooden skewer, or cake tester inserted in the center comes out clean.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and place pans on a wire cooling rack to cool for 10 to 15 minutes then remove cake from the pans and place the cakes on the wire cooling rack to finish cooling.In a large bowl, combine the butter and shortening; beat with an electric mixer on medium speed until creamy.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [], u'step': u'Add vanilla and beat until well mixed. Gradually add the sugar, one cup at a time, beating well after each addition. After all the sugar has been added the mixture will appear dry.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add 3 tablespoons of milk and beat until frosting is smooth, creamy, and fluffy.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Add additional milk if necessary to make a good spreading consistency.Trim and level each cake layer. For the top layer, slice off a small amount of the sharp edge to make a rounded edge for the fondant. Secure the bottom layer of the cake to a cake board or cake plate; place about a tablespoon of frosting in the middle of the board or plate, center the cake and press the cake lightly into the frosting to adhere. Tip: Use a cake lifter to easily pick up and move the layers onto the cake board or cake plate.Using an offset spatula spread frosting about  inch thick on the bottom layer. Repeat with the second layer.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Place the last cake layer on top. Crumb coat the cake by covering the sides and top of the cake with a thin layer of frosting.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Let the cake sit until the crumb coat is dried to the touch. At this point you can cover the cake in plastic wrap and refrigerate overnight. Tip: the crumb coat is a thin layer. Dont worry if the cake shows through in places, it will be covered again with another crumb coat layer.Cover remaining frosting tightly with plastic wrap until ready to continue with cake, or cover tightly and refrigerate if completing the following day.The second crumb coat should be applied just prior to covering the cake with rolled fondant. Re-whip frosting to bring it back to a fluffy texture, adding a small amount of milk if necessary. Apply a second crumb coat by covering the sides and top of the cake with a thin layer of frosting over the first crumb coat. The second crumb coat will provide a sticky surface for the fondant to stick to.While the second crumb coat is still fresh and soft, cover the cake with rolled fondant. Decorate with cutout fondant decorations. See', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Rolled Fondant Tips and Recipes.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Serve cake at room temperature. Cover loosely or place in a cardboard box with a cover, such as a cake box from a bakery. Store in a cool dry place.Make the fondant. Shape the fondant into a thick disk and rub a thin coating of shortening over the entire surface to keep the fondant from drying out. Wrap the fondant disc tightly in at least two layers of plastic wrap and then place in a resealable plastic bag or airtight container and store at room temperature to cure overnight.I made two batches of fondant for this cake, about 6 pounds total. Make one batch to use for covering the cake, and make a second batch for the cutout decorations. I used about 4 pounds total, a little less than 2 pounds to cover the cake and about 2 pounds for the cutout decorations.Leftover fondant can be wrapped tightly and stored for a future project. I recommend making two full batches even though you probably wont use it all. You would rather have too much than too little.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [], u'step': u'Bake the cake. After the cake is cooled, cover and refrigerate overnight to tighten the crumb and firm up the cake.Prepare the frosting. Assemble and fill the cake layers with frosting and apply the first frosting crumb coat.', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Let the crumb coat dry and then cover the cake tightly with plastic wrap or foil and refrigerate overnight. Cover remaining frosting tightly with plastic wrap or place in an airtight container and refrigerate until ready to continue with cake.', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Remove the cured fondant from the plastic and knead for several minutes to warm the fondant until it is pliable and smooth. You probably wont need any vegetable shortening on the rolling surface for this kneading, however if it starts to stick use a little shortening on the rolling surface and your hands. If the fondant is stiff and difficult to knead, microwave for about 15 seconds to warm it up. If the fondant seems too dry you can knead a small amount of vegetable shortening in, or if it seems too sticky knead a small amount of powdered sugar or cornstarch in. Cover until ready to use.Using one batch of fondant for the cutout decorations, tint about  of this batch with pale green food coloring.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'vegetable shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Roll the green fondant about  inch thick and cut out several tree shapes; 16 to 18 large trees 3 to 4 inches high and 10 to 15 small 1 inch trees. I used a total of four different cookie cutter tree shapes, but you can use just one tree shape; the trees can look any way you desire. Use a small artist paintbrush to brush a very thin layer of clear alcohol such as gin or vodka over the top of each tree. I used clear kirschwasser. Sprinkle the trees with green sugar sprinkles and green edible glitter.', u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Roll the remaining  white fondant about  inch thick and cut out about 6 large trees and 6 small trees.', u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Brush the top of each tree with a thin layer of clear alcohol and sprinkle with white and gold edible glitter. I used a tree shaped cookie cutter with a star top for one of the white trees and decorated this tree with colored dragees and painted the star gold with an alcohol and luster dust mixture.', u'number': 19, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Cut out several, 20 to 25, small  inch stars from the remaining white fondant scraps. In a small dish stir a small amount of clear alcohol and gold luster dust together; use this mixture to paint the top of the stars.Set all decorations aside to dry at room temperature until ready to use. Tightly wrap fondant scraps with 2 or 3 layers of plastic wrap and store in a resealable plastic bag or airtight container.Apply the second crumb coat.Using one whole batch of fondant, roll the fondant  inch thick and cover the cake. Tightly wrap fondant scraps with 2 or 3 layers of plastic wrap and store in a resealable plastic bag or airtight container.Make about 8 star imprints around the outer top edge of the fondant; use a 1 inch star cookie cutter and gently press the cookie cutter into the fondant just deep enough to leave an imprint. In a small dish stir a small amount of clear alcohol and gold luster dust together; use this mixture to paint around the star outlines.', u'number': 20, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Place a small dab of frosting on the back of the green trees and gently attach the trees around the cake, press the trees very gently to the cake to adhere.Cover the cake loosely with plastic wrap and set aside on the countertop or in a cool place (do not refrigerate) until ready to finish the following day.Rewhip remaining frosting to bring it back to a fluffy texture, adding a small amount of milk if necessary.', u'number': 21, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Place about 1 cup of frosting in the center of the cake, spreading a little bit over the surface inside the ring of imprinted stars. Use a small offset spatula to make swirls to resemble drifts of snow.Stand the white decorated star tree in the middle of the snow drift. Stand the additional large white and small white trees randomly in the snow drift around the star tree. If the trees start to lean, place some additional frosting behind the trees as support.', u'number': 22, u'ingredients': []}, {u'equipment': [], u'step': u'Place a small dab of frosting on the bottom of each  inch star and place randomly around the top of the cake.Sprinkle a little white edible glitter over the snow drifts.Stand back and admire your creation. Making this cake seems like a lot of work, but the finished cake is well worth the time and effort; you will thrill your family and guests and be extremely proud of this beautiful holiday dessert.', u'number': 23, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 51, u'instructions': u'In a medium mixing bowl, combine flour, cocoa, baking powder, baking soda, salt, and cinnamon; sift or whisk together to mix. Set aside.In a bowl with a pourable spout, a 2 cup liquid measuring cup works well, combine the melted butter and vegetable oil; stir to mix. Set aside.In a large bowl of an electric mixer, add eggs; beat on medium-high speed for 2 minutes. With the mixer still on medium-high speed, slowly add the sugar to the eggs, either one tablespoon at a time, or in a very slow steady stream, taking 3 to 4 minutes to add all of the sugar, and beating until the eggs and sugar are fully incorporated, and the mixture looks light in color and thickened. Add the vanilla and mix about another 30 seconds. Scrape down the sides and bottom of the bowl with a rubber spatula so the mixture blends evenly.Reduce mixer speed to medium, slowly pour the butter and oil mixture into the batter in a slow steady stream, and then beat for 1 minute longer.Reduce mixer speed to medium-low, and blend in the flour mixture all at once, mixing just until incorporated.Remove the bowl from the mixer. Using a balloon type whisk or large rubber spatula, fold in the carrots.Bake: Spoon the batter into the prepared pans and smooth the surface with the back of a large spoon. Bake 30 minutes or until a long toothpick, wooden skewer, or cake tester inserted in the center comes out clean. Remove from oven and place pans on a wire cooling rack to cool for 10 to 15 minutes then remove cake from the pans and place the cakes on the wire cooling rack to finish cooling.In a large bowl, combine the butter and shortening; beat with an electric mixer on medium speed until creamy. Add vanilla and beat until well mixed. Gradually add the sugar, one cup at a time, beating well after each addition. After all the sugar has been added the mixture will appear dry. Add 3 tablespoons of milk and beat until frosting is smooth, creamy, and fluffy. Add additional milk if necessary to make a good spreading consistency.Trim and level each cake layer. For the top layer, slice off a small amount of the sharp edge to make a rounded edge for the fondant. Secure the bottom layer of the cake to a cake board or cake plate; place about a tablespoon of frosting in the middle of the board or plate, center the cake and press the cake lightly into the frosting to adhere. Tip: Use a cake lifter to easily pick up and move the layers onto the cake board or cake plate.Using an offset spatula spread frosting about  inch thick on the bottom layer. Repeat with the second layer. Place the last cake layer on top. Crumb coat the cake by covering the sides and top of the cake with a thin layer of frosting. Let the cake sit until the crumb coat is dried to the touch. At this point you can cover the cake in plastic wrap and refrigerate overnight. Tip: the crumb coat is a thin layer. Dont worry if the cake shows through in places, it will be covered again with another crumb coat layer.Cover remaining frosting tightly with plastic wrap until ready to continue with cake, or cover tightly and refrigerate if completing the following day.The second crumb coat should be applied just prior to covering the cake with rolled fondant. Re-whip frosting to bring it back to a fluffy texture, adding a small amount of milk if necessary. Apply a second crumb coat by covering the sides and top of the cake with a thin layer of frosting over the first crumb coat. The second crumb coat will provide a sticky surface for the fondant to stick to.While the second crumb coat is still fresh and soft, cover the cake with rolled fondant. Decorate with cutout fondant decorations. See Rolled Fondant Tips and Recipes.Serve cake at room temperature. Cover loosely or place in a cardboard box with a cover, such as a cake box from a bakery. Store in a cool dry place.Make the fondant. Shape the fondant into a thick disk and rub a thin coating of shortening over the entire surface to keep the fondant from drying out. Wrap the fondant disc tightly in at least two layers of plastic wrap and then place in a resealable plastic bag or airtight container and store at room temperature to cure overnight.I made two batches of fondant for this cake, about 6 pounds total. Make one batch to use for covering the cake, and make a second batch for the cutout decorations. I used about 4 pounds total, a little less than 2 pounds to cover the cake and about 2 pounds for the cutout decorations.Leftover fondant can be wrapped tightly and stored for a future project. I recommend making two full batches even though you probably wont use it all. You would rather have too much than too little.Bake the cake. After the cake is cooled, cover and refrigerate overnight to tighten the crumb and firm up the cake.Prepare the frosting. Assemble and fill the cake layers with frosting and apply the first frosting crumb coat. Let the crumb coat dry and then cover the cake tightly with plastic wrap or foil and refrigerate overnight. Cover remaining frosting tightly with plastic wrap or place in an airtight container and refrigerate until ready to continue with cake.Remove the cured fondant from the plastic and knead for several minutes to warm the fondant until it is pliable and smooth. You probably wont need any vegetable shortening on the rolling surface for this kneading, however if it starts to stick use a little shortening on the rolling surface and your hands. If the fondant is stiff and difficult to knead, microwave for about 15 seconds to warm it up. If the fondant seems too dry you can knead a small amount of vegetable shortening in, or if it seems too sticky knead a small amount of powdered sugar or cornstarch in. Cover until ready to use.Using one batch of fondant for the cutout decorations, tint about  of this batch with pale green food coloring. Roll the green fondant about  inch thick and cut out several tree shapes; 16 to 18 large trees 3 to 4 inches high and 10 to 15 small 1 inch trees. I used a total of four different cookie cutter tree shapes, but you can use just one tree shape; the trees can look any way you desire. Use a small artist paintbrush to brush a very thin layer of clear alcohol such as gin or vodka over the top of each tree. I used clear kirschwasser. Sprinkle the trees with green sugar sprinkles and green edible glitter.Roll the remaining  white fondant about  inch thick and cut out about 6 large trees and 6 small trees. Brush the top of each tree with a thin layer of clear alcohol and sprinkle with white and gold edible glitter. I used a tree shaped cookie cutter with a star top for one of the white trees and decorated this tree with colored dragees and painted the star gold with an alcohol and luster dust mixture. Cut out several, 20 to 25, small  inch stars from the remaining white fondant scraps. In a small dish stir a small amount of clear alcohol and gold luster dust together; use this mixture to paint the top of the stars.Set all decorations aside to dry at room temperature until ready to use. Tightly wrap fondant scraps with 2 or 3 layers of plastic wrap and store in a resealable plastic bag or airtight container.Apply the second crumb coat.Using one whole batch of fondant, roll the fondant  inch thick and cover the cake. Tightly wrap fondant scraps with 2 or 3 layers of plastic wrap and store in a resealable plastic bag or airtight container.Make about 8 star imprints around the outer top edge of the fondant; use a 1 inch star cookie cutter and gently press the cookie cutter into the fondant just deep enough to leave an imprint. In a small dish stir a small amount of clear alcohol and gold luster dust together; use this mixture to paint around the star outlines.Place a small dab of frosting on the back of the green trees and gently attach the trees around the cake, press the trees very gently to the cake to adhere.Cover the cake loosely with plastic wrap and set aside on the countertop or in a cool place (do not refrigerate) until ready to finish the following day.Rewhip remaining frosting to bring it back to a fluffy texture, adding a small amount of milk if necessary. Place about 1 cup of frosting in the center of the cake, spreading a little bit over the surface inside the ring of imprinted stars. Use a small offset spatula to make swirls to resemble drifts of snow.Stand the white decorated star tree in the middle of the snow drift. Stand the additional large white and small white trees randomly in the snow drift around the star tree. If the trees start to lean, place some additional frosting behind the trees as support.Place a small dab of frosting on the bottom of each  inch star and place randomly around the top of the cake.Sprinkle a little white edible glitter over the snow drifts.Stand back and admire your creation. Making this cake seems like a lot of work, but the finished cake is well worth the time and effort; you will thrill your family and guests and be extremely proud of this beautiful holiday dessert.', u'spoonacularSourceUrl': u'https://spoonacular.com/christmas-forest-cake-610504', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5790, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}