{u'recipes': [{u'sourceName': u'Fifteen Spatulas', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/558852-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 558852, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fresh Pumpkin Spice Muffins', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 43.38, u'creditText': u'Fifteen Spatulas', u'extendedIngredients': [{u'originalString': u'5 oz all purpose flour (1 cup)', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'3/4 cup buttermilk (I did a milk and vinegar substitute)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'(I did a milk and vinegar substitute)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'3/4 cup packed dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'3 tbsp dark molasses (I used blackstrap molasses)', u'aisle': u'Baking', u'name': u'dark molasses', u'metaInformation': [u'dark', u'(I used blackstrap molasses)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19304, u'unit': u'tbsp'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup grapeseed oil (can sub canola or vegetable oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [u'(can sub canola or vegetable oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4517, u'unit': u'cup'}, {u'originalString': u'1/8 tsp ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'2 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'1/8 tsp ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1 cup fresh pumpkin puree (canned is okay too)', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [u'fresh', u'canned', u'( is okay too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'pumpkin seeds, for garnish', u'aisle': u'Savory Snacks', u'name': u'pumpkin seeds', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 12014, u'unit': u'servings'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'turbinado sugar, for garnish', u'aisle': u'Health Foods;Baking', u'name': u'turbinado sugar', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19908, u'unit': u'servings'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'5 oz whole wheat flour (1 cup)', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20080, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.fifteenspatulas.com/fresh-pumpkin-spice-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F. Line a 12 cup muffin pan with paper liners.In a large bowl, whisk together both flours, baking soda, salt, cinnamon, ginger, nutmeg, and allspice. Set this aside.In another large bowl, whisk to combine the sugar, molasses, grapeseed oil, and two eggs. When you stop whisking, there should be a bit of frothiness on top of the wet ingredients.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4517, u'name': u'grape seed oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the pumpkin and vanilla extract, and whisk to combine.Before we get into mixing everything together, remember that you want to whisk/stir as little as possible for these muffins. If you whisk too much, it will make the muffins tough because of gluten development. Lumps are okay.Gather up the flour mixture and the buttermilk, and whisk half the flour mixture into the wet ingredients, then half the buttermilk. Repeat with the other half of the flour, then the rest of the buttermilk (doing this in bursts lets the wet ingredients incorporate everything well). When the batter is homogenous and combined, evenly divide the batter into the muffin cups, making sure every cup is completely full to the top. Sprinkle the tops with pumpkin seeds and turbinado sugar, and bake for about 20 minutes. They are done when the tops are springy in the center.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'id': 19908, u'name': u'turbinado sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Let the muffins cool, then enjoy!', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 476, u'instructions': u'Preheat the oven to 400 degrees F. Line a 12 cup muffin pan with paper liners.In a large bowl, whisk together both flours, baking soda, salt, cinnamon, ginger, nutmeg, and allspice. Set this aside.In another large bowl, whisk to combine the sugar, molasses, grapeseed oil, and two eggs. When you stop whisking, there should be a bit of frothiness on top of the wet ingredients. Add the pumpkin and vanilla extract, and whisk to combine.Before we get into mixing everything together, remember that you want to whisk/stir as little as possible for these muffins. If you whisk too much, it will make the muffins tough because of gluten development. Lumps are okay.Gather up the flour mixture and the buttermilk, and whisk half the flour mixture into the wet ingredients, then half the buttermilk. Repeat with the other half of the flour, then the rest of the buttermilk (doing this in bursts lets the wet ingredients incorporate everything well). When the batter is homogenous and combined, evenly divide the batter into the muffin cups, making sure every cup is completely full to the top. Sprinkle the tops with pumpkin seeds and turbinado sugar, and bake for about 20 minutes. They are done when the tops are springy in the center. Let the muffins cool, then enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/fresh-pumpkin-spice-muffins-558852', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}