{u'recipes': [{u'sourceName': u'Caf\xe9 Johnsonia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573848-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 573848, u'veryPopular': False, u'lowFodmap': False, u'title': u'For Vegan, Gluten-Free Black-Bottom Coconut Cream Tart', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 120, u'pricePerServing': 140.86, u'creditText': u'Caf\xe9 Johnsonia', u'extendedIngredients': [{u'originalString': u'1 Tbsp. organic agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'Tbsp'}, {u'originalString': u'\xbd cup almond meal, packed', u'aisle': u'Gluten Free;Health Foods', u'name': u'almond meal', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93740, u'unit': u'cup'}, {u'originalString': u'2 cups almond milk (or another non-dairy milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'(or another non-dairy milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'cups'}, {u'originalString': u'2 Tbsp. unsweetened almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'Tbsp'}, {u'originalString': u'3.5 oz. bar bittersweet chocolate, broken into small pieces (I used one from IKEA)', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate bar', u'metaInformation': [u'small', u'(I used one from IKEA)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 10019904, u'unit': u'oz'}, {u'originalString': u'1 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbe cup organic evaporated cane sugar', u'aisle': u'Baking', u'name': u'cane sugar', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbc cup cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'\xbd cup ground unsweetened coconut, or dessicated coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'2 Tbsp. organic virgin coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp. coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tbsp'}, {u'originalString': u'\xbd cup cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'2 cups full-fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full-fat coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cups'}, {u'originalString': u'1 Tbsp. ground flax seed mixed with 3 Tbsp. cold water', u'aisle': u'Health Foods;Baking', u'name': u'ground flax seed', u'metaInformation': [u'mixed', u'with 3 tbsp. cold water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12220, u'unit': u'Tbsp'}, {u'originalString': u'pinch of sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'\xbd cup unsweetened coconut, toasted', u'aisle': u'Baking', u'name': u'unsweetened coconut', u'metaInformation': [u'unsweetened', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12108, u'unit': u'cup'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'png', u'spoonacularScore': 31.0, u'sourceUrl': u'http://cafejohnsonia.com/2012/08/vegan-gluten-free-coconut-cream-tart.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For crust: Preheat oven to 400 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Brush the bottom and sides of a 9 or 10" springform pan with pure vegetable shortening or oil. Trace the pan on parchment paper and cut the round to fit the bottom of the pan.In a mixing bowl, mix together the coconut oil, brown sugar, flax "egg," and vanilla extract.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'id': 10012220, u'name': u'flaxseed'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Add the dry ingredients and using an electric hand mixer, mix on low until crumbly. Stop the mixer and use your fingers to press the dough together into a ball.Press the dough onto the bottom and about 1\xbd" up the sides of the springform pan. Prick the bottom of the dough with a fork all over.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to cool completely.For coconut cream pudding: In a saucepan, mix together the cornstarch, sugar, and salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the coconut and almond milk. Bring to a simmer and cook until thick, whisking constantly.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Remove from the heat and whisk in the coconut oil and vanilla extract.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}], u'name': u''}, {u'steps': [], u'name': u'Pour into the cooled crust and chill until set. (If you want a thicker chocolate layer, double this recipe.)For caramel sauce topping'}, {u'steps': [{u'equipment': [], u'step': u'Spread the coconut cream pudding over the chocolate layer and let chill until set. Top with a good drizzle of the caramel sauce and sprinkle the top liberally with the toasted coconut.Allow to chill for about 30 minutes before serving. (Can be made ahead and assembled at the last minute. If you need to chill the tart for a long time before serving it, wait to drizzle it with the caramel sauce until just before serving.) It is best eaten the same day, but will keep for a few days.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u'Combine brown sugar, almond milk, brown rice syrup and salt together in a heavy-bottomed saucepan. Bring to a boil and cook until thick and syrupy. (Test by dropping some onto a plate to see if it sets up a bit. Or it should read the "thread" stage on a candy thermometer, or about 225-230 degrees F.)Carefully pour the syrup into a clean, heat-proof jar and allow to cool slightly before using. (You won\'t need all of it.)To assemble'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place all of the ingredients in a glass, microwave-safe bowl. Microwave on 50% power for 30 seconds and stir. Continue heating at 10-20 second intervals, just until most of the chocolate is melted, the rest will melt as you stir it. (Be careful not to let it burn.)', u'number': 1, u'ingredients': []}], u'name': u'Transfer to a clean bowl and allow to cool. Press a piece of plastic wrap against the surface and chill until ready to use. Before assembling tart, stir in the toasted coconut.For chocolate ganache'}], u'aggregateLikes': 31, u'instructions': u'For crust: Preheat oven to 400 degrees F. Brush the bottom and sides of a 9 or 10" springform pan with pure vegetable shortening or oil. Trace the pan on parchment paper and cut the round to fit the bottom of the pan.In a mixing bowl, mix together the coconut oil, brown sugar, flax "egg," and vanilla extract. Add the dry ingredients and using an electric hand mixer, mix on low until crumbly. Stop the mixer and use your fingers to press the dough together into a ball.Press the dough onto the bottom and about 1\xbd" up the sides of the springform pan. Prick the bottom of the dough with a fork all over. Bake for 15 minutes. Remove from oven and allow to cool completely.For coconut cream pudding: In a saucepan, mix together the cornstarch, sugar, and salt. Whisk in the coconut and almond milk. Bring to a simmer and cook until thick, whisking constantly. Remove from the heat and whisk in the coconut oil and vanilla extract. Transfer to a clean bowl and allow to cool. Press a piece of plastic wrap against the surface and chill until ready to use. Before assembling tart, stir in the toasted coconut.For chocolate ganache: Place all of the ingredients in a glass, microwave-safe bowl. Microwave on 50% power for 30 seconds and stir. Continue heating at 10-20 second intervals, just until most of the chocolate is melted, the rest will melt as you stir it. (Be careful not to let it burn.) Pour into the cooled crust and chill until set. (If you want a thicker chocolate layer, double this recipe.)For caramel sauce topping: Combine brown sugar, almond milk, brown rice syrup and salt together in a heavy-bottomed saucepan. Bring to a boil and cook until thick and syrupy. (Test by dropping some onto a plate to see if it sets up a bit. Or it should read the "thread" stage on a candy thermometer, or about 225-230 degrees F.)Carefully pour the syrup into a clean, heat-proof jar and allow to cool slightly before using. (You won\'t need all of it.)To assemble: Spread the coconut cream pudding over the chocolate layer and let chill until set. Top with a good drizzle of the caramel sauce and sprinkle the top liberally with the toasted coconut.Allow to chill for about 30 minutes before serving. (Can be made ahead and assembled at the last minute. If you need to chill the tart for a long time before serving it, wait to drizzle it with the caramel sauce until just before serving.) It is best eaten the same day, but will keep for a few days.', u'spoonacularSourceUrl': u'https://spoonacular.com/for-vegan-gluten-free-black-bottom-coconut-cream-tart-573848', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}