{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/450124-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 450124, u'veryPopular': False, u'lowFodmap': False, u'title': u'Nutty Banana Shakes', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 130.94, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'4 medium ripe bananas, cut into chunks', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'ripe', u'medium', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'4 miniature Butterfinger candy bars', u'aisle': u'Sweet Snacks', u'name': u'butterfinger candy bar', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butterfinger.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 19069, u'unit': u''}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'3 cups vanilla ice cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'cups'}, {u'originalString': u'1/2 cup chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/nutty-banana-shakes', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all ingredients in a blender; cover and process until blended.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into chilled glasses; serve immediately.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 29, u'instructions': u'Directions                                                                                Place all ingredients in a blender; cover and process until blended. Pour into chilled glasses; serve immediately.                                        Yield: 5 servings.                                                                                                                         Originally published as Nutty Banana Shakes in  Simple & DeliciousMay/June 2007, p29                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 433 calories, 21 g fat (9 g saturated fat), 42 mg cholesterol, 122 mg sodium, 56 g carbohydrate, 3 g fiber, 10 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/nutty-banana-shakes-450124', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}