{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220914-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 220914, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry ripple cheese-cupcakes', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 107.7, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'600g soft cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 600.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'g'}, {u'originalString': u'400g cranberries, fresh or frozen', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 9078, u'unit': u'g'}, {u'originalString': u'250g digestive biscuits', u'aisle': u'Sweet Snacks', u'name': u'digestive biscuits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/digestive-biscuits.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 18173, u'unit': u'g'}, {u'originalString': u'2 eggs, plus 1 yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'175g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'dash vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'dash'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/164630/cranberry-ripple-cheesecupcakes', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'First make the ripple by putting thecranberries and icing sugar into a shallowpan and cooking down over a mediumhighheat for 10 mins until the berriescollapse into a thick and sticky sauce.Turn off the heat and leave to cool.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4.Line a 12-hole muffin tin with 12 muffincases. Crush the biscuits in a plastic bagor whizz in a food processor, then mixwith the melted butter. Divide betweenthe muffin cases and press down withyour fingers. In a separate bowl, mix thesoft cheese with the flour, sugar andvanilla extract, then gradually beat in theeggs and yolk until smooth. Ripple theberry mix through the cheese, beingcareful not to over-mix. Spoon the mixinto the cases and smooth the tops withthe back of the spoon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Bake for 30 mins,leave to cool, then chill in the fridge untilcompletely cold.To serve, peel the cases off the cakes,if you like, then dust with icing sugar.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve piled up on a nice dish foreveryone to help themselves.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 107, u'instructions': u'First make the ripple by putting thecranberries and icing sugar into a shallowpan and cooking down over a mediumhighheat for 10 mins until the berriescollapse into a thick and sticky sauce.Turn off the heat and leave to cool.Heat oven to 180C/160C fan/gas 4.Line a 12-hole muffin tin with 12 muffincases. Crush the biscuits in a plastic bagor whizz in a food processor, then mixwith the melted butter. Divide betweenthe muffin cases and press down withyour fingers. In a separate bowl, mix thesoft cheese with the flour, sugar andvanilla extract, then gradually beat in theeggs and yolk until smooth. Ripple theberry mix through the cheese, beingcareful not to over-mix. Spoon the mixinto the cases and smooth the tops withthe back of the spoon. Bake for 30 mins,leave to cool, then chill in the fridge untilcompletely cold.To serve, peel the cases off the cakes,if you like, then dust with icing sugar.Serve piled up on a nice dish foreveryone to help themselves.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-ripple-cheese-cupcakes-220914', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}