{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/628081-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 628081, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pasta With Chickpea Sauce', u'diets': [u'dairy free'], u'pricePerServing': 154.57, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 cups cooked chickpeas (see note above), divided', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'divided', u'cooked', u'(see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 16057, u'unit': u'cups'}, {u'originalString': u'12 ounce dried chickpeas, soaked overnight in salted water (see note above)', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'dried', u'salted', u'(see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 16057, u'unit': u'ounce'}, {u'originalString': u'1 head garlic, 3 clove thinly sliced, the rest left unpeeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'unpeeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'head'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons extra-virgin olive oil, plus more for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 large onion, split in half', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'split', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 cup chopped parsley, plus more for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'plus more for garnish', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'3 sprigs rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2036, u'unit': u'sprigs'}, {u'originalString': u'1 pound short ruffled pasta, such as farfalle', u'aisle': u'Pasta and Rice', u'name': u'short pasta', u'metaInformation': [u' such as farfalle'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20499, u'unit': u'pound'}, {u'originalString': u'1 1/2 cups chickpea-cooking liquid or vegetable broth, plus more as needed', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'as needed', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2015/02/pasta-chickpea-sauce-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place chickpeas in a large pot and cover with lightly salted water by at least 2 inches.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pressure-cooker.jpg', u'id': 404658, u'name': u'pressure cooker'}], u'step': u'Add unpeeled garlic, onion, and rosemary. Cover and bring to a boil over high heat. Reduce heat to a bare simmer and cook, topping up with water as necessary to keep beans submerged, until beans are very tender and creamy with no graininess left, about 2 hours. Beans can also be cooked in a pressure cooker at low pressure for 30 minutes. (See note above if using canned beans.) Discard onions, garlic, and rosemary.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drain beans, reserving beans and liquid separately.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, combine oil, garlic, and red pepper flakes and set over medium heat. Cook, stirring, until garlic is lightly golden, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add 3 cups chickpeas and chickpea-cooking liquid (or liquid from the cans) and bring to a simmer.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Remove from heat and, using an immersion blender, blend to a smooth, saucy puree, adding more chickpea-cooking liquid if too thick. Stir in remaining 1 cup chickpeas, crushing some lightly with a wooden spoon or potato masher but leaving them mostly whole. Season with salt and pepper.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [], u'step': u'3', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a pot of salted boiling water, cook pasta until just short of al dente. Reserve 1 cup of pasta-cooking water, then drain pasta. Return pasta to pot and add chickpea sauce along with 1/4 cup of reserved pasta-cooking water. Set over medium heat and bring to a simmer, stirring until pasta is al dente and sauce has thickened just enough to coat pasta, about 3 minutes; add more reserved pasta-cooking water, 1 tablespoon at a time, if sauce becomes too thick.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat, stir in chopped parsley and drizzle in some fresh olive oil, stirring to blend. Season with salt and pepper. Spoon pasta and sauce into bowls, garnish with chopped parsley, and serve.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 205, u'instructions': u'Procedures                                                          1                                              Place chickpeas in a large pot and cover with lightly salted water by at least 2 inches. Add unpeeled garlic, onion, and rosemary. Cover and bring to a boil over high heat. Reduce heat to a bare simmer and cook, topping up with water as necessary to keep beans submerged, until beans are very tender and creamy with no graininess left, about 2 hours. Beans can also be cooked in a pressure cooker at low pressure for 30 minutes. (See note above if using canned beans.) Discard onions, garlic, and rosemary. Drain beans, reserving beans and liquid separately.                                                                                    2                                              In a medium saucepan, combine oil, garlic, and red pepper flakes and set over medium heat. Cook, stirring, until garlic is lightly golden, about 3 minutes. Add 3 cups chickpeas and chickpea-cooking liquid (or liquid from the cans) and bring to a simmer. Remove from heat and, using an immersion blender, blend to a smooth, saucy puree, adding more chickpea-cooking liquid if too thick. Stir in remaining 1 cup chickpeas, crushing some lightly with a wooden spoon or potato masher but leaving them mostly whole. Season with salt and pepper.                                                                                    3                                              In a pot of salted boiling water, cook pasta until just short of al dente. Reserve 1 cup of pasta-cooking water, then drain pasta. Return pasta to pot and add chickpea sauce along with 1/4 cup of reserved pasta-cooking water. Set over medium heat and bring to a simmer, stirring until pasta is al dente and sauce has thickened just enough to coat pasta, about 3 minutes; add more reserved pasta-cooking water, 1 tablespoon at a time, if sauce becomes too thick. Remove from heat, stir in chopped parsley and drizzle in some fresh olive oil, stirring to blend. Season with salt and pepper. Spoon pasta and sauce into bowls, garnish with chopped parsley, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-with-chickpea-sauce-628081', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}