{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/518468-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 150, u'id': 518468, u'veryPopular': False, u'lowFodmap': False, u'title': u'Basic Beef Stew', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 236.3, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1 whole bay leaf', u'aisle': u'Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 pounds lean beef stew meat, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'beef stew meat', u'metaInformation': [u'lean', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10013411, u'unit': u'pounds'}, {u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups 1-inch slices carrots (12 ounces)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11124, u'unit': u'ounces'}, {u'originalString': u'1 pound small cremini mushrooms', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'pound'}, {u'originalString': u'1 cup dry red wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14097, u'unit': u'cup'}, {u'originalString': u'1/3 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 Tablespoon chopped fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'Tablespoon'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 (14-ounce) cans less-sodium beef broth', u'aisle': u'Canned and Jarred', u'name': u'less-sodium beef broth', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'liquid', u'id': 10093741, u'unit': u'ounce'}, {u'originalString': u'1 Tablespoon olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoon'}, {u'originalString': u'2 cups chopped onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'2 cups 3/4-inch cubed peeled white skinned potato (about 1 pound)', u'aisle': u'Produce', u'name': u'red skinned sweet potato', u'metaInformation': [u'white', u'cubed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11508, u'unit': u'pound'}, {u'originalString': u'3/4 teaspoon salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 61.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.recipegirl.com/2006/09/02/basic-beef-stew/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat 1 teaspoon olive oil in a large Dutch oven over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add mushrooms, and saut\xe9 for 5 minutes or until mushrooms begin to brown. Spoon mushrooms into large bowl. Lightly coat pan with cooking spray.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion; saut\xe9 10 minutes or until tender and golden brown.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic; saut\xe9 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add onion mixture to mushroom mixture.2.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place flour in a shallow bowl or pie plate. Dredge beef in flour, shaking off excess.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat remaining 2 teaspoons oil in pan over medium-high heat.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add half of beef mixture; sprinkle with 1/8 teaspoon salt. Cook 6 minutes, browning on all sides.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add browned beef to mushroom mixture. Repeat procedure with remaining beef mixture and 1/8 teaspoon salt.3.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1 cup wine to pan, scraping pan to loosen browned bits.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Add thyme, broth, and bay leaf; bring to a boil. Stir in beef mixture. Cover, reduce heat to medium-low, and simmer for 1 hour or until beef is just tender.4.  Stir in potato and carrot. Simmer, uncovered, 1 hour and 15 minutes or until beef and vegetables are very tender and sauce is thick, stirring occasionally. Stir in remaining 1/2 teaspoon salt and pepper. Discard bay leaf.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Garnish with thyme sprigs, if desired.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}]}], u'name': u''}], u'aggregateLikes': 193, u'instructions': u'1.  Heat 1 teaspoon olive oil in a large Dutch oven over medium-high heat. Add mushrooms, and saut\xe9 for 5 minutes or until mushrooms begin to brown. Spoon mushrooms into large bowl. Lightly coat pan with cooking spray. Add onion; saut\xe9 10 minutes or until tender and golden brown. Add garlic; saut\xe9 1 minute. Add onion mixture to mushroom mixture.2.  Place flour in a shallow bowl or pie plate. Dredge beef in flour, shaking off excess. Heat remaining 2 teaspoons oil in pan over medium-high heat. Add half of beef mixture; sprinkle with 1/8 teaspoon salt. Cook 6 minutes, browning on all sides. Add browned beef to mushroom mixture. Repeat procedure with remaining beef mixture and 1/8 teaspoon salt.3.  Add 1 cup wine to pan, scraping pan to loosen browned bits. Add thyme, broth, and bay leaf; bring to a boil. Stir in beef mixture. Cover, reduce heat to medium-low, and simmer for 1 hour or until beef is just tender.4.  Stir in potato and carrot. Simmer, uncovered, 1 hour and 15 minutes or until beef and vegetables are very tender and sauce is thick, stirring occasionally. Stir in remaining 1/2 teaspoon salt and pepper. Discard bay leaf. Garnish with thyme sprigs, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/basic-beef-stew-518468', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}