{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/756298-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 756298, u'veryPopular': False, u'lowFodmap': False, u'title': u'The', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 128.03, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/4 cup small broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011090, u'unit': u'cup'}, {u'originalString': u'2 tablespoons clarified butter (or 1 tablespoon olive oil and 1 tablespoon butter)', u'aisle': u'Ethnic Foods', u'name': u'clarified butter', u'metaInformation': [u'(or 1 tablespoon olive oil and 1 tablespoon butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoons'}, {u'originalString': u'3 eggs, well-beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup diced green pepper', u'aisle': u'Produce', u'name': u'green pepper', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 ounce Muenster, shredded', u'aisle': u'Cheese', u'name': u'muenster', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1030, u'unit': u'ounce'}, {u'originalString': u'1/4 cup diced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1/4 cup diced Roma tomatoes', u'aisle': u'Produce', u'name': u'roma tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10211529, u'unit': u'cup'}, {u'originalString': u'1 ounce Cheddar, shredded', u'aisle': u'Cheese', u'name': u'shredded cheddar', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounce'}, {u'originalString': u'Whole wheat toast and fresh fruit, as accompaniments', u'aisle': u'Bakery/Bread', u'name': u'toast', u'metaInformation': [u'fresh', u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/toast.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 18070, u'unit': u'servings'}, {u'originalString': u'1/4 cup diced yellow onions', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/the-rachael-omelet-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Steam the broccoli, either in a microwave or steamer, until tender and reserve.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt the butter in an omelet pan or small skillet over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the tomatoes, onions, peppers, and mushrooms and cook, stirring frequently until the onions soften and the tomato juices evaporate, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the broccoli to the pan and season the vegetable mixture with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Pour the eggs over the vegetables. Cook until the eggs begin to set 2 to 3 minutes. Sprinkle the cheeses over the omelet. Cook until the eggs are no longer runny then fold the omelet in half. Raise the heat if the omelet is not brown. Cook for another 1 to 2 minutes, if necessary, then transfer to a plate and serve with whole-wheat toast and fresh fruit.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 26, u'instructions': u'Steam the broccoli, either in a microwave or steamer, until tender and reserve.                          Melt the butter in an omelet pan or small skillet over medium-high heat. Add the tomatoes, onions, peppers, and mushrooms and cook, stirring frequently until the onions soften and the tomato juices evaporate, about 5 minutes. Add the broccoli to the pan and season the vegetable mixture with salt and pepper. Pour the eggs over the vegetables. Cook until the eggs begin to set 2 to 3 minutes. Sprinkle the cheeses over the omelet. Cook until the eggs are no longer runny then fold the omelet in half. Raise the heat if the omelet is not brown. Cook for another 1 to 2 minutes, if necessary, then transfer to a plate and serve with whole-wheat toast and fresh fruit.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-756298', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}