{u'recipes': [{u'sourceName': u'A Healthy Life for Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/713865-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 713865, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Pie with Cauliflower Crust', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 226.41, u'creditText': u'A Healthy Life for Me', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'3 large carrots, peeled and sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large', u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 large head of cauliflower, trimmed and torn into florets', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'large', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'2 large celery stalks, trimmed and diced', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'diced', u'large', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 small fennel bulb, outer leaves removed, flesh sliced and diced', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'diced', u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'handful of fresh parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'2 cloves of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/4 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'Pinch of ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'Pinch of kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinch'}, {u'originalString': u'2 leeks, trimmed and diced', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'diced', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'2 cups of low sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'9 ounces of mushrooms, sliced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'1 rotisserie organic chicken, skinless and meat shredded', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'shredded', u'skinless', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 5112, u'unit': u''}, {u'originalString': u'1/4 cup of shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'1 tablespoon unsalted butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1 tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://ahealthylifeforme.com/chicken-pie-with-cauliflower-crust/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the butter in a large frying pan over a medium heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the leeks and cook stirring for 3-4 minutes, or until softened.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Add the celery and bay leaf and increase the heat to high, cook for 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken broth to the pan and bring to the boil.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the carrots, fennel and mushrooms and reduce the heat until the mixture is simmering. Continue to simmer the mixture until the volume of liquid has reduced and the vegetables are tender, about 12-15 minutes.Meanwhile, for the topping, fill the bottom of a pot with 1/2 of water and add the cauliflower, and garlic cloves.Bring the pan contents to a simmer over a medium heat, cover and cook for 6-8 minutes, or until the cauliflower is tender when pierced with a fork (add a splash more water during cooking if necessary).', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Remove from the heat and transfer the contents to a food processor. Blend till smooth and creamy {similar to the texture of mashed potatoes}. Season with cheddar cheese, salt and pepper. Pulse food processor to blend.To finish the pie filling, remove the bay leaf and add the shredded chicken, parsley, salt and pepper. Stir to blend and pour into a pie dish.Spoon the cauliflower topping over the filling and spread into an even layer using the back of a spoon to smooth.Dot the top of the pie with the 1 tablespoon of diced unsalted butter.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1145, u'name': u'unsalted butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Bake for 25-30 minutes, or until the filling is bubbling and the topping is golden-brown.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u'Preheat the oven to 400.Heat the butter in a large frying pan over a medium heat. Add the leeks and cook stirring for 3-4 minutes, or until softened.Add the celery and bay leaf and increase the heat to high, cook for 1-2 minutes.Add the chicken broth to the pan and bring to the boil.Add the carrots, fennel and mushrooms and reduce the heat until the mixture is simmering. Continue to simmer the mixture until the volume of liquid has reduced and the vegetables are tender, about 12-15 minutes.Meanwhile, for the topping, fill the bottom of a pot with 1/2 of water and add the cauliflower, and garlic cloves.Bring the pan contents to a simmer over a medium heat, cover and cook for 6-8 minutes, or until the cauliflower is tender when pierced with a fork (add a splash more water during cooking if necessary).Remove from the heat and transfer the contents to a food processor. Blend till smooth and creamy {similar to the texture of mashed potatoes}. Season with cheddar cheese, salt and pepper. Pulse food processor to blend.To finish the pie filling, remove the bay leaf and add the shredded chicken, parsley, salt and pepper. Stir to blend and pour into a pie dish.Spoon the cauliflower topping over the filling and spread into an even layer using the back of a spoon to smooth.Dot the top of the pie with the 1 tablespoon of diced unsalted butter.Bake for 25-30 minutes, or until the filling is bubbling and the topping is golden-brown.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-pie-with-cauliflower-crust-713865', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}