{u'recipes': [{u'sourceName': u'Spoonful of Flavor', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/521422-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 521422, u'veryPopular': False, u'lowFodmap': False, u'title': u'Brooksters', u'diets': [], u'pricePerServing': 70.34, u'creditText': u'Spoonful of Flavor', u'extendedIngredients': [{u'originalString': u'\xbd tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'\xbc cup firmly packed light brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbd cup firmly packed dark brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'5 oz. dark chocolate, coarsely chopped', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 19904, u'unit': u'oz'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 large eggs, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbe cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'\xbc cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'6 oz. (1 cup) semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'\xbe cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'4 oz. (1 stick) unsalted butter, cut into 1-inch pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into 1-inch pieces', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'oz'}, {u'originalString': u'1 tbsp. unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.spoonfulofflavor.com/2013/08/14/brooksters/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'To make the chocolate chip cookie filling: In a large mixing bowl, whisk together the flour, salt, and baking soda. Set aside.In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and sugars together on medium speed until smooth and creamy. Scrape down the sides of the bowl and add the eggs, one at a time, beating well after each addition. The mixture will look light and fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the vanilla and mix until combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Add half of the flour mixture and beat for 15 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the remaining flour mixture and beat until just incorporated.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowl from the mixer and fold in the chocolate chips until evenly combined. Cover the bowl tightly and chill in the refrigerator for 3 hours.To make the brownie shells: Lightly butter each individual cup of a large cupcake pan. In a medium bowl, whisk together the flour, cocoa powder, and salt.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the chocolate and the butter in the bowl of a double boiler over medium heat and stir occasionally until the chocolate and butter are completely melted and combined. Turn off the heat, but keep the bowl over the water of the double boiler and add both sugars, whisking until completely combined.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowl from the water and let the mixture cool to room temperature.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add one egg at a time to the chocolate mixture, whisking after each addition until just combined.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the vanilla and stir until just combined. Sprinkle the flour mixture over the chocolate mixture. Using a spatula, fold the dry ingredients into the wet ingredients until there is just a trace amount of the flour mixture visible. Fill each individual cupcake cup with brownie batter about 1/3 full.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the cupcake pan in the refrigerator and chill for 3 hours.To assemble the Brooksters: After the cookie dough and brownie batter have chilled for 3 hours, preheat the oven to 350 degrees. Using an ice cream scoop, scoop out the dough into roughly 1 \xbd tablespoon–size balls and use your hands to shape the dough into perfect balls. Gently flatten each ball into an oblong disk. The disks should be slightly smaller than the tops of the cupcake cups.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Remove the cupcake pan containing the brownie batter and gently press a cookie dough disk into the batter in each cupcake cup.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the cupcake pan in the oven and bake for 15 to 20 minutes, rotating the pan halfway through the baking time. The Brooksters are done when the cookie part is golden brown. Cool to room temperature or serve warm with ice cream.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 39, u'instructions': u'To make the chocolate chip cookie filling: In a large mixing bowl, whisk together the flour, salt, and baking soda. Set aside.In the bowl of an electric mixer fitted with the paddle attachment, beat the butter and sugars together on medium speed until smooth and creamy. Scrape down the sides of the bowl and add the eggs, one at a time, beating well after each addition. The mixture will look light and fluffy. Add the vanilla and mix until combined. Add half of the flour mixture and beat for 15 seconds. Add the remaining flour mixture and beat until just incorporated. Remove the bowl from the mixer and fold in the chocolate chips until evenly combined. Cover the bowl tightly and chill in the refrigerator for 3 hours.To make the brownie shells: Lightly butter each individual cup of a large cupcake pan. In a medium bowl, whisk together the flour, cocoa powder, and salt.Place the chocolate and the butter in the bowl of a double boiler over medium heat and stir occasionally until the chocolate and butter are completely melted and combined. Turn off the heat, but keep the bowl over the water of the double boiler and add both sugars, whisking until completely combined. Remove the bowl from the water and let the mixture cool to room temperature.Add one egg at a time to the chocolate mixture, whisking after each addition until just combined. Add the vanilla and stir until just combined. Sprinkle the flour mixture over the chocolate mixture. Using a spatula, fold the dry ingredients into the wet ingredients until there is just a trace amount of the flour mixture visible. Fill each individual cupcake cup with brownie batter about 1/3 full. Place the cupcake pan in the refrigerator and chill for 3 hours.To assemble the Brooksters: After the cookie dough and brownie batter have chilled for 3 hours, preheat the oven to 350 degrees. Using an ice cream scoop, scoop out the dough into roughly 1 \xbd tablespoon–size balls and use your hands to shape the dough into perfect balls. Gently flatten each ball into an oblong disk. The disks should be slightly smaller than the tops of the cupcake cups.Remove the cupcake pan containing the brownie batter and gently press a cookie dough disk into the batter in each cupcake cup. Place the cupcake pan in the oven and bake for 15 to 20 minutes, rotating the pan halfway through the baking time. The Brooksters are done when the cookie part is golden brown. Cool to room temperature or serve warm with ice cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/brooksters-521422', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}