{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/583327-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 583327, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pico De Gallo', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 44.56, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'2 tablespoons of cilantro, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 jalapeno, diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'juice from 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'\xbd a medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'pinch of salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'pinch'}, {u'originalString': u'1 large tomato, diced and seeded', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced', u'large', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://dailydishrecipes.com/easy-pico-de-gallo-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Pretty simple.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the tomatoes, onions, jalapeno, minced garlic, and the lime juice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the finely chopped cilantro and a pinch of salt and a pinch of pepper.Stir gently and serve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Pico De Gallo. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Bernardus Rosella's Vineyard Pinot Noir. Reviewers quite like it with a 4.7 out of 5 star rating and a price of about 48 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The Santa Lucia Highlands are known as one of the premier Pinot Noir appellations of the world. One reason for this lofty reputation is Rosella's Vineyard. Gary Franscioni planted his home ranch, named for his lovely wife, in the heart of the Highlands. Gary's home vineyard is planted with a selection of the best available Pinot Noir clones and farmed with unparalleled passion and attention to detail. We at Bernardus are fortunate to have access to three small blocks: 2 planted with clone 777, and the third with the celebrated Pisoni clone.Each block is individually monitored for ripeness in order to hand-pick each clone at its perfect ripeness level. The grapes are sorted at the winery and fermented in small individual fermenters using specially selected yeasts. Once fermentation and pressing are complete, each lot is aged separately for 10 months in the finest French oak barrels. Each barrel is evaluated individually and the final selection is made through a lengthy series of tasting trials.The robe of our 2011 Rosella's is a deep crimson. On the nose we find aromas of candied red cherry fruits along with notes of oak and spice. The palate is very full and complex, exuding flavors of red cherry and berries, accented by notes of cinnamon and nutmeg. This is a beautifully intense wine that will age wonderfully for many years to come. View More", u'title': u"Bernardus Rosella's Vineyard Pinot Noir", u'price': u'$47.99', u'id': 465202, u'link': u'https://www.wine.com/product/bernardus-rosellas-vineyard-pinot-noir-2011/131978', u'imageUrl': u'https://spoonacular.com/productImages/465202-312x231.jpg'}]}, u'aggregateLikes': 124, u'instructions': u'Pretty simple. Mix the tomatoes, onions, jalapeno, minced garlic, and the lime juice.Add the finely chopped cilantro and a pinch of salt and a pinch of pepper.Stir gently and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/pico-de-gallo-583327', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}