{u'recipes': [{u'sourceName': u'Cookie Madness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610701-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 610701, u'veryPopular': False, u'lowFodmap': False, u'title': u'Frozen Millionaire Pie', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 419.26, u'creditText': u'Cookie Madness', u'extendedIngredients': [{u'originalString': u'1 (14 oz) can of condensed milk', u'aisle': u'Baking', u'name': u'condensed milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'8 oz cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 9 to 9 \xbd inch deep dish pastry crust or a deep dish 9 or 10 inch homemade graham cracker crust', u'aisle': u'Refrigerated;Frozen', u'name': u'deep dish pie crust', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 9.0, u'consistency': u'solid', u'id': 18945, u'unit': u'inch'}, {u'originalString': u'1 1/3 cups heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1 cup toasted and chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'toasted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'20 ounce can of crushed pineapple, drained and pressed dry', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'dry', u'crushed', u'pressed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 9266, u'unit': u'ounce'}, {u'originalString': u'1/3 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.cookiemadness.net/2014/08/frozen-millionaire-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 63, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare the pie shell as directed on the package so that it is fully baked.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u"Let it cool completely.In a mixing bowl, beat the heavy whipping cream until soft peaks form. Beat in the powdered sugar and vanilla and stop whipping when peaks are stiff.In a second bowl, beat the cream cheese until soft; beat in the condensed milk. Stir in the pineapple, then fold in the sweetened whipped cream and pecans. Pile as much filling as you can into the deep dish crust  most of it should fit if you're using a deep dish 9 inch or 10 inch pie plate.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Transfer the filling to the crust.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Put the pie in the freezer and freeze for several hours or until it is firm enough to cut neatly. Shortly before serving, removing the pie from the freezer, cut and plate.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let the cut pieces come to room temperature before serving. Alternatively, you can cut the pie into pieces, wrap them individually in plastic and put the wrapped pieces in a freezer bag. The cut pieces will last for 2 or 3 weeks (maybe longer) and only need a few minutes to thaw.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 9, u'instructions': u"Prepare the pie shell as directed on the package so that it is fully baked. Let it cool completely.In a mixing bowl, beat the heavy whipping cream until soft peaks form. Beat in the powdered sugar and vanilla and stop whipping when peaks are stiff.In a second bowl, beat the cream cheese until soft; beat in the condensed milk. Stir in the pineapple, then fold in the sweetened whipped cream and pecans. Pile as much filling as you can into the deep dish crust  most of it should fit if you're using a deep dish 9 inch or 10 inch pie plate.Transfer the filling to the crust. Put the pie in the freezer and freeze for several hours or until it is firm enough to cut neatly. Shortly before serving, removing the pie from the freezer, cut and plate. Let the cut pieces come to room temperature before serving. Alternatively, you can cut the pie into pieces, wrap them individually in plastic and put the wrapped pieces in a freezer bag. The cut pieces will last for 2 or 3 weeks (maybe longer) and only need a few minutes to thaw.", u'spoonacularSourceUrl': u'https://spoonacular.com/frozen-millionaire-pie-610701', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}