{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/694998-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 694998, u'veryPopular': True, u'lowFodmap': False, u'title': u'Loaded Garden Pizz’alad', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 256.17, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1/2 cup alfalfa sprouts', u'aisle': u'Produce', u'name': u'alfalfa sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10111001, u'unit': u'cup'}, {u'originalString': u'1 avocado, diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 1/4 cups bread flour or all-purpose flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'1/3 cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'1 cup sliced button mushrooms', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1 cup cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped fresh chives', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tablespoon'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/3 cup reduced-fat sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1179, u'unit': u'cup'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup shredded provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1035, u'unit': u'cup'}, {u'originalString': u'1 small red bell pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'2 cups chopped romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup lukewarm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'lukewarm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'3/4 cup whole-wheat pastry flour (see Tips) or all-purpose flour', u'aisle': u'Baking', u'name': u'whole-wheat pastry flour', u'metaInformation': [u'whole-wheat', u'all-purpose', u'(see Tips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10020080, u'unit': u'cup'}, {u'originalString': u'1 teaspoon instant or RapidRise yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoon'}], u'healthScore': 90.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/loaded_garden_pizzalad.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To prepare pizza dough: Stir water, yeast and sugar in a large bowl; let stand until the yeast has dissolved, about 5 minutes. Stir in bread flour (or all-purpose flour), whole-wheat flour (or all-purpose flour) and salt until the dough begins to come together.Turn the dough out onto a lightly floured work surface. Knead until smooth and elastic, about 10 minutes. (Alternatively, mix the dough in a food processor. Process until it forms a ball, then process for 1 minute to knead.)', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20080, u'name': u'whole wheat flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-stone.jpg', u'id': 406907, u'name': u'pizza stone'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 500.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place the dough in an oiled bowl and turn to coat.Cover the bowl with a clean kitchen towel; set aside in a warm, draft-free place until the dough has nearly doubled in size, about 1 hour.To bake pizza and prepare topping & salad: Position rack in lower third of oven, place a pizza stone on the rack and preheat oven to 500F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Let the stone heat at 500 for 20 minutes. Want to grill your pizza instead? See Tips below.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Roll pizza dough on a lightly floured surface into a 12- to 14-inch circle (depending on the size of your stone).', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer to a lightly floured pizza peel (or inverted baking sheet).', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the dough with oil and sprinkle cheese on top. Slide the pizza onto the hot stone.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake until golden and crispy, 8 to 10 minutes.Meanwhile, toss lettuce, bell pepper, avocado, mushrooms and tomatoes in a large bowl.Mash garlic and salt together with a fork in a small bowl to make a coarse paste. Stir in sour cream, buttermilk, chives and dill until combined.When the pizza is done, transfer to a large cutting board and let cool for 5 minutes.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drizzle 2 tablespoons of the dressing over the pizza. Mound the salad in the middle and drizzle with the remaining dressing. Top with alfalfa sprouts and serve immediately.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'id': 10111001, u'name': u'alfalfa sprouts'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1210, u'instructions': u'To prepare pizza dough: Stir water, yeast and sugar in a large bowl; let stand until the yeast has dissolved, about 5 minutes. Stir in bread flour (or all-purpose flour), whole-wheat flour (or all-purpose flour) and salt until the dough begins to come together.Turn the dough out onto a lightly floured work surface. Knead until smooth and elastic, about 10 minutes. (Alternatively, mix the dough in a food processor. Process until it forms a ball, then process for 1 minute to knead.) Place the dough in an oiled bowl and turn to coat.Cover the bowl with a clean kitchen towel; set aside in a warm, draft-free place until the dough has nearly doubled in size, about 1 hour.To bake pizza and prepare topping & salad: Position rack in lower third of oven, place a pizza stone on the rack and preheat oven to 500F. Let the stone heat at 500 for 20 minutes. Want to grill your pizza instead? See Tips below.Roll pizza dough on a lightly floured surface into a 12- to 14-inch circle (depending on the size of your stone). Transfer to a lightly floured pizza peel (or inverted baking sheet).Brush the dough with oil and sprinkle cheese on top. Slide the pizza onto the hot stone. Bake until golden and crispy, 8 to 10 minutes.Meanwhile, toss lettuce, bell pepper, avocado, mushrooms and tomatoes in a large bowl.Mash garlic and salt together with a fork in a small bowl to make a coarse paste. Stir in sour cream, buttermilk, chives and dill until combined.When the pizza is done, transfer to a large cutting board and let cool for 5 minutes. Drizzle 2 tablespoons of the dressing over the pizza. Mound the salad in the middle and drizzle with the remaining dressing. Top with alfalfa sprouts and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/loaded-garden-pizzalad-694998', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}