{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/545520-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 255, u'id': 545520, u'veryPopular': True, u'lowFodmap': False, u'title': u'PHILADELPHIA No-Bake Peach Cheesecake', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 108.09, u'extendedIngredients': [{u'originalString': u'2 cups graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'6 Tbsp. margarine, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 4073, u'unit': u'Tbsp'}, {u'originalString': u'4 pkg. (8 oz. each) PHILADELPHIA Neufchatel Cheese, softened', u'aisle': u'Cheese', u'name': u'neufchatel cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/neufchatel.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 1031, u'unit': u'oz'}, {u'originalString': u'1 pkg. (3 oz.) JELL-O Peach Flavor Gelatin', u'aisle': u'Baking', u'name': u'orange flavor gelatin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-jello.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 10119172, u'unit': u'oz'}, {u'originalString': u'2 fresh peaches, chopped', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1 cup sugar, divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tub (8 oz.) COOL WHIP LITE Whipped Topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'oz'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.KraftRecipes.com/recipes/philadelphia-peaches-n-cream-no-bake-cheesecake-110364.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine graham crumbs, margarine and 1/4 cup sugar; press onto bottom of 13x9-inch pan.  Refrigerate until ready to use.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Beat Neufchatel and remaining sugar in large bowl with mixer until blended.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/neufchatel.jpg', u'id': 1031, u'name': u'neufchatel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add dry gelatin mix; mix well.  Stir in COOL WHIP and peaches.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [], u'step': u'Pour over crust.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Refrigerate 4 hours or until firm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 371, u'instructions': u'Combine graham crumbs, margarine and 1/4 cup sugar; press onto bottom of 13x9-inch pan.  Refrigerate until ready to use.                                            Beat Neufchatel and remaining sugar in large bowl with mixer until blended.  Add dry gelatin mix; mix well.  Stir in COOL WHIP and peaches.  Pour over crust.                                             Refrigerate 4 hours or until firm.', u'spoonacularSourceUrl': u'https://spoonacular.com/philadelphia-no-bake-peach-cheesecake-545520', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 255, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}