{u'recipes': [{u'sourceName': u'Vegan Richa', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/820717-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 820717, u'veryPopular': True, u'lowFodmap': False, u'title': u'Baked Fries with Garlic Sauce', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 126.37, u'creditText': u'Vegan Richa', u'extendedIngredients': [{u'originalString': u'2 to 3 tsp starch like arrowroot or flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20003, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp or more dried dill or parsley', u'aisle': u'Spices and Seasonings', u'name': u'dried dill', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2017, u'unit': u'tsp'}, {u'originalString': u'1 tbsp chopped fresh parsley or oregano for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'5 cloves of garlic, minced/finely chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'3 Tbsp hummus (or use cooked chickpeas + lemon juice)', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [u'cooked', u'(or use chickpeas + lemon juice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16158, u'unit': u'Tbsp'}, {u'originalString': u'2 to 3 tsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tsp'}, {u'originalString': u'1 tbsp oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'2 tsp oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp or more dried oregano, or use fresh', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried', u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'2 large russet potatoes cut into thin wedges or fat match sticks', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'large', u'cut into thin wedges or fat match sticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'salt, pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'salt to taste (1/4 to \xbd tsp)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u''}, {u'originalString': u'3 Tbsp tahini', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 12698, u'unit': u'Tbsp'}, {u'originalString': u'2 to 3 Tbsp water as needed to thin', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'as needed', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tbsp'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.veganricha.com/2015/10/baked-fries-with-garlic-sauce.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake the fries: Preheat the oven to 425 degrees F. Chop the potatoes. Press a paper towel on the potatoes to absorb excess moisture if needed.In a large bowl, add the chopped potatoes and toss in flour/starch. Then add oil and mix in. Sprinkle will salt, pepper, garlic, oregano and mix in.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread the potatoes on parchment lined baking sheet with atleast a  inch between them. *Parchment papers have oven safe temperature mentioned on them. Do not use parchment with temp rating lower than 425.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake on a greased baking sheet instead.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 15 minutes. Turn the sheet around and bake for another 5 to 10 minutes or until golden/golden brown on most edges. do not over bake to too much brown as the potatoes get bitter when burnt. .Meanwhile make the garlic tahini hummus sauce: In a small skillet heat oil over medium-low heat.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'id': 12698, u'name': u'tahini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place a double layer of freshly baked fries in a serving container. Dress generously with garlic sauce. Sprinkle cooked garlic over the sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Garnish with chopped fresh oregano or parsley.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve!', u'number': 3, u'ingredients': []}], u'name': u'Add chopped garlic and cook until translucent. Stir occasionally.Blend the rest of the sauce ingredients and half of the cooked garlic until smooth. Taste and adjust salt, tang (lemon juice) and garlic.To serve'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 132748, u'instructions': u'Bake the fries: Preheat the oven to 425 degrees F. Chop the potatoes. Press a paper towel on the potatoes to absorb excess moisture if needed.In a large bowl, add the chopped potatoes and toss in flour/starch. Then add oil and mix in. Sprinkle will salt, pepper, garlic, oregano and mix in.Spread the potatoes on parchment lined baking sheet with atleast a  inch between them. *Parchment papers have oven safe temperature mentioned on them. Do not use parchment with temp rating lower than 425. Bake on a greased baking sheet instead.Bake for 15 minutes. Turn the sheet around and bake for another 5 to 10 minutes or until golden/golden brown on most edges. do not over bake to too much brown as the potatoes get bitter when burnt. .Meanwhile make the garlic tahini hummus sauce: In a small skillet heat oil over medium-low heat. Add chopped garlic and cook until translucent. Stir occasionally.Blend the rest of the sauce ingredients and half of the cooked garlic until smooth. Taste and adjust salt, tang (lemon juice) and garlic.To serve: Place a double layer of freshly baked fries in a serving container. Dress generously with garlic sauce. Sprinkle cooked garlic over the sauce. Garnish with chopped fresh oregano or parsley. Serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-fries-with-garlic-sauce-820717', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}