{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/219648-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 219648, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy chocolate cupcakes', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 145.61, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'6 tbsp cocoa', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u"300g dark chocolate, broken into chunks - don't use one with a high cocoa content", u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'with a high cocoa content'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'g'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'200g light muscovado sugar, plus 3 tbsp extra', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'g'}, {u'originalString': u'200g self-raising flour', u'aisle': u'Baking', u'name': u'self-raising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 20129, u'unit': u'g'}, {u'originalString': u'284ml pot soured cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soured cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 284.0, u'consistency': u'solid', u'id': 1056, u'unit': u'ml'}, {u'originalString': u'150ml sunflower oil, plus a little extra for greasing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [u'for greasing', u'plus a little extra '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'ml'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/9651/easy-chocolate-cupcakes', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/fan 160C/gas 4and line a 10-hole muffin tin with papercases. Whizz the chocolate into smallpieces in a food processor. In thelargest mixing bowl you have, tipin the flour, sugar, cocoa, oil, 100mlsoured cream, eggs, vanilla and 100mlwater.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk everything together withelectric beaters until smooth, thenquickly stir in 100g of the whizzed-upchocolate bits. Divide between the10 cases, then bake for 20 mins untila skewer inserted comes out clean(make sure you don’t poke it into achocolate chip bit). Cool on a wire rack.To make the icing, put the remainingchocolate bits, soured cream and 3 tbspsugar in a small saucepan.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [], u'step': u'Heat gently,stirring, until the chocolate is meltedand you have a smooth icing. Chill inthe fridge until firm enough to swirlon top of the muffins, then tuck in.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 243, u'instructions': u'Heat oven to 180C/fan 160C/gas 4and line a 10-hole muffin tin with papercases. Whizz the chocolate into smallpieces in a food processor. In thelargest mixing bowl you have, tipin the flour, sugar, cocoa, oil, 100mlsoured cream, eggs, vanilla and 100mlwater. Whisk everything together withelectric beaters until smooth, thenquickly stir in 100g of the whizzed-upchocolate bits. Divide between the10 cases, then bake for 20 mins untila skewer inserted comes out clean(make sure you don’t poke it into achocolate chip bit). Cool on a wire rack.To make the icing, put the remainingchocolate bits, soured cream and 3 tbspsugar in a small saucepan. Heat gently,stirring, until the chocolate is meltedand you have a smooth icing. Chill inthe fridge until firm enough to swirlon top of the muffins, then tuck in.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-chocolate-cupcakes-219648', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}