{u'recipes': [{u'sourceName': u'Joanne Eats Well with Others', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/711885-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 711885, u'veryPopular': False, u'lowFodmap': False, u'title': u'Warm Farro Bowl with Roasted Vegetables and a Kale Pesto Vinaigrette', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 187.38, u'creditText': u'Joanne Eats Well with Others', u'extendedIngredients': [{u'originalString': u'5 oz arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11959, u'unit': u'oz'}, {u'originalString': u'1 head cauliflower, cut into florets', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'cut into florets'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'\xbc cup champagne vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'champagne vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002068, u'unit': u'cup'}, {u'originalString': u'\xbd cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'2 cups Village Harvest Farro Perlato, cooked according to package directions', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'farro', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10020005, u'unit': u'cups'}, {u'originalString': u'5 oz baby kale', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11233, u'unit': u'oz'}, {u'originalString': u'\xbd cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbe cup pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'salt and black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 medium sweet potato, peeled and cut into \xbd-inch dice', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'medium', u'peeled', u'cut into \xbd-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}], u'healthScore': 97.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://joanne-eatswellwithothers.com/2016/01/warm-farro-bowl-with-roasted-vegetables-and-a-kale-pesto-vinaigrette.html', u'glutenFree': False, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To make the pesto, in the bowl of a food processor, combine the kale, pecans, champagne vinegar, and olive oil. Pulse until pureed and well combined. Season to taste with salt and black pepper.For the salad, heat oven to 400F. Toss the cauliflower florets and sweet potato cubes with the olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10011135, u'name': u'cauliflower florets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1002068, u'name': u'champagne vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread on a parchment-lined baking sheet and season to taste with salt and black pepper. Roast for 20 minutes, or until tender and starting to brown.Toss the cooked farro with the roasted veggies, dried cranberries, arugula, and kale pesto vinaigrette. Season to taste with salt and black pepper.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'id': 9079, u'name': u'dried cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 80, u'instructions': u'To make the pesto, in the bowl of a food processor, combine the kale, pecans, champagne vinegar, and olive oil. Pulse until pureed and well combined. Season to taste with salt and black pepper.For the salad, heat oven to 400F. Toss the cauliflower florets and sweet potato cubes with the olive oil. Spread on a parchment-lined baking sheet and season to taste with salt and black pepper. Roast for 20 minutes, or until tender and starting to brown.Toss the cooked farro with the roasted veggies, dried cranberries, arugula, and kale pesto vinaigrette. Season to taste with salt and black pepper. Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/warm-farro-bowl-with-roasted-vegetables-and-a-kale-pesto-vinaigrette-711885', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}