{u'recipes': [{u'sourceName': u'In Sock Monkey Slippers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610020-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 610020, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cashew Coconut Blueberry Energy Bites', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 54.89, u'creditText': u'In Sock Monkey Slippers', u'extendedIngredients': [{u'originalString': u'1 cup cashews', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'1 cup (about 8 ounces) dried pitted dates', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'dried', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 9087, u'unit': u'ounces'}, {u'originalString': u'1/2 cup dried blueberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried blueberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries-dried.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93686, u'unit': u'cup'}, {u'originalString': u'2 tablespoons raw honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'raw honey', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'3/4 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup unsweetened shredded coconut, plus more to roll in', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened', u'plus more to roll in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012108, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.insockmonkeyslippers.com/cashew-coconut-blueberry-energy-bites', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'In a food processor, combine dates, cashews, coconut, honey, and sea salt. Process until combined and the mixture can be pressed together with your fingers.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}], u'step': u'Add blueberries and pulse a few times until incorporated. Using a small ice cream scoop or spoon, scoop out spoonfuls and roll into quarter-sized balls, pressing slightly, with your hands.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Roll balls in additional shredded coconut, if desired,Store at room temperature in a sealable container.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 149, u'instructions': u'In a food processor, combine dates, cashews, coconut, honey, and sea salt. Process until combined and the mixture can be pressed together with your fingers. Add blueberries and pulse a few times until incorporated. Using a small ice cream scoop or spoon, scoop out spoonfuls and roll into quarter-sized balls, pressing slightly, with your hands. Roll balls in additional shredded coconut, if desired,Store at room temperature in a sealable container.', u'spoonacularSourceUrl': u'https://spoonacular.com/cashew-coconut-blueberry-energy-bites-610020', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}