{u'recipes': [{u'sourceName': u'Picky Eater Blog', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/516739-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 516739, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chickpea and Lentil Saute with Apples and Curry', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 93.43, u'creditText': u'Picky Eater Blog', u'extendedIngredients': [{u'originalString': u'Brown rice or Naan for serving', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 20040, u'unit': u'servings'}, {u'originalString': u'1 16 ounce can of chickpeas, rised and drained', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16058, u'unit': u'ounce'}, {u'originalString': u'1/4 tsp cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2015, u'unit': u'Tbsp'}, {u'originalString': u"1-1.5 cups pre-cooked beluga/black lentils or French green lentils (I like the kind from Trader Joe's – picture below)", u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dried green lentils', u'metaInformation': [u'french', u'pre-cooked', u"(I like the kind from Trader Joe's - picture below)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10016069, u'unit': u'cups'}, {u'originalString': u'1 Fuji apple chopped', u'aisle': u'Produce', u'name': u'fuji apple', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1019003, u'unit': u''}, {u'originalString': u'4-5 cloves garlic (minced)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1-1.5 Tbsp minced ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11216, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9297, u'unit': u'cup'}, {u'originalString': u'1 Tbsp canola or olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1 red onion (diced)', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'4 tsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tsp'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 88.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://pickyeaterblog.com/2012/02/28/chickpea-and-lentil-saute-with-apples-and-curry/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Chop the apples, onion, garlic, etc.In a large saucepan: Cook the onion and garlic in the oil, stirring, over medium-high heat for 3 min.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the curry, ginger, cayenne and cook 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add the lentils and chickpeas and cook, stirring, 1 min more.Stir in the soy sauce, raisins and water and cook 15 min, stirring often, until all the water is absorbed. If you like softer chickpeas, cook it for up to 30 minutes.', u'length': {u'number': 46, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the apple during last 3 minutes of cooking.Just before serving, sprinkle with cilantro', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Asian on the menu? Try pairing with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try L'Ecole 41 Chenin Blanc. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish.', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 97, u'instructions': u'Chop the apples, onion, garlic, etc.In a large saucepan: Cook the onion and garlic in the oil, stirring, over medium-high heat for 3 min.Add the curry, ginger, cayenne and cook 1 minute. Add the lentils and chickpeas and cook, stirring, 1 min more.Stir in the soy sauce, raisins and water and cook 15 min, stirring often, until all the water is absorbed. If you like softer chickpeas, cook it for up to 30 minutes. Add the apple during last 3 minutes of cooking.Just before serving, sprinkle with cilantro', u'spoonacularSourceUrl': u'https://spoonacular.com/chickpea-and-lentil-saute-with-apples-and-curry-516739', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}