{u'recipes': [{u'sourceName': u'Gimme Delicious', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/801502-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 801502, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crispy Salmon & Avocado Salsa Rice Bowls with Cilantro Sauce', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 200.75, u'creditText': u'Gimme Delicious', u'extendedIngredients': [{u'originalString': u'1 avocado peeled, cored and diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'cored', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'\xbc cup packed cilantro', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 tablespoons cilantro, minced', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup lowfat sour-cream or greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 small jalapeno seeded and diced (optional)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced', u'small', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 Tbsp fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'Tbsp'}, {u'originalString': u'2 tablespoons lime juice (or \xbd lime)', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'(or \xbd lime)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'2 cups long grain rice', u'aisle': u'Pasta and Rice', u'name': u'long grain rice', u'metaInformation': [u'long grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'cups'}, {u'originalString': u'\xbc cup chopped red onion, diced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'1 medium roma tomato seeded and diced', u'aisle': u'Produce', u'name': u'roma tomato', u'metaInformation': [u'diced', u'medium', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}, {u'originalString': u'1 recipe (4 fillets) easy crispy skin salmon (click HERE)', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'crispy', u'(4 fillets)', u'(click HERE)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 15076, u'unit': u''}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3.5 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://gimmedelicious.com/2016/09/09/crispy-salmon-avocado-salsa-bowls-with-cilantro-sauce/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To Cook Rice:Wash rice in a large bowl under cold water for 2-5 minutes until the water runs clear. Allow to soak for at least 5 minutes. Boil 3.5 cups of water in a large sauce pan, pour rice and let simmer on low heat for 10 minutes or until the water has dried into the rice and the rice is soft. While the rice is cooking, move on to cooking the salmon', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour 1 cup cooked rice into each bowl, top with a fillet of cooked crispy skin salmon, top salmon with avocado salsa and drizzle each bowl with a about 2-3 tablespoons of cilantro sauce. Enjoy!', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u'Drizzle with lime juice and mix to combine with a spoon. To Make sauce Pulse the sour-cream or yogurt, lime and cilantro in blender for a few seconds or just until the cilantro is minced.To Assemble'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the diced avocado, tomato, onion, jalapeno, and cilantro in a small bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u'To make avocado salsa'}], u'aggregateLikes': 13, u'instructions': u'To Cook Rice:Wash rice in a large bowl under cold water for 2-5 minutes until the water runs clear. Allow to soak for at least 5 minutes. Boil 3.5 cups of water in a large sauce pan, pour rice and let simmer on low heat for 10 minutes or until the water has dried into the rice and the rice is soft. While the rice is cooking, move on to cooking the salmonTo make avocado salsa:  Combine the diced avocado, tomato, onion, jalapeno, and cilantro in a small bowl. Drizzle with lime juice and mix to combine with a spoon. To Make sauce: Pulse the sour-cream or yogurt, lime and cilantro in blender for a few seconds or just until the cilantro is minced.To Assemble:  Pour 1 cup cooked rice into each bowl, top with a fillet of cooked crispy skin salmon, top salmon with avocado salsa and drizzle each bowl with a about 2-3 tablespoons of cilantro sauce. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-salmon-avocado-salsa-rice-bowls-with-cilantro-sauce-801502', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 22, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}