{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/471737-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 471737, u'veryPopular': False, u'lowFodmap': False, u'title': u"Creole-Spiced Plantain Chips From 'Afro-Vegan", u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 499.6, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 teaspoons freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons coarse sea salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoons'}, {u'originalString': u'Chips', u'aisle': u'Savory Snacks', u'name': u'corn chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fritos-or-corn-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19003, u'unit': u'servings'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tablespoon'}, {u'originalString': u'4 large green plantains (about 2 pounds)', u'aisle': u'Produce', u'name': u'plantains', u'metaInformation': [u'green', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plantains.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 9277, u'unit': u'pounds'}, {u'originalString': u'2 teaspoons red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup Creole spice blend', u'aisle': u'Spices and Seasonings', u'name': u'spice blend', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1032027, u'unit': u'cup'}, {u'originalString': u'Coconut or sunflower oil, for deep frying (about 5 cups)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [u'for deep frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'cups'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/04/creole-spiced-plantain-chips-from-afro-vegan.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mandoline-slicer.png', u'id': 404687, u'name': u'mandoline'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut off both ends of each plantain. With the tip of a sharp knife, slice the peel along the length of each plantain, avoiding cutting into the flesh. Repeat this in three different places on each plantain. Gently remove each section of peel. (Compost the peels and tips.) If the peels are difficult to remove, soak the plantains in hot water for a few minutes. Just be sure to dry them well with a clean kitchen towel before frying, to prevent splattering. With a sharp knife or a mandoline, slice each plantain as thinly as possible into rounds, ideally about 1/16 inch thick, keeping the slices of each plantain separate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plantains.jpg', u'id': 9277, u'name': u'plantain'}]}, {u'equipment': [], u'step': u'3', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Put 1 tablespoon of the spice blend in a small paper bag. Line a plate with paper towels.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1032027, u'name': u'seasoning mix'}]}, {u'equipment': [], u'step': u'4', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/skimmer-spoon.jpg', u'id': 405894, u'name': u'skimmer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Warm about 2 inches of oil in a large, heavy pot over medium-high heat until hot but not smoking, about 375\xb0F. Fry the slices of 1 plantain at a time, moving them around with a fork to ensure even cooking, until golden, about 1 minute. With a skimmer or slotted spoon, immediately transfer the slices to the paper bag with the spice mixture. Fold the top to seal, then shake vigorously to evenly coat.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plantains.jpg', u'id': 9277, u'name': u'plantain'}]}, {u'equipment': [], u'step': u'Transfer to the lined plate. Repeat this process with the remaining plantains and spice blend.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1032027, u'name': u'seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plantains.jpg', u'id': 9277, u'name': u'plantain'}]}, {u'equipment': [], u'step': u'Serve while they are hot and crispy.', u'number': 7, u'ingredients': []}], u'name': u'To make the chips'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}], u'step': u'Combine all the ingredients in a mortar or spice grinder and grind into a fine powder. You will need 1/4 cup for this recipe; store the remainder in an airtight jar. Stored at room temperature, it will keep for 6 months.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 2, u'ingredients': []}], u'name': u'To make the Creole spice blend'}], u'winePairing': {}, u'aggregateLikes': 22, u'instructions': u'Procedures                                                                              1                                                                            To make the Creole spice blend: Combine all the ingredients in a mortar or spice grinder and grind into a fine powder. You will need 1/4 cup for this recipe; store the remainder in an airtight jar. Stored at room temperature, it will keep for 6 months.                                                                                                                            2                                                                            To make the chips: Cut off both ends of each plantain. With the tip of a sharp knife, slice the peel along the length of each plantain, avoiding cutting into the flesh. Repeat this in three different places on each plantain. Gently remove each section of peel. (Compost the peels and tips.) If the peels are difficult to remove, soak the plantains in hot water for a few minutes. Just be sure to dry them well with a clean kitchen towel before frying, to prevent splattering. With a sharp knife or a mandoline, slice each plantain as thinly as possible into rounds, ideally about 1/16 inch thick, keeping the slices of each plantain separate.                                                                                                                            3                                                                            Put 1 tablespoon of the spice blend in a small paper bag. Line a plate with paper towels.                                                                                                                            4                                                                            Warm about 2 inches of oil in a large, heavy pot over medium-high heat until hot but not smoking, about 375\xb0F. Fry the slices of 1 plantain at a time, moving them around with a fork to ensure even cooking, until golden, about 1 minute. With a skimmer or slotted spoon, immediately transfer the slices to the paper bag with the spice mixture. Fold the top to seal, then shake vigorously to evenly coat. Transfer to the lined plate. Repeat this process with the remaining plantains and spice blend. Serve while they are hot and crispy.', u'spoonacularSourceUrl': u'https://spoonacular.com/creole-spiced-plantain-chips-from-afro-vegan-471737', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}