{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/436262-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 436262, u'veryPopular': False, u'lowFodmap': False, u'title': u'Swiss Cheese Lasagna', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 100.44, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1-1/2 cups (12 ounces each) 4% cottage cheese', u'aisle': u'Cheese', u'name': u'cottage cheese', u'metaInformation': [u'4%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1012, u'unit': u'ounces'}, {u'originalString': u'1/2 to 1 teaspoon dried rosemary, crushed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 pound ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'1 package (8 ounces) lasagna noodles', u'aisle': u'Pasta and Rice', u'name': u'lasagna noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10620420, u'unit': u'ounces'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 cup shredded part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1028, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'8 ounces sliced Swiss cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1040, u'unit': u'ounces'}, {u'originalString': u'1 can (12 ounces) tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11887, u'unit': u'ounces'}, {u'originalString': u'3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/swiss-cheese-lasagna', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, cook the beef, onion and garlic over medium heat until meat is no longer pink; drain. Stir in the water, tomato paste, salt, rosemary and pepper. Bring to a boil. Reduce heat; simmer, uncovered, for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Meanwhile, cook lasagna noodles according to package directions; drain. In a greased 13-in. x 9-in. baking dish, layer a third of the meat sauce, noodles and Swiss cheese. Repeat layers. Top with cottage cheese and the remaining Swiss cheese, noodles and sauce. Sprinkle with mozzarella cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'id': 1012, u'name': u'cottage cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'id': 1040, u'name': u'swiss cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Cover and bake at 350\xb0 for 30 minutes. Uncover; bake 10-15 minutes longer or until bubbly.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand for 10 minutes before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Montepulciano, Sangiovese, and Chianti are great choices for Lasagne. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. The Buccicatino Montepulciano d with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'Dark chocolate and raspberries, harmonious, great palate authority', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'Directions                                                                                In a large skillet, cook the beef, onion and garlic over medium heat until meat is no longer pink; drain. Stir in the water, tomato paste, salt, rosemary and pepper. Bring to a boil. Reduce heat; simmer, uncovered, for 30 minutes.                                                                                            Meanwhile, cook lasagna noodles according to package directions; drain. In a greased 13-in. x 9-in. baking dish, layer a third of the meat sauce, noodles and Swiss cheese. Repeat layers. Top with cottage cheese and the remaining Swiss cheese, noodles and sauce. Sprinkle with mozzarella cheese.                                                                                            Cover and bake at 350\xb0 for 30 minutes. Uncover; bake 10-15 minutes longer or until bubbly. Let stand for 10 minutes before serving.                                        Yield: 12 servings.                                                                                                                         Originally published as Swiss Cheese Lasagna in  Taste of HomeDecember/January 2003, p39                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 piece) equals 275 calories, 11 g fat (7 g saturated fat), 48 mg cholesterol, 596 mg sodium, 23 g carbohydrate, 3 g fiber, 20 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/swiss-cheese-lasagna-436262', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}