{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/430930-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 430930, u'veryPopular': False, u'lowFodmap': False, u'title': u'Thai Shrimp and Cabbage', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 134.45, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 cup shredded cabbage', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11109, u'unit': u'cup'}, {u'originalString': u'3 teaspoons canola oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon minced fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 slice onion, halved', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'slice'}, {u'originalString': u'1/8 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'8 uncooked large shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large', u'deveined', u'uncooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 15152, u'unit': u''}, {u'originalString': u'1 tablespoon soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/thai-shrimp-and-cabbage', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a small skillet, stir-fry the cabbage in 1 teaspoon oil for 2 minutes or until tender.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove and keep warm. In the same skillet, stir-fry onion and garlic in remaining oil until tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the shrimp, water and soy sauce; stir-fry for 2-3 minutes or until shrimp turn pink. Stir in cilantro and pepper flakes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve with cabbage.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Casa Catelli Pinot Grigio. It has 4.2 out of 5 stars and a bottle costs about 8 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food. View More', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 178, u'instructions': u'Directions                                                                                In a small skillet, stir-fry the cabbage in 1 teaspoon oil for 2 minutes or until tender. Remove and keep warm. In the same skillet, stir-fry onion and garlic in remaining oil until tender. Add the shrimp, water and soy sauce; stir-fry for 2-3 minutes or until shrimp turn pink. Stir in cilantro and pepper flakes. Serve with cabbage.                                        Yield: 1 serving.                                                                                                                         Originally published as Thai Shrimp and Cabbage in  Taste of HomeJune/July 2005, p57                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 267 calories, 15 g fat (2 g saturated fat), 215 mg cholesterol, 1,181 mg sodium, 6 g carbohydrate, 2 g fiber, 26 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-shrimp-and-cabbage-430930', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}