{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520062-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 520062, u'veryPopular': True, u'lowFodmap': False, u'title': u'30 Minute Honey Whole Wheat Skillet Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 3, u'pricePerServing': 23.7, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u"1 1/4 cups buttermilk* (see Buttermilk Tips below if you don't have it on hand)", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u"(see Buttermilk Tips below if you don't have it on hand)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 1230, u'unit': u'cups'}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon light or dark brown sugar, packed (I use light brown)', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'dark', u'light', u'packed', u'(I use brown)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u"1 tablespoon unsulphered molasses (I recommend a medium molasses as opposed to dark or robust, and not blackstrap; it's too pungent and bitter)", u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [u'dark', u'medium', u"(I recommend a molasses as opposed to or robust, and not blackstrap; it's too pungent and bitter)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19304, u'unit': u'tablespoon'}, {u'originalString': u'pinch salt, optional and to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons canola or vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'1 cup whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20080, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.averiecooks.com/2013/03/30-minute-honey-whole-wheat-skillet-bread.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400F. Spray an enameled\xa0cast-iron skillet\xa0with cooking spray, grease a seasoned cast iron skillet, or prepare an oven-safe skillet; set aside. My skillet is 10 1/4-inches and I recommend a skillet from 8 to 12 inches in diameter. Alternatively, bake bread on a\xa0Silpat-lined\xa0or greased baking sheet. In a large mixing bowl, combine all ingredients in the order listed, except the buttermilk, and give a quick stir to mix them.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u"Pour 1 cup buttermilk over the top. Stir to combine. Dough should be quite loose, shaggy, and very moist. The flour is like a sponge, and if dough is at all dry, add up to 1/4 cup buttermilk so that it's nicely moistened, and stir until just combined (I used 1 1/4 cups buttermilk total). Dough will be lumpy, bumpy, thick, and not at all smooth; don't overmix and don't try to make it smooth. Turn dough out into skillet in a circular mound that's about 6 inches in diameter and 3 to 4 inches high. Score top of bread with a knife, making a cross.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u"Bake at 400F for 15 minutes. Lower the temperature to 350F and bake for 10 minutes, or until bread is golden and done. (When I lower the temperature to 350F, I also rotate my skillet by 180 degrees to ensure even baking). With a large spatula, slide or nudge bread out onto a wire rack immediately to cool. Don't keep it in the skillet because it will continue to cook and bottom will get too browned.", u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u"Serve after it's sufficiently cooled. Note - If you're not consuming this bread immediately and it stays on a rack to cool for an hour or two, you may observe a fair amount of water released that's pooled underneath the rack. Mine released about 3 tablespoons in 1 hour. I store all my fully cooled bread by wrapping it in plasticwrap, then placing it inside a large Ziplock where it stays fresh for up to 4 days. Bread may also be frozen for up to 3 months.", u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7922, u'instructions': u"Preheat oven to 400F. Spray an enameled\xa0cast-iron skillet\xa0with cooking spray, grease a seasoned cast iron skillet, or prepare an oven-safe skillet; set aside. My skillet is 10 1/4-inches and I recommend a skillet from 8 to 12 inches in diameter. Alternatively, bake bread on a\xa0Silpat-lined\xa0or greased baking sheet. In a large mixing bowl, combine all ingredients in the order listed, except the buttermilk, and give a quick stir to mix them. Pour 1 cup buttermilk over the top. Stir to combine. Dough should be quite loose, shaggy, and very moist. The flour is like a sponge, and if dough is at all dry, add up to 1/4 cup buttermilk so that it's nicely moistened, and stir until just combined (I used 1 1/4 cups buttermilk total). Dough will be lumpy, bumpy, thick, and not at all smooth; don't overmix and don't try to make it smooth. Turn dough out into skillet in a circular mound that's about 6 inches in diameter and 3 to 4 inches high. Score top of bread with a knife, making a cross. Bake at 400F for 15 minutes. Lower the temperature to 350F and bake for 10 minutes, or until bread is golden and done. (When I lower the temperature to 350F, I also rotate my skillet by 180 degrees to ensure even baking). With a large spatula, slide or nudge bread out onto a wire rack immediately to cool. Don't keep it in the skillet because it will continue to cook and bottom will get too browned. Serve after it's sufficiently cooled. Note - If you're not consuming this bread immediately and it stays on a rack to cool for an hour or two, you may observe a fair amount of water released that's pooled underneath the rack. Mine released about 3 tablespoons in 1 hour. I store all my fully cooled bread by wrapping it in plasticwrap, then placing it inside a large Ziplock where it stays fresh for up to 4 days. Bread may also be frozen for up to 3 months.", u'spoonacularSourceUrl': u'https://spoonacular.com/30-minute-honey-whole-wheat-skillet-bread-520062', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 28, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}