{u'recipes': [{u'sourceName': u'Jessica Gavin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/603293-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 603293, u'veryPopular': False, u'lowFodmap': False, u'title': u'All-American Potato Salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 54.92, u'creditText': u'Jessica Gavin', u'extendedIngredients': [{u'originalString': u'\xbd cup chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 teaspoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'teaspoon'}, {u'originalString': u'2 hard cooked eggs, peeled and cut into 1/4" inch cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'hard', u'cooked', u'peeled', u'cut into 1/4" inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons minced parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons pickle relish', u'aisle': u'Condiments', u'name': u'pickle relish', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 11944, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons minced red onions', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'tablespoons'}, {u'originalString': u'2 pounds Russet potatoes, peeled and cut into \xbe inch cubes', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'peeled', u'cut into \xbe inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11353, u'unit': u'pounds'}, {u'originalString': u'\xbe teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon salt (for cooking potatoes)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'(for cooking potatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons distilled white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white distilled vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.jessicagavin.com/test-kitchen/appetizers/all-american-potato-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place potatoes in a large saucepan and add water to cover by 1 inch. Bring to boil over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add 1-tablespoon salt, reduce heat to medium, and simmer. Stir a few times, until potatoes re fork tender, about 8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain potatoes and transfer to a large bowl.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add vinegar and using a rubber spatula, toss gently to combine.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let stand for 20 minutes, the potatoes will still be warm.In a medium sized bowl, stir together celery, mayonnaise relish, onion, parsley, mustard, \xbe teaspoon salt, \xbd teaspoon pepper, onion powder and chopped eggs. Gently stir and fold ingredients together.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add more salt and pepper to taste. Cover and refrigerate until chilled, about 1 hour before serving. Potato salad can be made up to one day ahead.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 113, u'instructions': u'Place potatoes in a large saucepan and add water to cover by 1 inch. Bring to boil over medium-high heat. Add 1-tablespoon salt, reduce heat to medium, and simmer. Stir a few times, until potatoes re fork tender, about 8 minutes.Drain potatoes and transfer to a large bowl. Add vinegar and using a rubber spatula, toss gently to combine. Let stand for 20 minutes, the potatoes will still be warm.In a medium sized bowl, stir together celery, mayonnaise relish, onion, parsley, mustard, \xbe teaspoon salt, \xbd teaspoon pepper, onion powder and chopped eggs. Gently stir and fold ingredients together. Add more salt and pepper to taste. Cover and refrigerate until chilled, about 1 hour before serving. Potato salad can be made up to one day ahead.', u'spoonacularSourceUrl': u'https://spoonacular.com/all-american-potato-salad-603293', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}