{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600205-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 600205, u'veryPopular': False, u'lowFodmap': False, u'title': u'Floating Islands with Black Currant Sauce', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 340.68, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'2 pounds black currants', u'aisle': u'Produce', u'name': u'black currants', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/currants.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 9083, u'unit': u'pounds'}, {u'originalString': u'1 tablespoon very strongly brewed black coffee (optional)', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'black', u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14209, u'unit': u'tablespoon'}, {u'originalString': u'4 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'4 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1 cup superfine sugar (or blitz granulated sugar in the blender until finely ground but not powdery)', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'finely', u'(or blitz granulated sugar in the blender until ground but not powdery)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 vanilla bean, split lengthwise', u'aisle': u'Baking', u'name': u'vanilla bean', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://leitesculinaria.com/4328/recipes-floating-islands-black-currant-sauce.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the custard1. Beat the eggs and egg yolks together with the sugar until well mixed.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put the cream and milk in a heavy saucepan, add the vanilla bean, and scald (that means to bring the milk almost but not quite to a boil).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove and discard the vanilla bean.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour the cream and milk over the eggs, whisking constantly.2.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the custard mixture into a large, heavy pan over low heat and stir gently until it thickens enough to coat the back of the spoon.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from the heat and stir for 1 to 2 minutes more. Strain the custard through a fine sieve into a bowl.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool.Make the black currant sauce3. Pick over the black currants, removing any twigs, leaves, or stalks, and gently wash the currants.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/currants.jpg', u'id': 9083, u'name': u'black currants'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place them in a pan over low heat with the water and 1/2 cup sugar and cook, stirring occasionally, until the currants begin to break down. Simmer gently for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from the heat.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Let the currants cool slightly.4. Press the currant mixture through a sieve. Taste the resulting pur\xe9e while it is still warm and stir in more sugar if you think it needs it (remember the custard is sweet, so the sauce should be quite tart).', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Let the sauce cool completely.Make the meringues5.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the egg whites until they form stiff peaks.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the sugar 1/3 at a time, plus the coffee if using, and continue whisking until you have a thick, creamy meringue that keeps its shape when scooped.6. Using 2 tablespoons, form the meringue into individual meringues in the shape of quenelles (football shapes). You do this by scraping a little heap of the meringue from 1 spoon to the other. It’s hard to describe but easy to do with a little practice.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the meringues, 2 or 3 at a time, in a wide pan of gently simmering water. Cover the pan and poach the meringues until puffed up and lightly set, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the pan with a slotted spoon.7. While the meringues are poaching, pour a pool of cold custard into individual serving plates or shallow bowls. Float a couple of meringues on each pool of custard and drizzle 2 or 3 tablespoons of the sauce over the top.', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with extra fruit such as fresh raspberries or sliced strawberries, if you like.', u'number': 16, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Float. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Make the custard1. Beat the eggs and egg yolks together with the sugar until well mixed. Put the cream and milk in a heavy saucepan, add the vanilla bean, and scald (that means to bring the milk almost but not quite to a boil). Remove and discard the vanilla bean. Pour the cream and milk over the eggs, whisking constantly.2. Pour the custard mixture into a large, heavy pan over low heat and stir gently until it thickens enough to coat the back of the spoon. Remove from the heat and stir for 1 to 2 minutes more. Strain the custard through a fine sieve into a bowl. Let cool.Make the black currant sauce3. Pick over the black currants, removing any twigs, leaves, or stalks, and gently wash the currants. Place them in a pan over low heat with the water and 1/2 cup sugar and cook, stirring occasionally, until the currants begin to break down. Simmer gently for 5 minutes. Remove from the heat. Let the currants cool slightly.4. Press the currant mixture through a sieve. Taste the resulting pur\xe9e while it is still warm and stir in more sugar if you think it needs it (remember the custard is sweet, so the sauce should be quite tart). Let the sauce cool completely.Make the meringues5. Whisk the egg whites until they form stiff peaks. Whisk in the sugar 1/3 at a time, plus the coffee if using, and continue whisking until you have a thick, creamy meringue that keeps its shape when scooped.6. Using 2 tablespoons, form the meringue into individual meringues in the shape of quenelles (football shapes). You do this by scraping a little heap of the meringue from 1 spoon to the other. It’s hard to describe but easy to do with a little practice. Place the meringues, 2 or 3 at a time, in a wide pan of gently simmering water. Cover the pan and poach the meringues until puffed up and lightly set, about 2 minutes. Remove from the pan with a slotted spoon.7. While the meringues are poaching, pour a pool of cold custard into individual serving plates or shallow bowls. Float a couple of meringues on each pool of custard and drizzle 2 or 3 tablespoons of the sauce over the top. Garnish with extra fruit such as fresh raspberries or sliced strawberries, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/floating-islands-with-black-currant-sauce-600205', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}