{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520629-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 520629, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Buttermilk Waffles with Mixed Berry and Lemon Preserves', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 124.8, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'16 ounces frozen mixed berries (or fresh), can be used frozen or thawed', u'aisle': u'Produce', u'name': u'berries', u'metaInformation': [u'mixed', u'frozen', u'thawed', u'canned', u'(or fresh)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'ounces'}, {u'originalString': u'Mixed Berry and Lemon Preserves', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'1 cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'Waffles', u'aisle': u'Frozen', u'name': u'frozen waffles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/waffles-isolated.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 28015, u'unit': u'servings'}, {u'originalString': u"3/4 cup granulated sugar (reduce to 1/2 cup if your berries are quite sweet, mine weren't)", u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'sweet', u"(reduce to 1/2 cup if your berries are quite , mine weren't)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'juice of 1 lemon (reduce to half lemon, or to taste, if preferred)', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'to taste', u'(reduce to half lemon, or , if preferred)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'pinch salt, optional and to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup canola or vegetable oil (1/4 cup unsalted melted butter may be substituted)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.averiecooks.com/2014/02/easy-buttermilk-waffles-with-mixed-berry-and-lemon-preserves.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"Mixed Berry and Lemon Preserves\xa0- In a medium saucepan, combine berries, sugar, lemon , and heat uncovered over medium-high heat until mixture comes to a rolling boil. Stir frequently until sugar dissolves. After mixture is boiling rapidly, turn heat down to low or medium-low, and allow mixture to simmer uncovered for about 30 to 45 minutes, or until the liquid volume has reduced by half and mixture has thickened some. The sauce doesn't get 'thick' per se, but it does tighten up as the liquid volume reduces. I used frozen berries straight from the freezer without thawing fist, and needed to simmer for 45 minutes. If your fruit is already thawed, the simmering time will be reduced.", u'length': {u'number': 75, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'id': 1009054, u'name': u'berries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Transfer preserves to a glass jar with a lid, or heat-safe container; set aside. Extra preserves will keep airtight at room temp for up to 1 week and up to 4 weeks in the refrigerator. I have not tried canning this with a water bath so cannot speak to processing times. Waffles\xa0- In a large mixing bowl, whisk to combine first 6 dry ingredients (through optional salt); set aside. In a glass measuring cup or small bowl, whisk remaining 4 wet ingredients.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u"Pour wet mixture over dry, and stir gently until just combined; don't overmix. Batter will be thick and with some lumps, don't try to stir them smooth or waffles will be tough. Preheat waffle maker\xa0to manufacturer's directions, and spray grates with cooking spray. When waffle maker is hot, add batter, leaving a bare margin of about 1/2-inch on all sides. Cook for 3 to 5 minutes, or as\xa0manufacturer's directions indicate, or until waffles are done, cooked through, and lightly golden. Carefully remove waffles, place on serving plate, and top with mixed berry preserves. Optionally, dust with confectioners' sugar, serve with maple syrup, or with your favorite waffle topping.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'id': 1009054, u'name': u'berries'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6116, u'instructions': u"Mixed Berry and Lemon Preserves\xa0- In a medium saucepan, combine berries, sugar, lemon , and heat uncovered over medium-high heat until mixture comes to a rolling boil. Stir frequently until sugar dissolves. After mixture is boiling rapidly, turn heat down to low or medium-low, and allow mixture to simmer uncovered for about 30 to 45 minutes, or until the liquid volume has reduced by half and mixture has thickened some. The sauce doesn't get 'thick' per se, but it does tighten up as the liquid volume reduces. I used frozen berries straight from the freezer without thawing fist, and needed to simmer for 45 minutes. If your fruit is already thawed, the simmering time will be reduced. Transfer preserves to a glass jar with a lid, or heat-safe container; set aside. Extra preserves will keep airtight at room temp for up to 1 week and up to 4 weeks in the refrigerator. I have not tried canning this with a water bath so cannot speak to processing times. Waffles\xa0- In a large mixing bowl, whisk to combine first 6 dry ingredients (through optional salt); set aside. In a glass measuring cup or small bowl, whisk remaining 4 wet ingredients. Pour wet mixture over dry, and stir gently until just combined; don't overmix. Batter will be thick and with some lumps, don't try to stir them smooth or waffles will be tough. Preheat waffle maker\xa0to manufacturer's directions, and spray grates with cooking spray. When waffle maker is hot, add batter, leaving a bare margin of about 1/2-inch on all sides. Cook for 3 to 5 minutes, or as\xa0manufacturer's directions indicate, or until waffles are done, cooked through, and lightly golden. Carefully remove waffles, place on serving plate, and top with mixed berry preserves. Optionally, dust with confectioners' sugar, serve with maple syrup, or with your favorite waffle topping.", u'spoonacularSourceUrl': u'https://spoonacular.com/easy-buttermilk-waffles-with-mixed-berry-and-lemon-preserves-520629', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}