{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/750169-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 750169, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peach Salsa', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 30, u'pricePerServing': 235.9, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'3 teaspoons freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoons'}, {u'originalString': u'3 teaspoons chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoons'}, {u'originalString': u'12 cups fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 12.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cups'}, {u'originalString': u'12 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 12.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'6 jalapenos', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'3 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'12 limes', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'3 #10 cans (106 ounces each) peaches in syrup, drained (retain the syrup in case needed)', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'drained', u'canned', u'(retain the syrup in case needed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 318.0, u'consistency': u'solid', u'id': 9236, u'unit': u'ounces'}, {u'originalString': u'6 red bell peppers', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'6 red onions', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}], u'healthScore': 36.0, u'imageType': u'jpeg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/peach-salsa.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Divide the ingredients (except for the peaches and cilantro) into 3 batches so they will fit into a food processor. For each batch, halve or quarter 4 cloves garlic, 2 onions, 2 jalapenos and 2 bell peppers and throw into a food processor.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add 1 teaspoon each chili powder, salt and pepper. Squeeze in the juice from 4 limes and pulse.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'Pour the salsa into a very large container and repeat with the remaining 2 batches.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the peaches into small chunks, add to the salsa and mix.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [], u'step': u'Mix in the cilantro. If your salsa is a little thick, loosen it with some of the syrup from the peaches.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Salsa. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Trombetta Gap's Crown Vineyard Pinot Noir. It has 4.1 out of 5 stars and a bottle costs about 59 dollars.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Rich garnet color. Aromas of vanilla, clove and cooking spiceswith hints of ripe berry, pomegranate and toast. Soft entry,balanced tannin and berry fruit mingled with pleasant acidityand lingering finish.', u'title': u"Trombetta Gap's Crown Vineyard Pinot Noir", u'price': u'$58.99', u'id': 439275, u'link': u'https://www.wine.com/product/trombetta-gaps-crown-vineyard-pinot-noir-2012/138834', u'imageUrl': u'https://spoonacular.com/productImages/439275-312x231.jpg'}]}, u'aggregateLikes': 481, u'instructions': u'Watch how to make this recipe.                    Divide the ingredients (except for the peaches and cilantro) into 3 batches so they will fit into a food processor. For each batch, halve or quarter 4 cloves garlic, 2 onions, 2 jalapenos and 2 bell peppers and throw into a food processor. Add 1 teaspoon each chili powder, salt and pepper. Squeeze in the juice from 4 limes and pulse. Pour the salsa into a very large container and repeat with the remaining 2 batches.                          Cut the peaches into small chunks, add to the salsa and mix. Mix in the cilantro. If your salsa is a little thick, loosen it with some of the syrup from the peaches.', u'spoonacularSourceUrl': u'https://spoonacular.com/peach-salsa-750169', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}