{u'recipes': [{u'sourceName': u'Evil Shenanigans', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497577-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 497577, u'veryPopular': True, u'lowFodmap': False, u'title': u'Stove-top Macaroni and Cheese', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 36.27, u'creditText': u'Evil Shenanigans', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'6 ounces (about 1 cup) freshly grated cheddar cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009, u'unit': u'cup'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Hot sauce, to taste', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'8 ounces macaroni, or any smallish tube shaped pasta', u'aisle': u'Pasta and Rice', u'name': u'macaroni', u'metaInformation': [u'or any smallish tube shaped pasta'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20499, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon dry mustard powder', u'aisle': u'Spices and Seasonings', u'name': u'mustard powder', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon red pepper', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u'teaspoon'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.evilshenanigans.com/2009/03/stove-top-macaroni-and-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook the pasta according to package directions, but reduce the cooking time by one minute.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain and pour back into the cooking pot.Over medium-low heat, add the butter and stir until melted.In a small bowl combine the egg, milk, and spices.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk until thoroughly combined then pour over the pasta. Stir until the sauce begins to thicken, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat then add the cheese in four installments, making sure the first is melted completely before adding the next.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese can be paired with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. One wine you could try is Dry Creek Vineyard Dry Chenin Blanc, Wine. It has 5 out of 5 stars and a bottle costs about 15 dollars.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'pineapple , cantaloupe , white peach', u'title': u'Dry Creek Vineyard Dry Chenin Blanc, Wine', u'price': u'$15.0', u'id': 430261, u'link': u'https://www.amazon.com/Dry-Creek-Vineyard-Chenin-Clarksburg/dp/B01N30XOBY', u'imageUrl': u'https://spoonacular.com/productImages/430261-312x231.jpg'}]}, u'aggregateLikes': 41661, u'instructions': u'Cook the pasta according to package directions, but reduce the cooking time by one minute. Drain and pour back into the cooking pot.Over medium-low heat, add the butter and stir until melted.In a small bowl combine the egg, milk, and spices. Whisk until thoroughly combined then pour over the pasta. Stir until the sauce begins to thicken, about 5 minutes.Remove the pan from the heat then add the cheese in four installments, making sure the first is melted completely before adding the next.', u'spoonacularSourceUrl': u'https://spoonacular.com/stove-top-macaroni-and-cheese-497577', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}