{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/758642-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758642, u'veryPopular': True, u'lowFodmap': False, u'title': u'Black Bean and Edamame Sliders', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 35.06, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbe cup plus 1 Tbs. prepared fat-free barbecue sauce, divided', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [u'fat-free', u'divided', u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'1 \xbd cups cooked black beans, or 1 15-oz. can black beans, rinsed and drained', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 16015, u'unit': u'cups'}, {u'originalString': u'1 chipotle chile in adobo sauce, drained and minced', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chile in adobo', u'metaInformation': [u'minced', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'\xbc cup coarsely chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'12 small whole-wheat dinner rolls, split like buns', u'aisle': u'Bakery/Bread;Frozen', u'name': u'dinner yeast rolls', u'metaInformation': [u'whole-wheat', u'split', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dinner-yeast-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18347, u'unit': u''}, {u'originalString': u'1 cup frozen shelled edamame', u'aisle': u'Health Foods;Frozen', u'name': u'edamame', u'metaInformation': [u'frozen', u'shelled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-soy-beans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11212, u'unit': u'cup'}, {u'originalString': u'1 clove garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 \xbd tsp. ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 tsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'4 oz. reduced-fat sharp cheddar cheese, cut into 12 slices', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'cut into 12 slices', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'oz'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/black-bean-and-edamame-sliders/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring small pot of water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add edamame, and cook 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-soy-beans.jpg', u'id': 11212, u'name': u'edamame'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Drain.  2. Process garlic in food processor until minced.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add edamame, black beans, chipotle chile, cilantro, 1 Tbs. barbecue sauce, cumin, and salt. Process until mixture forms coarse paste.   3.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-soy-beans.jpg', u'id': 11212, u'name': u'edamame'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat oil in saucepan over medium-low heat.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add edamame mixture, and heat until hot, stirring occasionally.  4. Spoon 1 Tbs. barbecue sauce onto each bottom bun. Top with bean mixture, cheese, and top buns.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-soy-beans.jpg', u'id': 11212, u'name': u'edamame'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Nicolas Feuillatte Blanc de Blancs with a 4.4 out of 5 star rating seems like a good match. It costs about 65 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Subtle glints of lime-blossom green, with delicate, abundant bubbles. The wine offers aromas of white flowers, such ashawthorn and acacia, as well as more subtle scents of citrus fruits, pears and even limeblossom. Very generous on the palate. Lively, fresh and powerful on the attack.', u'title': u'Nicolas Feuillatte Blanc de Blancs', u'price': u'$64.99', u'id': 442400, u'link': u'https://www.wine.com/product/nicolas-feuillatte-blanc-de-blancs-2005/127127', u'imageUrl': u'https://spoonacular.com/productImages/442400-312x231.jpg'}]}, u'aggregateLikes': 2808, u'instructions': u'1. Bring small pot of water to a boil. Add edamame, and cook 10 minutes. Drain.  2. Process garlic in food processor until minced. Add edamame, black beans, chipotle chile, cilantro, 1 Tbs. barbecue sauce, cumin, and salt. Process until mixture forms coarse paste.   3. Heat oil in saucepan over medium-low heat. Add edamame mixture, and heat until hot, stirring occasionally.  4. Spoon 1 Tbs. barbecue sauce onto each bottom bun. Top with bean mixture, cheese, and top buns.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-bean-and-edamame-sliders-758642', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}