{u'recipes': [{u'sourceName': u'SippitySup', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/612526-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 612526, u'veryPopular': False, u'lowFodmap': False, u'title': u'Catfish Sloppy Joe Sliders with Cole Slaw', u'diets': [u'pescatarian'], u'pricePerServing': 232.52, u'creditText': u'SippitySup', u'extendedIngredients': [{u'originalString': u'2 tablespoon apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoon'}, {u'originalString': u'1 cup barbecue sauce (either homemade or store bought, see note)', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [u'homemade', u'store bought', u'(either or , see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'\xbc cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'1 \xbc pound cabbage (finely shredded)', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'shredded', u'finely', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 11109, u'unit': u'pound'}, {u'originalString': u'\xbc cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1 carrot (finely shredded)', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'shredded', u'finely', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'8 ounce skinless catfish fillet (cut into \xbd-inch chunks)', u'aisle': u'Seafood', u'name': u'catfish fillet', u'metaInformation': [u'skinless', u'cut into \xbd-inch chunks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/catfish.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 15010, u'unit': u'ounce'}, {u'originalString': u'\xbd cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon kosher salt (plus more for seasoning catfish)', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'plus more for seasoning catfish)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoon freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon freshly cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'8 soft slider buns', u'aisle': u'Bakery/Bread', u'name': u'slider buns', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/slider-buns.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 93646, u'unit': u''}, {u'originalString': u'2 tablespoon unsalted butter (melted)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.sippitysup.com/catfish-sloppy-joe-sliders-cole-slaw/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine shredded cabbage and carrot in a large bowl; set aside.In a medium bowl, whisk together sugar, salt, pepper, mayonnaise, milk, buttermilk, lemon juice and vinegar until well blended; toss with vegetables. Cover and chill until ready to use. This recipe makes more than you need to top these sliders. It will keep refrigerated about 3 days.Prepare the sloppy Joe mixture: Season the catfish with salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/catfish.jpg', u'id': 15010, u'name': u'catfish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a medium non-stick or cast iron skillet over medium-high heat. When the pan is quite hot, add the oil, onion, and bell pepper. Cook,stirring often, until softened, about 5 minutes. Stir in the paprika and cook, stirring constantly, for 1 minute.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the catfish and cook, stirring often, until the fish is opaque.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/catfish.jpg', u'id': 15010, u'name': u'catfish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the barbecue sauce and lower heat to a simmer. Cook the mixture, stirring occasionally, until thick, about 10 minutes.Assemble the sliders: Butter the slider tops and bottoms and lightly toast them, buttered-side down, in a hot skillet. Lay the buns, toasted side up, onto a clean work surface.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}, {u'equipment': [], u'step': u'Place a tomato slice on each of the bun bottoms, top with sloppy Joe mixture and cole slaw (be generous). Close the sliders with the bun tops; serve immediately (with napkins).Like this:Like Loading...', u'number': 5, u'ingredients': []}], u'name': u'Prepare the cole slaw'}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Fetzer Vineyards Valley Oaks Pinot Grigio. It has 5 out of 5 stars and a bottle costs about 11 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This Pinot Grigio is clean with a fruit forward character and a crisp acid backbone . There are aromas of mango, pear, orange spice, lemongrass and pineapple. In the mouth, there are flavors of tropical fruit, apples, pears and a nice orange citrus note, balanced with minerality and a wonderful, round finish.', u'title': u'Fetzer Vineyards Valley Oaks Pinot Grigio', u'price': u'$10.99', u'id': 428373, u'link': u'https://www.amazon.com/Fetzer-Vineyards-Valley-Pinot-Grigio/dp/B0725QB94C', u'imageUrl': u'https://spoonacular.com/productImages/428373-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Prepare the cole slaw: Combine shredded cabbage and carrot in a large bowl; set aside.In a medium bowl, whisk together sugar, salt, pepper, mayonnaise, milk, buttermilk, lemon juice and vinegar until well blended; toss with vegetables. Cover and chill until ready to use. This recipe makes more than you need to top these sliders. It will keep refrigerated about 3 days.Prepare the sloppy Joe mixture: Season the catfish with salt. Heat a medium non-stick or cast iron skillet over medium-high heat. When the pan is quite hot, add the oil, onion, and bell pepper. Cook,stirring often, until softened, about 5 minutes. Stir in the paprika and cook, stirring constantly, for 1 minute. Add the catfish and cook, stirring often, until the fish is opaque. Add the barbecue sauce and lower heat to a simmer. Cook the mixture, stirring occasionally, until thick, about 10 minutes.Assemble the sliders: Butter the slider tops and bottoms and lightly toast them, buttered-side down, in a hot skillet. Lay the buns, toasted side up, onto a clean work surface. Place a tomato slice on each of the bun bottoms, top with sloppy Joe mixture and cole slaw (be generous). Close the sliders with the bun tops; serve immediately (with napkins).Like this:Like Loading...', u'spoonacularSourceUrl': u'https://spoonacular.com/catfish-sloppy-joe-sliders-with-cole-slaw-612526', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}