{u'recipes': [{u'sourceName': u'My Colombian Recipes', u'cuisines': [u'south american', u'latin american'], u'image': u'https://spoonacular.com/recipeImages/227500-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 227500, u'veryPopular': False, u'lowFodmap': False, u'title': u'Arepa con Carne y Champi\xf1ones (Corn Cake with Beef and Mushrooms)', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 795.45, u'creditText': u'My Colombian Recipes', u'extendedIngredients': [{u'originalString': u'1 pound thin beef steaks, skirt steaks are a good choice', u'aisle': u'Meat', u'name': u'beef tenderloin steaks', u'metaInformation': [u'good', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-tenderloin.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023583, u'unit': u'pound'}, {u'originalString': u'Fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'1 garlic clove', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 garlic cloves crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'teaspoon'}, {u'originalString': u'2 cups portobello mushrooms, sliced', u'aisle': u'Produce', u'name': u'portobello mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11265, u'unit': u'cups'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 scallion, finely chopped', u'aisle': u'Produce', u'name': u'scallion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.mycolombianrecipes.com/arepa-con-carne-y-champinones-corn-cake-with-beef-and-mushrooms', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the olive oil in a sauce pan over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onions, mushrooms, garlic and thyme and season with salt and pepper. Cook for about 7 minutes or until they are golden brown, stirring often.To assemble: top each arepa with beef and mushrooms.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Garnish with fresh cilantro and serve warm.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}]}], u'name': u'Mix the crushed garlic, cumin, scallion, salt and pepper together to make a marinade for the meat.2 Rub the garlic cumin marinade on the thin steaks and let marinate for a couple of hours or overnight.Grill or fry the steaks over high heat to desired doneness. Since they are relatively thin they won’t take too long to cook. Set aside.To make the mushrooms'}, {u'steps': [], u'name': u'To make the beef'}], u'winePairing': {}, u'aggregateLikes': 189, u'instructions': u'To make the beef: Mix the crushed garlic, cumin, scallion, salt and pepper together to make a marinade for the meat.2 Rub the garlic cumin marinade on the thin steaks and let marinate for a couple of hours or overnight.Grill or fry the steaks over high heat to desired doneness. Since they are relatively thin they won’t take too long to cook. Set aside.To make the mushrooms: Heat the olive oil in a sauce pan over medium heat. Add the onions, mushrooms, garlic and thyme and season with salt and pepper. Cook for about 7 minutes or until they are golden brown, stirring often.To assemble: top each arepa with beef and mushrooms. Garnish with fresh cilantro and serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/arepa-con-carne-y-championes-corn-cake-with-beef-and-mushrooms-227500', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}