{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/613380-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 613380, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cherry Greek Yogurt Parfaits', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 179.85, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'1/2 cup halved frozen cherries', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'frozen', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9070, u'unit': u'cup'}, {u'originalString': u'1/2 cup granola', u'aisle': u'Cereal', u'name': u'granola', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 8212, u'unit': u'cup'}, {u'originalString': u'1 cup vanilla greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim vanilla greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 99033, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.foodfanatic.com/2014/09/cherry-greek-yogurt-parfaits/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}], u'step': u'Spoon half the yogurt into 2 small canning jars. Top with half the granola and half the fruit. Repeat layers. Close each jar with a lid and refrigerate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'id': 8212, u'name': u'granola'}]}], u'name': u''}], u'aggregateLikes': 13, u'instructions': u'Spoon half the yogurt into 2 small canning jars. Top with half the granola and half the fruit. Repeat layers. Close each jar with a lid and refrigerate.', u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-greek-yogurt-parfaits-613380', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}