{u'recipes': [{u'sourceName': u'Jo Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/671367-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 671367, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crispy Baked Parmesan Chicken Wings', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 100.84, u'creditText': u'Jo Cooks', u'extendedIngredients': [{u'originalString': u'2 lbs chicken wings', u'aisle': u'Meat', u'name': u'chicken wings', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 5100, u'unit': u'lbs'}, {u'originalString': u'1 tsp red pepper chili flakes', u'aisle': u'Spices and Seasonings', u'name': u'chili flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'\xbc cup Parmesan cheese, grated', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'\xbc cup chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.jocooks.com/healthy-eating/crispy-baked-parmesan-chicken-wings/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425 F degrees. Line a baking sheet with parchment paper, this will save you from scrubbing the baking pan until tomorrow.Season the wings generously with salt, pepper and the  tsp of garlic powder. Arrange the wings in a single layer on the prepared baking pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Bake for about 40 to 45 minutes or until they're golden crisp.While wings are baking, mix all the Parmesan mixture ingredients together in a small bowl.When the wings are done baking, transfer them to a bowl right away. Dump the Parmesan mixture over the wings and toss well, making sure each wing is fully covered with the Parmesan mixture.", u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}, {u'equipment': [], u'step': u'Serve right away.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken Wings. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 312, u'instructions': u"Preheat oven to 425 F degrees. Line a baking sheet with parchment paper, this will save you from scrubbing the baking pan until tomorrow.Season the wings generously with salt, pepper and the  tsp of garlic powder. Arrange the wings in a single layer on the prepared baking pan. Bake for about 40 to 45 minutes or until they're golden crisp.While wings are baking, mix all the Parmesan mixture ingredients together in a small bowl.When the wings are done baking, transfer them to a bowl right away. Dump the Parmesan mixture over the wings and toss well, making sure each wing is fully covered with the Parmesan mixture. Serve right away.", u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-baked-parmesan-chicken-wings-671367', u'dishTypes': [u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}