{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/196503-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 196503, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Orange-Chipotle Pork Loin', u'diets': [u'gluten free'], u'pricePerServing': 157.34, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 whole canned chipotle chiles in adobo plus 1 tablespoon sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chiles in adobo', u'metaInformation': [u'whole', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'2 tablespoons dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'tablespoons'}, {u'originalString': u'Type of fire: two-zone indirect', u'aisle': u'Canned and Jarred', u'name': u'fire-roasted tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 98849, u'unit': u'servings'}, {u'originalString': u'2 medium cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Grill heat: high', u'aisle': u'Cheese', u'name': u'grill cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10093624, u'unit': u'servings'}, {u'originalString': u'1 tablespoon Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup orange juice, divided', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1 pork loin trimmed of excess fat and silver skin (about 2 1/2 pounds total)', u'aisle': u'Baking;Meat', u'name': u'pork fat', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-fat-or-lard.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 4002, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/12/grilled-orange-chipotle-pork-loin-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place 1/4 cup orange juice, olive oil, dark brown sugar, chipotles in adobo, adobo sauce, garlic, and salt in jar of a blender. Puree until chipotles and garlic are completely chopped.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'canned chipotle chiles in adobo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 10019334, u'name': u'dark brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Place pork loin in large resealable plastic bag.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in orange-chipotle marinade, seal, and toss to thoroughly coat loin with marinade.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place in refrigerator and marinate for 6 hours to overnight, turning occasionally.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour marinade from bag into small saucepan. Stir in remaining 1/2 cup of orange juice. Bring to boil over medium-high heat; reduce to heat to medium and cook until sauce has reduced in volume by half, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}]}, {u'equipment': [], u'step': u'Remove from heat and set aside.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Sear pork over hot side of grill until browned on all sides, about 4-5 minutes per side. Move pork to cool side of the grill and brush with orange-chipotle sauce. Cover grill and continue to cook until an instant read thermometer reads 140\xb0F when inserted into the thickest part of the pork loin, 15 to 30 minutes longer.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove from grill, let stand for 15 minutes; slice and serve with reserved orange-chipotle sauce.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 147, u'instructions': u'Procedures                                                                              1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Place 1/4 cup orange juice, olive oil, dark brown sugar, chipotles in adobo, adobo sauce, garlic, and salt in jar of a blender. Puree until chipotles and garlic are completely chopped.                                                                                                                            2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Place pork loin in large resealable plastic bag. Pour in orange-chipotle marinade, seal, and toss to thoroughly coat loin with marinade. Place in refrigerator and marinate for 6 hours to overnight, turning occasionally.                                                                                                                            3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Pour marinade from bag into small saucepan. Stir in remaining 1/2 cup of orange juice. Bring to boil over medium-high heat; reduce to heat to medium and cook until sauce has reduced in volume by half, about 15 minutes. Remove from heat and set aside.                                                                                                                            4                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Sear pork over hot side of grill until browned on all sides, about 4-5 minutes per side. Move pork to cool side of the grill and brush with orange-chipotle sauce. Cover grill and continue to cook until an instant read thermometer reads 140\xb0F when inserted into the thickest part of the pork loin, 15 to 30 minutes longer. Remove from grill, let stand for 15 minutes; slice and serve with reserved orange-chipotle sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-orange-chipotle-pork-loin-196503', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 420, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}