{u'recipes': [{u'sourceName': u'Cookie Madness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/260948-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 260948, u'veryPopular': False, u'lowFodmap': False, u'title': u'Self-Rising Flour Double Chocolate Chip Cookies', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 18.28, u'creditText': u'Cookie Madness', u'extendedIngredients': [{u'originalString': u'1 1/3 cups (224 grams) dark chocolate chips plus 2/3 cup for adding later', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'dark', u'for adding later'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 224.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'grams'}, {u'originalString': u'1/4 cup (20 grams) unsweetened natural cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 19165, u'unit': u'grams'}, {u'originalString': u'2 large eggs, lightly beaten with a fork in a separate bowl', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'with a fork in a separate bowl', u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 teaspoon espresso powder (optional)', u'aisle': u'Tea and Coffee', u'name': u'espresso powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10014214, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup (47 grams) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 47.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'3/4 cup (150 grams) packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 19334, u'unit': u'grams'}, {u'originalString': u'Tiny pinch of salt (omit if using salted butter)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'salted', u'(omit if using butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'4 tablespoons (60 grams) unsalted or salted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'unsalted', u'salted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'grams'}, {u'originalString': u'1 cup plus 2 tablespoons (140 grams) self-rising White Lily flour', u'aisle': u'Baking', u'name': u'self rising flour', u'metaInformation': [u'white', u'(140 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20129, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://www.cookiemadness.net/2013/03/self-rising-white-lily-flour-double-chocolate-chip-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Melt 1 1/3 cups of the dark chocolate chips (8 oz) in a microwave-safe bowl at 50% power, stirring every 30 seconds until fully melted. Stir the cocoa powder and espresso powder into the melted chocolate and let cool slightly.In a mixing bowl using an electric mixer, beat the butter, salt (if using) and both sugars until creamy. With mixer on medium, add eggs 1 tablespoon at a time until incorporated, then beat for 1 minute. Beat in vanilla and melted chocolate mixture, scraping sides of bowl often. When chocolate is incorporated, stir in the flour. Make sure the dough is completely cool, then stir in the remaining 2/3 cup chocolate chips. Cover mixture and let sit until thickened.Preheat oven to 350 degrees F. Line 2 baking sheets with parchment paper or Silpats. Using a tablespoon measure, scoop up heaping tablespoons of dough and shape into balls. Arrange about 2 inches apart (6 to a sheet) on baking sheets. Press tops down slightly.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10014214, u'name': u'instant espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake one sheet at a time on center rack for 10 minutes or just until cookies appear set.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Let the cookies cool on baking sheets about 5 minutes or until set.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 26, u'instructions': u'Melt 1 1/3 cups of the dark chocolate chips (8 oz) in a microwave-safe bowl at 50% power, stirring every 30 seconds until fully melted. Stir the cocoa powder and espresso powder into the melted chocolate and let cool slightly.In a mixing bowl using an electric mixer, beat the butter, salt (if using) and both sugars until creamy. With mixer on medium, add eggs 1 tablespoon at a time until incorporated, then beat for 1 minute. Beat in vanilla and melted chocolate mixture, scraping sides of bowl often. When chocolate is incorporated, stir in the flour. Make sure the dough is completely cool, then stir in the remaining 2/3 cup chocolate chips. Cover mixture and let sit until thickened.Preheat oven to 350 degrees F. Line 2 baking sheets with parchment paper or Silpats. Using a tablespoon measure, scoop up heaping tablespoons of dough and shape into balls. Arrange about 2 inches apart (6 to a sheet) on baking sheets. Press tops down slightly.Bake one sheet at a time on center rack for 10 minutes or just until cookies appear set. Let the cookies cool on baking sheets about 5 minutes or until set.', u'spoonacularSourceUrl': u'https://spoonacular.com/self-rising-flour-double-chocolate-chip-cookies-260948', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 22, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}