{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611492-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 611492, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peanut Butter Chocolate Yogurt Fruit Dip', u'diets': [u'gluten free'], u'preparationMinutes': 3, u'pricePerServing': 150.83, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'1 tbsp. mini chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp. creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10116098, u'unit': u'tbsp'}, {u'originalString': u'fruit for dipping', u'aisle': u'Produce', u'name': u'fruit', u'metaInformation': [u'for dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9431, u'unit': u'servings'}, {u'originalString': u'5 oz. nonfat vanilla Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat vanilla greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'liquid', u'id': 99033, u'unit': u'oz'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://wearychef.com/peanut-butter-chocolate-yogurt-fruit-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Vigorously stir together yogurt and peanut butter until smooth. Stir in chocolate chips.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [], u'step': u'Serve with apple slices or other fruit for dipping. Pretzels would be great too!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fruit'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fruit Dip works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 474, u'instructions': u'Vigorously stir together yogurt and peanut butter until smooth. Stir in chocolate chips.Serve with apple slices or other fruit for dipping. Pretzels would be great too!', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-chocolate-yogurt-fruit-dip-611492', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 3, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}