{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/294826-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 294826, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crispy Phyllo Wrapped Hot Dog Mummies', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 65.31, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'Ketchup, yellow mustard, barbecue sauce or your favorite dipping sauce, for serving and decorating', u'aisle': u'Condiments', u'name': u'Barbeque Dipping Sauce', u'metaInformation': [u'yellow', u'for serving and decorating', u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 ounces Cheddar, cut into 16 thin slices', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'cut into 16 thin slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1009, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 16-ounce package bun-size hot dogs (8 hot dogs), each halved crosswise', u'aisle': u'Meat', u'name': u'hot dogs', u'metaInformation': [u'halved', u'(8 hot dogs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 21118, u'unit': u'ounce'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'8 sheets phyllo dough', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 8.0, u'consistency': u'solid', u'id': 18338, u'unit': u'sheets'}, {u'originalString': u'4 ounces (1 stick) unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/crispy-phyllo-wrapped-hot-dog-mummies-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F and line a rimmed baking sheet with parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut a slit in each hot dog piece and stuff with a slice of cheese. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the salt, garlic powder and pepper in a small bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Working with one sheet of phyllo at a time and keeping the rest covered under a damp towel or paper towels, lay a phyllo sheet on a large cutting board or counter and lightly brush with melted butter. Lightly sprinkle with some of the spice mix and fold in half lengthwise.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Brush the top with more melted butter and cut into 1/2-inch-thick strips. Using 2 pieces of stuffed hot dogs per phyllo sheet, wrap half of the strips around each piece of hot dog to create a mummy look. Leave a small section of hot dog exposed towards the top so it looks like the top part of the face peeking out from the phyllo wrappings. Don't worry about frayed edges or tears-- it will add to the mummy look.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on the prepared baking sheet and repeat with the remaining phyllo, melted butter, spice mix and hot dogs. Remelt the butter if it cools down too much while forming the mummies.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'id': 21118, u'name': u'hot dogs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake until the phyllo is crisp and golden brown, about 25 minutes. If desired, dot ketchup or mustard eyes on each mummy using a toothpick and serve with extra sauces for dipping.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Gewurztraminer, and ros\xe9 Wine are my top picks for Hot Dogs. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. One wine you could try is Chateau Ste. Michelle Cold Creek Vineyard Riesling. It has 4.2 out of 5 stars and a bottle costs about 15 dollars.', u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u'The Cold Creek Riesling is made from 40-year-old vines which contribute fruit intensity and concentration. This is a ripe, lush style of Riesling with aromas of ripe peaches, dried apricots and spice notes. It displays beautiful ripe fruit flavors with a crisp finish. View More', u'title': u'Chateau Ste. Michelle Cold Creek Vineyard Riesling', u'price': u'$14.99', u'id': 438970, u'link': u'https://www.wine.com/product/chateau-ste-michelle-cold-creek-vineyard-riesling-2013/132851', u'imageUrl': u'https://spoonacular.com/productImages/438970-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u"Preheat the oven to 400 degrees F and line a rimmed baking sheet with parchment paper. Cut a slit in each hot dog piece and stuff with a slice of cheese. Set aside. Combine the salt, garlic powder and pepper in a small bowl.                          Working with one sheet of phyllo at a time and keeping the rest covered under a damp towel or paper towels, lay a phyllo sheet on a large cutting board or counter and lightly brush with melted butter. Lightly sprinkle with some of the spice mix and fold in half lengthwise. Brush the top with more melted butter and cut into 1/2-inch-thick strips. Using 2 pieces of stuffed hot dogs per phyllo sheet, wrap half of the strips around each piece of hot dog to create a mummy look. Leave a small section of hot dog exposed towards the top so it looks like the top part of the face peeking out from the phyllo wrappings. Don't worry about frayed edges or tears-- it will add to the mummy look.                          Place on the prepared baking sheet and repeat with the remaining phyllo, melted butter, spice mix and hot dogs. Remelt the butter if it cools down too much while forming the mummies.                          Bake until the phyllo is crisp and golden brown, about 25 minutes. If desired, dot ketchup or mustard eyes on each mummy using a toothpick and serve with extra sauces for dipping.", u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-phyllo-wrapped-hot-dog-mummies-294826', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}