{u'recipes': [{u'sourceName': u'Jelly Toast Blog', u'cuisines': [u'european', u'irish'], u'image': u'https://spoonacular.com/recipeImages/503695-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 503695, u'veryPopular': True, u'lowFodmap': False, u'title': u'guinness irish beef stew', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 199.51, u'creditText': u'Jelly Toast Blog', u'extendedIngredients': [{u'originalString': u'2 pounds beef chuck, cut into chunks', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 13786, u'unit': u'pounds'}, {u'originalString': u'4 medium carrots, peeled and diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'medium', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'12 oz Guinness Extra Stout', u'aisle': u'Alcoholic Beverages', u'name': u'guinness stout', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 93619, u'unit': u'oz'}, {u'originalString': u'4 cups low sodium beef broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium beef broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 10093741, u'unit': u'cups'}, {u'originalString': u'2 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 large potato, peeled and diced', u'aisle': u'Produce', u'name': u'potato', u'metaInformation': [u'diced', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 Tablespoons of Worcester sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6150, u'unit': u'Tablespoons'}, {u'originalString': u'4 oz tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11887, u'unit': u'oz'}, {u'originalString': u'2 turnips, peeled and diced', u'aisle': u'Produce', u'name': u'turnips', u'metaInformation': [u'diced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11564, u'unit': u''}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://jellytoastblog.com/2013/03/guinness-irish-beef-stew.html/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add half of the cubed beef to the pot. Brown beef on all sides (about 2-4 minutes) and remove to a plate. Repeat with remaining beef.To the pot, add onions and garlic. Stir around a bit to scrape up the brown bits and soften them a bit.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add tomato paste and stir around a bit more. Allow the tomato paste to become golden in places.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour in Guinness, beef broth and Worcestershire sauce and stir with a wooden spoon, scraping up all the brown bits from the bottom of the pot. Return the beef to the pot, including any juices from the plate. Bring stew to a boil and then cover the pot and reduce to a simmer. Allow beef to cook for 1 \xbd - 2 hours.After the 1 \xbd - 2 hours, add the carrots, turnips and potatoes to the pot. Allow the stew to simmer, covered, for 20-30 minutes more or until vegetables are tender. Adjust salt and pepper to taste.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'id': 93619, u'name': u'guinness'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'id': 11564, u'name': u'turnip'}]}, {u'equipment': [], u'step': u'Garnish with chopped parsley and serve.Enjoy!', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Malbec, and Shiraz are great choices for Beef Stew. These full-bodied red wines are the perfect accompaniment for hearty beef stew. The Anderra Cabernet Sauvignon with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'malbec', u'shiraz'], u'productMatches': [{u'description': u'Aromatic bouquet of spices and ripe red berries, such as black and red currants. On the palate, ripe, vibrant fruit, full body and smooth tannins. View More', u'title': u'Anderra Cabernet Sauvignon', u'price': u'$12.99', u'id': 466210, u'link': u'https://www.wine.com/product/anderra-cabernet-sauvignon-2012/124362', u'imageUrl': u'https://spoonacular.com/productImages/466210-312x231.jpg'}]}, u'aggregateLikes': 455, u'instructions': u'Directions:Season beef with salt and pepper.In a large Dutch Oven, heat oil over medium high heat. Add half of the cubed beef to the pot. Brown beef on all sides (about 2-4 minutes) and remove to a plate. Repeat with remaining beef.To the pot, add onions and garlic. Stir around a bit to scrape up the brown bits and soften them a bit. Add tomato paste and stir around a bit more. Allow the tomato paste to become golden in places.Pour in Guinness, beef broth and Worcestershire sauce and stir with a wooden spoon, scraping up all the brown bits from the bottom of the pot. Return the beef to the pot, including any juices from the plate. Bring stew to a boil and then cover the pot and reduce to a simmer. Allow beef to cook for 1 \xbd - 2 hours.After the 1 \xbd - 2 hours, add the carrots, turnips and potatoes to the pot. Allow the stew to simmer, covered, for 20-30 minutes more or until vegetables are tender. Adjust salt and pepper to taste.Garnish with chopped parsley and serve.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/guinness-irish-beef-stew-503695', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u"father's day", u'winter', u'st patricks day'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 165, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}