{u'recipes': [{u'sourceName': u'Natashas Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619357-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 7, u'id': 619357, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Gravy', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 19.2, u'creditText': u'Natashas Kitchen', u'extendedIngredients': [{u'originalString': u'3 Tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'\xbc cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 cups turkey drippings, skimmed of fat (add water or broth if needed to make 2 cups)', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 5165, u'unit': u'cups'}, {u'originalString': u'3 Tbsp fat drippings from roasted turkey', u'aisle': u'Meat', u'name': u'turkey fat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lard.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 4575, u'unit': u'Tbsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://natashaskitchen.com/2014/11/09/turkey-gravy-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Once your Thanksgiving turkey has been transferred from the roasting pan and is resting, make your turkey gravy. Strain all drippings from the turkey pan through a fine mesh sieve into a large measuring cup. Discard anything you catch in the sieve.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Let drippings in the measuring cup rest for a minute, the fat will float to the top and broth will sink to the bottom.Skim off 3 Tbsp of fat and transfer into a medium sauce pan (skim off and discard excess fat left in the measuring cup, making sure to keep the broth underneath). Set sauce pan over medium heat. Once oil is starting to sizzle, whisk in 3 Tbsp flour and stir until well combined. Continue whisking until mixture is starting to turn a light golden brown.Gradually pour remaining broth from drippings into your saucepan, whisking constantly. You should have about 2 cups of drippings left in the measuring cup after fat is removed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add more water or broth if needed to make 2 cups (I had to add  cup water). Bring to a light boil, whisking constantly.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add  cup milk for a creamier gravy and continue to simmer 5 min. Season with salt and pepper to taste if needed (mine was plenty flavorful without it).', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/gravy-boat.jpg', u'id': 405912, u'name': u'gravy boat'}], u'step': u'Remove from heat, cover with lid and keep warm until ready to serve, then transfer gravy to a gravy boat. It will thicken slightly as it cools.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over sliced turkey and mashed potatoes. Its truly wonderful.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 17, u'instructions': u'Once your Thanksgiving turkey has been transferred from the roasting pan and is resting, make your turkey gravy. Strain all drippings from the turkey pan through a fine mesh sieve into a large measuring cup. Discard anything you catch in the sieve. Let drippings in the measuring cup rest for a minute, the fat will float to the top and broth will sink to the bottom.Skim off 3 Tbsp of fat and transfer into a medium sauce pan (skim off and discard excess fat left in the measuring cup, making sure to keep the broth underneath). Set sauce pan over medium heat. Once oil is starting to sizzle, whisk in 3 Tbsp flour and stir until well combined. Continue whisking until mixture is starting to turn a light golden brown.Gradually pour remaining broth from drippings into your saucepan, whisking constantly. You should have about 2 cups of drippings left in the measuring cup after fat is removed. Add more water or broth if needed to make 2 cups (I had to add  cup water). Bring to a light boil, whisking constantly.Add  cup milk for a creamier gravy and continue to simmer 5 min. Season with salt and pepper to taste if needed (mine was plenty flavorful without it). Remove from heat, cover with lid and keep warm until ready to serve, then transfer gravy to a gravy boat. It will thicken slightly as it cools. Pour over sliced turkey and mashed potatoes. Its truly wonderful.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-gravy-619357', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}