{u'recipes': [{u'sourceName': u'Feast Asia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478319-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 478319, u'veryPopular': False, u'lowFodmap': False, u'title': u'Monggo con chicharon (mung bean stew with pork cracklings)', u'diets': [u'gluten free', u'dairy free', u'whole 30', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 76.43, u'creditText': u'Feast Asia', u'extendedIngredients': [{u'originalString': u'freshly ground black pepper, about half a teaspoonful', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 tbsps. of cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsps'}, {u'originalString': u'6 cloves of garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'chunky vegetables (eggplants, okra and squash are my recommendations), diced', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'diced', u'(eggplants, okra and squash are my recommendations)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11583, u'unit': u'servings'}, {u'originalString': u'1 onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'patis (fish sauce), to taste', u'aisle': u'Ethnic Foods', u'name': u'patis', u'metaInformation': [u'to taste', u'(fish sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'servings'}, {u'originalString': u'scrap pork bones (sold as soup bones in some groceries)', u'aisle': u'Meat', u'name': u'pork bones', u'metaInformation': [u'(sold as soup bones in some groceries)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-bones.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11811111, u'unit': u'servings'}, {u'originalString': u'2 tomatoes, diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'chicharon, as much as you like', u'aisle': u'?', u'name': u'chicharon', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'unit': u'servings'}, {u'originalString': u'150 g. of monggo (green or yellow, your choice)', u'aisle': u'?', u'name': u'monggo', u'metaInformation': [u'green', u'yellow', u'( or , your choice)'], u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'unit': u'g'}, {u'originalString': u'a generous handful of green leafy vegetables — spinach, kangkong (water / swamp spinach) or talbos ng kamote (sweet potato leaves)', u'aisle': u'?', u'name': u'talbos ng kamote', u'metaInformation': [u'green', u'(water / swamp spinach)', u'(sweet potato leaves)'], u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'unit': u'handful'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://feastasia.casaveneracion.com/monggo-con-chicharon-mung-bean-stew-pork-cracklings/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Boil the mung beans in about two cups of water for 10 minutes. Turn off the heat, cover the pan tightly and leave the mung beans to soak and swell for a couple of hours.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat about three tablespoonfuls of cooking oil in a pan and saute the garlic, onion, chilis and tomato, stirring often, until the vegetables start to soften.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pork bones to the pan and cook until no longer pink.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-bones.jpg', u'id': 11811111, u'name': u'pork bone'}]}, {u'equipment': [], u'step': u'Add the mung beans with the cooking liquid. Stir well.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add more water to make a rather thin mixture.Season with patis (fish sauce) and with freshly ground black pepper. Bring to the boil and simmer for about an hour or until the mung beans are mushy and the mixture has thickened. You will need to stir the pot every 15 minutes or so, scraping the bottom of the pan, to make sure that the mung beans do not settle and stick to the bottom.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}]}, {u'equipment': [], u'step': u'Add the chunky vegetables, stir and simmer for 10 minutes.Taste and adjust seasonings, if needed.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add the leafy vegetables and simmer for another five minutes.Taste one last time and adjust seasonings, if needed. Ladle into bowls. Sprinkle the chicharon on top. Alternatively, add the chicharon along with the leafy vegetables and allow to boil into the stew. Your choice, really.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Stew works really well with Cabernet Sauvignon, Chablis, and Malbec. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'imageUrl': u'https://spoonacular.com/productImages/469305-312x231.jpg', u'description': u'This wine starts with a bouquet of rich plum and wild berries. It has a concentrated flavor profile of black fruit with a hint of chocolate and brown spice. With notes that are complex, full-bodied and expansive on the palate, it ends with firm tannins and a dash of espresso. This wine is balanced, with a supple texture and approachable grip.', u'link': u'https://www.amazon.com/Volta-Cabernet-Sauvignon-Mission-Valley/dp/B00GNKJZ02', u'id': 469305, u'title': u'Volta Cabernet Sauvignon Mission Ridge'}]}, u'aggregateLikes': 30, u'instructions': u'InstructionsBoil the mung beans in about two cups of water for 10 minutes. Turn off the heat, cover the pan tightly and leave the mung beans to soak and swell for a couple of hours.Heat about three tablespoonfuls of cooking oil in a pan and saute the garlic, onion, chilis and tomato, stirring often, until the vegetables start to soften.Add the pork bones to the pan and cook until no longer pink.Add the mung beans with the cooking liquid. Stir well. Add more water to make a rather thin mixture.Season with patis (fish sauce) and with freshly ground black pepper. Bring to the boil and simmer for about an hour or until the mung beans are mushy and the mixture has thickened. You will need to stir the pot every 15 minutes or so, scraping the bottom of the pan, to make sure that the mung beans do not settle and stick to the bottom.Add the chunky vegetables, stir and simmer for 10 minutes.Taste and adjust seasonings, if needed. Add the leafy vegetables and simmer for another five minutes.Taste one last time and adjust seasonings, if needed. Ladle into bowls. Sprinkle the chicharon on top. Alternatively, add the chicharon along with the leafy vegetables and allow to boil into the stew. Your choice, really.', u'spoonacularSourceUrl': u'https://spoonacular.com/monggo-con-chicharon-mung-bean-stew-with-pork-cracklings-478319', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}