{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520672-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 520672, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramel Corn Chocolate Chip Cookies', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 62.4, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3 cups caramel corn', u'aisle': u'Sweet Snacks', u'name': u'Caramel Corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caramel-popcorn.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19039, u'unit': u'cups'}, {u'originalString': u'1 teaspoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoon'}, {u'originalString': u'1 large egg, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2/3 cup light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'pinch salt, optional and to taste (some caramel corn is already well-salted, something to consider before salting the dough)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'(some caramel corn is already well-salted, something to consider before salting the dough)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 cup semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1/2 cup unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.averiecooks.com/2013/02/caramel-corn-chocolate-chip-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the caramel corn, chocolate chips, and beat for just a couple seconds to incorporat, but don’t overmix and break those pretty kernels. Using a medium cookie scoop (or use your hands and roll the dough into tightly packed balls), form mounds weighing 1.40 to 1.50 ounces each, about two heaping tablespoons each; I made 20 cookies. The mounds will look large because the caramel corn bulks the dough without adding much mass so they look bigger raw than they bake into.It’ll seem that there are more add-ins than dough, and that there’s no way all this caramel corn and chocolate chips will stay bound together with this paltry amount of dough, but they do. Using your hands as necessary, press all the caramel corn and chocolate chips in, and firmly squeeze the mounds of dough, or roll them between your hands as necessary to get everything to stick together. Slightly flatten the mounds so they don’t stay too domed and puffed while baking, just don’t over-flatten.The dough must be chilled before baking, so place mounds on a large plate, cover with plastic wrap, and refrigerate for at least 2 hours, or up to 5 days, before baking. Unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future as desired.Preheat oven to 350F, line two baking sheets with Silpat Non-Stick Baking Mats, place dough on trays spaced 2 inches apart, and bake for 8 to 10 minutes, or until edges are set and tops are barely set. Even if they’re pale, glossy, and slightly under-baked in the center, this is okay and they’ll firm up as they cool. Watch them closely after 7 minutes, and I recommend the lower end of the baking range, and not exceeding 10 minutes.Baking too long results in cookies that become too crisp and hard, with caramel corn and undersides that will become too browned. The cookies shown in the photos were baked for 8 to 9 minutes depending on the batch (I preferred the 8 minute cookies), with trays rotated halfway through baking. They were quite glossy and\xa0translucent at 8 to 9 minutes, but I pulled them out anyway and as they cooled, the warm dough shrank down and clung tightly to chunks of caramel corn.I brought the cookies to my daughter’s birthday party and men, women, toddlers, teenagers, and strangers from a neighboring party in the park came over to our table requesting cookies. Word got out in the park about them and they were a hot item, even seeming to trump the birthday cakes from either party. Although I made a strawberry cake with strawberry frosting and sprinkles per my princess’ request that wasn’t too shabby.People would take a bite of a cookie, lock eyes with someone else who was eating one, and were proclaiming things like ohmygodthesearesogood. I love bringing food to parties and watching people’s honest reactions when they don’t know who made what and I observe those reactions like a fly on the wall.They’re sweet with a little bit of saltiness from the caramel corn, although not a true sweet-and-salty treat. But you can make them that way with a finishing sprinkle of coarse sea salt. As it bakes, the caramel corn turns from crunchy and crisp into soft and chewy. The caramel sauce that coats the corn melts off a bit, creating puddles of caramel amidst chocolate.The idea of stuffing as much chocolate as possible into cookie dough is something I did with the New York Times Chocolate Chips Cookies and repeated it here. Chocolate oozes everywhere and is a rich, dark, flood that blankets the pieces of caramel corn and contrasts beautifully against the buttery, vanilla-twinged dough.', u'length': {u'number': 49, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'coarse sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caramel-popcorn.jpg', u'id': 19039, u'name': u'caramel popcorn'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Caramel Popcorn on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 103, u'instructions': u'Add the caramel corn, chocolate chips, and beat for just a couple seconds to incorporat, but don’t overmix and break those pretty kernels. Using a medium cookie scoop (or use your hands and roll the dough into tightly packed balls), form mounds weighing 1.40 to 1.50 ounces each, about two heaping tablespoons each; I made 20 cookies. The mounds will look large because the caramel corn bulks the dough without adding much mass so they look bigger raw than they bake into.It’ll seem that there are more add-ins than dough, and that there’s no way all this caramel corn and chocolate chips will stay bound together with this paltry amount of dough, but they do. Using your hands as necessary, press all the caramel corn and chocolate chips in, and firmly squeeze the mounds of dough, or roll them between your hands as necessary to get everything to stick together. Slightly flatten the mounds so they don’t stay too domed and puffed while baking, just don’t over-flatten.The dough must be chilled before baking, so place mounds on a large plate, cover with plastic wrap, and refrigerate for at least 2 hours, or up to 5 days, before baking. Unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future as desired.Preheat oven to 350F, line two baking sheets with Silpat Non-Stick Baking Mats, place dough on trays spaced 2 inches apart, and bake for 8 to 10 minutes, or until edges are set and tops are barely set. Even if they’re pale, glossy, and slightly under-baked in the center, this is okay and they’ll firm up as they cool. Watch them closely after 7 minutes, and I recommend the lower end of the baking range, and not exceeding 10 minutes.Baking too long results in cookies that become too crisp and hard, with caramel corn and undersides that will become too browned. The cookies shown in the photos were baked for 8 to 9 minutes depending on the batch (I preferred the 8 minute cookies), with trays rotated halfway through baking. They were quite glossy and\xa0translucent at 8 to 9 minutes, but I pulled them out anyway and as they cooled, the warm dough shrank down and clung tightly to chunks of caramel corn.I brought the cookies to my daughter’s birthday party and men, women, toddlers, teenagers, and strangers from a neighboring party in the park came over to our table requesting cookies. Word got out in the park about them and they were a hot item, even seeming to trump the birthday cakes from either party. Although I made a strawberry cake with strawberry frosting and sprinkles per my princess’ request that wasn’t too shabby.People would take a bite of a cookie, lock eyes with someone else who was eating one, and were proclaiming things like ohmygodthesearesogood. I love bringing food to parties and watching people’s honest reactions when they don’t know who made what and I observe those reactions like a fly on the wall.They’re sweet with a little bit of saltiness from the caramel corn, although not a true sweet-and-salty treat. But you can make them that way with a finishing sprinkle of coarse sea salt. As it bakes, the caramel corn turns from crunchy and crisp into soft and chewy. The caramel sauce that coats the corn melts off a bit, creating puddles of caramel amidst chocolate.The idea of stuffing as much chocolate as possible into cookie dough is something I did with the New York Times Chocolate Chips Cookies and repeated it here. Chocolate oozes everywhere and is a rich, dark, flood that blankets the pieces of caramel corn and contrasts beautifully against the buttery, vanilla-twinged dough.', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-corn-chocolate-chip-cookies-520672', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}