{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/607303-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 607303, u'veryPopular': False, u'lowFodmap': False, u'title': u'Thai-Style Grilled Chicken (Gai Yang)', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 218.61, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 whole chicken, spine removed, split in half along the breast bone', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'whole', u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1025006, u'unit': u''}, {u'originalString': u'12 sprigs cilantro, including thick stalks', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 12.0, u'consistency': u'solid', u'id': 11165, u'unit': u'sprigs'}, {u'originalString': u'2 tablespoons fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoons'}, {u'originalString': u'6 medium cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons ground white pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoons'}, {u'originalString': u'2 (3-inch) segments lemongrass (optional)', u'aisle': u'Produce;Ethnic Foods', u'name': u'lemongrass', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 6.0, u'consistency': u'solid', u'id': 11972, u'unit': u'inch'}, {u'originalString': u'3 tablespoons palm or light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons dark soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoons'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/07/thai-style-grilled-chicken-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine garlic, cilantro, sugar, white pepper, coriander, fish sauce, dark soy sauce, and lemongrass (if using) in the bowl of a food processor. Process until a rough paste is formed. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'id': 11972, u'name': u'lemon grass'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/skewer-metal.jpg', u'id': 404712, u'name': u'metal skewers'}], u'step': u'Place chicken halves flat on a cutting board. Insert two metal skewers into each chicken, running parallel through the legs and the breasts.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Transfer chicken to a casserole dish that just fits them. Rub on all surfaces with marinade. Cover, transfer to refrigerator, and allow to marinate for at least 2 hours and up to over night.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'When ready to cook, light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place chicken skin-side up on cooler side of grill with legs facing towards hotter side. Cover grill with vents on lid open and aligned over the chicken. Open bottom vents of grill. Cook until instant read thermometer inserted into deepest part of breast registers 140\xb0F, about 45 minutes. Carefully flip chicken and place skin-side-down on hotter side of grill with breasts pointed towards cooler side. Cover and cook until skin is crisp and instant read thermometer inserted into deepest part of breast registers 145 to 150\xb0F, about 3 minutes longer (be careful, the skin is very prone to burning). If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature or chicken will burn.', u'length': {u'number': 48, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'5', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Transfer chicken to a cutting board and allow to rest for 5 minutes. Carve and serve with dipping sauce.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 156, u'instructions': u'Procedures                                                          1                                                                                                                                                                                                   Combine garlic, cilantro, sugar, white pepper, coriander, fish sauce, dark soy sauce, and lemongrass (if using) in the bowl of a food processor. Process until a rough paste is formed. Set aside.                                                                                    2                                                                                                                                                                                                   Place chicken halves flat on a cutting board. Insert two metal skewers into each chicken, running parallel through the legs and the breasts. Transfer chicken to a casserole dish that just fits them. Rub on all surfaces with marinade. Cover, transfer to refrigerator, and allow to marinate for at least 2 hours and up to over night.                                                                                    3                                                                                                                                                                                                   When ready to cook, light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate.                                                                                    4                                                                                                                                                                                                   Place chicken skin-side up on cooler side of grill with legs facing towards hotter side. Cover grill with vents on lid open and aligned over the chicken. Open bottom vents of grill. Cook until instant read thermometer inserted into deepest part of breast registers 140\xb0F, about 45 minutes. Carefully flip chicken and place skin-side-down on hotter side of grill with breasts pointed towards cooler side. Cover and cook until skin is crisp and instant read thermometer inserted into deepest part of breast registers 145 to 150\xb0F, about 3 minutes longer (be careful, the skin is very prone to burning). If chicken threatens to burn before temperature is achieved, carefully slide to cooler side of grill, cover, and continue to cook until done. Do not leave the lid off for longer than it takes to check temperature or chicken will burn.                                                                                    5                                                                                                                                                                                                   Transfer chicken to a cutting board and allow to rest for 5 minutes. Carve and serve with dipping sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-style-grilled-chicken-gai-yang-607303', u'dishTypes': [], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}