{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/666155-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 666155, u'veryPopular': False, u'lowFodmap': False, u'title': u'Thyme for a Salty Dog', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 272.0, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 tablespoon coarse salt, for glass rim', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [u'for glass rim'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'3 ounces freshly squeezed pink grapefruit juice from 1 grapefruit', u'aisle': u'Beverages', u'name': u'grapefruit juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grapefruit-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 98926, u'unit': u'ounces'}, {u'originalString': u'1/2 ounce freshly squeezed juice from 1 lime', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'ounce'}, {u'originalString': u'1 lime wedge', u'aisle': u'Produce', u'name': u'lime wedge', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1/2 ounce Thyme Simple Syrup', u'aisle': u'Alcoholic Beverages', u'name': u'simple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'liquid', u'id': 90480, u'unit': u'ounce'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'8 sprigs thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 8.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'Lime wheels or thyme sprigs for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thyme sprigs', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprig', u'unitShort': u'sprigs', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'2 ounces vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 14051, u'unit': u'ounces'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2015/04/salty-dog-brunch-drink-with-herbs-thyme-easy-cocktail.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'For the Thyme Simple Syrup: In a small saucepan, combine sugar and water. Stir over medium heat until sugar is dissolved.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 90480, u'name': u'simple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from heat, add thyme, and allow to steep 15 minutes. Strain into airtight container. Thyme Simple Syrup can be refrigerated for up to 1 week.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 90480, u'name': u'simple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Pour salt on a small saucer. Run lime wedge around the outer rim of a Collins glass and roll glass in salt to coat outside rim. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'3', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Combine grapefruit juice, vodka, lime juice, and thyme syrup in cocktail shaker. Fill shaker with ice. Shake until well chilled, about 15 seconds. Fill salt-rimmed Collins glass with fresh ice and strain cocktail into glass.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grapefruit-juice.jpg', u'id': 98926, u'name': u'grapefruit juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'id': 14051, u'name': u'vodka'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Garnish with thyme or lime if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}], u'name': u'For the Cocktail'}], u'aggregateLikes': 46, u'instructions': u'Procedures                                                          1                                              For the Thyme Simple Syrup: In a small saucepan, combine sugar and water. Stir over medium heat until sugar is dissolved. Remove from heat, add thyme, and allow to steep 15 minutes. Strain into airtight container. Thyme Simple Syrup can be refrigerated for up to 1 week.                                                                                     2                                              For the Cocktail: Pour salt on a small saucer. Run lime wedge around the outer rim of a Collins glass and roll glass in salt to coat outside rim. Set aside.                                                                                     3                                              Combine grapefruit juice, vodka, lime juice, and thyme syrup in cocktail shaker. Fill shaker with ice. Shake until well chilled, about 15 seconds. Fill salt-rimmed Collins glass with fresh ice and strain cocktail into glass. Garnish with thyme or lime if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/thyme-for-a-salty-dog-666155', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}