{u'recipes': [{u'sourceName': u'Cinnamon Spice and Everything Nice', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/491928-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 491928, u'veryPopular': True, u'lowFodmap': False, u'title': u'Flour Bakery’s Aged Chocolate Chip Cookies', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 53.24, u'creditText': u'Cinnamon Spice and Everything Nice', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 \xbc cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbe cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbe cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbd cup finely chopped milk chocolate', u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19081, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 \xbd cups chopped semisweet chocolate', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 19903, u'unit': u'cups'}, {u'originalString': u'1 cup unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2/3 cup walnuts, chopped, optional', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.cinnamonspiceandeverythingnice.com/joanne-changs-chocolate-chip-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F. making sure oven rack is in the middle of your oven. Use a stand mixer with a paddle attachment or alternately you can mix by hand. Beat butter and both sugars together on medium speed until light and fluffy about 5 minutes, stopping to scrap down the bowl a few times. Beat in eggs and vanilla extract until thoroughly combined, two to three minutes on medium speed, scraping down the bowl again.In a separate bowl mix both flours, baking soda and salt together.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add both chocolates and walnuts, if using, toss to combine. Turn the mixer on low speed (or continue to use a wooden spoon if mixing by hand) and add flour mixture slowly mixing until completely incorporated. Refrigerate dough, covered, for 1-2 hours. (If making the next day, store dough in tightly covered container in the refrigerator.)Drop dough in \xbc-cup balls onto a baking sheet about two inches apart, pressing them down slightly with your palm.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake until cookies are golden brown on the edges and slightly soft in the center, 15 to 18 minutes. Repeat until all cookies are baked! If you only have one baking sheet allow to cool before making the next batch – you can run it under cold water.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from oven and let cool on pan 5 minutes, remove to wire racks and cool completely. Once cooled, store cookies in an airtight container for up to three days and unbaked dough in an airtight container for up to a week in the fridge.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 651, u'instructions': u'Preheat the oven to 350 degrees F. making sure oven rack is in the middle of your oven. Use a stand mixer with a paddle attachment or alternately you can mix by hand. Beat butter and both sugars together on medium speed until light and fluffy about 5 minutes, stopping to scrap down the bowl a few times. Beat in eggs and vanilla extract until thoroughly combined, two to three minutes on medium speed, scraping down the bowl again.In a separate bowl mix both flours, baking soda and salt together. Add both chocolates and walnuts, if using, toss to combine. Turn the mixer on low speed (or continue to use a wooden spoon if mixing by hand) and add flour mixture slowly mixing until completely incorporated. Refrigerate dough, covered, for 1-2 hours. (If making the next day, store dough in tightly covered container in the refrigerator.)Drop dough in \xbc-cup balls onto a baking sheet about two inches apart, pressing them down slightly with your palm. Bake until cookies are golden brown on the edges and slightly soft in the center, 15 to 18 minutes. Repeat until all cookies are baked! If you only have one baking sheet allow to cool before making the next batch – you can run it under cold water. Remove from oven and let cool on pan 5 minutes, remove to wire racks and cool completely. Once cooled, store cookies in an airtight container for up to three days and unbaked dough in an airtight container for up to a week in the fridge.', u'spoonacularSourceUrl': u'https://spoonacular.com/flour-bakerys-aged-chocolate-chip-cookies-491928', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 43, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}