{u'recipes': [{u'sourceName': u'Cookin Canuck', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/584723-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 584723, u'veryPopular': True, u'lowFodmap': False, u'title': u'Nutella & Sea Salt Stuffed Sugar Cookie', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 22.5, u'creditText': u'Cookin Canuck', u'extendedIngredients': [{u'originalString': u'1/2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups plus 1/3 cup granulated sugar, divided', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1/2 cup Nutella (chocolate-hazelnut spread)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [u'(chocolate-hazelnut spread)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19125, u'unit': u'cup'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tbsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tbsp'}, {u'originalString': u'14 tbsp (1 3/4 sticks) unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'(1 3/4 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 14.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.cookincanuck.com/2011/12/nutella-sea-salt-stuffed-sugar-cookie-recipe-oxo-baking-giveaway/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Using a 1 teaspoon measure, scoop out Nutella and place in small mounds on a cookie sheet lined with parchment paper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}, {u'equipment': [], u'step': u'Place in the freezer for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place an oven rack in the middle position and preheat the oven to 350 degrees F.  Line 2 large baking sheets with parchment paper.In a medium bowl, whisk together flour, baking powder, and salt.In a large bowl, beat butter and 1 1/2 cups granulated sugar with an electric mixer set on medium speed until the mixture is creamy and fluffy, 3 to 5 minutes.  Beat in the eggs, one at a time, and the vanilla extract.Turn the mixer to low speed and gradually beat in the flour mixture until it is just combined.  Using a rubber spatula, stir the mixture a few times to make sure all of the flour mixture is incorporated.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place 1/3 cup granulated sugar in a small bowl.  Use 2 tablespoons cookie dough for each cookie.  Split the piece of dough in half and slightly flatten the bottom half. Sprinkle 5 or 6 grains of sea salt on the flattened dough. Use a small metal spatula to lift the mounds of Nutella from the baking sheet and lay on the bottom half of cookie dough, on top of the salt.  If the Nutella starts to soften, place back in the freezer for a few minutes.  Cover Nutella with the other piece of cookie dough.  Seal the edges with your fingers.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll the ball in the sugar to coat it and place it on a prepared baking sheet.Repeat with the remaining dough and Nutella mounds, spacing the cookies about 2 inches apart from each other on the baking sheets.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Bake the cookies, one sheet a time, rotating from front to back halfway through baking.  They are done when the edges are set and beginning to brown, 10 to 13 minutes.  The centers of the cookies should still be soft and puffy.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the cookies from the oven and let them cool on the baking sheet for 10 minutes.  Using a spatula, remove the cookies from the baking sheet and let cool on a rack.  They can also be served warm.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 26314, u'instructions': u'Using a 1 teaspoon measure, scoop out Nutella and place in small mounds on a cookie sheet lined with parchment paper.  Place in the freezer for 15 minutes.Place an oven rack in the middle position and preheat the oven to 350 degrees F.  Line 2 large baking sheets with parchment paper.In a medium bowl, whisk together flour, baking powder, and salt.In a large bowl, beat butter and 1 1/2 cups granulated sugar with an electric mixer set on medium speed until the mixture is creamy and fluffy, 3 to 5 minutes.  Beat in the eggs, one at a time, and the vanilla extract.Turn the mixer to low speed and gradually beat in the flour mixture until it is just combined.  Using a rubber spatula, stir the mixture a few times to make sure all of the flour mixture is incorporated.Place 1/3 cup granulated sugar in a small bowl.  Use 2 tablespoons cookie dough for each cookie.  Split the piece of dough in half and slightly flatten the bottom half. Sprinkle 5 or 6 grains of sea salt on the flattened dough. Use a small metal spatula to lift the mounds of Nutella from the baking sheet and lay on the bottom half of cookie dough, on top of the salt.  If the Nutella starts to soften, place back in the freezer for a few minutes.  Cover Nutella with the other piece of cookie dough.  Seal the edges with your fingers.  Roll the ball in the sugar to coat it and place it on a prepared baking sheet.Repeat with the remaining dough and Nutella mounds, spacing the cookies about 2 inches apart from each other on the baking sheets.  Bake the cookies, one sheet a time, rotating from front to back halfway through baking.  They are done when the edges are set and beginning to brown, 10 to 13 minutes.  The centers of the cookies should still be soft and puffy.  Remove the cookies from the oven and let them cool on the baking sheet for 10 minutes.  Using a spatula, remove the cookies from the baking sheet and let cool on a rack.  They can also be served warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/nutella-sea-salt-stuffed-sugar-cookie-584723', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}