{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/763026-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 85, u'id': 763026, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lamb Ragu with Potato Gnocchi: Pasticcio di Agnello con Gnocchi di Patate', u'diets': [u'gluten free'], u'preparationMinutes': 60, u'pricePerServing': 371.02, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 2/3 cups dry red wine (recommended: Montepulciano)', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red', u'(recommended: Montepulciano)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.6666666666666665, u'consistency': u'liquid', u'id': 14097, u'unit': u'cups'}, {u'originalString': u'1 small eggplant', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'1 sprig fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprig', u'unitShort': u'sprig', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'sprig'}, {u'originalString': u'2 medium cloves garlic, peeled and smashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'medium', u'peeled', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 pound potatoes Idaho or russet (about 3 to 4 medium to large potatoes)', u'aisle': u'Produce', u'name': u'idaho potatoes', u'metaInformation': [u'medium to large', u'( 3 to 4 potatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u'pound'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 pounds boned leg of lamb, trimmed and cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'leg of lamb', u'metaInformation': [u'trimmed', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leg-of-lamb.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 17013, u'unit': u'pounds'}, {u'originalString': u'2 teaspoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'5 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'6 ounces Pecorino Romano (4 ounces grated and the rest broken into medium to large pieces )', u'aisle': u'Cheese', u'name': u'pecorino romano', u'metaInformation': [u'medium to large', u'grated', u'(4 ounces and the rest broken into pieces )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1038, u'unit': u'ounces'}, {u'originalString': u'1/4 cup purified water', u'aisle': u'Beverages', u'name': u'purified water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'Pinch salt, plus 1/2 tablespoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 cup lamb or veal stock', u'aisle': u'Canned and Jarred', u'name': u'veal stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'cup'}, {u'originalString': u'1/2 large yellow onion, sliced thinly', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 23.0, u'imageType': u'jpeg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/lamb-ragu-with-potato-gnocchi-pasticcio-di-agnello-con-gnocchi-di-patate-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare the gnocchi according to the recipe. Keep the gnocchi covered and refrigerated until ready to use.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Combine the lamb, onion, bay leaves, garlic, and rosemary in a roasting pan (see Cooks Note for clay roasting alternative).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drizzle the lamb mixture with 2 to 3 tablespoons of the olive oil, season with salt and pepper and mix well.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Roast the lamb turning it after about 20 minutes. Cook until the meat begins to brown, about 40 minutes.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the wine and stock, stir to coat, then reduce the oven temperature to 350 degrees F. Braise until the lamb is tender and cooked through, about 30 minutes more.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Meanwhile, peel and trim the eggplant then cut it into -inch cubes.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining 2 tablespoons of olive oil in a large cast iron skillet over medium-high heat. Fry the eggplant, turning it frequently, until golden.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the eggplant from the skillet using a slotted spoon. Allow the eggplant to drain on a plate lined with paper towels.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the eggplant and the gnocchi to the lamb stew. Top the stew with both the grated and broken pieces of Pecorino Romano cheese. Return the pot to the oven and cook until the liquid has reduced and is thickened by the melted cheese, about 15 minutes more.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'pecorino romano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the lamb from the oven and allow the stew to rest for 10 minutes. Spoon lamb with gnocchi, eggplant and sauce into warm bowls and serve.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the potatoes in a medium size saucepan.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add a pinch of salt and enough water to cover the potatoes by 2 inches. Bring the contents of the pot to a boil over high heat. Reduce the temperature and simmer until the potatoes are tender, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain the potatoes and allow them to cool just enough to handle. Peel, then mash or rice them.', u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Place the flour and the salt in a mixing bowl.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add the warm smoothly mashed potatoes. Using a wooden spoon, mix the ingredients together.', u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle the potato dough with olive oil and 1/4-cup of water.', u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Mix well, incorporating all of the ingredients and forming a smooth ball. Set the dough aside for 10 minutes to relax.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 18, u'ingredients': []}, {u'equipment': [], u'step': u'Working on a floured surface, divide the dough into 8 equal pieces.', u'number': 19, u'ingredients': []}, {u'equipment': [], u'step': u'Roll each portion of dough into a rope about 1/2-inch in diameter.', u'number': 20, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each rope into 1/4-inch pieces. Shape each piece of dough into a small ball.', u'number': 21, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll the dough balls over the tines of a fork then set them aside on a lightly floured baking sheet.', u'number': 22, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring 6 quarts of salted water to a boil over high heat. Reduce the heat so that the water is at a simmer. Working in batches, add gnocchi to the pot (shaking off any excess flour). Stir gently and cook the gnocchi until they float then remove them with a slotted spoon. They can be dressed and served at this point or chilled in an ice bath, drained then dressed with a little olive oil if they are to be held for several hours. Once cooked gnocchi can be stored in the refrigerator but should be eaten the same day they are made.', u'number': 23, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are my top picks for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Felsina Chianti Colli Senesi. It has 4.1 out of 5 stars and a bottle costs about 21 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and  mellow on the palate, with a delightful finish of red fruit and vanilla. View More', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 183, u'instructions': u'Prepare the gnocchi according to the recipe. Keep the gnocchi covered and refrigerated until ready to use.                          Preheat the oven to 400 degrees F.                          Combine the lamb, onion, bay leaves, garlic, and rosemary in a roasting pan (see Cooks Note for clay roasting alternative). Drizzle the lamb mixture with 2 to 3 tablespoons of the olive oil, season with salt and pepper and mix well.                          Roast the lamb turning it after about 20 minutes. Cook until the meat begins to brown, about 40 minutes. Add the wine and stock, stir to coat, then reduce the oven temperature to 350 degrees F. Braise until the lamb is tender and cooked through, about 30 minutes more.                          Meanwhile, peel and trim the eggplant then cut it into -inch cubes. Heat the remaining 2 tablespoons of olive oil in a large cast iron skillet over medium-high heat. Fry the eggplant, turning it frequently, until golden. Remove the eggplant from the skillet using a slotted spoon. Allow the eggplant to drain on a plate lined with paper towels.                          Add the eggplant and the gnocchi to the lamb stew. Top the stew with both the grated and broken pieces of Pecorino Romano cheese. Return the pot to the oven and cook until the liquid has reduced and is thickened by the melted cheese, about 15 minutes more.                          Remove the lamb from the oven and allow the stew to rest for 10 minutes. Spoon lamb with gnocchi, eggplant and sauce into warm bowls and serve.                          Place the potatoes in a medium size saucepan. Add a pinch of salt and enough water to cover the potatoes by 2 inches. Bring the contents of the pot to a boil over high heat. Reduce the temperature and simmer until the potatoes are tender, about 30 minutes. Drain the potatoes and allow them to cool just enough to handle. Peel, then mash or rice them.                          Place the flour and the salt in a mixing bowl. Add the warm smoothly mashed potatoes. Using a wooden spoon, mix the ingredients together. Drizzle the potato dough with olive oil and 1/4-cup of water. Mix well, incorporating all of the ingredients and forming a smooth ball. Set the dough aside for 10 minutes to relax.                          Working on a floured surface, divide the dough into 8 equal pieces. Roll each portion of dough into a rope about 1/2-inch in diameter. Cut each rope into 1/4-inch pieces. Shape each piece of dough into a small ball. Roll the dough balls over the tines of a fork then set them aside on a lightly floured baking sheet.                          Bring 6 quarts of salted water to a boil over high heat. Reduce the heat so that the water is at a simmer. Working in batches, add gnocchi to the pot (shaking off any excess flour). Stir gently and cook the gnocchi until they float then remove them with a slotted spoon. They can be dressed and served at this point or chilled in an ice bath, drained then dressed with a little olive oil if they are to be held for several hours. Once cooked gnocchi can be stored in the refrigerator but should be eaten the same day they are made.', u'spoonacularSourceUrl': u'https://spoonacular.com/lamb-ragu-with-potato-gnocchi-pasticcio-di-agnello-con-gnocchi-di-patate-763026', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 145, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}