{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/392572-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 392572, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Nachos', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 32.55, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (10-3/4 ounces) condensed cheddar cheese soup, undiluted', u'aisle': u'Canned and Jarred', u'name': u'cheddar cheese soup', u'metaInformation': [u'undiluted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese-soup.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 6038, u'unit': u'ounces'}, {u'originalString': u'3/4 cup salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'Tortilla chips', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 32.0, u'consistency': u'solid', u'id': 19056, u'unit': u'servings'}, {u'originalString': u'1 cup cubed cooked turkey or chicken', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'cubed', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 5165, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/turkey-nachos', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, combine soup and salsa. Bring to a boil. Reduce heat; stir in turkey; cook until heated through.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Serve warm with tortilla chips.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood on the menu? Try pairing with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Mumm Napa Cuvee M. It has 4.1 out of 5 stars and a bottle costs about 20 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"The naturally ripened fruit selected from more than 50 separate vineyards, reveals layers of crisp and creamy textures that are rich and lingering. Individually selected lots were kept separate during initial fermentation in order to highlight their vineyard differences and extract the quintessence of their specific strengths. The resulting blend is a soft and elegant wine that highlights the delicious and powerful ripe fruit flavors that characterize the world-class grapes of the Napa Valley.Cuv\xe9e M exhibits a graceful stream of very fine bubbles gently rising to a persistent mousse cordon with a light peach rose color. The aromas are elegant, rich and complex, showing fresh white and yellow stone fruits with subtle hints of wild strawberry. A light touch of fresh brioche, with hints of vanilla and honey add to the wine's complex bouquet. On the palate, full flavors of peach and pear combine with a creamy caramel character, which lingers into a long satisfying finish.Mumm Napa's Cuv\xe9e M is the perfect sparkling wine for champagne cocktails or as an ap\xe9ritif to pair with hors d'oeuvres. It is also a perfect match with creamy desserts and spicy foods. View More", u'title': u'Mumm Napa Cuvee M', u'price': u'$19.99', u'id': 451872, u'link': u'https://www.wine.com/product/mumm-napa-cuvee-m/80229', u'imageUrl': u'https://spoonacular.com/productImages/451872-312x231.jpg'}]}, u'aggregateLikes': 67, u'instructions': u'Directions                                                                                In a small saucepan, combine soup and salsa. Bring to a boil. Reduce heat; stir in turkey; cook until heated through. Serve warm with tortilla chips.                                        Yield: About 2 cups.                                                                                                                         Originally published as Turkey Nachos in  Quick CookingNovember/December 1998, p10                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (2 tablespoons) equals 16 calories, 1 g fat (trace saturated fat), 4 mg cholesterol, 102 mg sodium, 1 g carbohydrate, trace fiber, 2 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-nachos-392572', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 32, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}