{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/798258-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 798258, u'veryPopular': False, u'lowFodmap': False, u'title': u'Banana Split Cupcakes', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 93.79, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'3 medium bananas, mashed', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'medium', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'\xbe cup butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'\xbe cup Crisco\xae All-Vegetable Butter Flavor Shortening Sticks', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'butter flavor vegetable shortening', u'metaInformation': [u'crisco\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'6 tablespoons buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1230, u'unit': u'tablespoons'}, {u'originalString': u'1\xbd teaspoons corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 19350, u'unit': u'teaspoons'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups Pillsbury All-Purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbe cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbc cup heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 tablespoon heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoon'}, {u'originalString': u'18 maraschino cherries', u'aisle': u'Canned and Jarred', u'name': u'maraschino cherries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maraschino.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 18.0, u'consistency': u'solid', u'id': 9328, u'unit': u''}, {u'originalString': u'3\xbe cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.75, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'\xbc cup salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 oz semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'oz'}, {u'originalString': u'sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 18.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'2 tablespoons strawberry jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'strawberry jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10819297, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.tasteandtellblog.com/banana-split-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 300F. Line 18 muffin tins with cupcake wrappers.In the bowl of a stand mixer, beat the Crisco shortening and the sugar together very well, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'crisco'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the mashed bananas, then mix in the eggs, one at a time, scraping down the sides of the bowl as needed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the salt and baking soda, then mix in the flour.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour in the buttermilk and beat just until everything is combined.Divide the batter evenly between the prepared cupcake wrappers.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the preheated oven until a tester inserted in the center comes out clean, 20-25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let the cupcakes cool completely.In the bowl of a stand mixer, beat the Crisco shortening and the butter together until light and creamy, about 2 minutes. Slowly beat in the powdered sugar until combined, then beat in the salt.Divide the mixture in half and transfer half into a second bowl. To the first bowl, add the whipping cream and the vanilla extract. Continue to beat until light and fluffy.To the second bowl, add the strawberry jam and beat until combined and light and fluffy.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 10819297, u'name': u'strawberry jam'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'crisco'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add a few drops of red food coloring, if desired.To decorate the cupcakes, place the vanilla in a piping bag and the strawberry frosting in a separate piping bag.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Place both of the bags in a larger piping bag fitted with a decorative tip. Swirl the frosting on top of the cooled cupcakes.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the cream in a small bowl and microwave until just boiling.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the chocolate chips and let the mixture sit for a minute or two. Stir until the chocolate is completely melted and the mixture is smooth. Stir in the corn syrup.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}]}, {u'equipment': [], u'step': u'Drizzle some of the ganache over the tops of the cupcakes. Immediately add sprinkles and a maraschino cherry to the top.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maraschino.jpg', u'id': 9328, u'name': u'maraschino cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 59, u'instructions': u'Preheat the oven to 300F. Line 18 muffin tins with cupcake wrappers.In the bowl of a stand mixer, beat the Crisco shortening and the sugar together very well, about 2 minutes. Add the mashed bananas, then mix in the eggs, one at a time, scraping down the sides of the bowl as needed.Add the salt and baking soda, then mix in the flour. Pour in the buttermilk and beat just until everything is combined.Divide the batter evenly between the prepared cupcake wrappers. Bake in the preheated oven until a tester inserted in the center comes out clean, 20-25 minutes. Let the cupcakes cool completely.In the bowl of a stand mixer, beat the Crisco shortening and the butter together until light and creamy, about 2 minutes. Slowly beat in the powdered sugar until combined, then beat in the salt.Divide the mixture in half and transfer half into a second bowl. To the first bowl, add the whipping cream and the vanilla extract. Continue to beat until light and fluffy.To the second bowl, add the strawberry jam and beat until combined and light and fluffy. Add a few drops of red food coloring, if desired.To decorate the cupcakes, place the vanilla in a piping bag and the strawberry frosting in a separate piping bag. Place both of the bags in a larger piping bag fitted with a decorative tip. Swirl the frosting on top of the cooled cupcakes.Place the cream in a small bowl and microwave until just boiling. Add the chocolate chips and let the mixture sit for a minute or two. Stir until the chocolate is completely melted and the mixture is smooth. Stir in the corn syrup.Drizzle some of the ganache over the tops of the cupcakes. Immediately add sprinkles and a maraschino cherry to the top.', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-split-cupcakes-798258', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}