{u'recipes': [{u'sourceName': u'Farm Girl Gourmet', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556644-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 556644, u'veryPopular': False, u'lowFodmap': False, u'title': u'Puff Pastry Pesto Chicken', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 234.43, u'creditText': u'Farm Girl Gourmet', u'extendedIngredients': [{u'originalString': u'2 cups cubed cooked chicken breast', u'aisle': u'Meat', u'name': u'cooked chicken breast', u'metaInformation': [u'cubed', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 5064, u'unit': u'cups'}, {u'originalString': u'2 tabelspoons mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 4025, u'unit': u''}, {u'originalString': u'1 tablespoon prepared pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons toasted pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12147, u'unit': u'teaspoons'}, {u'originalString': u'1 package Pepperidge Farm Puff Pastry Shells, cooked according to package, cooled', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry shells', u'metaInformation': [u'cooled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pastry-shells.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10018337, u'unit': u'package'}, {u'originalString': u'1 tablespoon julienned roasted red pepper (for garnish, optional)', u'aisle': u'Canned and Jarred', u'name': u'roasted red pepper', u'metaInformation': [u'red', u'julienned', u'(for garnish, optional)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11916, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons minced shallot', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u'tablespoons'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.farmgirlgourmet.com/2013/11/puff-pastry-pesto-chicken.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook Pepperidge Farm Puff Pastry Shells according to package.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pastry-shells.jpg', u'id': 10018337, u'name': u'puff pastry shells'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove tops and allow to cool.In a medium bowl, add the cubed chicken, shallot, mayonnaise, pesto and pine nuts.  Toss to combine.  Season with salt and pepper.  Spoon into the shells and garnish with red pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 75, u'instructions': u'Cook Pepperidge Farm Puff Pastry Shells according to package.  Remove tops and allow to cool.In a medium bowl, add the cubed chicken, shallot, mayonnaise, pesto and pine nuts.  Toss to combine.  Season with salt and pepper.  Spoon into the shells and garnish with red pepper.  Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/puff-pastry-pesto-chicken-556644', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}