{u'recipes': [{u'sourceName': u'My Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/206572-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 206572, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lemony Fruit Dip', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 12.35, u'creditText': u'My Recipes', u'extendedIngredients': [{u'originalString': u'1 1/2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/2 tablespoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup sugar, divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups frozen reduced-calorie whipped topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'frozen', u'thawed', u'reduced-calorie'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 42135, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://www.myrecipes.com/recipe/lemony-fruit-dip-10000000592313/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine 2 tablespoons sugar, egg, and lemon juice in a small bowl; stir well with a whisk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine remaining 2 tablespoons sugar, water, and cornstarch in a small saucepan; bring to a boil. Cook 30 seconds or until thickened, stirring constantly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from heat. Slowly pour beaten egg mixture into water mixture, stirring constantly. Cook over medium heat 2 minutes or until thick, stirring constantly.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove from heat; stir in vanilla. Cool completely. Fold in whipped topping.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Fruit Dip. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 602, u'instructions': u'Combine 2 tablespoons sugar, egg, and lemon juice in a small bowl; stir well with a whisk. Combine remaining 2 tablespoons sugar, water, and cornstarch in a small saucepan; bring to a boil. Cook 30 seconds or until thickened, stirring constantly. Remove from heat. Slowly pour beaten egg mixture into water mixture, stirring constantly. Cook over medium heat 2 minutes or until thick, stirring constantly. Remove from heat; stir in vanilla. Cool completely. Fold in whipped topping.', u'spoonacularSourceUrl': u'https://spoonacular.com/lemony-fruit-dip-206572', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 14, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}