{u'recipes': [{u'sourceName': u'B Sugar Mama', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/519196-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 519196, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Turkey French Dip Sandwiches', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 3284.0, u'creditText': u'B Sugar Mama', u'extendedIngredients': [{u'originalString': u'2 carrots, thinly sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery stalks,thinly sliced', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'2 c. chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'c'}, {u'originalString': u'4 mini baguettes or ciabatta bread', u'aisle': u'Bakery/Bread', u'name': u'ciabatta bread', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 93655, u'unit': u''}, {u'originalString': u'2 cloves garlic, mashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tbsp. liquid smoke', u'aisle': u'Spices and Seasonings;Condiments', u'name': u'liquid smoke', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93627, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 large onion, roughly chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 slices provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'1 1/2 lb. turkey breast', u'aisle': u'Meat', u'name': u'turkey breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 5696, u'unit': u'lb'}, {u'originalString': u'3 tbsp. Worcestershire Sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tbsp'}], u'healthScore': 71.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://bsugarmama.com/turkey-french-dip-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 150, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Preheat a crockpot on high: In a large saute pan, heat the olive oil on medium heat. Once the oil is hot, place the turkey breast in the pot to sear on both sides for 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'id': 5696, u'name': u'turkey breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add the celery, carrot, and onion. Season with salt and pepper to taste. Meanwhile, while the crockpot is heating, add the chicken stock.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the garlic to the pot of turkey breast, Worcestershire, and liquid smoke. Turn the turkey breast and the rest of the contents to the crockpot and allow to cook for 1 hour. Once the turkey has cooked, Roughly carve the turkey breasts and turn the meat back into the crockpot for another 30 minutes. Preheat the broiler in the oven , cut the bread into two pieces and brush what will be the top of the sandwich with olive oil.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'id': 5696, u'name': u'turkey breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 93627, u'name': u'liquid smoke'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place a piece of provolone cheese on top and place in the oven and allow the cheese to melt, about 2-3 minutes. Take the bottom piece of bread and pour drizzle with some of the drippings of the turkey and place some of the turkey, celery,and carrots on the bottom and put the top piece of bread on top, secure with toothpick and enjoy.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'id': 1035, u'name': u'provolone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 144, u'instructions': u'Preheat a crockpot on high: In a large saute pan, heat the olive oil on medium heat. Once the oil is hot, place the turkey breast in the pot to sear on both sides for 2-3 minutes. Add the celery, carrot, and onion. Season with salt and pepper to taste. Meanwhile, while the crockpot is heating, add the chicken stock. Add the garlic to the pot of turkey breast, Worcestershire, and liquid smoke. Turn the turkey breast and the rest of the contents to the crockpot and allow to cook for 1 hour. Once the turkey has cooked, Roughly carve the turkey breasts and turn the meat back into the crockpot for another 30 minutes. Preheat the broiler in the oven , cut the bread into two pieces and brush what will be the top of the sandwich with olive oil. Place a piece of provolone cheese on top and place in the oven and allow the cheese to melt, about 2-3 minutes. Take the bottom piece of bread and pour drizzle with some of the drippings of the turkey and place some of the turkey, celery,and carrots on the bottom and put the top piece of bread on top, secure with toothpick and enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-turkey-french-dip-sandwiches-519196', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}