{u'recipes': [{u'sourceName': u'Two Peas and Their Pod', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/548566-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 548566, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bunny Tails', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 25.35, u'creditText': u'Two Peas and Their Pod', u'extendedIngredients': [{u'originalString': u'12 Large marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 19116, u'unit': u''}, {u'originalString': u'1 cup sweetened coconut flakes', u'aisle': u'Baking', u'name': u'sweetened coconut flakes', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12109, u'unit': u'cup'}, {u'originalString': u'1 cup white chocolate chips, melted', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019087, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.twopeasandtheirpod.com/bunny-tails/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Dip half of a marshmallow into the melted white chocolate. Sprinkle coconut over the chocolate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Place the marshmallow chocolate side up to dry.Note-bunny tails can be stored in an air-tight container for 3-4 days.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}], u'name': u''}], u'aggregateLikes': 7580, u'instructions': u'1. Dip half of a marshmallow into the melted white chocolate. Sprinkle coconut over the chocolate. Place the marshmallow chocolate side up to dry.Note-bunny tails can be stored in an air-tight container for 3-4 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/bunny-tails-548566', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}