{u'recipes': [{u'sourceName': u'Cook Like a Champion Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/613411-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 613411, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Chunk, Coconut and Cashew Cookies', u'diets': [], u'pricePerServing': 47.49, u'creditText': u'Cook Like a Champion Blog', u'extendedIngredients': [{u'originalString': u'\xbe teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'12 ounces bittersweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1 cup finely chopped cashews', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'1-1\xbd cups chipped coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cups'}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1-1\xbc teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 sticks (1 cup) unsalted butter, at room temperature, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'divided', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.cooklikeachampionblog.com/2014/09/chocolate-chunk-coconut-and-cashew-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 375 and line two baking sheets with parchment or silicone baking mats.In a small skillet, add one stick of butter. Melt the butter over medium heat. Once the butter stops foaming, carefully watch for it to take on a darker color, stirring as needed. The butter should be a darkish color and have a nutty aroma.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and pour into a small bowl and allow to come to room temperature. In a small bowl, whisk together the flour, salt and baking soda. Set aside. Working with a stand mixer fitted with a paddle attachment, beat the butter on medium speed for about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the brown sugar and cooled brown butter and continue beating another 1-2 minutes. Beat in the vanilla.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the eggs, one at a time, beating well after each addition. Reduce speed to low and beat in the flour mixture in three additions. On low speed, or by hand using a sturdy rubber spatula, mix in the chocolate, cashews and coconut. Using a 3 tablespoon scoop, measure out the dough and place, at least 2 inches apart, on the prepared baking sheets.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 12-14 minutes, rotating halfway through, until the edges are brown and the center is golden. They may be slightly soft in the center, but they will set up as they cool. Pull the sheet from the oven and allow the cookies to cool on it for 1 minute, then carefully transfer them to a cooling rack to cool completely. Have another sheet ready to go in when the first batch comes out, and repeat with the remaining dough. Alternately, you can refrigerate the dough for up to 3 days or portion out dough balls to freeze and bake directly from the freezer. If you refrigerate the dough, I recommend setting it out while your oven heats (it makes it easier to scoop). If you bake from frozen, simply add a couple minutes to the original baking time.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 53, u'instructions': u'Heat oven to 375 and line two baking sheets with parchment or silicone baking mats.In a small skillet, add one stick of butter. Melt the butter over medium heat. Once the butter stops foaming, carefully watch for it to take on a darker color, stirring as needed. The butter should be a darkish color and have a nutty aroma. Remove from heat and pour into a small bowl and allow to come to room temperature. In a small bowl, whisk together the flour, salt and baking soda. Set aside. Working with a stand mixer fitted with a paddle attachment, beat the butter on medium speed for about 1 minute. Add the brown sugar and cooled brown butter and continue beating another 1-2 minutes. Beat in the vanilla. Add the eggs, one at a time, beating well after each addition. Reduce speed to low and beat in the flour mixture in three additions. On low speed, or by hand using a sturdy rubber spatula, mix in the chocolate, cashews and coconut. Using a 3 tablespoon scoop, measure out the dough and place, at least 2 inches apart, on the prepared baking sheets. Bake for 12-14 minutes, rotating halfway through, until the edges are brown and the center is golden. They may be slightly soft in the center, but they will set up as they cool. Pull the sheet from the oven and allow the cookies to cool on it for 1 minute, then carefully transfer them to a cooling rack to cool completely. Have another sheet ready to go in when the first batch comes out, and repeat with the remaining dough. Alternately, you can refrigerate the dough for up to 3 days or portion out dough balls to freeze and bake directly from the freezer. If you refrigerate the dough, I recommend setting it out while your oven heats (it makes it easier to scoop). If you bake from frozen, simply add a couple minutes to the original baking time.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-chunk-coconut-and-cashew-cookies-613411', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 28, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}