{u'recipes': [{u'sourceName': u'Maebells', u'cuisines': [u'middl eastern'], u'image': u'https://spoonacular.com/recipeImages/689929-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 6, u'id': 689929, u'veryPopular': True, u'lowFodmap': False, u'title': u'Grilled Zucchini Hummus Wrap', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 174.0, u'creditText': u'Maebells', u'extendedIngredients': [{u'originalString': u'1 tomato, sliced or handful of cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'2 slices white cheddar or chipotle gouda cheese', u'aisle': u'Cheese', u'name': u'gouda cheese', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gouda.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 1022, u'unit': u'slices'}, {u'originalString': u'4 tablespoons hummus', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 16158, u'unit': u'tablespoons'}, {u'originalString': u'1 cup kale, tough stems removed', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'⅛ cup sliced red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.125, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u"2 large Udi's gluten free tortillas", u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [u'gluten free', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}, {u'originalString': u'1 zucchini, ends removed and sliced', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.maebells.com/grilled-zucchini-hummus-wrap/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat a skillet or grill to medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the ends from the zucchini and slice length wise into strips. Toss sliced zucchini in olive oil and sprinkle with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place sliced zucchini directly on grill and let cook for 3 minutes, turn and cook for 2 more minutes.Set zucchini aside.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the tortillas on grill for approximately one minute, or just until grill marks are visible and tortillas are pliable.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove tortillas from grill and assemble wraps, 2 tablespoons of hummus, one slice of cheese, zucchini slices,  cup kale, onion and tomato slices.Wrap tightly and enjoy immediately.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Hummus on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 16536, u'instructions': u'Heat a skillet or grill to medium heat.Remove the ends from the zucchini and slice length wise into strips. Toss sliced zucchini in olive oil and sprinkle with salt and pepper.Place sliced zucchini directly on grill and let cook for 3 minutes, turn and cook for 2 more minutes.Set zucchini aside.Place the tortillas on grill for approximately one minute, or just until grill marks are visible and tortillas are pliable.Remove tortillas from grill and assemble wraps, 2 tablespoons of hummus, one slice of cheese, zucchini slices,  cup kale, onion and tomato slices.Wrap tightly and enjoy immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-zucchini-hummus-wrap-689929', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 16, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}