{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/279511-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 14, u'id': 279511, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon-Cheddar Stuffed Burgers', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 197.14, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'6 slices OSCAR MAYER Bacon, cooked, crumbled', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u"1/4 cup BULL'S-EYE Texas Style Barbecue Sauce", u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [u'texas style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'1 lb. ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'4 hamburger buns', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'1/4 cup MIRACLE WHIP Dressing', u'aisle': u'Condiments', u'name': u'miracle whip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 4014, u'unit': u'cup'}, {u'originalString': u'2 slices red onion, separated into rings', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'slices'}, {u'originalString': u'4 KRAFT DELI DELUXE Process Sharp Cheddar Cheese Slices, quartered', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'quartered', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1031009, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/bacon-cheddar-stuffed-burgers-118831.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Shape meat into 8 thin patties. Reserve half the cheese and bacon.  Top 4 patties with remaining cheese and bacon; cover with remaining patties. Pinch edges together to seal.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Grill 5 to 7 min. on each side or until done (160F), brushing occasionally the last few minutes with barbecue sauce.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}, {u'equipment': [], u'step': u'Spread bottom halves of buns with dressing.  Fill buns with burgers, remaining cheese, bacon and onions.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are great choices for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Don Rodolfo Malbec. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 12 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'An intense ruby red color with violet flashes. Aromas of berries, cassis and plums. This Malbec is a burst of dark cherry and blackberry with a rich, plush finish. View More', u'title': u'Don Rodolfo Malbec', u'price': u'$11.99', u'id': 438361, u'link': u'https://www.wine.com/product/don-rodolfo-malbec-2015/153771', u'imageUrl': u'https://spoonacular.com/productImages/438361-312x231.jpg'}]}, u'aggregateLikes': 91, u'instructions': u'Heat grill to medium-high heat.                                            Shape meat into 8 thin patties. Reserve half the cheese and bacon.  Top 4 patties with remaining cheese and bacon; cover with remaining patties. Pinch edges together to seal.                                             Grill 5 to 7 min. on each side or until done (160F), brushing occasionally the last few minutes with barbecue sauce.                                            Spread bottom halves of buns with dressing.  Fill buns with burgers, remaining cheese, bacon and onions.', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-cheddar-stuffed-burgers-279511', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 29, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}