{u'recipes': [{u'sourceName': u'My Whole Food Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/621905-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 621905, u'veryPopular': True, u'lowFodmap': True, u'title': u'4 Ingredient Peppermint Fudge', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 55.45, u'creditText': u'My Whole Food Life', u'extendedIngredients': [{u'originalString': u'1/2 cup almond milk (or milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'(or milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'2 cups coconut butter (you can use homemade or store bought)', u'aisle': u'Health Foods', u'name': u'coconut butter', u'metaInformation': [u'homemade', u'store bought', u'canned', u'(you can use or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93746, u'unit': u'cups'}, {u'originalString': u'2-3 T maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'T'}, {u'originalString': u'1/2 - 1 tsp peppermint extract (depending on how strong you like it)', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [u'(depending on how strong you like it)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1022050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://mywholefoodlife.com/2014/11/30/4-ingredient-peppermint-fudge/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'In a food processor, combine all the ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula.jpg', u'id': 404717, u'name': u'baking spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Mix until smooth. Line an 8x8 pan with parchment paper, leaving enough room to come out the sides. Using a silicone spatula, transfer the mixture to the 8x8 baking dish.  Press the top down firmly. Sprinkle some of the candy can dust on top.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place in the fridge for a bit to firm up.  It should not take long at all. Using a knife or pizza wheel, but into squares.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1249, u'instructions': u'In a food processor, combine all the ingredients.  Mix until smooth. Line an 8x8 pan with parchment paper, leaving enough room to come out the sides. Using a silicone spatula, transfer the mixture to the 8x8 baking dish.  Press the top down firmly. Sprinkle some of the candy can dust on top. Place in the fridge for a bit to firm up.  It should not take long at all. Using a knife or pizza wheel, but into squares.', u'spoonacularSourceUrl': u'https://spoonacular.com/4-ingredient-peppermint-fudge-621905', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 18, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}