{u'recipes': [{u'sourceName': u'Joanne Eats Well with Others', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/629564-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 629564, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Almond Tiramisu', u'diets': [], u'pricePerServing': 112.46, u'creditText': u'Joanne Eats Well with Others', u'extendedIngredients': [{u'originalString': u'\xbd cup International Delight Fat Free & Sugar Free Chocolate Almond Biscotti creamer', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'fat free', u'sugar free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'2 tsp almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002050, u'unit': u'tsp'}, {u'originalString': u'1 cup strong espresso', u'aisle': u'Tea and Coffee', u'name': u'espresso', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14210, u'unit': u'cup'}, {u'originalString': u'2 cups heavy cream, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'35-40 ladyfingers', u'aisle': u'Sweet Snacks', u'name': u'ladyfingers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 35.0, u'consistency': u'solid', u'id': 18423, u'unit': u''}, {u'originalString': u'8 oz mascarpone', u'aisle': u'Cheese', u'name': u'mascarpone', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93820, u'unit': u'oz'}, {u'originalString': u'6 oz semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'oz'}, {u'originalString': u"\xbd cup confectioner's sugar", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://joanne-eatswellwithothers.com/2015/02/chocolate-almond-tiramisu.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the chocolate chips in a heatproof bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 cup of the heavy cream in a heavy-bottomed skillet on medium-high heat until bubbles appear on the sides of the pan, but it is not yet boiling.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'Remove the cream from the heat and pour over the chocolate chips.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Let sit for 1 minute and then whisk until the chocolate is fully melted and even incorporated into the cream.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place in the refrigerator and let cool until it thickens to the consistency of soft peanut butter.Meanwhile, beat the remaining cup of heavy cream, mascarpone, confectioner's sugar, and almond extract together in a large bowl until they form stiff peaks.In a shallow bowl, stir together the espresso and International Delight creamer. Dunk a ladyfinger into this mixture so that it is fully submerged, and then layer it into the bottom of a 9x9-inch square baking dish. Repeat until the bottom of the pan is covered in a single layer of ladyfingers.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 1002050, u'name': u'almond extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'id': 18423, u'name': u'ladyfingers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14210, u'name': u'espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Spread half of the mascarpone mixture over the ladyfingers. Top with all of the chocolate ganache. Top with another layer of espresso-dunked lady fingers and the remaining mascarpone. Sprinkle with the unsweetened cocoa powder. Cover with plastic wrap and refrigerate overnight or for at least 6 hours.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'id': 18423, u'name': u'ladyfingers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Chianti, and Moscato d'Asti are my top picks for Tiramisu. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'chianti', u'moscato dasti', u'port', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u"Place the chocolate chips in a heatproof bowl.Heat 1 cup of the heavy cream in a heavy-bottomed skillet on medium-high heat until bubbles appear on the sides of the pan, but it is not yet boiling. Remove the cream from the heat and pour over the chocolate chips. Let sit for 1 minute and then whisk until the chocolate is fully melted and even incorporated into the cream. Place in the refrigerator and let cool until it thickens to the consistency of soft peanut butter.Meanwhile, beat the remaining cup of heavy cream, mascarpone, confectioner's sugar, and almond extract together in a large bowl until they form stiff peaks.In a shallow bowl, stir together the espresso and International Delight creamer. Dunk a ladyfinger into this mixture so that it is fully submerged, and then layer it into the bottom of a 9x9-inch square baking dish. Repeat until the bottom of the pan is covered in a single layer of ladyfingers.Spread half of the mascarpone mixture over the ladyfingers. Top with all of the chocolate ganache. Top with another layer of espresso-dunked lady fingers and the remaining mascarpone. Sprinkle with the unsweetened cocoa powder. Cover with plastic wrap and refrigerate overnight or for at least 6 hours.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-almond-tiramisu-629564', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}