{u'recipes': [{u'sourceName': u'The Cookie Rookie', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/617440-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 617440, u'veryPopular': False, u'lowFodmap': False, u'title': u'Banana Cheesecake Watermelon “Pizza”', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 284.96, u'creditText': u'The Cookie Rookie', u'extendedIngredients': [{u'originalString': u'1 banana, sliced', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'4 ounces low fat cream cheese', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounces'}, {u'originalString': u'\xbc cup chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'4 ounces vanilla greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim vanilla greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 99033, u'unit': u'ounces'}, {u'originalString': u'4-5 strawberries, sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}, {u'originalString': u'1 round slice of watermelon, about 1\xbd inch thick', u'aisle': u'Produce', u'name': u'watermelon', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9326, u'unit': u''}, {u'originalString': u'\xbc cup white chocolate chips', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10019087, u'unit': u'cup'}], u'healthScore': 28.0, u'imageType': u'png', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.thecookierookie.com/banana-cheesecake-watermelon-pizza/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Using an electric mixer, mix together greek yogurt, cream cheese, and powdered sugar until well combined. Set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place your watermelon on a large plate/platter', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}]}, {u'equipment': [], u'step': u'Spread cream cheese mixture over watermelon, like a "pizza sauce"Top with banana slices and strawberries', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Sprinkle on the pecans and white chocolate chips', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'id': 10019087, u'name': u'white chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Cut into slices (like pizza slices) and serve cold. Enjoy!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Madsen Family Cellars Sangiovese Wine with a 5 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This wine has a pronounced nose with a hint of coffee while your mouth is invaded with spices; clove, licorice, and cinnamon.The palate features cherries and notes of clove which continue on to a smooth, long finish with subtle oak, slight pepper and berry flavors. The tartness of the wine works well with food as Sangiovese is a food wine, but can be enjoyed on its own as well. Columbia Valley AVA from the vineyards of Jordan Reed.', u'title': u'Madsen Family Cellars Sangiovese Wine', u'price': u'$26.0', u'id': 431618, u'link': u'https://www.amazon.com/2009-Madsen-Family-Cellars-Sangiovese/dp/B00I0F3FJA', u'imageUrl': u'https://spoonacular.com/productImages/431618-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Using an electric mixer, mix together greek yogurt, cream cheese, and powdered sugar until well combined. Set aside.Place your watermelon on a large plate/platterSpread cream cheese mixture over watermelon, like a "pizza sauce"Top with banana slices and strawberriesSprinkle on the pecans and white chocolate chipsCut into slices (like pizza slices) and serve cold. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-cheesecake-watermelon-pizza-617440', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}