{u'recipes': [{u'sourceName': u"Elana's Pantry", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/473145-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_3', u'id': 473145, u'veryPopular': True, u'lowFodmap': True, u'title': u'Fish Sticks', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'fodmap friendly', u'whole 30', u'pescatarian', u'ketogenic'], u'pricePerServing': 302.73, u'creditText': u"Elana's Pantry", u'extendedIngredients': [{u'originalString': u'1 cup blanched almond flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'blanched almond flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93740, u'unit': u'cup'}, {u'originalString': u'6 tablespoons olive oil or coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'2 eggs, whisked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 pound white fish (such as cod, snapper or tilapia)', u'aisle': u'Seafood', u'name': u'fish', u'metaInformation': [u'white', u'(such as cod, snapper or tilapia)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10115261, u'unit': u'pound'}, {u'originalString': u'1 teaspoon celtic sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.elanaspantry.com/fish-sticks/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse fish fillets in cold water and set on a plate', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish fillets'}]}, {u'equipment': [], u'step': u'Cut fish into 1 inch by 5 inch pieces, following the lines of the fillets and removing any bones', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Place eggs in one dish and flour and salt in another', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Dip fish sticks in egg, then flour; reserve to a plate', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 3 tablespoons oil in a large skillet over medium-high heat', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place half the the fish sticks in the pan, leaving enough room around them so that they aren’t crowded', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Cook for a few minutes on each side, until well browned, then remove fish sticks to a plate lined with a paper towel', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 3 tablespoons olive to pan and fry remaining batch of fish sticks', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with ketchup', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serves 4', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Casa Catelli Pinot Grigio. It has 4.2 out of 5 stars and a bottle costs about 8 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food. View More', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 3170, u'instructions': u'Rinse fish fillets in cold water and set on a plateCut fish into 1 inch by 5 inch pieces, following the lines of the fillets and removing any bonesPlace eggs in one dish and flour and salt in anotherDip fish sticks in egg, then flour; reserve to a plateHeat 3 tablespoons oil in a large skillet over medium-high heatPlace half the the fish sticks in the pan, leaving enough room around them so that they aren’t crowdedCook for a few minutes on each side, until well browned, then remove fish sticks to a plate lined with a paper towelAdd 3 tablespoons olive to pan and fry remaining batch of fish sticksServe with ketchupServes 4', u'spoonacularSourceUrl': u'https://spoonacular.com/fish-sticks-473145', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}