{u'recipes': [{u'sourceName': u'The Little Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/530764-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 530764, u'veryPopular': False, u'lowFodmap': False, u'title': u'Biscoff Butter Cup Cupcakes', u'diets': [u'gluten free'], u'pricePerServing': 156.74, u'creditText': u'The Little Kitchen', u'extendedIngredients': [{u'originalString': u'1/2 cup biscoff spread', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'Biscoff spread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 99011, u'unit': u'cup'}, {u'originalString': u"1 (9 oz) package devil's food cake mix (I used Duncan Hines)", u'aisle': u'Baking', u'name': u'angel food cake mix', u'metaInformation': [u'(I used Duncan Hines)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 18087, u'unit': u'oz'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Biscoff Buttercream Icing', u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'servings'}, {u'originalString': u'1 (3.9 oz) package instant chocolate pudding mix', u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.9, u'consistency': u'solid', u'id': 19184, u'unit': u'oz'}, {u'originalString': u'1/2 Tbsp instant espresso granules, dissolve it in 1/4 cup warm water', u'aisle': u'Tea and Coffee', u'name': u'instant espresso', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10014214, u'unit': u'Tbsp'}, {u'originalString': u'1-3 Tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tbsp'}, {u'originalString': u'2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1/8 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/4 cup salted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001001, u'unit': u'cup'}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'2 Tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1/2 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.thelittlekitchen.net/biscoff-butter-cup-cupcakes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Biscoff Butter Cup Filling', u'number': 1, u'ingredients': [{u'image': None, u'id': 99011, u'name': u'cookie butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the biscoff spread, unsalted butter, and salt in a glass microwavable bowl and place in the microwave to heat for 20 seconds. Stir the biscoff butter mixture until thoroughly combined.In 1/4 cup increments, stir in the powdered sugar until throughly combined.Portion into the a chocolate cup candy mold and freeze or using a 2-3 tsp cookie scoop out filling and place on a plate and freeze for at least 30-40 minutes or until frozen solid.Chocolate Cupcakes', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1145, u'name': u'unsalted butter'}, {u'image': None, u'id': 99011, u'name': u'cookie butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Be sure to preheat your oven to 350 degrees F.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u"Place cupcake liners in your cupcake tin.In a large mixing bowl with a hand mixer or your stand mixer bowl using the paddle attachment, mix together all of your ingredients except the peanut butter cups for minute or two until well mixed. (Don't overmix.)", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-spoons.png', u'id': 404719, u'name': u'measuring spoon'}], u'step': u'Place 3 Tbsp of cake batter in each cupcake liner using a measuring spoon or a cookie scoop.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove biscoff butter cup filling from freezer and unmold (if necessary).', u'number': 6, u'ingredients': [{u'image': None, u'id': 99011, u'name': u'cookie butter'}]}, {u'equipment': [], u'step': u'Add 1 biscoff butter cup to each cupcake and push down.', u'number': 7, u'ingredients': [{u'image': None, u'id': 99011, u'name': u'cookie butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 18 to 22 minutes or until several cupcakes pricked with a toothpick come out clean. Allow the cupcakes to cool in the pan for 5 to 10 minutes.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Remove cupcakes from the pans and place them on a cooling rack & let them cool all the way. While the cupcakes are baking you can make the buttercream icing.Biscoff Buttercream Icing', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In your stand mixer bowl using the paddle attachment, mix thoroughly the softened butter and biscoff spread on low to medium speed.', u'number': 10, u'ingredients': [{u'image': None, u'id': 99011, u'name': u'cookie butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add vanilla extract and mix well. Turn off your mixer and add the powdered sugar and mixing until well blended (it will look like a dough). Be careful, the powered sugar can go everywhere!', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add 1 to 3 tablespoons of milk a little bit at a time while blending on low speed. Blend until well combined. You'll start to see the icing pull from the sides of the bowl.", u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404725, u'name': u'butter knife'}], u'step': u'Add a little bit more milk to get to the right thinness (to your preference). Keep blending, higher the speed, until nice and fluffy, about 5 to 7 minutes.Using a big star tip and decorator bag, pipe icing onto cooled cupcakes or spread icing onto cupcakes using an offset spatula or butter knife. Icing can be stored in the fridge for up to a couple of weeks. Allow to sit at room temperature for at least 30 minutes before icing cupcakes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cupcakes. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u"Biscoff Butter Cup FillingAdd the biscoff spread, unsalted butter, and salt in a glass microwavable bowl and place in the microwave to heat for 20 seconds. Stir the biscoff butter mixture until thoroughly combined.In 1/4 cup increments, stir in the powdered sugar until throughly combined.Portion into the a chocolate cup candy mold and freeze or using a 2-3 tsp cookie scoop out filling and place on a plate and freeze for at least 30-40 minutes or until frozen solid.Chocolate CupcakesBe sure to preheat your oven to 350 degrees F. Place cupcake liners in your cupcake tin.In a large mixing bowl with a hand mixer or your stand mixer bowl using the paddle attachment, mix together all of your ingredients except the peanut butter cups for minute or two until well mixed. (Don't overmix.)Place 3 Tbsp of cake batter in each cupcake liner using a measuring spoon or a cookie scoop.Remove biscoff butter cup filling from freezer and unmold (if necessary). Add 1 biscoff butter cup to each cupcake and push down.Bake for 18 to 22 minutes or until several cupcakes pricked with a toothpick come out clean. Allow the cupcakes to cool in the pan for 5 to 10 minutes.Remove cupcakes from the pans and place them on a cooling rack & let them cool all the way. While the cupcakes are baking you can make the buttercream icing.Biscoff Buttercream IcingIn your stand mixer bowl using the paddle attachment, mix thoroughly the softened butter and biscoff spread on low to medium speed. Add vanilla extract and mix well. Turn off your mixer and add the powdered sugar and mixing until well blended (it will look like a dough). Be careful, the powered sugar can go everywhere!Add 1 to 3 tablespoons of milk a little bit at a time while blending on low speed. Blend until well combined. You'll start to see the icing pull from the sides of the bowl. Add a little bit more milk to get to the right thinness (to your preference). Keep blending, higher the speed, until nice and fluffy, about 5 to 7 minutes.Using a big star tip and decorator bag, pipe icing onto cooled cupcakes or spread icing onto cupcakes using an offset spatula or butter knife. Icing can be stored in the fridge for up to a couple of weeks. Allow to sit at room temperature for at least 30 minutes before icing cupcakes.", u'spoonacularSourceUrl': u'https://spoonacular.com/biscoff-butter-cup-cupcakes-530764', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}