{u'recipes': [{u'sourceName': u'Cook Like a Champion Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/596263-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 596263, u'veryPopular': True, u'lowFodmap': False, u'title': u'Homemade Brioche Loaf Bread', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 21.49, u'creditText': u'Cook Like a Champion Blog', u'extendedIngredients': [{u'originalString': u'3\xbc cups (14.75 ounces) unbleached bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.75, u'consistency': u'solid', u'id': 10120129, u'unit': u'ounces'}, {u'originalString': u'1 egg, whisked until frothy (for egg wash)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'(for egg wash)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 large (6.6 ounces) eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.6, u'consistency': u'solid', u'id': 1123, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons (1 ounce) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'ounce'}, {u'originalString': u'2 teaspoons (0.22 ounce) instant yeast', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.22, u'consistency': u'solid', u'id': 10118375, u'unit': u'ounce'}, {u'originalString': u'1\xbc teaspoons (0.31 ounce) salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.31, u'consistency': u'solid', u'id': 2047, u'unit': u'ounce'}, {u'originalString': u'\xbd cup (4 ounces) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}, {u'originalString': u'\xbd cup (4 ounces) whole milk, lukewarm', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'lukewarm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.cooklikeachampionblog.com/2014/04/homemade-brioche-loaf-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make the sponge, stir together the flour in yeast in the bowl of an electric mixer.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add the milk, and stir until all the flour is moistened. Cover with plastic wrap and allow to ferment for 30-45 minutes, or until the sponge rises and then falls when you tap the bowl.To make the dough, add the eggs to the sponge and beat on medium speed with the paddle attachment until smooth. In a separate bowl, whisk together the flour, sugar and salt. With the mixer on low speed, add in the flour and mix until evenly combined. Allow to rest for 5 minutes. Replace the paddle with the dough hook and, with the mixer on medium speed, add the butter one tablespoon at a time, waiting until it's incorporated before adding more. Reduce speed to low and continue kneading with the dough hook for 6-8 minutes, or until the dough is well mixed and easily clears the sides and bottom of the bowl, adding small amounts of flour as needed. The dough should be smooth and soft but not sticky.Lightly oil a bowl and transfer the dough to it. Lightly mist the top of the dough with spray oil and cover with plastic wrap. Allow to ferment for about 90 minutes, or until the dough doubles in size.Grease two 8.5 x 4.5-inch loaf pans. Divide the dough in half. Working with one half at a time, flatten the dough with your hands to form a rectangle about 5 inches wide and 6-8 inches long. Working from the short side, roll up the length of the dough one section at a time, pinching the crease after each turn. The loaf will spread as you roll it, and the final length should be 8-9 inches, depending on the size loaf pan you have. Pinch the final seam closed, then roll the loaf back and forth to even it out, taking care not to taper the edges. (See this post for step by step photos of the shaping process.) Repeat with remaining dough.", u'length': {u'number': 148, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Place the loaves in the prepared pans, making sure that the ends of the loaves touch the ends of the pans. Mist the top of the loaves with spray oil and loosely cover with plastic wrap. Proof the dough for 60-90 minutes, or until it nearly fills the pans. Gently brush the tops with egg wash. Cover again with plastic wrap that has been lightly misted with spray oil. Continue proofing for 15-30 minutes, until the dough fills the pans.', u'length': {u'number': 120, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 350\xba and bake for 35-50 minutes. The finished loaf should be 190\xbaF in the center, and the bottom should sound hollow when thumped.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the loaves from the pans as soon as you take them out of the oven. Cool on a rack for at least 1 hour before cutting and serving (though really, who has the willpower to do that?). To store, wrap the cooled loaf in plastic wrap or store in a plastic bag in a cool, dark place. Do not refrigerate it because doing so will cause the bread to dry out. If it cannot be eaten within 3 days, I recommend slicing then freezing it, which allows you to remove only as many slices as you need at a time.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 515, u'instructions': u"To make the sponge, stir together the flour in yeast in the bowl of an electric mixer. Add the milk, and stir until all the flour is moistened. Cover with plastic wrap and allow to ferment for 30-45 minutes, or until the sponge rises and then falls when you tap the bowl.To make the dough, add the eggs to the sponge and beat on medium speed with the paddle attachment until smooth. In a separate bowl, whisk together the flour, sugar and salt. With the mixer on low speed, add in the flour and mix until evenly combined. Allow to rest for 5 minutes. Replace the paddle with the dough hook and, with the mixer on medium speed, add the butter one tablespoon at a time, waiting until it's incorporated before adding more. Reduce speed to low and continue kneading with the dough hook for 6-8 minutes, or until the dough is well mixed and easily clears the sides and bottom of the bowl, adding small amounts of flour as needed. The dough should be smooth and soft but not sticky.Lightly oil a bowl and transfer the dough to it. Lightly mist the top of the dough with spray oil and cover with plastic wrap. Allow to ferment for about 90 minutes, or until the dough doubles in size.Grease two 8.5 x 4.5-inch loaf pans. Divide the dough in half. Working with one half at a time, flatten the dough with your hands to form a rectangle about 5 inches wide and 6-8 inches long. Working from the short side, roll up the length of the dough one section at a time, pinching the crease after each turn. The loaf will spread as you roll it, and the final length should be 8-9 inches, depending on the size loaf pan you have. Pinch the final seam closed, then roll the loaf back and forth to even it out, taking care not to taper the edges. (See this post for step by step photos of the shaping process.) Repeat with remaining dough.Place the loaves in the prepared pans, making sure that the ends of the loaves touch the ends of the pans. Mist the top of the loaves with spray oil and loosely cover with plastic wrap. Proof the dough for 60-90 minutes, or until it nearly fills the pans. Gently brush the tops with egg wash. Cover again with plastic wrap that has been lightly misted with spray oil. Continue proofing for 15-30 minutes, until the dough fills the pans. Heat oven to 350\xba and bake for 35-50 minutes. The finished loaf should be 190\xbaF in the center, and the bottom should sound hollow when thumped. Remove the loaves from the pans as soon as you take them out of the oven. Cool on a rack for at least 1 hour before cutting and serving (though really, who has the willpower to do that?). To store, wrap the cooled loaf in plastic wrap or store in a plastic bag in a cool, dark place. Do not refrigerate it because doing so will cause the bread to dry out. If it cannot be eaten within 3 days, I recommend slicing then freezing it, which allows you to remove only as many slices as you need at a time.", u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-brioche-loaf-bread-596263', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}