{u'recipes': [{u'sourceName': u'Fuss Free Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/615340-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 615340, u'veryPopular': False, u'lowFodmap': False, u'title': u'[] Sambal Chicken Stir-Fry with Sugar Snap Peas', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 320.8, u'creditText': u'Fuss Free Cooking', u'extendedIngredients': [{u'originalString': u'500g chicken breasts, cut into strips', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'liquid', u'id': 5062, u'unit': u'g'}, {u'originalString': u'Cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'A generous handful of fresh coriander', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'handful'}, {u'originalString': u'1/8 cup fish sauce + extra to taste towards the end of cooking time', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.125, u'consistency': u'liquid', u'id': 6179, u'unit': u'cup'}, {u'originalString': u'2 tsps grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tsps'}, {u'originalString': u'1/4 cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1/2 Tbsp toasted sesame seeds for garnish optional', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'toasted', u'for garnish optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 12023, u'unit': u'Tbsp'}, {u'originalString': u'2 tbsps Indonesian sweet soy sauce (kecap manis)', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'sweet', u'(kecap manis)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsps'}, {u'originalString': u'200g sugar snap peas', u'aisle': u'Produce', u'name': u'sugar snap peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10011300, u'unit': u'g'}, {u'originalString': u'1/4 cup white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}, {u'originalString': u'1/3 cup sambal oelek (less if you like it milder)', u'aisle': u'?', u'name': u'sambal oelek', u'metaInformation': [u'(less if you like it milder)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'unit': u'cup'}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.fussfreecooking.com/recipe-categories/meat-recipes/recipe-sambal-chicken-stir-fry-sugar-snap-peas/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix maple syrup, white vinegar, sambal oelek, 1/8 cup fish sauce and ginger in a bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'distilled white vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk until well mixed with a fork.Marinate the chicken with half of the sauce above. Set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add a teaspoon of oil in a non-stick pan. When the oil is hot add chicken (be careful of the oil splatter!). Brown the chicken until cooked through and set aside on a plate.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the remaining sauce into the pan. Cook over high heat until the sauce has slightly thickened (about a minute or so). Return the chicken to the pan and add sugar snap peas and the Indonesian sweet soy sauce.  Cook until the sugar snap peas have soften slightly. Check for taste, add more fish sauce if you like. Turn off the heat, stir in fresh coriander. Sprinkle with toasted sesame seeds and serve immediately with rice.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'id': 10011300, u'name': u'sugar snap peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}]}], u'name': u''}], u'aggregateLikes': 102, u'instructions': u'Mix maple syrup, white vinegar, sambal oelek, 1/8 cup fish sauce and ginger in a bowl. Whisk until well mixed with a fork.Marinate the chicken with half of the sauce above. Set aside.Add a teaspoon of oil in a non-stick pan. When the oil is hot add chicken (be careful of the oil splatter!). Brown the chicken until cooked through and set aside on a plate.Pour the remaining sauce into the pan. Cook over high heat until the sauce has slightly thickened (about a minute or so). Return the chicken to the pan and add sugar snap peas and the Indonesian sweet soy sauce.  Cook until the sugar snap peas have soften slightly. Check for taste, add more fish sauce if you like. Turn off the heat, stir in fresh coriander. Sprinkle with toasted sesame seeds and serve immediately with rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/-sambal-chicken-stir-fry-with-sugar-snap-peas-615340', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}