{u'recipes': [{u'sourceName': u'Texanerin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/613087-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 613087, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grain-free and Vegan Apple Crisp', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 57.33, u'creditText': u'Texanerin', u'extendedIngredients': [{u'originalString': u'\xbd cup (50 grams) almond flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 93740, u'unit': u'grams'}, {u'originalString': u'5\xbd cups chopped apples (this was about 5 small/medium apples, 774 grams with the core and 630 grams of apples, post coring)', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'with the core and 630 grams of apples, post coring)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.5, u'consistency': u'solid', u'id': 9003, u'unit': u'cups'}, {u'originalString': u"1 tablespoon arrowroot powder (or cornstarch if it doesn't need to be GF)", u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot powder', u'metaInformation': [u"(or cornstarch if it doesn't need to be GF)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20003, u'unit': u'tablespoon'}, {u'originalString': u'1\xbd teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons coconut flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93747, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons (28 grams) coconut oil, room temperature', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 28.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'grams'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup (60ml) maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 60.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'ml'}, {u'originalString': u'\xbc teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.texanerin.com/2014/09/apple-crisp.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat the oven to 350F (175C) and get out an 8"x8" (20cmx20cm) pan.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the maple syrup, lemon juice, arrowroot powder, cinnamon, nutmeg, and salt together in a large bowl. Peel the apples, if desired, and core and cut into " pieces.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20003, u'name': u'arrowroot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [], u'step': u'Place the apples in the maple syrup mixture and stir until the apples are well coated in the mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place in the ungreased pan.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Mix all the topping ingredients and drop walnut-sized pieces of topping over the apples. Only about half of the apples will be covered.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u"Bake for 40-50 minutes or until the topping is brown and crisp and the apples are bubbling. The topping will crisp up much slower than a traditional crisp, but don't worry as it will crisp up towards the very end of the baking time. Cover the crisp with foil if the topping starts to brown too early.", u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u"Let cool for 10 minutes and serve. If not serving immediately, once cool, loosely cover with a piece of plastic wrap (so the topping doesn't go soft). If storing overnight, properly cover the crisp with plastic wrap. Do note that the topping gets soft on the second day.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Crisp can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 109, u'instructions': u'Preheat the oven to 350F (175C) and get out an 8"x8" (20cmx20cm) pan. Mix the maple syrup, lemon juice, arrowroot powder, cinnamon, nutmeg, and salt together in a large bowl. Peel the apples, if desired, and core and cut into " pieces. Place the apples in the maple syrup mixture and stir until the apples are well coated in the mixture. Place in the ungreased pan.Mix all the topping ingredients and drop walnut-sized pieces of topping over the apples. Only about half of the apples will be covered.Bake for 40-50 minutes or until the topping is brown and crisp and the apples are bubbling. The topping will crisp up much slower than a traditional crisp, but don\'t worry as it will crisp up towards the very end of the baking time. Cover the crisp with foil if the topping starts to brown too early.Let cool for 10 minutes and serve. If not serving immediately, once cool, loosely cover with a piece of plastic wrap (so the topping doesn\'t go soft). If storing overnight, properly cover the crisp with plastic wrap. Do note that the topping gets soft on the second day.', u'spoonacularSourceUrl': u'https://spoonacular.com/grain-free-and-vegan-apple-crisp-613087', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}