{u'recipes': [{u'sourceName': u'Tori Avey', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/606063-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 606063, u'veryPopular': False, u'lowFodmap': False, u'title': u'American Cakes – German Chocolate Cake', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 80.99, u'creditText': u'Tori Avey', u'extendedIngredients': [{u'originalString': u'1 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 cup buttermilk or sour milk (1 tablespoon white vinegar or lemon juice plus milk to equal 1 cup) (8.25 ounces/240 grams)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'sour', u'white', u'(8.25 ounces/240 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'2 1/2 cups sifted cake flour or 2 cups all-purpose flour, sifted (9 ounces/250 grams)', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 10020129, u'unit': u'cups'}, {u'originalString': u'4 ounces sweet (German) chocolate, coarsely chopped (115 grams)', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'sweet', u'coarsely chopped', u'(German)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 115.0, u'consistency': u'solid', u'id': 19081, u'unit': u'grams'}, {u'originalString': u'1 1/3 cups grated coconut (3.5 ounces/100 grams)', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'grated', u'(3.5 ounces/100 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.3333333333333333, u'consistency': u'solid', u'id': 12104, u'unit': u'cups'}, {u'originalString': u'4 large egg whites (\xbd cup/4.25 ounces/120 grams)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'3 large egg yolks, lightly beaten (3\xbd tablespoons/2 ounces/60 grams)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 cup granulated sugar (7 ounces/200 grams)', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'(7 ounces/200 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup evaporated milk or heavy cream (8.5 ounces/245 grams)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'(8.5 ounces/245 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 cup pecans, lightly toasted and finely chopped (4 ounces/115 grams)', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'lightly toasted', u'finely chopped', u'(4 ounces/115 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/2 cup unsalted butter (1 stick/4 ounces/115 grams)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1 stick/4 ounces/115 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 1/2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 cup unsalted butter or vegetable shortening, softened (65 to 67\xb0F) (2 sticks/8 ounces/225 grams)', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [u'unsalted', u'softened', u'(65 to 67\xb0F)', u'(2 sticks/8 ounces/225 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'1/2 cup boiling water or brewed coffee (4.15 ounces/120 grams)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling', u'brewed', u'(4.15 ounces/120 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://toriavey.com/history-kitchen/2014/07/american-cakes-german-chocolate-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the chocolate in a medium bowl, pour the boiling water over top, and stir until melted.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool. Stir in the vanilla.To make the batter: Sift together the flour, baking soda, and salt. In a large bowl, beat the butter on low speed until smooth, about 2 minutes. Increase the speed to medium, gradually add the sugar, and beat until light and fluffy, about 4 minutes. Beat in the egg yolks, one at a time. Stir in the chocolate.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the flour mixture alternately with the milk (4 portions for the flour; 3 portions for the milk) beginning and ending with the flour, until smooth. The batter will be rather thick.  In a medium bowl, beat the egg whites on low until foamy, about 1 minute. Increase the speed to medium and beat until stiff but not dry, 5 to 8 minutes. Fold one fourth of the egg whites into the batter, then fold in the remaining whites.Divide the batter equally between the prepared pans.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [], u'step': u'Bake until a wooden tester inserted in the center comes out clean and the cake springs back when lightly touched, 30 to 35 minutes for 9-inch rounds; 45 to 50 minutes for the 8-inch squares; and 45 to 50 minutes for a 13- by 9-inch.', u'length': {u'number': 120, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Let cool in the pans for 10 minutes, then remove the cakes to wire racks and let cool completely, at least 1\xbd hours. The cake can be wrapped in plastic wrap and stored at room temperature for up to 2 days.To make the frosting: In a medium saucepan, cook the milk, sugar, butter, egg yolks, and salt over medium heat, stirring constantly, until bubbly and thickened or 170\xb0F, about 12 minutes.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from the heat and add the vanilla. Stir in the coconut and pecans.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}], u'name': u'Position a rack in the center of the oven. Preheat the oven to 350\xb0F (325\xb0F for a convection oven). Grease three 9- by 1\xbd-inch round cake pans, two 8-inch by 2-inch square pans, or one 13- by 9-inch pan, line with parchment paper or waxed paper, and grease again.To prepare the chocolate'}, {u'steps': [{u'equipment': [], u'step': u'Place a cake layer on a serving plate, spread the top with one third of the frosting. Arrange a second cake layer on top, spread with one half of the remaining frosting, top with the remaining cake layer, and spread the remaining frosting on top. Or for a sheet cake, spread the frosting over the top and sides; or cut the cake lengthwise into thirds and layer. Store in an airtight container at room temperature for up to 5 days. Do not freeze. VARIATIONSSubstitute 2 ounces (55 grams) bittersweet or semisweet chocolate and 2 ounces (55 grams) unsweetened chocolate for the sweet chocolate.German Chocolate Cupcakes: Divide the batter between 24 (2\xbd-inch) cupcake tins lined with paper liners, filling them about 2/3 full, and bake for about 25 minutes. After cooling, spread a layer of the frosting over top of each cupcake.Hawaiian Chocolate Cake: In the frosting, substitute 1 cup chopped toasted unsalted macadamia nuts (4.75 ounces/135 grams) for the pecans, reduce the vanilla to \xbd teaspoon, and add 1 teaspoon dark rum.Chocolate Tomato Cake: Substitute 1 cup unseasoned tomato sauce for the buttermilk.German Chocolate Upside Down Cake: This is a late 20th century adaptation, influenced by black bottom cake.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}], u'name': u'Let cool, stirring occasionally, until thick enough to spread, about 30 minutes.To assemble'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread the nuts on a baking sheet and bake in a 350-degree oven, shaking the sheet occasionally, until lightly browned, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u'Omit the frosting; scatter 1 cup shredded coconut and 1 cup chopped pecans in the bottom of a greased and floured 13- by 9-inch baking pan; top with the batter; beat together 8 ounces cream cheese, \xbd cup (1 stick/4 ounces/115 grams) unsalted butter, and 2 cups confectioners’ sugar until smooth, then drop spoonfuls over top of the batter; bake as above.HINTS – To Toast Pecans'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 75, u'instructions': u'Position a rack in the center of the oven. Preheat the oven to 350\xb0F (325\xb0F for a convection oven). Grease three 9- by 1\xbd-inch round cake pans, two 8-inch by 2-inch square pans, or one 13- by 9-inch pan, line with parchment paper or waxed paper, and grease again.To prepare the chocolate: Place the chocolate in a medium bowl, pour the boiling water over top, and stir until melted. Let cool. Stir in the vanilla.To make the batter: Sift together the flour, baking soda, and salt. In a large bowl, beat the butter on low speed until smooth, about 2 minutes. Increase the speed to medium, gradually add the sugar, and beat until light and fluffy, about 4 minutes. Beat in the egg yolks, one at a time. Stir in the chocolate. Add the flour mixture alternately with the milk (4 portions for the flour; 3 portions for the milk) beginning and ending with the flour, until smooth. The batter will be rather thick.  In a medium bowl, beat the egg whites on low until foamy, about 1 minute. Increase the speed to medium and beat until stiff but not dry, 5 to 8 minutes. Fold one fourth of the egg whites into the batter, then fold in the remaining whites.Divide the batter equally between the prepared pans. Bake until a wooden tester inserted in the center comes out clean and the cake springs back when lightly touched, 30 to 35 minutes for 9-inch rounds; 45 to 50 minutes for the 8-inch squares; and 45 to 50 minutes for a 13- by 9-inch.  Let cool in the pans for 10 minutes, then remove the cakes to wire racks and let cool completely, at least 1\xbd hours. The cake can be wrapped in plastic wrap and stored at room temperature for up to 2 days.To make the frosting: In a medium saucepan, cook the milk, sugar, butter, egg yolks, and salt over medium heat, stirring constantly, until bubbly and thickened or 170\xb0F, about 12 minutes. Remove from the heat and add the vanilla. Stir in the coconut and pecans. Let cool, stirring occasionally, until thick enough to spread, about 30 minutes.To assemble: Place a cake layer on a serving plate, spread the top with one third of the frosting. Arrange a second cake layer on top, spread with one half of the remaining frosting, top with the remaining cake layer, and spread the remaining frosting on top. Or for a sheet cake, spread the frosting over the top and sides; or cut the cake lengthwise into thirds and layer. Store in an airtight container at room temperature for up to 5 days. Do not freeze. VARIATIONSSubstitute 2 ounces (55 grams) bittersweet or semisweet chocolate and 2 ounces (55 grams) unsweetened chocolate for the sweet chocolate.German Chocolate Cupcakes: Divide the batter between 24 (2\xbd-inch) cupcake tins lined with paper liners, filling them about 2/3 full, and bake for about 25 minutes. After cooling, spread a layer of the frosting over top of each cupcake.Hawaiian Chocolate Cake: In the frosting, substitute 1 cup chopped toasted unsalted macadamia nuts (4.75 ounces/135 grams) for the pecans, reduce the vanilla to \xbd teaspoon, and add 1 teaspoon dark rum.Chocolate Tomato Cake: Substitute 1 cup unseasoned tomato sauce for the buttermilk.German Chocolate Upside Down Cake: This is a late 20th century adaptation, influenced by black bottom cake.     Omit the frosting; scatter 1 cup shredded coconut and 1 cup chopped pecans in the bottom of a greased and floured 13- by 9-inch baking pan; top with the batter; beat together 8 ounces cream cheese, \xbd cup (1 stick/4 ounces/115 grams) unsalted butter, and 2 cups confectioners’ sugar until smooth, then drop spoonfuls over top of the batter; bake as above.HINTS – To Toast Pecans: Spread the nuts on a baking sheet and bake in a 350-degree oven, shaking the sheet occasionally, until lightly browned, about 10 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/american-cakes-german-chocolate-cake-606063', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}