{u'recipes': [{u'sourceName': u'Damn Delicious', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/622182-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 622182, u'veryPopular': True, u'lowFodmap': False, u'title': u'Wonton Soup', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 265.65, u'creditText': u'Damn Delicious', u'extendedIngredients': [{u'originalString': u'2 baby bok choy', u'aisle': u'Produce', u'name': u'baby bok choy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 93636, u'unit': u''}, {u'originalString': u'4 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon freshly grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'3 green onions, thinly sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/4 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon yellow miso paste, or more, to taste', u'aisle': u'Ethnic Foods', u'name': u'Miso Soybean Paste', u'metaInformation': [u'yellow', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16112, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon oyster sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6176, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon reduced sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'reduced sodium soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces shiitake mushrooms', u'aisle': u'Produce', u'name': u'shiitake mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11238, u'unit': u'ounces'}, {u'originalString': u'8 ounces medium shrimp, peeled, deveined and diced', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'diced', u'medium', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon Sriracha, optional', u'aisle': u'Condiments', u'name': u'sriracha', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1016168, u'unit': u'teaspoon'}, {u'originalString': u'36 2-inch won ton wrappers', u'aisle': u'Ethnic Foods', u'name': u'won ton wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'2-inchs', u'unitShort': u'2-inch', u'amount': 36.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'2-inch'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://damndelicious.net/2014/12/06/wonton-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine shrimp, garlic, green onions, oyster sauce, soy sauce, ginger, sesame oil, Sriracha and pepper.* To assemble the wontons, place wrappers on a work surface. Spoon 1 tablespoon of the shrimp mixture into the center of each wrapper. Using your finger, rub the edges of the wrappers with water. Fold the dough over the filling to create a half-moon shape, pinching the edges to seal; set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'id': 6176, u'name': u'oyster sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat 1 tablespoon sesame oil in a large stockpot or Dutch oven over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [], u'step': u'Add garlic and ginger, and cook, stirring frequently, until fragrant, about 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in chicken broth, mushrooms and 2 cups water. Bring to a boil; reduce heat and simmer until mushrooms have softened, about 10 minutes. Stir in bok choy and green onions. Stir in miso paste until well combined, about 1-2 minutes. Stir in wontons until cooked through, about 2 minutes.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Wonton Soup. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try Mulderbosch Chenin Blanc. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food.', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 1026, u'instructions': u'In a large bowl, combine shrimp, garlic, green onions, oyster sauce, soy sauce, ginger, sesame oil, Sriracha and pepper.* To assemble the wontons, place wrappers on a work surface. Spoon 1 tablespoon of the shrimp mixture into the center of each wrapper. Using your finger, rub the edges of the wrappers with water. Fold the dough over the filling to create a half-moon shape, pinching the edges to seal; set aside. Heat 1 tablespoon sesame oil in a large stockpot or Dutch oven over medium heat. Add garlic and ginger, and cook, stirring frequently, until fragrant, about 1-2 minutes. Whisk in chicken broth, mushrooms and 2 cups water. Bring to a boil; reduce heat and simmer until mushrooms have softened, about 10 minutes. Stir in bok choy and green onions. Stir in miso paste until well combined, about 1-2 minutes. Stir in wontons until cooked through, about 2 minutes. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/wonton-soup-622182', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}