{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'european', u'irish'], u'image': u'https://spoonacular.com/recipeImages/605036-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 605036, u'veryPopular': False, u'lowFodmap': False, u'title': u'Irish Cream Ice Cream', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 212.64, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 cups half-and-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'2 cups heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1/2 cup Irish cream liqueur', u'aisle': u'Alcoholic Beverages', u'name': u'irish cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baileys-liqueur.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93764, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Irish-Cream-Ice-Cream/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 43, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Beat together half-and-half, white sugar, and brown sugar in a large bowl with an electric mixer on medium speed until the sugars have dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}]}, {u'equipment': [], u'step': u'Stir heavy cream and vanilla extract into the mixture until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}], u'step': u"Pour the mixture into an ice cream maker and freeze according to manufacturer's instructions.", u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}], u'step': u'About 2 minutes before the end of freezing time, pour Irish cream liqueur into the ice cream maker; allow the machine to finish freezing the ice cream.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer ice cream into a freezer-proof container with a tight lid and place in freezer until ice cream is hardened, at least 4 hours.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 136, u'instructions': u"Beat together half-and-half, white sugar, and brown sugar in a large bowl with an electric mixer on medium speed until the sugars have dissolved.                            Stir heavy cream and vanilla extract into the mixture until smooth.                            Pour the mixture into an ice cream maker and freeze according to manufacturer's instructions.                            About 2 minutes before the end of freezing time, pour Irish cream liqueur into the ice cream maker; allow the machine to finish freezing the ice cream.                            Transfer ice cream into a freezer-proof container with a tight lid and place in freezer until ice cream is hardened, at least 4 hours.                                                Kitchen-Friendly View", u'spoonacularSourceUrl': u'https://spoonacular.com/irish-cream-ice-cream-605036', u'dishTypes': [u'dessert'], u'occasions': [u'st patricks day', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 255, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}