{u'recipes': [{u'sourceName': u'My Life as a Mrs', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/498218-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 498218, u'veryPopular': False, u'lowFodmap': False, u'title': u'Teriyaki Chicken with Ginger Scallion Sauce', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 148.54, u'creditText': u'My Life as a Mrs', u'extendedIngredients': [{u'originalString': u'2 tablespoons grated fresh ginger (about a 1" x 2" piece)', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated', u'( a 1" x 2" piece)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon low sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'teaspoon'}, {u'originalString': u'1/4-1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup thinly sliced scallions (about 1 bunch)', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'thinly sliced', u'( 1 bunch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'4 boneless skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u"1 cup Trader Joe's SoyakiTeriyaki Sauce (or substitute your favorite Teriyaki Sauce*)", u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'your favorite', u'(or substitute Teriyaki Sauce*)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'3 tablespoons mild flavored oil (I used extra light olive oil)', u'aisle': u'?', u'name': u'mild oil', u'metaInformation': [u'light', u'flavored', u'(I used extra olive oil)'], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'unit': u'tablespoons'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.mylifeasamrs.com/2014/02/teriyaki-chicken-with-ginger-scallion-sauce.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add all ingredients to a bowl and stir well to combine. Cover, refrigerate, and allow to sit for at least 30 minutes before serving to allow the flavors to meld (may do this hours in advance).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Serve over warm teriyaki chicken.', u'number': 2, u'ingredients': []}], u'name': u'Serve over rice with a dallop of ginger scallion sauce.For the Ginger Scallion Sauce'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add chicken and teriyaki sauce to a re-sealable plastic bag and allow to marinade for a few hours or overnight preferred. When ready to cook, preheat grill to medium high heat and grill for roughly 8-10 minutes per side, or until chicken reaches a minimum internal temperature of 165\xbaF.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u'For the Chicken'}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 82, u'instructions': u'For the Chicken:Add chicken and teriyaki sauce to a re-sealable plastic bag and allow to marinade for a few hours or overnight preferred. When ready to cook, preheat grill to medium high heat and grill for roughly 8-10 minutes per side, or until chicken reaches a minimum internal temperature of 165\xbaF. Serve over rice with a dallop of ginger scallion sauce.For the Ginger Scallion Sauce:Add all ingredients to a bowl and stir well to combine. Cover, refrigerate, and allow to sit for at least 30 minutes before serving to allow the flavors to meld (may do this hours in advance). Serve over warm teriyaki chicken.', u'spoonacularSourceUrl': u'https://spoonacular.com/teriyaki-chicken-with-ginger-scallion-sauce-498218', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}