{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/545668-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 167, u'id': 545668, u'veryPopular': True, u'lowFodmap': False, u'title': u'Under-a-Spell Red Devil Cake', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 92.93, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 Tbsp. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 pkg. (8 oz.) PHILADELPHIA Cream Cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 pkg. (3.3 oz. each) JELL-O White Chocolate Flavor Instant Pudding, divided', u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [u'white', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.899999999999999, u'consistency': u'solid', u'id': 19184, u'unit': u'oz'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/3 cup oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1 pkg. (2-layer size) red velvet cake mix', u'aisle': u'Baking', u'name': u'red velvet cake mix', u'metaInformation': [u'red', u'(2-layer size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-velvet-cake.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10018099, u'unit': u'pkg'}, {u'originalString': u"3 oz. BAKER'S Semi-Sweet Chocolate", u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 19903, u'unit': u'oz'}, {u'originalString': u'6 Tbsp. unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19165, u'unit': u'Tbsp'}, {u'originalString': u'1-1/4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 tub (12 oz.) COOL WHIP Whipped Topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 42135, u'unit': u'oz'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/under-a-spell-red-devil-cake-119272.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 350F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Line 2 (15x10x1-inch) pans with foil.  Spray with cooking spray.  Lightly sprinkle 1 clean kitchen towel with 3 Tbsp. cocoa powder; sprinkle remaining cocoa powder onto large cutting board.  Beat cake mix, 1 pkg. dry pudding mix, water, oil and eggs with mixer until well blended.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Pour into prepared pans.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake 15 to 17 min. or until toothpick inserted in centers comes out clean.  Immediately invert 1 cake onto prepared towel; invert second cake onto prepared cutting board.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove pans and foil.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}], u'step': u'Cut cake on board crosswise into thirds to make 3 (10x5-inch) rectangles; place on wire racks, then cover with a second clean kitchen towel.  Set aside.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Roll up remaining cake loosely with towel, starting at one long side.  Cool all cakes completely.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Beat cream cheese in large bowl with mixer until creamy.  Gradually beat in milk.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add remaining dry pudding mixes; beat 2 min. until well blended.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in COOL WHIP.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Unroll cake slowly; remove towel.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Cut cake crosswise into thirds to make 3 (10x5-inch) rectangles.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Spread pudding mixture over all 6 cake rectangles.  Reroll 1 rolled cake piece, starting at one short side; stand in center of large plate.  Wrap remaining 2 rolled cake pieces, pudding-sides in, around first piece to resemble spiral.  Wrap the 3 flat cake pieces around spiral to complete the cake.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Microwave chocolate and butter in microwaveable bowl on HIGH 1 min.  Stir until chocolate is melted and mixture is well blended; cool.  Spoon around top edge of cake to cover outer cake pieces only, allowing glaze to drip down side.  Refrigerate 2 hours.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Cut cake into wedges to serve.', u'number': 15, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 2129, u'instructions': u'Heat oven to 350F.                                            Line 2 (15x10x1-inch) pans with foil.  Spray with cooking spray.  Lightly sprinkle 1 clean kitchen towel with 3 Tbsp. cocoa powder; sprinkle remaining cocoa powder onto large cutting board.  Beat cake mix, 1 pkg. dry pudding mix, water, oil and eggs with mixer until well blended.  Pour into prepared pans.                                             Bake 15 to 17 min. or until toothpick inserted in centers comes out clean.  Immediately invert 1 cake onto prepared towel; invert second cake onto prepared cutting board.  Remove pans and foil.  Cut cake on board crosswise into thirds to make 3 (10x5-inch) rectangles; place on wire racks, then cover with a second clean kitchen towel.  Set aside.  Roll up remaining cake loosely with towel, starting at one long side.  Cool all cakes completely.                                              Beat cream cheese in large bowl with mixer until creamy.  Gradually beat in milk.  Add remaining dry pudding mixes; beat 2 min. until well blended.  Whisk in COOL WHIP.                                            Unroll cake slowly; remove towel.  Cut cake crosswise into thirds to make 3 (10x5-inch) rectangles.  Spread pudding mixture over all 6 cake rectangles.  Reroll 1 rolled cake piece, starting at one short side; stand in center of large plate.  Wrap remaining 2 rolled cake pieces, pudding-sides in, around first piece to resemble spiral.  Wrap the 3 flat cake pieces around spiral to complete the cake.                                             Microwave chocolate and butter in microwaveable bowl on HIGH 1 min.  Stir until chocolate is melted and mixture is well blended; cool.  Spoon around top edge of cake to cover outer cake pieces only, allowing glaze to drip down side.  Refrigerate 2 hours.  Cut cake into wedges to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/under-a-spell-red-devil-cake-545668', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 187, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}