{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/213533-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 213533, u'veryPopular': False, u'lowFodmap': False, u'title': u'Asian caramel chicken wings', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 40, u'pricePerServing': 147.35, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1kg chicken wings, tips removed and cut in half', u'aisle': u'Meat', u'name': u'chicken wings', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 5100, u'unit': u'kg'}, {u'originalString': u'small piece cinnamon bark', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'piece'}, {u'originalString': u'boiled white rice, to serve', u'aisle': u'Pasta and Rice', u'name': u'cooked white rice', u'metaInformation': [u'white', u'boiled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'servings'}, {u'originalString': u'handful coriander sprigs', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'handful'}, {u'originalString': u'4 tbsp gluten-free fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tbsp'}, {u'originalString': u'large piece ginger, cut into matchsticks', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'large', u'cut into matchsticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'100g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u"1 green chilli (seeds removed if you don't like it too hot), cut into rings", u'aisle': u'Produce', u'name': u'green chilli', u'metaInformation': [u'green', u"seeds removed if you don't like it too hot), cut into rings"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'juice 1 large lime, plus extra for squeezing over', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'large', u'for squeezing over'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'small bunch spring onion, cut into 1cm lengths', u'aisle': u'Produce', u'name': u'spring onion', u'metaInformation': [u'small', u'cut into 1cm lengths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunch'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/asian-caramel-chicken-wings', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the sugar in a medium saut\xe9 pan with enough water to make it go sludgy.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place on a low heat and bring to the boil, then cook until you have a dark amber caramel (see tip, below).At arms length, add the other ingredients, except for the chicken and garnish, and bring to a simmer – take care as it will spit. Once it has calmed down a little and you have a thick sauce, stir in the wings until well coated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}, {u'equipment': [], u'step': u'Pour over 100ml water and simmer on a medium heat for about 30 mins, stirring every now and then until the sauce is a thicker consistency – add a splash more water if needed.Turn down the heat and continue to cook, covered, for a further 15 mins, stirring occasionally, until the wings are lacquered and tender and the sauce is very thick. Turn off the heat and quickly stir through half the spring onion, ginger and chilli. Tip the wings and sauce onto a platter. Scatter with the remaining garnish and coriander, and serve with extra lime and rice.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken Wings. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 319, u'instructions': u'Put the sugar in a medium saut\xe9 pan with enough water to make it go sludgy. Place on a low heat and bring to the boil, then cook until you have a dark amber caramel (see tip, below).At arms length, add the other ingredients, except for the chicken and garnish, and bring to a simmer – take care as it will spit. Once it has calmed down a little and you have a thick sauce, stir in the wings until well coated. Pour over 100ml water and simmer on a medium heat for about 30 mins, stirring every now and then until the sauce is a thicker consistency – add a splash more water if needed.Turn down the heat and continue to cook, covered, for a further 15 mins, stirring occasionally, until the wings are lacquered and tender and the sauce is very thick. Turn off the heat and quickly stir through half the spring onion, ginger and chilli. Tip the wings and sauce onto a platter. Scatter with the remaining garnish and coriander, and serve with extra lime and rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/asian-caramel-chicken-wings-213533', u'dishTypes': [u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}