{u'recipes': [{u'sourceName': u'Bakers Royale', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/541659-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 541659, u'veryPopular': False, u'lowFodmap': True, u'title': u'Strawberry Meringue Cookies', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'pricePerServing': 2.96, u'creditText': u'Bakers Royale', u'extendedIngredients': [{u'originalString': u'1/8 teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup superfine sugar or granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/3 cup sifted powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'6 drops red food coloring', u'aisle': u'Baking', u'name': u'red food coloring', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 6.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'drops'}, {u'originalString': u'1 tablespoon seedless Strawberry jam (at room temperature)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'strawberry jam', u'metaInformation': [u'seedless', u'at room temperature', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10819297, u'unit': u'tablespoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://www.bakersroyale.com/cookies/strawberry-meringue-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 300 degrees F.For the remainder of the recipe, click here', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 329, u'instructions': u'Preparation: Heat oven to 300 degrees F.For the remainder of the recipe, click here', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-meringue-cookies-541659', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}