{u'recipes': [{u'sourceName': u'Handle the Heat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/559486-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 559486, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Stout Cheesecake Bars', u'diets': [], u'pricePerServing': 106.51, u'creditText': u'Handle the Heat', u'extendedIngredients': [{u'originalString': u'4 ounces bittersweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'8 ounces cream cheese, at room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 full graham cracker sheets', u'aisle': u'Sweet Snacks', u'name': u'graham cracker sheets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18617, u'unit': u''}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon instant espresso powder', u'aisle': u'Tea and Coffee', u'name': u'instant espresso powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10014214, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups small twist pretzels', u'aisle': u'Savory Snacks', u'name': u'pretzels', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19047, u'unit': u'cups'}, {u'originalString': u'1/4 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1/3 cup stout beer', u'aisle': u'Alcoholic Beverages', u'name': u'stout beer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 93619, u'unit': u'cup'}, {u'originalString': u'4 tablespoons unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.handletheheat.com/2012/08/chocolate-stout-cheesecake-bars.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the crust:Preheat oven to 325\xb0F. Line an 8x8-inch baking pan with foil or parchment paper, leaving a slight overhang on two sides. Using a food processor, pulse the graham crackers, pretzels, and sugar until finely ground.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the butter and pulse until mixture is evenly moistened. Press the mixture into the bottom of the prepared pan.For the filling:In a small saucepan combine the chocolate and beer over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Heat until the chocolate is melted, stirring constantly.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and allow to cool.Wipe the processor bowl clean and add the cream cheese and sour cream. Process until smooth, scraping sides of the bowl as needed.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add both sugars, cocoa powder, vanilla and espresso powder and process until well combined. Scrape down the sides of the bowl and add the egg and cornstarch and pulse to combine.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10014214, u'name': u'instant espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the melted chocolate mixture and pulse until combined.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the filling over the cookie crust.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 35 to 40 minutes, or until the edges of the cheesecake are set and the center is only slightly jiggly.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove to a wire rack and cool completely. Cover and chill in the refrigerator for at least 2 hours, but preferably overnight. Use the foil to lift the cheesecake from the pan and place on a cutting board. Using a sharp knife, slice into bars. For cleaner cuts, dip knife in hot water and wipe between cuts.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 254, u'instructions': u'For the crust:Preheat oven to 325\xb0F. Line an 8x8-inch baking pan with foil or parchment paper, leaving a slight overhang on two sides. Using a food processor, pulse the graham crackers, pretzels, and sugar until finely ground. Add the butter and pulse until mixture is evenly moistened. Press the mixture into the bottom of the prepared pan.For the filling:In a small saucepan combine the chocolate and beer over medium-high heat. Heat until the chocolate is melted, stirring constantly. Remove from heat and allow to cool.Wipe the processor bowl clean and add the cream cheese and sour cream. Process until smooth, scraping sides of the bowl as needed. Add both sugars, cocoa powder, vanilla and espresso powder and process until well combined. Scrape down the sides of the bowl and add the egg and cornstarch and pulse to combine. Add the melted chocolate mixture and pulse until combined. Pour the filling over the cookie crust.Bake for 35 to 40 minutes, or until the edges of the cheesecake are set and the center is only slightly jiggly. Remove to a wire rack and cool completely. Cover and chill in the refrigerator for at least 2 hours, but preferably overnight. Use the foil to lift the cheesecake from the pan and place on a cutting board. Using a sharp knife, slice into bars. For cleaner cuts, dip knife in hot water and wipe between cuts.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-stout-cheesecake-bars-559486', u'dishTypes': [], u'occasions': [u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}