{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/493652-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 493652, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Pork Tenderloin With Chipotle Sauce', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 205.14, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'1/3 cup apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'1/4 cup apricots, finely chopped', u'aisle': u'Produce', u'name': u'apricots', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9021, u'unit': u'cup'}, {u'originalString': u'6 ounces lager style beer, such as Budweiser or beer of your preference', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u' such as budweiser or beer of your preference', u'lager style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'ounces'}, {u'originalString': u'1/8 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 canned chipotle peppers, finely chopped', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'canned chipotle peppers', u'metaInformation': [u'canned', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'1/4 cup chili sauce', u'aisle': u'Ethnic Foods', u'name': u'chili sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 6972, u'unit': u'cup'}, {u'originalString': u'1/2 cup chipotle sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11632, u'unit': u'cup'}, {u'originalString': u'1 tablespoon dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 1034053, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons fresh ginger, minced', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 teaspoons fresh garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'3/4 cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup lightly packed dark or light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'dark', u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 cup onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1 1-pound pork tenderloin', u'aisle': u'Meat', u'name': u'pork tenderloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10218, u'unit': u'pound'}, {u'originalString': u'2 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon chopped fresh mix of thyme, flat Italian parsley, and oregano', u'aisle': u'?', u'name': u'mix of thyme', u'metaInformation': [u'fresh', u'italian', u'chopped'], u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'tablespoon'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.foodrepublic.com/2014/03/18/roasted-pork-tenderloin-chipotle-sauce-recipe', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat the oven to 400F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a medium, ovenproof saut pan over medium-high heat and lightly coat with olive oil cooking spray. Season all sides of the pork tenderloin with salt, pepper, and fresh herbs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10218, u'name': u'pork tenderloin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pork to the pan and sear on one side for 1 to 2 minutes. Turn and continue searing until browned all over.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the pan in the hot oven and finish cooking, another 3 to 5 minutes. Aim for pork thats light pink in the center.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u'For the pork tenderloin'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the olive oil in medium saucepan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion, apricots, garlic, and ginger. Saut for about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'id': 9021, u'name': u'apricot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the ketchup, vinegar, soy sauce, brown sugar, mustard, chili sauce, chipotles, orange juice, and beer. Bring the sauce to a boil, reduce the heat to a simmer, and simmer for about 30 minutes to blend the flavors and thicken the sauce.  To serve:  Arrange the pork slices on each plate and drizzle with 2 tablespoons of warm chipotle sauce.  Try some other pork recipes on Food Republic:  Pork With Peaches And Mustard Recipe Spicy Grilled Jerk Pork Chops Recipe Jalapeno Pork Slab With Bacon Jam Recipe', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 6972, u'name': u'chili sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}], u'name': u'Let the pork rest for another 3 to 4 minutes and then cut into slices.  For the chipotle sauce'}], u'winePairing': {u'pairingText': u"Malbec, Pinot Noir, and Sangiovese are my top picks for Pork Tenderloin. Pinot noir's light body is great for lean cuts, medium bodied sangiovese complement meaty sauces, stews, and other multi-ingredient dishes, and full-bodied tannic malbec pairs with fatty cuts and barbecue. The Finca La Malena Malbec with a 5 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'malbec', u'pinot noir', u'sangiovese'], u'productMatches': [{u'description': u'100% Malbec from eastern Mendoza. Limestone and clay soils, cool winters and warm summers provide great fruit concentration, and smooth tannins. Dark ruby in color reflecting light in an array of orange/purple hues. Pleasant nose filled with hints of red forest fruits and herbs. Young round tannins give it a silky sensuous texture that leads to a rich mouthfeel. Mouthwatering layers of red berries, plum, vanilla and spice open as it warms up, delivering a rich varietal character. A delicate finish that bridges the gap between drinks and lingers well after the last sip.', u'title': u'Finca La Malena Malbec', u'price': u'$13.99', u'id': 431374, u'link': u'https://www.amazon.com/2015-Finca-Malena-Malbec-750mL/dp/B01N9QTXGO', u'imageUrl': u'https://spoonacular.com/productImages/431374-312x231.jpg'}]}, u'aggregateLikes': 196, u'instructions': u'For the pork tenderloin:  Heat the oven to 400F. Heat a medium, ovenproof saut pan over medium-high heat and lightly coat with olive oil cooking spray. Season all sides of the pork tenderloin with salt, pepper, and fresh herbs. Add the pork to the pan and sear on one side for 1 to 2 minutes. Turn and continue searing until browned all over. Place the pan in the hot oven and finish cooking, another 3 to 5 minutes. Aim for pork thats light pink in the center. Let the pork rest for another 3 to 4 minutes and then cut into slices.  For the chipotle sauce:  Heat the olive oil in medium saucepan. Add the onion, apricots, garlic, and ginger. Saut for about 2 minutes. Add the ketchup, vinegar, soy sauce, brown sugar, mustard, chili sauce, chipotles, orange juice, and beer. Bring the sauce to a boil, reduce the heat to a simmer, and simmer for about 30 minutes to blend the flavors and thicken the sauce.  To serve:  Arrange the pork slices on each plate and drizzle with 2 tablespoons of warm chipotle sauce.  Try some other pork recipes on Food Republic:  Pork With Peaches And Mustard Recipe Spicy Grilled Jerk Pork Chops Recipe Jalapeno Pork Slab With Bacon Jam Recipe', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-pork-tenderloin-with-chipotle-sauce-493652', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}