{u'recipes': [{u'sourceName': u'Naturally Ella', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/711393-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 711393, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Cauliflower Soup', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 231.79, u'creditText': u'Naturally Ella', u'extendedIngredients': [{u'originalString': u'Toasted Bread crumbs, for topping', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'toasted', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 18079, u'unit': u'servings'}, {u'originalString': u'4 cups cauliflower florets', u'aisle': u'Produce', u'name': u'cauliflower florets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10011135, u'unit': u'cups'}, {u'originalString': u'2 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 cup heavy cream (optional)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'Hot sauce, for topping', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'Salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cup vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}, {u'originalString': u'1 to 2 cups water (see note)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1/2 medium yellow onion, minced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'minced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://naturallyella.com/roasted-cauliflower-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425 F. Toss with 1 tablespoon olive oil and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place on a baking tray in a single layer. Roast stirring once halfway through, until cauliflower is caramelized, 25 to 30 minutes.While cauliflower is roasting, heat a medium stock pot over medium-low heat.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Add olive oil followed by the minced onion. Cook until onion is fragrant and translucent, 5 to 6 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in the garlic and thyme, cooking for one minute more.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Add in the vegetable broth and water, bring to a boil, reduce to a simmer, and let simmer until the cauliflower has finished roasting. Pull a few small pieces of cauliflower out and set aside for topping.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the broth mixture and cauliflower in a blender and puree until smooth. If a perfectly smooth consistency is desired, pass the soup mixture through a sieve while transferring back to the pot.Once the soup is back in the pot, measure in the heavy cream and heat over low until ready to serve.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 127, u'instructions': u'Preheat oven to 425 F. Toss with 1 tablespoon olive oil and salt. Place on a baking tray in a single layer. Roast stirring once halfway through, until cauliflower is caramelized, 25 to 30 minutes.While cauliflower is roasting, heat a medium stock pot over medium-low heat. Add olive oil followed by the minced onion. Cook until onion is fragrant and translucent, 5 to 6 minutes. Add in the garlic and thyme, cooking for one minute more.Add in the vegetable broth and water, bring to a boil, reduce to a simmer, and let simmer until the cauliflower has finished roasting. Pull a few small pieces of cauliflower out and set aside for topping. Place the broth mixture and cauliflower in a blender and puree until smooth. If a perfectly smooth consistency is desired, pass the soup mixture through a sieve while transferring back to the pot.Once the soup is back in the pot, measure in the heavy cream and heat over low until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-cauliflower-soup-711393', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}