{u'recipes': [{u'sourceName': u'Two Peas and Their Pod', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/548365-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 548365, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Chip Peppermint Crunch Cookies', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 92.78, u'creditText': u'Two Peas and Their Pod', u'extendedIngredients': [{u'originalString': u'3 3/4 cups all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 1/2 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'6 large candy canes, crushed', u'aisle': u'Sweet Snacks', u'name': u'candy canes', u'metaInformation': [u'large', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 93759, u'unit': u''}, {u'originalString': u'1 1/2 cups chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10019146, u'unit': u'cups'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 boxes (3.5 ounce) Peppermint Crunch Junior Mints', u'aisle': u'Baking', u'name': u'peppermint crunch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 98858, u'unit': u'ounce'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'Sea salt, for sprinkling on cookies', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'for sprinkling on cookies'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 cup unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 1/2 tablespoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.twopeasandtheirpod.com/chocolate-chip-peppermint-crunch-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 350 degrees F.  If you are making giant cookies, spray a muffin top pan and set aside. If you are making regular sized cookies, line a baking sheet with parchment paper or a silicone baking mat and set aside. 2. In a large bowl, whisk together the flour, baking soda, and salt. Set aside. In a large mixing bowl, cream the butter and sugars together until smooth. Beat in eggs and vanilla until well combined. Slowly add the dry ingredients to the wet ingredients. Stir in the chocolate chips. 3. To make giant cookies-scoop out 1/4 cup of dough and flatten the dough with your hands.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place 3 Peppermint Crunch Junior Mints onto the dough and wrap the dough around the candies. Make sure they are covered. Press the dough into the muffin top pans. Sprinkle crushed candy cane pieces and sea salt over each cookie. To make regular sized cookies-tuck 1 Peppermint Crunch Junior Mint into about 1 tablespoon of cookie dough. Form into a ball and roll into crushed candy cane pieces.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'id': 98858, u'name': u'peppermint crunch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'id': 93759, u'name': u'candy cane'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place cookies on baking sheet and sprinkle with sea salt. 4.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [], u'step': u'Bake giant cookies for 10-13 minutes, until edges just start to turn golden brown.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cookies cool for 10 minutes in muffin top pan before transferring to a cooling rack.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake regular sized cookies for 8-10 minutes, or until edges just start to turn golden brown. Cool on baking sheet for 5 minutes before transferring to a cooling rack.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1984, u'instructions': u'1. Preheat oven to 350 degrees F.  If you are making giant cookies, spray a muffin top pan and set aside. If you are making regular sized cookies, line a baking sheet with parchment paper or a silicone baking mat and set aside. 2. In a large bowl, whisk together the flour, baking soda, and salt. Set aside. In a large mixing bowl, cream the butter and sugars together until smooth. Beat in eggs and vanilla until well combined. Slowly add the dry ingredients to the wet ingredients. Stir in the chocolate chips. 3. To make giant cookies-scoop out 1/4 cup of dough and flatten the dough with your hands. Place 3 Peppermint Crunch Junior Mints onto the dough and wrap the dough around the candies. Make sure they are covered. Press the dough into the muffin top pans. Sprinkle crushed candy cane pieces and sea salt over each cookie. To make regular sized cookies-tuck 1 Peppermint Crunch Junior Mint into about 1 tablespoon of cookie dough. Form into a ball and roll into crushed candy cane pieces. Place cookies on baking sheet and sprinkle with sea salt. 4. Bake giant cookies for 10-13 minutes, until edges just start to turn golden brown.  Let cookies cool for 10 minutes in muffin top pan before transferring to a cooling rack. Bake regular sized cookies for 8-10 minutes, or until edges just start to turn golden brown. Cool on baking sheet for 5 minutes before transferring to a cooling rack.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-chip-peppermint-crunch-cookies-548365', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 13, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}