{u'recipes': [{u'sourceName': u'The Pioneer Woman', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/471053-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 471053, u'veryPopular': True, u'lowFodmap': False, u'title': u'Tortellini Primavera', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 289.56, u'creditText': u'The Pioneer Woman', u'extendedIngredients': [{u'originalString': u'Extra Basil, For Serving', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2044, u'unit': u'servings'}, {u'originalString': u'8 whole Basil Leaves, Chopped (or Chiffonade)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'whole', u'chopped', u'(or Chiffonade)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'2 Tablespoons Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'3 whole Carrots, Peeled And Diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'whole', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 cup Cauliflower, Broken Into Small Pieces', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'cup'}, {u'originalString': u'1/4 cup Chicken Broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'3/4 cups Cooked Ham, Diced', u'aisle': u'Meat', u'name': u'diced ham', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/diced-ham.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 99186, u'unit': u'cups'}, {u'originalString': u'3 cloves Garlic, Minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/3 cup Heavy Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 whole Medium Onion, Finely Diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'whole', u'medium', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Extra Parmesan, For Serving', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1/2 cup Grated Parmesan Cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 cup Frozen Peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'Salt And Pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 pound Cheese Or Spinach Tortellini', u'aisle': u'Pasta and Rice;Refrigerated;Frozen', u'name': u'spinach tortellini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93725, u'unit': u'pound'}, {u'originalString': u'1/4 cup White Wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://thepioneerwoman.com/cooking/2014/03/tortellini-primavera/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+pwcooks+%28The+Pioneer+Woman+Cooks%21%29', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook tortellini a couple of minutes less than package directions call for.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain and set aside. Melt the butter in a large skillet over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the onions and garlic and stir to cook for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the carrots and cauliflower, stir, and cook 1 minute. Splash in wine and broth, then cook for 2 to 3 minutes, until the liquid reduces a bit. Stir in cream and Parmesan and stir. When the mixture is hot, stir in peas, ham, salt, and pepper. Allow them to heat up in the sauce. When the sauce is hot, stir in the tortellini. Check for seasonings, add more if needed, and serve with extra Parmesan and basil.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6775, u'instructions': u'Cook tortellini a couple of minutes less than package directions call for. Drain and set aside. Melt the butter in a large skillet over medium-high heat. Add the onions and garlic and stir to cook for 1 minute. Add the carrots and cauliflower, stir, and cook 1 minute. Splash in wine and broth, then cook for 2 to 3 minutes, until the liquid reduces a bit. Stir in cream and Parmesan and stir. When the mixture is hot, stir in peas, ham, salt, and pepper. Allow them to heat up in the sauce. When the sauce is hot, stir in the tortellini. Check for seasonings, add more if needed, and serve with extra Parmesan and basil.', u'spoonacularSourceUrl': u'https://spoonacular.com/tortellini-primavera-471053', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}