{u'recipes': [{u'sourceName': u'Crazy for Crust', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/732204-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 732204, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tiramisu Cups To Go', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 83.24, u'creditText': u'Crazy for Crust', u'extendedIngredients': [{u'originalString': u'8 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 cup cold heavy whipping cream (may substitute whipped topping)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [u'cold', u'(may substitute whipped topping)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons instant coffee (or you can use cold brewed coffee, see step 1)', u'aisle': u'Tea and Coffee', u'name': u'instant coffee', u'metaInformation': [u'cold', u'brewed', u'canned', u'(or you can use coffee, see step 1)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 14214, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'6-8 unfrosted (baked and cooled) vanilla cupcakes', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [u'cooled', u'(baked and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 2050, u'unit': u''}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.crazyforcrust.com/2016/04/tiramisu-cups-to-go/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u"Stir instant coffee into hot water and let cool. Alternately, you can use cold leftover coffee.Beat heavy whipping cream until stiff peaks form using a stand or a hand mixer. Set aside. (Alternately you can use one 8 ounce tub of whipped topping.)Beat cream cheese with powdered sugar until smooth, then mix in vanilla and 1-2 tablespoons of coffee to taste. Fold in whipped cream (or whipped topping, if you're using).Slice each cupcake in half or thirds, depending on the size of your cups or how big you want each tiramisu to be.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 14214, u'name': u'instant coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Place one cupcake slice in the bottom of a clear plastic disposable cup.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Brush it with remaining coffee, then top with some of the tiramisu cream. Dust it with cocoa, then repeat for 1-2 more layers. Dust the top with cocoa.Store in refrigerator until ready to serve. To take these to-go, wrap the tops with plastic wrap. They make a great party treat or easy potluck item.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Tiramisu on the menu? Try pairing with Cream Sherry, Chianti, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'chianti', u'moscato dasti', u'port', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 213, u'instructions': u"Stir instant coffee into hot water and let cool. Alternately, you can use cold leftover coffee.Beat heavy whipping cream until stiff peaks form using a stand or a hand mixer. Set aside. (Alternately you can use one 8 ounce tub of whipped topping.)Beat cream cheese with powdered sugar until smooth, then mix in vanilla and 1-2 tablespoons of coffee to taste. Fold in whipped cream (or whipped topping, if you're using).Slice each cupcake in half or thirds, depending on the size of your cups or how big you want each tiramisu to be. Place one cupcake slice in the bottom of a clear plastic disposable cup. Brush it with remaining coffee, then top with some of the tiramisu cream. Dust it with cocoa, then repeat for 1-2 more layers. Dust the top with cocoa.Store in refrigerator until ready to serve. To take these to-go, wrap the tops with plastic wrap. They make a great party treat or easy potluck item.", u'spoonacularSourceUrl': u'https://spoonacular.com/tiramisu-cups-to-go-732204', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}