{u'recipes': [{u'sourceName': u'Dinner Mom', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/593783-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 593783, u'veryPopular': True, u'lowFodmap': False, u'title': u'Three Cheese Rosemary and Garlic Pizza Bites in a Cake Pops Maker', u'diets': [], u'pricePerServing': 28.09, u'creditText': u'Dinner Mom', u'extendedIngredients': [{u'originalString': u'1 8 ounce can Pillsbury crescent roll dough', u'aisle': u'Refrigerated', u'name': u'crescent roll dough', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93618, u'unit': u'ounce'}, {u'originalString': u'2 Tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tablespoons'}, {u'originalString': u'1 teaspoon fresh rosemary, finely chopped', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2/3 cup ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1036, u'unit': u'cup'}, {u'originalString': u'1 cup mozzarella, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.dinner-mom.com/three-cheese-pizza-bites-in-cake-pops-maker/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix olive oil, garlic and rosemary in a small bowl and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix cheeses in a separate bowl and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Roll out dough and press together seams.Use a knife or pizza cutter to make 24 small squares (four cuts lengthwise and 6 cuts on the shorter side.)', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Brush olive oil mixture over the dough.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Place 1 teaspoon of cheese mixture on each square. Pull up the sides of the dough over the cheese and roll into a ball.Repeat for all of the squares.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place 12 balls into pre-heated cake pops maker. Close lid and cook for about 3 minutes, turning halfway through if you have a rotating maker. We used a Babycakes Cake Pop Maker. If you are using a different appliance, follow the cooking instructions for that appliance.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Remove pizza bites with toothpicks.Repeat process with remaining pizza bites.Enjoy!', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1160, u'instructions': u'Mix olive oil, garlic and rosemary in a small bowl and set aside.Mix cheeses in a separate bowl and set aside.Roll out dough and press together seams.Use a knife or pizza cutter to make 24 small squares (four cuts lengthwise and 6 cuts on the shorter side.)Brush olive oil mixture over the dough.Place 1 teaspoon of cheese mixture on each square. Pull up the sides of the dough over the cheese and roll into a ball.Repeat for all of the squares.Place 12 balls into pre-heated cake pops maker. Close lid and cook for about 3 minutes, turning halfway through if you have a rotating maker. We used a Babycakes Cake Pop Maker. If you are using a different appliance, follow the cooking instructions for that appliance.Remove pizza bites with toothpicks.Repeat process with remaining pizza bites.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/three-cheese-rosemary-and-garlic-pizza-bites-in-a-cake-pops-maker-593783', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}