{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/745219-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 745219, u'veryPopular': False, u'lowFodmap': False, u'title': u'Inside-Out Bacon Cheeseburgers with Grilled Green Onion Mayo', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 319.15, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'5 slices bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 5.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 tablespoon steak seasoning blend or coarse salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'4 crusty Kaiser rolls, split', u'aisle': u'Bakery/Bread', u'name': u'crusty rolls', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-roll-or-crusty-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18349, u'unit': u''}, {u'originalString': u'1/2 pound extra sharp white cheddar cheese, crumbled', u'aisle': u'Cheese', u'name': u'extra sharp cheddar cheese', u'metaInformation': [u'white', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1021009, u'unit': u'pound'}, {u'originalString': u'1 1/3 pounds ground beef sirloin', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.3333333333333333, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pounds'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'Extra-virgin olive oil, for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 cup mayonnaise or reduced fat mayonnaise', u'aisle': u'Condiments', u'name': u'reduced fat mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4641, u'unit': u'cup'}, {u'originalString': u'4 leaves crisp romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'crisp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 4.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'leaves'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 scallions, cleaned and trimmed', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'cleaned', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tablespoon Worcestershire sauce, eyeball it', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 27.0, u'imageType': u'jpeg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/rachael-ray/inside-out-bacon-cheeseburgers-with-grilled-green-onion-mayo-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 38, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Preheat grill pan over high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a medium pan brown bacon over medium high heat and drain on paper towel lined plate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush scallions with a little oil and grill on hot grill pan 2 or 3 minutes on each side.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [], u'step': u'Remove from heat to cool.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Combine ground beef with Worcestershire and steak seasoning or salt and pepper. Divide meat into 4 equal parts.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Combine cheese crumbles and cooked bacon. Take 1/4 of the meat in your hand and make a well in the center of it. Pile in cheese and bacon, then carefully form the burger around the cheese and bacon filling. Make sure the fillings are completely covered with meat. When all 4 patties are formed, drizzle burgers with oil and place on hot grill pan. Cook 2 minutes on each side over high heat, reduce heat to medium low and cook burgers 7 or 8 minutes longer, turning occasionally. Do not press down on burgers as they cook.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Transfer burgers to a plate and let them rest 5 minutes before serving.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Chop cooled, grilled green onions and add to a food processor.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add mayonnaise and cumin to the food processor and pulse the onions and mayonnaise. Season with salt and pepper, to your taste.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Pile burgers on crusty buns and top with crisp lettuce leaves and a slather of green onion mayonnaise. As you bite into the burgers, you will find a smoky, cheesy surprise at the center.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Alamos Malbec Mendoza Seleccion with a 4.2 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Malbec is the "signature wines of the Mendoza region, representing the greatest achievements of Argentine winemaking, and Alamos Seleccion Malbec is the pinnacle of Alamos winemaking. The nose is full of ripe black fruits with floral tones and touches of leather, vanilla, and spice. The mouthfeel is full yet supple, with juicy black raspberry, black cherry and black currant fruit flavors layered with notes of violets, black pepper and anise. The finish is long and lingering, with soft, velvety tannins and bright, refreshing acidity. View More', u'title': u'Alamos Malbec Mendoza Seleccion', u'price': u'$16.95', u'id': 443245, u'link': u'https://www.wine.com/product/alamos-malbec-mendoza-seleccion-2009/106171', u'imageUrl': u'https://spoonacular.com/productImages/443245-312x231.jpg'}]}, u'aggregateLikes': 298, u'instructions': u'Preheat grill pan over high heat.                          In a medium pan brown bacon over medium high heat and drain on paper towel lined plate.                          Brush scallions with a little oil and grill on hot grill pan 2 or 3 minutes on each side. Remove from heat to cool.                          Combine ground beef with Worcestershire and steak seasoning or salt and pepper. Divide meat into 4 equal parts. Combine cheese crumbles and cooked bacon. Take 1/4 of the meat in your hand and make a well in the center of it. Pile in cheese and bacon, then carefully form the burger around the cheese and bacon filling. Make sure the fillings are completely covered with meat. When all 4 patties are formed, drizzle burgers with oil and place on hot grill pan. Cook 2 minutes on each side over high heat, reduce heat to medium low and cook burgers 7 or 8 minutes longer, turning occasionally. Do not press down on burgers as they cook. Transfer burgers to a plate and let them rest 5 minutes before serving.                          Chop cooled, grilled green onions and add to a food processor. Add mayonnaise and cumin to the food processor and pulse the onions and mayonnaise. Season with salt and pepper, to your taste.                          Pile burgers on crusty buns and top with crisp lettuce leaves and a slather of green onion mayonnaise. As you bite into the burgers, you will find a smoky, cheesy surprise at the center.', u'spoonacularSourceUrl': u'https://spoonacular.com/inside-out-bacon-cheeseburgers-with-grilled-green-onion-mayo-745219', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}