{u'recipes': [{u'sourceName': u'Shrinking Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/850460-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 850460, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sunny Avocado Toast', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 134.51, u'creditText': u'Shrinking Kitchen', u'extendedIngredients': [{u'originalString': u'2 California avocados', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'4 slices of your favorite grainy bread (I used Ezekiel Bread)', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'your favorite', u'(I used Ezekiel Bread)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'2 teaspoons butter or ghee', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 fresh lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'servings'}, {u'originalString': u'sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://shrinkingkitchen.com/sunny-avocado-toast/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Halve and scoop out your avocados. Slice into strips or mash, whatever you like. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat your egg pan and melt the butter or ghee.Throw your bread in the toaster.Fry your eggs to your preferred doneness. I think over easy is the best, personally, I like the way the yolk mixes with the avocado!When your bread pops up, place each slice on a plate. Arrange your avocado on the bread, then sprinkle each slice with red pepper flake, sea salt and pepper. Squeeze a bit of lemon juice over the avocado.When the eggs are ready, gently place one atop each avocado toast.Eat immediately! Yum!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 12, u'instructions': u'Halve and scoop out your avocados. Slice into strips or mash, whatever you like. Set aside.Heat your egg pan and melt the butter or ghee.Throw your bread in the toaster.Fry your eggs to your preferred doneness. I think over easy is the best, personally, I like the way the yolk mixes with the avocado!When your bread pops up, place each slice on a plate. Arrange your avocado on the bread, then sprinkle each slice with red pepper flake, sea salt and pepper. Squeeze a bit of lemon juice over the avocado.When the eggs are ready, gently place one atop each avocado toast.Eat immediately! Yum!', u'spoonacularSourceUrl': u'https://spoonacular.com/sunny-avocado-toast-850460', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}