{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479544-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 479544, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Sausage and Kale Penne', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 163.93, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'\xbe cup half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'\xbd lb. sweet Italian sausage', u'aisle': u'Meat', u'name': u'italian sausage', u'metaInformation': [u'sweet', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 7036, u'unit': u'lb'}, {u'originalString': u'About 6 large kale leaves, torn from the rib and roughly chopped', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'large', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11233, u'unit': u''}, {u'originalString': u'Splash lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'servings'}, {u'originalString': u'1 teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'8 oz. penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'oz'}, {u'originalString': u'Dash red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'Dash'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 yellow bell pepper, chopped', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 62.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.neighborfoodblog.com/2013/11/creamy-parmesan-sausage-and-kale-penne.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add sausage and pepper and cook until sausage is browned and pepper is softened, about 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add half and half to skillet and let cook down until reduced by about half, or approximately another 7 minutes.Meanwhile, start a pot of water to boil for the penne. Cook according to package directions. Reserve \xbc cup of pasta water when draining. Once drained, return pasta to the pot and toss with a teaspoon of olive oil.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'id': 11120420, u'name': u'penne'}]}, {u'equipment': [], u'step': u'Add kale to the sausage mixture and let wilt.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Add lemon juice and red pepper flakes, stirring to combine.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add penne and cheese to the skillet and toss. If sauce is too thick, add pasta water to thin it out and make it spread.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'id': 11120420, u'name': u'penne'}]}, {u'equipment': [], u'step': u'Serve warm with good crusty bread and a side salad!', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1254, u'instructions': u'Heat a large skillet over medium heat. Add sausage and pepper and cook until sausage is browned and pepper is softened, about 7 minutes. Add half and half to skillet and let cook down until reduced by about half, or approximately another 7 minutes.Meanwhile, start a pot of water to boil for the penne. Cook according to package directions. Reserve \xbc cup of pasta water when draining. Once drained, return pasta to the pot and toss with a teaspoon of olive oil.Add kale to the sausage mixture and let wilt. Add lemon juice and red pepper flakes, stirring to combine. Add penne and cheese to the skillet and toss. If sauce is too thick, add pasta water to thin it out and make it spread. Serve warm with good crusty bread and a side salad!', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-sausage-and-kale-penne-479544', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}