{u'recipes': [{u'sourceName': u'Girl Versus Dough', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/605465-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 255, u'id': 605465, u'veryPopular': True, u'lowFodmap': False, u'title': u'slow cooker italian meatballs', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 44.32, u'creditText': u'Girl Versus Dough', u'extendedIngredients': [{u'originalString': u'12 ounces bulk mild Italian sausage', u'aisle': u'Meat', u'name': u'bulk pork sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 7063, u'unit': u'ounces'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'2 lbs ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lbs'}, {u'originalString': u'1 \xbc cups Italian seasoned breadcrumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'italian seasoned breadcrumbs', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 18376, u'unit': u'cups'}, {u'originalString': u'\xbd cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'\xbc cup shredded Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 (24 oz) jars marinara pasta sauce (or make your own & use 6 cups)', u'aisle': u'Pasta and Rice', u'name': u'pasta sauce', u'metaInformation': [u'(or make your own & use 6 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 48.0, u'consistency': u'solid', u'id': 10011549, u'unit': u'oz'}, {u'originalString': u'\xbd teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.girlversusdough.com/2014/07/14/slow-cooker-italian-meatballs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, whisk together milk and eggs until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add ground beef, Italian sausage, breadcrumbs, Parmesan cheese, salt, pepper and garlic powder; stir with a wooden spoon or mix with your fingers until well combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat broiler to high; place an oven rack about 4 to 5 inches from the broiler. Lightly grease 2 baking sheets with cooking spray or oil. Using your hands, shape (about 40) 1 to 2-inch meatballs from the mixture; place on prepared baking sheets.Broil meatballs 6 to 8 minutes, flipping halfway through, until browned.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer to a 6-quart slow cooker.Top meatballs evenly with sauce. Cover and cook on low 4 to 5 hours in the slow cooker until meatballs are cooked through to an internal temperature of at least 160 degrees F.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Serve on top of pasta, on split hoagie rolls with melty cheese for meatball sub sandwiches, alongside buttery mashed potatoes or on their own as an appetizer.NOTE: This recipe makes a lot of meatballs, so if you don't plan to freeze any I'd suggest halving the recipe.", u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 2835, u'instructions': u"In a large bowl, whisk together milk and eggs until combined. Add ground beef, Italian sausage, breadcrumbs, Parmesan cheese, salt, pepper and garlic powder; stir with a wooden spoon or mix with your fingers until well combined.Heat broiler to high; place an oven rack about 4 to 5 inches from the broiler. Lightly grease 2 baking sheets with cooking spray or oil. Using your hands, shape (about 40) 1 to 2-inch meatballs from the mixture; place on prepared baking sheets.Broil meatballs 6 to 8 minutes, flipping halfway through, until browned. Transfer to a 6-quart slow cooker.Top meatballs evenly with sauce. Cover and cook on low 4 to 5 hours in the slow cooker until meatballs are cooked through to an internal temperature of at least 160 degrees F.Serve on top of pasta, on split hoagie rolls with melty cheese for meatball sub sandwiches, alongside buttery mashed potatoes or on their own as an appetizer.NOTE: This recipe makes a lot of meatballs, so if you don't plan to freeze any I'd suggest halving the recipe.", u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-italian-meatballs-605465', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 270, u'servings': 40, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}