{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/206078-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 206078, u'veryPopular': False, u'lowFodmap': True, u'title': u'Cook the Book: Roasted Blackfish with Olives and Sage', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'whole 30'], u'pricePerServing': 734.69, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'Urfa or Aleppo red pepper, for seasoning', u'aisle': u'Spices and Seasonings', u'name': u'aleppo pepper', u'metaInformation': [u'red', u'for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1062009, u'unit': u'servings'}, {u'originalString': u'Freshly ground black pepper, for seasoning', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 small bunch fresh sage', u'aisle': u'Produce', u'name': u'fresh sage', u'metaInformation': [u'fresh', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'bunch'}, {u'originalString': u'Freshly squeezed juice of 1/2 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/2 cup pitted kalamata or other olives', u'aisle': u'Canned and Jarred', u'name': u'kalamata olive', u'metaInformation': [u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1009195, u'unit': u'cup'}, {u'originalString': u'Kosher salt, for seasoning', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 (1-pound) skin-on blackfish fillets, patted dry', u'aisle': u'Ethnic Foods', u'name': u'tofu skin', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beancurd-sheets.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 98891, u'unit': u'pound'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/10/roasted-blackfish-with-olives-and-sage-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425\xb0F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drizzle 1 tablespoon of the oil into the bottom of a baking sheet.  Arrange the fish fillets, skin-side down, in the pan.  Season the fish generously with salt and pepper.  Tear the sage leaves into small pieces and sprinkle over the fish.  Scatter the olives on top and around the fish.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Drizzle the fish with the remaining 2 tablespoons oil.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the pan to the oven and roast until the fish is just opaque. 8 to 10 minutes.  Squeeze the lemon juice over the fish and dust the fillet with Turkish (Urfa) or Aleppo pepper.  Finish with a light drizzle of good oil, if desired.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1062009, u'name': u'aleppo pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}], u'name': u''}], u'aggregateLikes': 25, u'instructions': u'Procedures                                                                              1                                                                            Preheat the oven to 425\xb0F.  Drizzle 1 tablespoon of the oil into the bottom of a baking sheet.  Arrange the fish fillets, skin-side down, in the pan.  Season the fish generously with salt and pepper.  Tear the sage leaves into small pieces and sprinkle over the fish.  Scatter the olives on top and around the fish.  Drizzle the fish with the remaining 2 tablespoons oil.                                                                                                                            2                                                                            Transfer the pan to the oven and roast until the fish is just opaque. 8 to 10 minutes.  Squeeze the lemon juice over the fish and dust the fillet with Turkish (Urfa) or Aleppo pepper.  Finish with a light drizzle of good oil, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/cook-the-book-roasted-blackfish-with-olives-and-sage-206078', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}