{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/447819-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 447819, u'veryPopular': False, u'lowFodmap': False, u'title': u'Simple Hamburger Stroganoff', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 257.48, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 (0.75 ounce) packet dry brown gravy mix', u'aisle': u'Canned and Jarred', u'name': u'brown gravy', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.75, u'consistency': u'solid', u'id': 6998, u'unit': u'ounce'}, {u'originalString': u'1 (6 ounce) can chopped mushrooms, with liquid', u'aisle': u'Canned and Jarred', u'name': u'canned mushrooms', u'metaInformation': [u'with liquid', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11264, u'unit': u'ounce'}, {u'originalString': u'2 (10.75 ounce) cans condensed cream of mushroom soup', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of mushroom soup', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-mushroom-soup.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.5, u'consistency': u'liquid', u'id': 6147, u'unit': u'ounce'}, {u'originalString': u'1 (8 ounce) package cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'1 (16 ounce) package egg noodles', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 20409, u'unit': u'ounce'}, {u'originalString': u'1 pound lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'1/2 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 (8 ounce) container sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1056, u'unit': u'ounce'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Simple-Hamburger-Stroganoff/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of lightly salted water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add egg noodles and cook for 8 to 10 minutes or until al dente; drain.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 20409, u'name': u'egg noodles'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a skillet over medium heat, brown the ground beef until no pink shows; drain.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mix brown gravy, cream cheese and mushrooms with hamburger until cream cheese has given the mixture a whitish look.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'id': 6998, u'name': u'brown gravy'}]}, {u'equipment': [], u'step': u'Add milk, sour cream, and mushroom soup to cooked pasta.  Blend hamburger mixture with pasta.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 360, u'instructions': u'Bring a large pot of lightly salted water to a boil. Add egg noodles and cook for 8 to 10 minutes or until al dente; drain.                            In a skillet over medium heat, brown the ground beef until no pink shows; drain.                            Mix brown gravy, cream cheese and mushrooms with hamburger until cream cheese has given the mixture a whitish look.  Add milk, sour cream, and mushroom soup to cooked pasta.  Blend hamburger mixture with pasta.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/simple-hamburger-stroganoff-447819', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}