{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/544975-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 544975, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Chicken Legs with Roasted Corn Packets', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 87.9, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'6 chicken drumsticks (1-1/2 lb.)', u'aisle': u'Meat', u'name': u'chicken drumsticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5066, u'unit': u'lb'}, {u'originalString': u'2 pkg. (10 oz. each) frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 11913, u'unit': u'oz'}, {u'originalString': u'1 lime, cut into 6 wedges', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'cut into 6 wedges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1/3 cup KRAFT Real Mayo Mayonnaise', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 jalape\xc3\xb1o pepper, seeded, sliced', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'seeded', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u''}, {u'originalString': u'1 red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2-1/2 Tbsp. A.1. Dry Rub Sweet Mesquite BBQ', u'aisle': u'Spices and Seasonings', u'name': u'rub', u'metaInformation': [u'sweet', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012034, u'unit': u'Tbsp'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/grilled-chicken-legs-roasted-corn-packets-162225.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat greased grill for indirect grilling.  Light one side of grill, leaving other side unlit. Close lid; heat grill to 350F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Sprinkle Dry Rub over chicken; rub onto chicken. Refrigerate 20 min.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'id': 1012034, u'name': u'dry seasoning rub'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Combine all remaining ingredients except lime wedges; spoon onto 6 large sheets heavy-duty foil. Fold to make 6 packets, leaving room for heat circulation inside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place chicken on grate over unlit area; cover.  Grill  25 min. or until done (165F), turning occasionally and placing foil packets over lit area of grill after 10 min.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Cut slits in foil to release steam before opening packets.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve chicken with vegetables and lime wedges.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken Leg. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Heat greased grill for indirect grilling.  Light one side of grill, leaving other side unlit. Close lid; heat grill to 350F.                                             Sprinkle Dry Rub over chicken; rub onto chicken. Refrigerate 20 min.                                            Combine all remaining ingredients except lime wedges; spoon onto 6 large sheets heavy-duty foil. Fold to make 6 packets, leaving room for heat circulation inside.                                             Place chicken on grate over unlit area; cover.  Grill  25 min. or until done (165F), turning occasionally and placing foil packets over lit area of grill after 10 min.                                            Cut slits in foil to release steam before opening packets.  Serve chicken with vegetables and lime wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-chicken-legs-with-roasted-corn-packets-544975', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}