{u'recipes': [{u'sourceName': u'Cook Like a Champion Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/596062-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 596062, u'veryPopular': False, u'lowFodmap': False, u'title': u'Steel Cut Oats with Nutella and Strawberries', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 176.01, u'creditText': u'Cook Like a Champion Blog', u'extendedIngredients': [{u'originalString': u'2 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'4-6 tablespoons chocolate hazelnut spread', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'chocolate hazelnut spread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19125, u'unit': u'tablespoons'}, {u'originalString': u'1 cup low-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1174, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup steel-cut oats', u'aisle': u'Cereal', u'name': u'steel cut oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/steel-cut-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93695, u'unit': u'cup'}, {u'originalString': u'Fresh sliced strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 9316, u'unit': u'servings'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.cooklikeachampionblog.com/2013/02/steel-cut-oats-with-nutella-and-strawberries/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine the water and milk in a medium saucepan and bring to a simmer. Meanwhile, melt the butter in a 10- or 12-inch skillet set over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the oats and toast, stirring occasionally, for about 2 minutes or until golden and fragrant.Stir the oats into the simmering liquid and reduce heat to medium-low. Simmer gently until the oat mixture has thickened significantly, about 20 minutes. Stir in the salt and brown sugar and continue cooking for about 10 minutes, until most of the liquid has been absorbed and the oatmeal is creamy.', u'length': {u'number': 32, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Remove from heat and allow to sit for about 10 minutes before serving.Portion the oatmeal into serving bowls and top with 1 tablespoon of chocolate hazelnut spread and swirl gently into the oats using a spoon or knife. Top with a handful of strawberries and serve immediately.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u''}], u'aggregateLikes': 12, u'instructions': u'Combine the water and milk in a medium saucepan and bring to a simmer. Meanwhile, melt the butter in a 10- or 12-inch skillet set over medium heat. Add the oats and toast, stirring occasionally, for about 2 minutes or until golden and fragrant.Stir the oats into the simmering liquid and reduce heat to medium-low. Simmer gently until the oat mixture has thickened significantly, about 20 minutes. Stir in the salt and brown sugar and continue cooking for about 10 minutes, until most of the liquid has been absorbed and the oatmeal is creamy. Remove from heat and allow to sit for about 10 minutes before serving.Portion the oatmeal into serving bowls and top with 1 tablespoon of chocolate hazelnut spread and swirl gently into the oats using a spoon or knife. Top with a handful of strawberries and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/steel-cut-oats-with-nutella-and-strawberries-596062', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}