{u'recipes': [{u'sourceName': u'Shugary Sweets', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/558173-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 558173, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peanut Butter Granola Bars', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 32.29, u'creditText': u'Shugary Sweets', u'extendedIngredients': [{u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/4 cup creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'1 cup crispy rice cereal', u'aisle': u'Cereal', u'name': u'crispy rice cereal', u'metaInformation': [u'crispy'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8066, u'unit': u'cup'}, {u'originalString': u'2 cup granola (I actually used Cascadian Farm Maple Nut Granola Cereal)', u'aisle': u'Cereal', u'name': u'granola', u'metaInformation': [u'(I actually used Cascadian Farm Maple Nut Granola Cereal)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8212, u'unit': u'cup'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u"3/4 cup peanut butter morsels (I used Reese's brand), divided", u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [u'divided', u"(I used Reese's brand)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'1/2 cup salted peanuts, chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'salted peanuts', u'metaInformation': [u'salted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16092, u'unit': u'cup'}, {u'originalString': u'4 Tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.shugarysweets.com/2013/01/peanut-butter-granola-bars', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'IN a a large saucepan, heat butter, sugar and honey over medium heat. Bring to a boil, reduce heat to simmer and continue to cook about 2-3 minutes, stirring constantly (until sugar is completely dissolved).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add peanut butter and mix thoroughly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [], u'step': u'Remove from heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Add in granola, cereal and peanuts, folding it onto itself until combined. Fold in 1/2 cup peanut butter morsels. Press mixture into a parchment paper lined 11x7 baking dish. Refrigerate about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/granola.jpg', u'id': 8212, u'name': u'granola'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Remove and cut into bars (of desired size). Melt remaining 1/4 cup peanut butter morsels in microwave for 30 seconds. Stir and heat an additional 30 seconds until melted.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [], u'step': u'Pour into a ziploc bag, snip off corner and drizzle over bars. Allow to set (about 15 minutes). Store bars in airtight containers. ENOY.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 9639, u'instructions': u'IN a a large saucepan, heat butter, sugar and honey over medium heat. Bring to a boil, reduce heat to simmer and continue to cook about 2-3 minutes, stirring constantly (until sugar is completely dissolved). Add peanut butter and mix thoroughly.Remove from heat. Add in granola, cereal and peanuts, folding it onto itself until combined. Fold in 1/2 cup peanut butter morsels. Press mixture into a parchment paper lined 11x7 baking dish. Refrigerate about 15 minutes. Remove and cut into bars (of desired size). Melt remaining 1/4 cup peanut butter morsels in microwave for 30 seconds. Stir and heat an additional 30 seconds until melted. Pour into a ziploc bag, snip off corner and drizzle over bars. Allow to set (about 15 minutes). Store bars in airtight containers. ENOY.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-granola-bars-558173', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}