{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/421924-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 421924, u'veryPopular': False, u'lowFodmap': False, u'title': u'Land of Enchantment Posole', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 187.2, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3 cups beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cups'}, {u'originalString': u'2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup minced fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 cans (4 ounces each) chopped green chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'green', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 31015, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 cans (15-1/2 ounces each) hominy, rinsed and drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'hominy', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-white.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 20030, u'unit': u'ounces'}, {u'originalString': u'1 to 2 jalapeno peppers, seeded and chopped, optional', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 pounds pork stew meat, cut into 3/4-inch cubes', u'aisle': u'Meat', u'name': u'stew meat', u'metaInformation': [u'cut into 3/4-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10013411, u'unit': u'pounds'}, {u'originalString': u'Tortilla strips, optional', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'tortilla strips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-strips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 98977, u'unit': u'servings'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/land-of-enchantment-posole', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a Dutch oven, cook pork and onion in oil over medium heat until meat is no longer pink.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add garlic; cook 1 minute longer.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Drain. Stir in the broth, hominy, chilies, jalapeno if desired, salt, cumin, oregano, pepper and cayenne.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-white.png', u'id': 20030, u'name': u'hominy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bring to a boil. Reduce heat; cover and simmer for 45-60 minutes or until meat is tender. Stir in cilantro.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [], u'step': u'Serve with tortilla strips if desired.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-strips.jpg', u'id': 98977, u'name': u'tortilla strips'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 27, u'instructions': u"Directions                                                                                In a Dutch oven, cook pork and onion in oil over medium heat until meat is no longer pink. Add garlic; cook 1 minute longer. Drain. Stir in the broth, hominy, chilies, jalapeno if desired, salt, cumin, oregano, pepper and cayenne.                                                                                            Bring to a boil. Reduce heat; cover and simmer for 45-60 minutes or until meat is tender. Stir in cilantro. Serve with tortilla strips if desired.                                        Yield: 5 servings.                                                                                                     Editor's Note: Wear disposable gloves when cutting hot peppers; the oils can burn skin. Avoid touching your face.                                                                                                Originally published as Land of Enchantment Posole in  Taste of HomeFebruary/March 2007, p31                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1-1/3 cups) equals 430 calories, 29 g fat (9 g saturated fat), 94 mg cholesterol, 1,266 mg sodium, 14 g carbohydrate, 3 g fiber, 27 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/land-of-enchantment-posole-421924', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}