{u'recipes': [{u'sourceName': u'Bunky Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575530-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 575530, u'veryPopular': False, u'lowFodmap': False, u'title': u'Asparagus and Prosciutto Salad', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 295.88, u'creditText': u'Bunky Cooks', u'extendedIngredients': [{u'originalString': u'Thin slices of fresh asparagus', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'fresh', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'slices'}, {u'originalString': u'Mixed baby lettuces', u'aisle': u'Produce', u'name': u'baby peas', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'serving'}, {u'originalString': u'Homemade croutons (made with leftover French baguette)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'croutons', u'metaInformation': [u'french', u'with leftover  baguette)', u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 18242, u'unit': u'serving'}, {u'originalString': u'Finely chopped hard boiled egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'hard', u'boiled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u'serving'}, {u'originalString': u'2 teaspoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'3 Tablespoons Extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'1/8 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'Slices of Prosciutto', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'Slice', u'unitShort': u'Slices', u'amount': 1.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'Slices'}, {u'originalString': u'Salad', u'aisle': u'Produce', u'name': u'salad mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 21052, u'unit': u'serving'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 Tablespoons good sherry vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sherry vinegar', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012068, u'unit': u'Tablespoons'}, {u'originalString': u'Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'slaw dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 43016, u'unit': u'serving'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.bunkycooks.com/2012/06/chefs-table-dinner-at-local-three-with-chef-chris-hall-and-asparagus-and-prosciutto-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Salad', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Compose salad first layering baby lettuces and then topping with thin slices of asparagus and finely chopped egg.  Put a few slices of Prosciutto in the middle of the salad and garnish with croutons.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18242, u'name': u'croutons'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Drizzle with vinaigrette.Vinaigrette', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk all ingredients together in a small bowl.  Set aside until ready to use.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is District 7 Estate Chardonnay. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'SaladCompose salad first layering baby lettuces and then topping with thin slices of asparagus and finely chopped egg.  Put a few slices of Prosciutto in the middle of the salad and garnish with croutons.  Drizzle with vinaigrette.VinaigretteWhisk all ingredients together in a small bowl.  Set aside until ready to use.', u'spoonacularSourceUrl': u'https://spoonacular.com/asparagus-and-prosciutto-salad-575530', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}