{u'recipes': [{u'sourceName': u'Martha Stewart', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/5378-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 5378, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp Boil With Corn And Potatoes', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 40, u'pricePerServing': 501.36, u'creditText': u'Martha Stewart', u'extendedIngredients': [{u'originalString': u'1 cup (2 sticks) melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'Coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'8 ears fresh corn, shucked and broken in half', u'aisle': u'Produce', u'name': u'ears corn', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'4 garlic cloves, smashed with the flat side of a large knife blade', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'with the flat side of a large knife blade', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Hot sauce', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'2 lemons, halved', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'2 medium onions, halved', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'medium', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 lbs medium red potatoes, scrubbed', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'medium', u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 10011355, u'unit': u'lbs'}, {u'originalString': u'3 lbs unshelled large shrimp, tail on', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'lbs'}, {u'originalString': u'shrimp Boil Spice Bundle', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'servings'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.marthastewart.com/326920/shrimp-boil-with-corn-and-potatoes', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add potatoes to pot; return liquid to a boil. Reduce heat; simmer, covered, until potatoes are almost tender, 15 to 20 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add corn; continue cooking 5 minutes more.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Santa Cristina by Antinori Pinot Grigio with a 4.1 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish.', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 56, u'instructions': u'Add potatoes to pot; return liquid to a boil. Reduce heat; simmer, covered, until potatoes are almost tender, 15 to 20 minutes. Add corn; continue cooking 5 minutes more.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-boil-with-corn-and-potatoes-5378', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}