{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/696689-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 100, u'id': 696689, u'veryPopular': False, u'lowFodmap': False, u'title': u'Jeweled Golden Rice', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 136.26, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 cup brown basmati rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20040, u'unit': u'cup'}, {u'originalString': u'3 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'2 cups chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cups'}, {u'originalString': u'1 14-ounce can reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'reduced-sodium', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon mild or hot curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2015, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup coarsely chopped dried cherries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cherries', u'metaInformation': [u'dried', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries-dried.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 93822, u'unit': u'cup'}, {u'originalString': u'1 tablespoon minced fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'3/4 cup unsalted mixed nuts, preferably pistachios, almonds and cashews, chopped, divided', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'mixed', u'unsalted', u'divided', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12135, u'unit': u'cup'}, {u'originalString': u'1 tablespoon freshly grated orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'tablespoon'}, {u'originalString': u'1 generous pinch finely crumbled saffron threads (see Note)', u'aisle': u'Ethnic Foods;Spices and Seasonings;Gourmet', u'name': u'saffron threads', u'metaInformation': [u'crumbled', u'finely', u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2037, u'unit': u''}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup chopped scallions or chives, divided', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'divided', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 cup fresh dark sweet cherries, pitted and chopped', u'aisle': u'Produce', u'name': u'sweet cherries', u'metaInformation': [u'dark', u'fresh', u'sweet', u'pitted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9070, u'unit': u'cup'}, {u'originalString': u'1/3 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/jeweled_golden_rice.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine rice, broth, water, curry powder, turmeric and saffron in a medium saucepan. Bring to a boil, stir once, cover with a tight-fitting lid, reduce heat to a simmer and cook until the liquid is absorbed, about 35 minutes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 2015, u'name': u'curry powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from heat and let stand, covered, 5 minutes more. Fluff with a fork.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine oil, lemon juice, honey, orange zest, ginger and salt in a large, nonreactive bowl (see Note). Stir in the cooked rice, celery, dried cherries and 1/4 cup scallions (or chives). Cover and refrigerate for at least 1 hour and up to 2 days.To serve, fold fresh cherries and 1/2 cup mixed nuts into the rice mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries-dried.jpg', u'id': 93822, u'name': u'dried cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve at room temperature, garnished with the remaining 1/4 cup scallions (or chives) and mixed nuts.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 256, u'instructions': u'Combine rice, broth, water, curry powder, turmeric and saffron in a medium saucepan. Bring to a boil, stir once, cover with a tight-fitting lid, reduce heat to a simmer and cook until the liquid is absorbed, about 35 minutes. Remove from heat and let stand, covered, 5 minutes more. Fluff with a fork.Combine oil, lemon juice, honey, orange zest, ginger and salt in a large, nonreactive bowl (see Note). Stir in the cooked rice, celery, dried cherries and 1/4 cup scallions (or chives). Cover and refrigerate for at least 1 hour and up to 2 days.To serve, fold fresh cherries and 1/2 cup mixed nuts into the rice mixture. Serve at room temperature, garnished with the remaining 1/4 cup scallions (or chives) and mixed nuts.', u'spoonacularSourceUrl': u'https://spoonacular.com/jeweled-golden-rice-696689', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}