{u'recipes': [{u'sourceName': u'Food Faith Fitness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/509466-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 509466, u'veryPopular': True, u'lowFodmap': False, u'title': u'Grilled Red Potato Salad with Sausage and Ranch #BetterWithReds {Low fat , GF + High Protein}', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 271.08, u'creditText': u'Food Faith Fitness', u'extendedIngredients': [{u'originalString': u'2 tsp Fresh dill, minced *', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tsp'}, {u'originalString': u'2 tsps Garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsps'}, {u'originalString': u'2 Tbsp Reduced-fat Buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat buttermilk', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1088, u'unit': u'Tbsp'}, {u'originalString': u'\xbd Tbsp Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'Pinch of pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'\xbd Cup Non-fat, Plain Greek yogurt', u'aisle': u'Meat', u'name': u'duck fat', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lard.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 4574, u'unit': u'Cup'}, {u'originalString': u'2 tsps Buttermilk Ranch dressing powdered mix', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93733, u'unit': u'tsps'}, {u'originalString': u'3 Large Red Potatoes (500 g)', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10011355, u'unit': u'g'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 cup Chicken/turkey sausage, sliced', u'aisle': u'Meat', u'name': u'turkey sausage', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 7955, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.foodfaithfitness.com/red-potato-salad-sausage/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of salted water to a boil, and cook the potatoes until they are just fork tender, about 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Drain and set aside.While the potatoes boil, heat your grill to medium/high and cook the sliced chicken sausage until it just has nice grill marks, only about 1-2 minutes per side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to a boil and set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the boiled potatoes into quarters** and toss with the olive oil, garlic and a pinch of salt.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place them onto the grill (still at medium/high heat) cut side down, and cook until they also have nice grill marks. This takes about 1-3 minutes per side. Make sure to flip them so both sides of the potato get a nice, crisp grill.While the potatoes are grilling, mix all the dressing ingredients in a large bowl until well combined.Toss in the grilled potatoes and sausage and stir until everything is well coated.DEVOUR immediately. ***', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 563, u'instructions': u'Bring a large pot of salted water to a boil, and cook the potatoes until they are just fork tender, about 12 minutes. Drain and set aside.While the potatoes boil, heat your grill to medium/high and cook the sliced chicken sausage until it just has nice grill marks, only about 1-2 minutes per side. Transfer to a boil and set aside.Cut the boiled potatoes into quarters** and toss with the olive oil, garlic and a pinch of salt.Place them onto the grill (still at medium/high heat) cut side down, and cook until they also have nice grill marks. This takes about 1-3 minutes per side. Make sure to flip them so both sides of the potato get a nice, crisp grill.While the potatoes are grilling, mix all the dressing ingredients in a large bowl until well combined.Toss in the grilled potatoes and sausage and stir until everything is well coated.DEVOUR immediately. ***', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-red-potato-salad-with-sausage-and-ranch-betterwithreds-low-fat-gf-+-high-protein-509466', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}