{u'recipes': [{u'sourceName': u'The Naptime Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511858-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 511858, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramelized Onion Grilled Cheese', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 171.5, u'creditText': u'The Naptime Chef', u'extendedIngredients': [{u'originalString': u'2 slices country bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'\xbd cup caramelized onions or shallots', u'aisle': u'Produce', u'name': u'caramelized onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10211282, u'unit': u'cup'}, {u'originalString': u'3 slices thinly sliced sweet cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'sweet', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'slices'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.thenaptimechef.com/2014/01/caramelized-onion-grilled-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt \xbd of the butter over medium heat in a skillet that is large enough to fit the bread. Assemble the sandwich by layering the caramelized onions, followed by the cheese (slightly overlapping), and topping it with the second slice of bread.2.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10211282, u'name': u'caramelized onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the sandwich in the melted butter and place a heavy object on top of it to press the bread down. I like to use my tea kettle (not the electric one) filled with water. Allow the sandwich to toast on one side on medium-low heat for about five minutes, or until the bread is golden brown. Flip the sandwich and add the rest of the butter to the pan. At this point you probably won’t need to put the kettle on top. But, if the sandwich is not compact enough go ahead and do so. Toast until the bread is golden brown, about five more minutes, serve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 9, u'instructions': u'1. Melt \xbd of the butter over medium heat in a skillet that is large enough to fit the bread. Assemble the sandwich by layering the caramelized onions, followed by the cheese (slightly overlapping), and topping it with the second slice of bread.2. Place the sandwich in the melted butter and place a heavy object on top of it to press the bread down. I like to use my tea kettle (not the electric one) filled with water. Allow the sandwich to toast on one side on medium-low heat for about five minutes, or until the bread is golden brown. Flip the sandwich and add the rest of the butter to the pan. At this point you probably won’t need to put the kettle on top. But, if the sandwich is not compact enough go ahead and do so. Toast until the bread is golden brown, about five more minutes, serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/caramelized-onion-grilled-cheese-511858', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}