{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/211539-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 22, u'id': 211539, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mincemeat Chelsea buns', u'diets': [u'gluten free'], u'preparationMinutes': 40, u'pricePerServing': 163.39, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tbsp apricot jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19719, u'unit': u'tbsp'}, {u'originalString': u'50g butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'2 tbsp demerara sugar, for sprinkling', u'aisle': u'Health Foods;Baking', u'name': u'demerara sugar', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10019908, u'unit': u'tbsp'}, {u'originalString': u'100g dried apricots, chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dried apricots', u'metaInformation': [u'dried', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 9032, u'unit': u'g'}, {u'originalString': u'1 large egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'100g glac\xe9 cherries, chopped', u'aisle': u'Produce;Baking', u'name': u'glace cherries', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-cherries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 93742, u'unit': u'g'}, {u'originalString': u'25g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'1\xbd tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'100g icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'300g mincemeat', u'aisle': u'Baking', u'name': u'mincemeat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mincemeat.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 93706, u'unit': u'g'}, {u'originalString': u'\xbd tsp mixed spice', u'aisle': u'Spices and Seasonings', u'name': u'mixed spice', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022035, u'unit': u'tsp'}, {u'originalString': u'sunflower or vegetable oil, for greasing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for greasing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'250ml whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 250.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'7g sachet fast-action dried yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 18375, u'unit': u'g'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/mincemeat-chelsea-buns', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the milk in a pan until steaming.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove from the heat, add the butter, then leave to cool until lukewarm and the butter has melted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the flour, yeast, sugar, spices and 1 tsp salt into a large bowl, and mix together. Make a well in the centre, and pour in the egg and milk mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 2035, u'name': u'spices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix everything together with your hands to form a dough – it will be quite wet. Tip the dough onto a lightly floured surface and knead for 5-10 mins until smooth.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the dough to a clean, lightly oiled bowl, cover with oiled cling film and leave to rise until doubled in size – this will take 1-2 hrs depending on how warm the room is. You could rise the dough in the fridge overnight, but make sure you bring to room temperature before moving on to the next step.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6. Tip the dough onto a lightly floured surface and knead for a few moments.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out to a 45 x 40cm rectangle, with the longest edge facing you.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Mix together the butter and sugar for the filling, and spread all over the dough. Follow with the mincemeat, then sprinkle over the apricots and cherries.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mincemeat.jpg', u'id': 93706, u'name': u'mincemeat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Roll up firmly, starting from one of the long sides. Using a sharp knife, cut off either end of the roll to neaten, then slice into 8 even pieces. Arrange, cut-side up, on an oiled tray, leaving about 1cm between each bun and making sure the tail ends are pointing inwards. Cover loosely with oiled cling film and leave to prove until doubled in size – about 30 mins. Sprinkle over the demerara sugar and bake for 22-25 mins until golden brown.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'id': 10019908, u'name': u'demerara sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Transfer to a wire rack. Melt the jam with \xbd tbsp water and brush over the buns, then leave to cool.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Mix the icing sugar with enough water to make a runny icing. Using a spoon, drizzle the icing back and forth over the buns. Leave for 10 mins to set before eating. Will keep in a sealed container for up to 3 days.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 59, u'instructions': u'Heat the milk in a pan until steaming. Remove from the heat, add the butter, then leave to cool until lukewarm and the butter has melted. Put the flour, yeast, sugar, spices and 1 tsp salt into a large bowl, and mix together. Make a well in the centre, and pour in the egg and milk mixture. Mix everything together with your hands to form a dough – it will be quite wet. Tip the dough onto a lightly floured surface and knead for 5-10 mins until smooth. Transfer the dough to a clean, lightly oiled bowl, cover with oiled cling film and leave to rise until doubled in size – this will take 1-2 hrs depending on how warm the room is. You could rise the dough in the fridge overnight, but make sure you bring to room temperature before moving on to the next step.Heat oven to 200C/180C fan/gas 6. Tip the dough onto a lightly floured surface and knead for a few moments. Roll out to a 45 x 40cm rectangle, with the longest edge facing you. Mix together the butter and sugar for the filling, and spread all over the dough. Follow with the mincemeat, then sprinkle over the apricots and cherries. Roll up firmly, starting from one of the long sides. Using a sharp knife, cut off either end of the roll to neaten, then slice into 8 even pieces. Arrange, cut-side up, on an oiled tray, leaving about 1cm between each bun and making sure the tail ends are pointing inwards. Cover loosely with oiled cling film and leave to prove until doubled in size – about 30 mins. Sprinkle over the demerara sugar and bake for 22-25 mins until golden brown. Transfer to a wire rack. Melt the jam with \xbd tbsp water and brush over the buns, then leave to cool.Mix the icing sugar with enough water to make a runny icing. Using a spoon, drizzle the icing back and forth over the buns. Leave for 10 mins to set before eating. Will keep in a sealed container for up to 3 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/mincemeat-chelsea-buns-211539', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 62, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}