{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598242-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 598242, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Veal Meatballs with Caramelized Onions', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 467.7, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'2 tablespoons aged balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'aged balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002069, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon julienned basil leaves', u'aisle': u'Produce', u'name': u'basil leaves', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoon'}, {u'originalString': u'1 bay leaf', u'aisle': u'Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 tablespoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tablespoon'}, {u'originalString': u'1 quart (4 cups) homemade chicken stock or canned chicken broth, or 2 cups chicken stock and 2 cups veal stock', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'homemade', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'3 large eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons chopped flat-leaf parsley leaves', u'aisle': u'Produce', u'name': u'flat leaf parsley leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'2 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'1/2 pound ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10219, u'unit': u'pound'}, {u'originalString': u'1/2 pound ground veal', u'aisle': u'Meat', u'name': u'ground veal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 17142, u'unit': u'pound'}, {u'originalString': u'1 tablespoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'Kosher salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon finely grated lemon zest, preferably organic', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'organic', u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 cups thinly sliced onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1 tablespoon chopped oregano leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoon'}, {u'originalString': u'2 cups panko (Japanese bread crumbs) or other coarse dried crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [u'dried', u'(Japanese bread crumbs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cups'}, {u'originalString': u'1 cup freshly grated Parmigiano-Reggiano cheese', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped thyme leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thyme leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'1 tomato, coarsely diced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'2 tablespoons (1 ounce) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounce'}, {u'originalString': u'1 stick (4 ounces) unsalted butter, melted and slightly cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://leitesculinaria.com/957/recipes-mini-veal-meatballs-caramelized-onions.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 36, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the caramelized onions1.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the olive oil in a large saucepan over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the garlic, onions, and sugar and season with salt and pepper. Cook, stirring occasionally, for 10 to 15 minutes, until golden brown.2.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the wine, bay leaf, and thyme. Bring to a boil, then reduce the heat and simmer briskly for 3 to 6 minutes, or until reduced by half.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the stock and bring to a boil, then reduce the heat and simmer briskly for 5 to 8 minutes, or until reduced by half again.3. Stir the butter into the sauce and keep stirring until its incorporated. Season to taste with salt and pepper and finish with a small splash vinegar (1 to 2 teaspoons). Cover and keep warm.Make the veal meatballs4. Preheat the oven to 350F (175C). Lightly oil a rimmed baking sheet.5. In a large bowl, combine the bread crumbs and melted butter and mix well with your hands.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [], u'step': u'Add the cheese, milk, eggs, garlic, 1 tablespoon of the parsley, the oregano, olive oil, salt, black and red pepper, and lemon zest and mix well.6.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the ground pork and veal to the bowl and mix well. Pinch off small walnut-sized pieces of meat, each about 1/2 ounce, and roll them into mini meatballs. You should have between 32 and 40 meatballs. A few extra are fine.7.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 10219, u'name': u'ground pork'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer the veal meatballs to the baking sheet. Arrange them in neat rows, leaving space between them.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [], u'step': u'Bake for 10 to 12 minutes, or until the meatballs are just barely cooked through. Do not overcook.8. Divvy the veal meatballs among 4 serving plates. Spoon the warm sauce over the top of the meatballs and garnish each plate with some of the remaining parsley, a little diced tomato, and the basil.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [], u'step': u'Drizzle the remaining vinegar over each plate and serve.', u'number': 10, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 52, u'instructions': u'Make the caramelized onions1. Heat the olive oil in a large saucepan over medium-high heat. Add the garlic, onions, and sugar and season with salt and pepper. Cook, stirring occasionally, for 10 to 15 minutes, until golden brown.2. Add the wine, bay leaf, and thyme. Bring to a boil, then reduce the heat and simmer briskly for 3 to 6 minutes, or until reduced by half. Add the stock and bring to a boil, then reduce the heat and simmer briskly for 5 to 8 minutes, or until reduced by half again.3. Stir the butter into the sauce and keep stirring until its incorporated. Season to taste with salt and pepper and finish with a small splash vinegar (1 to 2 teaspoons). Cover and keep warm.Make the veal meatballs4. Preheat the oven to 350F (175C). Lightly oil a rimmed baking sheet.5. In a large bowl, combine the bread crumbs and melted butter and mix well with your hands. Add the cheese, milk, eggs, garlic, 1 tablespoon of the parsley, the oregano, olive oil, salt, black and red pepper, and lemon zest and mix well.6. Add the ground pork and veal to the bowl and mix well. Pinch off small walnut-sized pieces of meat, each about 1/2 ounce, and roll them into mini meatballs. You should have between 32 and 40 meatballs. A few extra are fine.7. Transfer the veal meatballs to the baking sheet. Arrange them in neat rows, leaving space between them. Bake for 10 to 12 minutes, or until the meatballs are just barely cooked through. Do not overcook.8. Divvy the veal meatballs among 4 serving plates. Spoon the warm sauce over the top of the meatballs and garnish each plate with some of the remaining parsley, a little diced tomato, and the basil. Drizzle the remaining vinegar over each plate and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-veal-meatballs-with-caramelized-onions-598242', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}