{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/444040-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 444040, u'veryPopular': False, u'lowFodmap': False, u'title': u'Honey Chip Granola Bars', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 20.49, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1/4 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1/2 cup miniature chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'1 cup flaked coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'4-1/2 cups crisp rice cereal', u'aisle': u'Cereal', u'name': u'crisp rice cereal', u'metaInformation': [u'crisp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 8066, u'unit': u'cups'}, {u'originalString': u'1 cup graham cracker crumbs (about 16 squares)', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [u'( 16 squares)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'cup'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1-1/2 pounds miniature marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u'pounds'}, {u'originalString': u'5 cups old-fashioned oats', u'aisle': u'Cereal', u'name': u'old-fashioned oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'1/4 cup peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'1 cup crushed peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16091, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 17.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/honey-chip-granola-bars', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, combine the butter, oil and marshmallows. Cook and stir over low heat until mixture is melted and smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Remove from the heat; stir in honey and peanut butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Combine the oats, cereal, cracker crumbs, coconut and peanuts.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add to the marshmallow mixture; mix well. Press into a greased 15-in. x 10-in. x 1-in. pan. Cool for 10-15 minutes. Sprinkle with chips and gently press into top. Cool completely.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [], u'step': u'Cut into bars.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 59, u'instructions': u"Directions                                                                                In a large saucepan, combine the butter, oil and marshmallows. Cook and stir over low heat until mixture is melted and smooth. Remove from the heat; stir in honey and peanut butter.                                                                                            Combine the oats, cereal, cracker crumbs, coconut and peanuts. Add to the marshmallow mixture; mix well. Press into a greased 15-in. x 10-in. x 1-in. pan. Cool for 10-15 minutes. Sprinkle with chips and gently press into top. Cool completely. Cut into bars.                                        Yield: about 4 dozen.                                                                                                     Editor's Note: Reduced-fat peanut butter is not recommended for this recipe.                                                                                                Originally published as Honey Chip Granola Bars in  Quick CookingSeptember/October 2001, p31                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 159 calories, 6 g fat (2 g saturated fat), 3 mg cholesterol, 63 mg sodium, 25 g carbohydrate, 1 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/honey-chip-granola-bars-444040', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}