{u'recipes': [{u'sourceName': u'The Comfort of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/590607-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590607, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skinny Lemon Chicken Piccata', u'diets': [], u'pricePerServing': 179.24, u'creditText': u'The Comfort of Cooking', u'extendedIngredients': [{u'originalString': u'2 Tablespoons vegetable or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tablespoons'}, {u'originalString': u'2 Tablespoons capers, rinsed', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2054, u'unit': u'Tablespoons'}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1/4 cup + 1 teaspoon all-purpose flour, divided', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'4 teaspoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'4 (2-inch) strips lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 8.0, u'consistency': u'solid', u'id': 9156, u'unit': u'inch'}, {u'originalString': u'1 cup low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon each salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1102047, u'unit': u'teaspoon'}, {u'originalString': u'2 boneless, skinless chicken breasts, halved', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 Tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.thecomfortofcooking.com/2014/02/skinny-lemon-chicken-piccata.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Spread 1/4 cup flour in a shallow dish. Pound each chicken breast half into thin cutlets (for 4 cutlets total). Dry cutlets with paper towels and season with salt and pepper. Dredge one side of each cutlet in flour, shaking off excess.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 Tablespoon oil in a large skillet over medium-high heat. Once hot, lay 2 cutlets, floured side down, in the skillet. Cook for 3-4 minutes, or until golden brown. Flip cutlets over and continue to cook until no longer pink, about 1 more minute.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer cutlets to a plate and tent loosely with foil. Repeat with remaining 1 Tablespoon oil and 2 cutlets.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add capers and garlic to the skillet. Return to medium heat and cook for about 30 seconds, until fragrant. Stir in remaining 1 teaspoon flour until incorporated.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in broth, wine and lemon zest strips, scraping any browned bits for additional flavor. Bring to a simmer and cook until thickened slightly and reduced to about 1/2 cup, about 10 to 15 minutes.Return cutlets into the sauce, simmering until heated through and spooning sauce over chicken, about 30 seconds.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Transfer chicken to serving plates. Off heat, remove lemon zest and whisk lemon juice and butter into sauce.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}]}, {u'equipment': [], u'step': u'Serve to individual plates and spoon sauce over the chicken.Enjoy!', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chicken Piccatan on the menu? Try pairing with Sauvignon Blanc and Gruener Veltliner. Both Gr\xfcner Veltliner and Sauvignon Blanc have citrus and herbal flavors that complement chicken piccata's lemon and parsley. The Craggy Range Te Muna Road Vineyard Sauvignon Blanc with a 4.4 out of 5 star rating seems like a good match. It costs about 22 dollars per bottle.", u'pairedWines': [u'sauvignon blanc', u'gruener veltliner'], u'productMatches': [{u'description': u'The Te Muna Road Vineyard Sauvignon Blanc shows rich ripe flavors of limes, peaches and apples alongside the characteristic herbaceous components and unique dry grainy texture on the palate.', u'title': u'Craggy Range Te Muna Road Vineyard Sauvignon Blanc', u'price': u'$21.99', u'id': 439305, u'link': u'https://www.wine.com/product/craggy-range-te-muna-road-vineyard-sauvignon-blanc-2014/139203', u'imageUrl': u'https://spoonacular.com/productImages/439305-312x231.jpg'}]}, u'aggregateLikes': 13994, u'instructions': u'Spread 1/4 cup flour in a shallow dish. Pound each chicken breast half into thin cutlets (for 4 cutlets total). Dry cutlets with paper towels and season with salt and pepper. Dredge one side of each cutlet in flour, shaking off excess.Heat 1 Tablespoon oil in a large skillet over medium-high heat. Once hot, lay 2 cutlets, floured side down, in the skillet. Cook for 3-4 minutes, or until golden brown. Flip cutlets over and continue to cook until no longer pink, about 1 more minute. Transfer cutlets to a plate and tent loosely with foil. Repeat with remaining 1 Tablespoon oil and 2 cutlets.Add capers and garlic to the skillet. Return to medium heat and cook for about 30 seconds, until fragrant. Stir in remaining 1 teaspoon flour until incorporated. Whisk in broth, wine and lemon zest strips, scraping any browned bits for additional flavor. Bring to a simmer and cook until thickened slightly and reduced to about 1/2 cup, about 10 to 15 minutes.Return cutlets into the sauce, simmering until heated through and spooning sauce over chicken, about 30 seconds. Transfer chicken to serving plates. Off heat, remove lemon zest and whisk lemon juice and butter into sauce.Serve to individual plates and spoon sauce over the chicken.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-lemon-chicken-piccata-590607', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}