{u'recipes': [{u'sourceName': u'Blogging Over Thyme', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/478689-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 478689, u'veryPopular': False, u'lowFodmap': False, u'title': u'Rustic French Apple Tart', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 45, u'pricePerServing': 77.04, u'creditText': u'Blogging Over Thyme', u'extendedIngredients': [{u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'12 ounces all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 20081, u'unit': u'ounces'}, {u'originalString': u'4 ounces granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/3-1/2 cup apricot jelly (or substitute another variety)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jelly', u'metaInformation': [u'(or substitute another variety)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19297, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1/2 teaspoon fresh lemon zest (roughly 1 lemon)', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'fresh', u'(roughly 1 lemon)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'4-5 pink lady apples, peeled and cored', u'aisle': u'Produce', u'name': u'pink lady apples', u'metaInformation': [u'cored', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/braeburn-apples.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1009003, u'unit': u''}, {u'originalString': u'1 1/2 tablespoons cold unsalted butter, cut into very small pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'small', u'cut into very  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.bloggingoverthyme.com/2013/05/29/french-apple-tart/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add the butter and sugar to a mixing bowl and using the paddle attachment, cream together over medium speed for roughly one minute.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add zest, salt, vanilla, and egg, and mix over low speed until well incorporated, scraping down the bowl occasionally with a spatula as necessary.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-stone.jpg', u'id': 406907, u'name': u'pizza stone'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scale.jpg', u'id': 404705, u'name': u'kitchen scale'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add flour all at once, turn mixer on low speed and mix until dough begins to come together. Using the “fraisage” technique, use the heel of your hand to press down and smear the dough onto a clean countertop. Push back together and repeat until smooth and all ingredients are well incorporated—the dough will have a slight shine.Divide the dough equally in half (using scale), pat into a disk, cover with plastic wrap and refrigerate for a least one hour.Preheat a pizza stone in the oven to 350 degrees Fahrenheit for at least 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}], u'step': u'Remove one disk of cooled dough from refrigerator (you can freeze remaining dough for several weeks and save for a later date). Throughout the process, dust rolling pin, dough, and surface lightly with flour to prevent sticking. Using the rolling pin (starting from the center of dough to the outside), roll out into a rough circle to a little less than 1/4" thickness. Throughout the process, pick up dough carefully and move around ensuring it does not stick. **If dough cracks, gently press back together with hand and continue to roll.Using the rolling pin, pick up the dough and lay over a 9" (about 1 inch deep) tart pan, gently guiding it into the sides of the tart (try to avoid stretching the dough), pressing with your fingers. Make sure to press the dough tightly inside the corners and sides to shape the tart shell.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll your rolling pin over top of pan to get rid of excess pastry. Scraps of dough can be pressed together, frozen, and reused.Cover with plastic wrap and place the tart shell back in the refrigerator, while you assemble the filling.Peel one apple at a time, rubbing the outside of the apple pieces with the lemon half to reduce browning and oxidation. Slice in half, core and slice very thinly--and set aside in a medium-sized bowl, sprinkling on lemon juice as you go. Repeat with remaining apples. Roughly chop any trimmings and set those aside.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u"Remove the tart shell from the fridge, spread out any extra apple trimmings on the bottom of the shell and arrange the slices (overlapping) in a circular pattern, starting with the outside of the tart and working your way into the center. Don't worry if it's not completely perfect!Sprinkle the apples evenly with the granulated sugar and add the tabs of butter directly on top. Using a spoon or your fingers, sprinkle on the cinnamon.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-stone.jpg', u'id': 406907, u'name': u'pizza stone'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake at 350 degrees (directly on the pizza stone) for an hour and a half, or until the edges of the tart are golden brown and the apples are tender.Allow to cool on a rack for 15-20 minutes.Once the tart has cooled slightly, heat the jelly and water (almost equal parts) over medium heat until bubbling slightly, whisking frequently until smooth, thin, and consistent.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add more water or reduce if necessary to achieve the proper consistency.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Brush the top of the tart to finish. Best served slightly warm with a side of vanilla ice cream!', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tart works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 156, u'instructions': u'Add the butter and sugar to a mixing bowl and using the paddle attachment, cream together over medium speed for roughly one minute.Add zest, salt, vanilla, and egg, and mix over low speed until well incorporated, scraping down the bowl occasionally with a spatula as necessary.Add flour all at once, turn mixer on low speed and mix until dough begins to come together. Using the “fraisage” technique, use the heel of your hand to press down and smear the dough onto a clean countertop. Push back together and repeat until smooth and all ingredients are well incorporated—the dough will have a slight shine.Divide the dough equally in half (using scale), pat into a disk, cover with plastic wrap and refrigerate for a least one hour.Preheat a pizza stone in the oven to 350 degrees Fahrenheit for at least 25 minutes.Remove one disk of cooled dough from refrigerator (you can freeze remaining dough for several weeks and save for a later date). Throughout the process, dust rolling pin, dough, and surface lightly with flour to prevent sticking. Using the rolling pin (starting from the center of dough to the outside), roll out into a rough circle to a little less than 1/4" thickness. Throughout the process, pick up dough carefully and move around ensuring it does not stick. **If dough cracks, gently press back together with hand and continue to roll.Using the rolling pin, pick up the dough and lay over a 9" (about 1 inch deep) tart pan, gently guiding it into the sides of the tart (try to avoid stretching the dough), pressing with your fingers. Make sure to press the dough tightly inside the corners and sides to shape the tart shell.Roll your rolling pin over top of pan to get rid of excess pastry. Scraps of dough can be pressed together, frozen, and reused.Cover with plastic wrap and place the tart shell back in the refrigerator, while you assemble the filling.Peel one apple at a time, rubbing the outside of the apple pieces with the lemon half to reduce browning and oxidation. Slice in half, core and slice very thinly--and set aside in a medium-sized bowl, sprinkling on lemon juice as you go. Repeat with remaining apples. Roughly chop any trimmings and set those aside.Remove the tart shell from the fridge, spread out any extra apple trimmings on the bottom of the shell and arrange the slices (overlapping) in a circular pattern, starting with the outside of the tart and working your way into the center. Don\'t worry if it\'s not completely perfect!Sprinkle the apples evenly with the granulated sugar and add the tabs of butter directly on top. Using a spoon or your fingers, sprinkle on the cinnamon.Bake at 350 degrees (directly on the pizza stone) for an hour and a half, or until the edges of the tart are golden brown and the apples are tender.Allow to cool on a rack for 15-20 minutes.Once the tart has cooled slightly, heat the jelly and water (almost equal parts) over medium heat until bubbling slightly, whisking frequently until smooth, thin, and consistent. Add more water or reduce if necessary to achieve the proper consistency.Brush the top of the tart to finish. Best served slightly warm with a side of vanilla ice cream!', u'spoonacularSourceUrl': u'https://spoonacular.com/rustic-french-apple-tart-478689', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}