{u'recipes': [{u'sourceName': u'Caf\xe9 Terra Blog', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/628556-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 628556, u'veryPopular': False, u'lowFodmap': False, u'title': u'Herbed Veggie Risotto with Browned Butter Mushroom Sauce #TripleSBites', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 318.53, u'creditText': u'Caf\xe9 Terra Blog', u'extendedIngredients': [{u'originalString': u'2 (12 oz) container of sliced baby bella mushrooms', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 11266, u'unit': u'oz'}, {u'originalString': u'1 Tbsp Gourmet Gardens basil paste', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'Tbsp'}, {u'originalString': u'3 cups basmati rice', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10020444, u'unit': u'cups'}, {u'originalString': u'2 cups brussel sprouts, sliced in half', u'aisle': u'Produce', u'name': u'brussel sprouts', u'metaInformation': [u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11098, u'unit': u'cups'}, {u'originalString': u'1\xbd cups carrots, sliced \xbc inch thick', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'thick', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cups'}, {u'originalString': u'1 Tbsp Gourmet Gardens garlic paste', u'aisle': u'Produce;Ethnic Foods', u'name': u'garlic paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10111215, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp Gourmet Gardens oregano paste', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp Gourmet Gardens parsley paste', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'1 cup red bell peppers, cubed into \xbc inch diameter pieces', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'3 sticks (1\xbd cups) salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001001, u'unit': u'cups'}, {u'originalString': u'1\xbd to 2 quarts chicken stock, or vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 1.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'quarts'}, {u'originalString': u'4 Tbsp Acala Farms Fresh Cilantro Cottonseed Oil', u'aisle': u'?', u'name': u'acala farms cilantro cottonseed oil', u'metaInformation': [u'fresh'], u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'unit': u'Tbsp'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.cafeterrablog.com/2015/02/09/herbed-veggie-risotto-with-browned-butter-mushroom-sauce-triplesbites/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In 2 inch deep saut pan, warm pan with fresh cilantro cottonseed oil, add prepared veggies and saut until tender. Sit aside.In large stock pot warm 2 quarts of chicken stock and keep burner on low heat.In large 3 to 4 inch deep saut pan, burner at medium heat, add olive oil and rice, stir continuously until rice is lightly browned and smells nutty.Start to slowly add one ladle of chicken stock at a time, you add the stock and let rice absorb the liquid, then repeat the process, after three ladles of rice add 1 cup of white wine, then use stock a few more times, but remember to let the rice soak the liquid up before adding more. When the rice is almost completely done, instead of more stock, add the remaining 2 cups of white wine.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add parsley paste, basil paste, oregano paste, and garlic paste and mix well in the risotto, then add veggies and mix together. Make sure there is enough liquid in the pan so the rice does not burn on the bottom of the pan.In small sauce pan, salute mushrooms and then sit aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 10111215, u'name': u'garlic paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add butter to pan and melt down, lightly swirl the pan as the butter melts and starts to change to a brown color, once it starts to brown add the saluted mushrooms and remove from the burner.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the risotto to a bowl and then top with the browned butter mushroom sauce.Enjoy!', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Risotto. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Ricasoli Castello di Brolio Chianti Classico. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 46 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Dark ruby color, with lots of chocolate, berry and vanilla aromas, this is full-bodied and velvety, with lots of fruit and a long, succulent finish. A beauty from a great vintage.', u'title': u'Ricasoli Castello di Brolio Chianti Classico', u'price': u'$45.99', u'id': 433641, u'link': u'https://www.wine.com/product/ricasoli-castello-di-brolio-chianti-classico-1997/28225', u'imageUrl': u'https://spoonacular.com/productImages/433641-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'In 2 inch deep saut pan, warm pan with fresh cilantro cottonseed oil, add prepared veggies and saut until tender. Sit aside.In large stock pot warm 2 quarts of chicken stock and keep burner on low heat.In large 3 to 4 inch deep saut pan, burner at medium heat, add olive oil and rice, stir continuously until rice is lightly browned and smells nutty.Start to slowly add one ladle of chicken stock at a time, you add the stock and let rice absorb the liquid, then repeat the process, after three ladles of rice add 1 cup of white wine, then use stock a few more times, but remember to let the rice soak the liquid up before adding more. When the rice is almost completely done, instead of more stock, add the remaining 2 cups of white wine.Add parsley paste, basil paste, oregano paste, and garlic paste and mix well in the risotto, then add veggies and mix together. Make sure there is enough liquid in the pan so the rice does not burn on the bottom of the pan.In small sauce pan, salute mushrooms and then sit aside. Add butter to pan and melt down, lightly swirl the pan as the butter melts and starts to change to a brown color, once it starts to brown add the saluted mushrooms and remove from the burner.Add the risotto to a bowl and then top with the browned butter mushroom sauce.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/herbed-veggie-risotto-with-browned-butter-mushroom-sauce-triplesbites-628556', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}