{u'recipes': [{u'sourceName': u'The Baking Pan', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/672262-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 672262, u'veryPopular': False, u'lowFodmap': False, u'title': u'Old Glory Cupcakes', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 90, u'pricePerServing': 115.97, u'creditText': u'The Baking Pan', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'2 cups fresh blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cups'}, {u'originalString': u'4\xbc to 4\xbd cups confectioners (powdered) sugar', u'aisle': u'Baking', u'name': u'confectioners sugar', u'metaInformation': [u'(powdered)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'⅛ teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups fresh strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}, {u'originalString': u'\xbe cup (1\xbd sticks) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature', u'(1\xbd sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 cup (2 sticks) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup whipping (heavy) cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [u'(heavy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cup'}, {u'originalString': u'1 cup milk (preferably whole milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'(preferably milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://thebakingpan.com/recipes/cupcakes/old-glory-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a medium mixing bowl, combine flour, baking powder, and salt; sift or whisk together to mix. Set aside.In a small mixing bowl, stir the milk and vanilla together. Set aside.In a large bowl of an electric mixer, cream the butter and sugar until light and fluffy. Tip: To cream, start by placing the butter in the bowl, with an electric mixer on medium speed begin by beating the butter about 1 minute until it is smooth and light in color. With the mixer still on medium speed, slowly add the sugar to the butter, either one tablespoon at a time, or in a very slow steady stream, taking from 4 to 8 minutes to add all of the sugar, and beating until the butter and sugar are fully incorporated and the mixture is a light, or pale yellow color, with a fluffy texture. While adding the sugar, stop the mixer occasionally to scrape the mixture off the paddle and scrape down the sides and bottom of the bowl with a rubber spatula so the mixture blends evenly.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add eggs one at a time, beating until thoroughly mixed. Tip: For each egg, crack the egg into a small bowl and whisk with a fork to thoroughly break up the egg before adding to the creamed mixture. Start with the mixer on low speed so the liquid from the egg doesnt splatter, once the egg is partially mixed increase the speed to medium. Each egg should be fully incorporated into the mixture before adding the next egg, taking about one minute to blend in each egg.With the mixer on low speed, add about one third of the flour mixture, mix just until the flour is almost completely blended. Scrape the bowl down, and add about one half of the milk mixture, blending just until mixed. Scrape the bowl down again and continue alternating with the flour mixture and milk mixture, ending with the last portion of the flour, and stirring just until blended.Spoon the batter into the cupcake liners. Fill  full, using about  cup of batter per cup. Tip: Avoid over-filling the liners which may cause the batter to run-over the sides when baking. It is better to bake any remaining batter separately after the first pan of cupcakes has finished baking.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Bake, rotating pan halfway through, 18 to 20 minutes, or until the cakes are just firm and spring back when gently pressed, and a toothpick, wooden skewer, or cake tester inserted in the center comes out clean. Cool slightly in cupcake pan, and turn out of pan when cool enough to handle. Repeat process with any remaining batter. Cool cupcakes completely on a wire cooling rack before frosting.In a large mixing bowl, combine butter, whipping cream, vanilla, and salt. Use an electric mixer and beat together until mixture is combined, dont worry if the mixture looks curdled.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add 4 cups powdered sugar; beat 2 to 4 minutes or until frosting is thick and fluffy.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Add additional  cup powdered sugar if necessary to make a good spreading consistency.Use an offset spatula to frost the top of each cupcake, or use a pastry bag and decorating tip to pipe the frosting.For each cupcake, arrange 3 sliced strawberries and a 6 to 8 blueberries on top of the frosting.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}]}], u'name': u'Bake'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cupcakes. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'In a medium mixing bowl, combine flour, baking powder, and salt; sift or whisk together to mix. Set aside.In a small mixing bowl, stir the milk and vanilla together. Set aside.In a large bowl of an electric mixer, cream the butter and sugar until light and fluffy. Tip: To cream, start by placing the butter in the bowl, with an electric mixer on medium speed begin by beating the butter about 1 minute until it is smooth and light in color. With the mixer still on medium speed, slowly add the sugar to the butter, either one tablespoon at a time, or in a very slow steady stream, taking from 4 to 8 minutes to add all of the sugar, and beating until the butter and sugar are fully incorporated and the mixture is a light, or pale yellow color, with a fluffy texture. While adding the sugar, stop the mixer occasionally to scrape the mixture off the paddle and scrape down the sides and bottom of the bowl with a rubber spatula so the mixture blends evenly.Add eggs one at a time, beating until thoroughly mixed. Tip: For each egg, crack the egg into a small bowl and whisk with a fork to thoroughly break up the egg before adding to the creamed mixture. Start with the mixer on low speed so the liquid from the egg doesnt splatter, once the egg is partially mixed increase the speed to medium. Each egg should be fully incorporated into the mixture before adding the next egg, taking about one minute to blend in each egg.With the mixer on low speed, add about one third of the flour mixture, mix just until the flour is almost completely blended. Scrape the bowl down, and add about one half of the milk mixture, blending just until mixed. Scrape the bowl down again and continue alternating with the flour mixture and milk mixture, ending with the last portion of the flour, and stirring just until blended.Spoon the batter into the cupcake liners. Fill  full, using about  cup of batter per cup. Tip: Avoid over-filling the liners which may cause the batter to run-over the sides when baking. It is better to bake any remaining batter separately after the first pan of cupcakes has finished baking.Bake: Bake, rotating pan halfway through, 18 to 20 minutes, or until the cakes are just firm and spring back when gently pressed, and a toothpick, wooden skewer, or cake tester inserted in the center comes out clean. Cool slightly in cupcake pan, and turn out of pan when cool enough to handle. Repeat process with any remaining batter. Cool cupcakes completely on a wire cooling rack before frosting.In a large mixing bowl, combine butter, whipping cream, vanilla, and salt. Use an electric mixer and beat together until mixture is combined, dont worry if the mixture looks curdled. Add 4 cups powdered sugar; beat 2 to 4 minutes or until frosting is thick and fluffy. Add additional  cup powdered sugar if necessary to make a good spreading consistency.Use an offset spatula to frost the top of each cupcake, or use a pastry bag and decorating tip to pipe the frosting.For each cupcake, arrange 3 sliced strawberries and a 6 to 8 blueberries on top of the frosting.', u'spoonacularSourceUrl': u'https://spoonacular.com/old-glory-cupcakes-672262', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}