{u'recipes': [{u'sourceName': u'Norecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/603460-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 603460, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mongolian Beef', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 207.39, u'creditText': u'Norecipes', u'extendedIngredients': [{u'originalString': u'225 grams beef thinly sliced', u'aisle': u'Frozen;Meat', u'name': u'beef', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 23572, u'unit': u'grams'}, {u'originalString': u'11 grams garlic (2 large cloves) minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons hoisin sauce', u'aisle': u'Ethnic Foods', u'name': u'hoisin sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6175, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons oyster sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6176, u'unit': u'teaspoons'}, {u'originalString': u'3 Tien Tsin peppers or other hot chili pepper', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'1/4 teaspoon potato starch', u'aisle': u'Baking', u'name': u'potato starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11413, u'unit': u'teaspoon'}, {u'originalString': u'75 grams scallions (2-3 scallions) sliced diagonally', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'sliced', u'(2-3 scallions)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 11291, u'unit': u'grams'}, {u'originalString': u'1 teaspoon Shaoxing wine', u'aisle': u'Alcoholic Beverages', u'name': u'shaoxing wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 43479, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon doubanjiang', u'aisle': u'?', u'name': u'doubanjiang', u'metaInformation': [], u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'unit': u'teaspoon'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://norecipes.com/recipe/mongolian-beef/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the beef in a bowl along with the 1 teaspoon of shaoxing, the oyster sauce and potato starch. Stir to evenly coat the beef and let it marinate while you prepare the rest of the ingredients. In a small bowl, add the hoisin sauce, 1 tablespoon of shaoxing, and doubanjiang, stir to combine.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 11413, u'name': u'potato starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6175, u'name': u'hoisin sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'id': 6176, u'name': u'oyster sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat a wok or frying pan until hot.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the oil chili peppers and garlic and fry until the garlic is fragrant.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the beef and stir-fry until the beef is barely cooked through.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Add the scallions and sauce and continue to stir-fry until the sauce has caramelized and coats the beef evenly (a few more seconds).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Serve your Mongolian Beef over fried cellophane noodles or rice.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 263, u'instructions': u'Put the beef in a bowl along with the 1 teaspoon of shaoxing, the oyster sauce and potato starch. Stir to evenly coat the beef and let it marinate while you prepare the rest of the ingredients. In a small bowl, add the hoisin sauce, 1 tablespoon of shaoxing, and doubanjiang, stir to combine. Heat a wok or frying pan until hot. Add the oil chili peppers and garlic and fry until the garlic is fragrant. Add the beef and stir-fry until the beef is barely cooked through.Add the scallions and sauce and continue to stir-fry until the sauce has caramelized and coats the beef evenly (a few more seconds). Serve your Mongolian Beef over fried cellophane noodles or rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/mongolian-beef-603460', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}