{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/793908-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 793908, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hawaiian Mojito', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 289.66, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'Club soda (or a tropical flavored sparkling water such as lime, mango or coconut LaCroix)', u'aisle': u'Beverages', u'name': u'club soda', u'metaInformation': [u'flavored', u'(or a tropical sparkling water such as lime, mango or coconut LaCroix)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'servings'}, {u'originalString': u'1 shot pineapple coconut mixer', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u''}, {u'originalString': u'1 22-oz. container of coconut cream (such as Coco Lopez)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'coconut cream', u'metaInformation': [u'(such as Coco Lopez)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 22.0, u'consistency': u'solid', u'id': 12115, u'unit': u'oz'}, {u'originalString': u'1 shot coconut rum', u'aisle': u'Alcoholic Beverages', u'name': u'coconut rum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 10314037, u'unit': u''}, {u'originalString': u'Ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'servings'}, {u'originalString': u'Juice of 1 - 2 limes or lemons', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 14-oz. can light coconut milk', u'aisle': u'Canned and Jarred', u'name': u'light coconut milk', u'metaInformation': [u'light', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 99009, u'unit': u'oz'}, {u'originalString': u'1 lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'Several fresh mint leaves', u'aisle': u'Produce', u'name': u'mint leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'leaves'}, {u'originalString': u'1 12-oz. can of frozen pineapple juice concentrate', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [u'frozen', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 9273, u'unit': u'oz'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/hawaiian-mojito/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the base mixer by blending together the coconut pineapple mixer ingredients.In each mojito glass, put several fresh mint leaves in the bottom of the glass and squeeze the juices of a lime over. Muddle with a muddler or spoon to release the flavors of the mint.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'fresh mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Add pieces of the lime so the oils from the rind will infuse into the drink.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'Pour in 1 shot of coconut rum, 1 shot of the pineapple coconut mixer.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 10314037, u'name': u'coconut rum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [], u'step': u'Add ice to fill the glass, then top with club soda to fill the glass.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Garnish as desired and enjoy!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 43, u'instructions': u'Make the base mixer by blending together the coconut pineapple mixer ingredients.In each mojito glass, put several fresh mint leaves in the bottom of the glass and squeeze the juices of a lime over. Muddle with a muddler or spoon to release the flavors of the mint. Add pieces of the lime so the oils from the rind will infuse into the drink.Pour in 1 shot of coconut rum, 1 shot of the pineapple coconut mixer. Add ice to fill the glass, then top with club soda to fill the glass. Garnish as desired and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/hawaiian-mojito-793908', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}