{u'recipes': [{u'sourceName': u'Serena Bakes Simple from Scratch', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/520438-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 520438, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fudge Brownies With Peanut Butter Swirl', u'diets': [], u'pricePerServing': 89.87, u'creditText': u'Serena Bakes Simple from Scratch', u'extendedIngredients': [{u'originalString': u'1 1/2 teaspoons Baking Powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1 cup Brown Sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup Butter Plus More For Pan', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'plus more for pan'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1/4 cup Cocoa Powder Plus More For Pan', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'plus more for pan'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2/3 cup Whole Wheat Pastry Flour Or All-Purpose', u'aisle': u'Baking', u'name': u'pastry flour', u'metaInformation': [u'whole wheat', u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 10020080, u'unit': u'cup'}, {u'originalString': u'3/4 cup Peanut Butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'2 tablespoons Powdered Sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces Semi-Sweet Chocolate', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'1 tablespoons Vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoons'}, {u'originalString': u'3 whole Eggs, Stirred To Break Yolks (Not Beaten)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole', u'beaten', u'(Not )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.serenabakessimplyfromscratch.com/2012/05/fudgy-brownies-with-peanut-butter-swirl.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Everything needs to be mixed by hand please do not use a mixer.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 350 degrees. Grease a 8"x11" pan with butter, then dust with cocoa. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a double boiler or a medium-large bowl over a pot of boiling water add butter and chocolate.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Stir until melted over medium heat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Remove mixture from heat and set aside to cool.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Now mix all ingredients for peanut butter swirl in a small bowl until fully incorporated and set aside.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix eggs, brown sugar, and vanilla in a medium/small bowl. Set aside.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Now return to the melted chocolate bowl and add baking powder, sea salt and cocoa.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [], u'step': u'Mix until fully combined.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the egg/sugar mixture into the chocolate mixture and stir being careful not to incorporate air.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add all of the flour to the chocolate mixture and stir just until incorporated.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Take half of the brownie mixture and spread in the prepared pan. Dollop half of the peanut butter mixture randomly over the top of the brownie mixture using a small cookie scoop or tablespoon. Cover with remaining brownie mixture. Now repeat dolloping with peanut butter mixture.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'With a knife make large S shapes  like a snake going width of the pan. Now repeat long S shapes going the length of the pan. Tap pan lightly once or twice to level.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 35-40 minutes. Brownies will still be slightly jiggly in the middle.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool completely or brownies will be a little crumbly if warm.', u'number': 15, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 98, u'instructions': u'Everything needs to be mixed by hand please do not use a mixer.                    Preheat oven to 350 degrees. Grease a 8"x11" pan with butter, then dust with cocoa. Set aside.                    In a double boiler or a medium-large bowl over a pot of boiling water add butter and chocolate.                     Stir until melted over medium heat.Remove mixture from heat and set aside to cool.                    Now mix all ingredients for peanut butter swirl in a small bowl until fully incorporated and set aside.                    Mix eggs, brown sugar, and vanilla in a medium/small bowl. Set aside.                    Now return to the melted chocolate bowl and add baking powder, sea salt and cocoa. Mix until fully combined.                    Pour the egg/sugar mixture into the chocolate mixture and stir being careful not to incorporate air. Add all of the flour to the chocolate mixture and stir just until incorporated.                    Take half of the brownie mixture and spread in the prepared pan. Dollop half of the peanut butter mixture randomly over the top of the brownie mixture using a small cookie scoop or tablespoon. Cover with remaining brownie mixture. Now repeat dolloping with peanut butter mixture.                    With a knife make large S shapes  like a snake going width of the pan. Now repeat long S shapes going the length of the pan. Tap pan lightly once or twice to level.                    Bake for 35-40 minutes. Brownies will still be slightly jiggly in the middle. Let cool completely or brownies will be a little crumbly if warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/fudge-brownies-with-peanut-butter-swirl-520438', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}