{u'recipes': [{u'sourceName': u'Foodess', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/618949-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 618949, u'veryPopular': False, u'lowFodmap': False, u'title': u'Three-Cheese Skillet Lasagna', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 142.58, u'creditText': u'Foodess', u'extendedIngredients': [{u'originalString': u'Coarse salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 large egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3 garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'3 tbsp extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 box (12 ounces) no-boil lasagna noodles', u'aisle': u'Pasta and Rice', u'name': u'packaged no-boil lasagna noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10620420, u'unit': u'ounces'}, {u'originalString': u'\xbc cup grated Pecorino Romano or Parmigiano-Reggianno cheese (1 ounce)', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'ounce'}, {u'originalString': u'1\xbd cups part-skim ricotta cheese (12 ounces), room temperature', u'aisle': u'Cheese', u'name': u'part-skim ricotta cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 1037, u'unit': u'ounces'}, {u'originalString': u'2 cans (one 28 ounce and one 15 ounces) whole peeled plum tomatoes', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'whole', u'peeled', u'(one 28 ounce and one 15 ounces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 10411529, u'unit': u'cans'}, {u'originalString': u'2 cups shredded fresh mozzarella cheese (1/2 pound)', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'fresh', u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'pound'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://foodess.com/10328-three-cheese-skillet-lasagna.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 400F. In a food processor, pulse tomatoes (with their liquid) until coarsely pureed. In a large saute pan, bring tomatoes, garlic, and oil to a boil over medium-high heat. Season with salt and pepper. Reduce to medium and simmer until thickened, about 12 minutes (you should have about 5 cups marinara sauce).Meanwhile, in a bowl, mix together egg yolk, ricotta, and  teaspoon each salt and pepper.Carefully pour sauce into a heatproof bowl, and return  cup to pan; spread sauce evenly.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add a single layer of noodles, breaking them up to fit. Top with half the ricotta mixture, spreading evenly. Follow with a second layer of noodles, then 1 cups marinara.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add a third layer of noodles, then remaining ricotta mixture. Follow with a final noodle layer, then remaining sauce. Sprinkle mozzarella and Pecorino over top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Bake lasagna until golden and bubbling, 30 to 35 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand 10 minutes before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 113, u'instructions': u'Preheat oven to 400F. In a food processor, pulse tomatoes (with their liquid) until coarsely pureed. In a large saute pan, bring tomatoes, garlic, and oil to a boil over medium-high heat. Season with salt and pepper. Reduce to medium and simmer until thickened, about 12 minutes (you should have about 5 cups marinara sauce).Meanwhile, in a bowl, mix together egg yolk, ricotta, and  teaspoon each salt and pepper.Carefully pour sauce into a heatproof bowl, and return  cup to pan; spread sauce evenly. Add a single layer of noodles, breaking them up to fit. Top with half the ricotta mixture, spreading evenly. Follow with a second layer of noodles, then 1 cups marinara. Add a third layer of noodles, then remaining ricotta mixture. Follow with a final noodle layer, then remaining sauce. Sprinkle mozzarella and Pecorino over top.Bake lasagna until golden and bubbling, 30 to 35 minutes. Let stand 10 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/three-cheese-skillet-lasagna-618949', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}