{u'recipes': [{u'sourceName': u'A Farm Girls Dabbles', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497744-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 497744, u'veryPopular': True, u'lowFodmap': False, u'title': u'Overnight Prosciutto & Goat Cheese Egg Bake', u'diets': [], u'pricePerServing': 174.15, u'creditText': u'A Farm Girls Dabbles', u'extendedIngredients': [{u'originalString': u'14 to 18 slices English muffin bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'english'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 14.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'1 T. Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'T'}, {u'originalString': u'5 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'6 T. thinly sliced fresh basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 2044, u'unit': u'T'}, {u'originalString': u'8 oz. crumbled goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'1/4 c. chopped green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'c'}, {u'originalString': u'1/2 tsp. ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'6 oz. prosciutto, thinly sliced and torn into bite size pieces (or use some good ham, small diced)', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'diced', u'good', u'small', u'thinly sliced', u'(or use some ham, )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'oz'}, {u'originalString': u'8 oz. shredded provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1035, u'unit': u'oz'}, {u'originalString': u'1/2 tsp. salt (you may want to use less, depending on the saltiness of your prosciutto/ham and goat cheese)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'(you may want to use less, depending on the saltiness of your prosciutto/ham and goat cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'3 T. unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'T'}, {u'originalString': u'2 c. whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'c'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.afarmgirlsdabbles.com/2011/12/29/overnight-prosciutto-goat-cheese-egg-bake-giveaway/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Spray a 9'' x 13'' baking dish with cooking spray. Then line the bottom of the dish with 1 layer of bread, cutting some of the slices to fit if necessary. Arrange half the prosciutto evenly over the bread, and then half the goat cheese and half the provolone. Sprinkle with half of the green onions and basil. Top with a second layer of bread slices. Layer on the remaining prosciutto, goat cheese, provolone, green onions, and basil.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'id': 1035, u'name': u'provolone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u"Cut enough of the remaining bread slices into 1/4'' cubes to equal 2 cups of bread cubes. Sprinkle these over the top.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18064, u'name': u'bread cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk eggs, milk, mustard, salt, and pepper in a medium bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour egg mixture evenly over the egg bake, letting it soak in.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Drizzle melted butter evenly over the top. Cover and refrigerate overnight.The next morning, preheat oven to 350\xb0. Uncover the egg bake and let stand at room temperature for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Bake until the center is set, about 55 to 60 minutes. If you want to crisp up the top even more, set it under the broiler for a minute or two, until golden.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into large squares and serve.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1297, u'instructions': u"Spray a 9'' x 13'' baking dish with cooking spray. Then line the bottom of the dish with 1 layer of bread, cutting some of the slices to fit if necessary. Arrange half the prosciutto evenly over the bread, and then half the goat cheese and half the provolone. Sprinkle with half of the green onions and basil. Top with a second layer of bread slices. Layer on the remaining prosciutto, goat cheese, provolone, green onions, and basil. Cut enough of the remaining bread slices into 1/4'' cubes to equal 2 cups of bread cubes. Sprinkle these over the top.Whisk eggs, milk, mustard, salt, and pepper in a medium bowl. Pour egg mixture evenly over the egg bake, letting it soak in. Drizzle melted butter evenly over the top. Cover and refrigerate overnight.The next morning, preheat oven to 350\xb0. Uncover the egg bake and let stand at room temperature for 30 minutes. Bake until the center is set, about 55 to 60 minutes. If you want to crisp up the top even more, set it under the broiler for a minute or two, until golden. Cut into large squares and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/overnight-prosciutto-goat-cheese-egg-bake-497744', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}