{u'recipes': [{u'sourceName': u'Tickling Palates', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/564616-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 564616, u'veryPopular': True, u'lowFodmap': False, u'title': u'Aloo Chana Masala | Aloo Chole | Side Dish for Chapathi', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 122.34, u'creditText': u'Tickling Palates', u'extendedIngredients': [{u'originalString': u'Cumin seeds – 1 tsp', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'tsp'}, {u'originalString': u'Ginger – 1 inch piece', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'Green chilies – 2', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'Chana Masala powder – 1-1/2 tbsp', u'aisle': u'Spices and Seasonings', u'name': u'alum powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10118371, u'unit': u'tbsp'}, {u'originalString': u'Dry mango – 4 inch piece *(See Notes)', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 4.0, u'consistency': u'solid', u'id': 9176, u'unit': u'inch'}, {u'originalString': u'Oil – 1 tbsp', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'Onion, medium – 1', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Potatoes (Aloo), medium – 3', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'medium', u'(Aloo)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'Red chili powder – 1 tsp', u'aisle': u'Spices and Seasonings', u'name': u'red chili powder', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'Salt – to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Tomatoes, medium – 2', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'Turmeric powder – 1/2 tsp', u'aisle': u'Spices and Seasonings', u'name': u'turmeric powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}, {u'originalString': u'White Kabuli Chana (Chickpeas) – 1 cup', u'aisle': u'?', u'name': u'kabuli chana', u'metaInformation': [u'white', u'(Chickpeas)'], u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.ticklingpalates.com/2013/12/aloo-chana-masala-aloo-chole-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Soak chickpeas in enough water overnight. The next day discard the soaked water and rinse well. Pressure cook in enough water with a pinch of salt till soft.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain the water (stock). Do not discard the water as we are going to use it.\xa0 Pressure potatoes till soft. Peel the skin and either cube them or quarter them.  Chop the onion and tomatoes finely. Slit the green chilies. Grate the ginger.  Soak the dry mango piece in 1/8 cup hot water and let it rest for 10 minutes. Grind to a paste using little more water if needed and keep aside.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Gruener Veltliner, and Sparkling ros\xe9 are my top picks for Chole. The best wine for Indian food will depending on the dish, of course, but these picks can be served chilled and have some sweetness to complement the spiciness and complex flavors of a wide variety of traditional dishes. The Engel Wines Riesling - Kosher with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'riesling', u'gruener veltliner', u'sparkling rose'], u'productMatches': [{u'description': u'A lively off-dry Riesling, with accents of green apple, citrus and tropical fruits, complemented by delicate floral aromas, and a crisp acidity. Enjoy this wine chilled.', u'title': u'Engel Wines Riesling - Kosher', u'price': u'$19.99', u'id': 431252, u'link': u'https://www.amazon.com/Engel-Wines-Finger-Lakes-Riesling/dp/B06WRRCM11', u'imageUrl': u'https://spoonacular.com/productImages/431252-312x231.jpg'}]}, u'aggregateLikes': 462, u'instructions': u'Soak chickpeas in enough water overnight. The next day discard the soaked water and rinse well. Pressure cook in enough water with a pinch of salt till soft. Drain the water (stock). Do not discard the water as we are going to use it.\xa0 Pressure potatoes till soft. Peel the skin and either cube them or quarter them.  Chop the onion and tomatoes finely. Slit the green chilies. Grate the ginger.  Soak the dry mango piece in 1/8 cup hot water and let it rest for 10 minutes. Grind to a paste using little more water if needed and keep aside.', u'spoonacularSourceUrl': u'https://spoonacular.com/aloo-chana-masala-aloo-chole-side-dish-for-chapathi-564616', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}