{u'recipes': [{u'sourceName': u'How Sweet Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/617624-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 617624, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Butternut, Bacon and Leek Pappardelle', u'diets': [], u'pricePerServing': 215.68, u'creditText': u'How Sweet Eats', u'extendedIngredients': [{u'originalString': u'2 1/2 cups (1-inch) cubed butternut squash', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'cubed', u'(1-inch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 cup half and half (or heavy cream!)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [u'(or heavy cream!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'4 cleaned and trimmed leeks, sliced', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'cleaned', u'trimmed', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1/4 teaspoon freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1 cup freshly grated parmigiano-reggiano cheese', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'8 ounces pappardelle pasta, cooked', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'6 slices thick-cut bacon, chopped', u'aisle': u'Meat', u'name': u'thick-cut bacon', u'metaInformation': [u'thick-cut', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 10310123, u'unit': u'slices'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.howsweeteats.com/2014/10/creamy-butternut-bacon-and-leek-pappardelle/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Heat a large skillet over medium heat and add the bacon. Cook until most of the fat is rendered and the bacon is almost crispy, then add the leeks and stir to coat. Cook for 5 minutes. Stir in the garlic and butternut cubes along with the pepper and nutmeg. (At this point I usually begin to cook the pappardelle.) Toss the squash well to coat it in the bacon fat, then cover the skillet and cook for 5 to 6 minutes - until the squash is JUST tender enough to eat. You don't want it breaking down.With the heat on low, stir in the half and half and the cheese. Cook and stir until the cream is just warmed, then stir in the cooked pasta. Toss the ingredients in the skillet well. Taste and season additionally with salt if desired - I usually find that the bacon is salty enough for the entire dish.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Serve immediately!', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 411, u'instructions': u"Heat a large skillet over medium heat and add the bacon. Cook until most of the fat is rendered and the bacon is almost crispy, then add the leeks and stir to coat. Cook for 5 minutes. Stir in the garlic and butternut cubes along with the pepper and nutmeg. (At this point I usually begin to cook the pappardelle.) Toss the squash well to coat it in the bacon fat, then cover the skillet and cook for 5 to 6 minutes - until the squash is JUST tender enough to eat. You don't want it breaking down.With the heat on low, stir in the half and half and the cheese. Cook and stir until the cream is just warmed, then stir in the cooked pasta. Toss the ingredients in the skillet well. Taste and season additionally with salt if desired - I usually find that the bacon is salty enough for the entire dish. Serve immediately!", u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-butternut-bacon-and-leek-pappardelle-617624', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}