{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/493634-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 493634, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicago Burger Week: The Chicago Deep Dish Pizza Burger', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 419.07, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'2 hamburger patties, cooked to your liking', u'aisle': u'Frozen', u'name': u'cooked hamburger patties', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 23569, u'unit': u''}, {u'originalString': u'1 pound mushrooms, trimmed and thinly sliced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'trimmed', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'pound'}, {u'originalString': u'1 tablespoon fresh oregano, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoon'}, {u'originalString': u'6 ounces pizza sauce or other thick tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'6 ounces Shredded mozzarella', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'ounces'}, {u'originalString': u'2 sturdy burger buns or round Italian buns, split', u'aisle': u'Bakery/Bread', u'name': u'sub buns', u'metaInformation': [u'split', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon Amstel light', u'aisle': u'?', u'name': u'amstel', u'metaInformation': [u'light'], u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'unit': u'tablespoon'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.foodrepublic.com/2013/09/30/chicago-burger-week-chicago-deep-dish-pizza-burger', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the butter in a medium skillet. When it’s hot and foamy, add the mushrooms, toss to coat with butter and cook on medium heat for 5-7 minutes or until just golden-brown.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Add the oregano and beer, toss again to distribute, reduce heat to low and cook for another 5 minutes or until all the liquid is absorbed.Season to taste with salt and pepper, then set aside and let cool for at least 15 minutes (this will help keep the juices in)To assemble the burger:Preheat the broiler to high heat.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [], u'step': u'Place a burger patty on the bottom of each bun and divide the pizza sauce, then the shredded mozzarella between them.Broil the patties until the cheese is melted and slightly browned, keeping a close eye on them (they burn quickly!)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001026, u'name': u'shredded mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven, top with the saut\xe9ed mushrooms, finish with the top bun and serve.This post is brought to you by our friends at Amstel Light', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}], u'name': u'For the oregano mushrooms'}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are great choices for Pizza Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Salentein Killka Malbec. It has 4.2 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'The color is ruby red with tints of violet. The aroma rich in fruit, reminiscent of plum, black fruits, blackberries and violets. The palate shows great structure and well-balanced acidity. The tannins feel soft and pleasant, with marked roundness and a strong fruity finish.', u'title': u'Salentein Killka Malbec', u'price': u'$12.99', u'id': 436136, u'link': u'https://www.wine.com/product/salentein-killka-malbec-2009/108793', u'imageUrl': u'https://spoonacular.com/productImages/436136-312x231.jpg'}]}, u'aggregateLikes': 69, u'instructions': u'Directions:\xa0                                    For the oregano mushrooms:Heat the butter in a medium skillet. When it’s hot and foamy, add the mushrooms, toss to coat with butter and cook on medium heat for 5-7 minutes or until just golden-brown.Add the oregano and beer, toss again to distribute, reduce heat to low and cook for another 5 minutes or until all the liquid is absorbed.Season to taste with salt and pepper, then set aside and let cool for at least 15 minutes (this will help keep the juices in)To assemble the burger:Preheat the broiler to high heat.Place a burger patty on the bottom of each bun and divide the pizza sauce, then the shredded mozzarella between them.Broil the patties until the cheese is melted and slightly browned, keeping a close eye on them (they burn quickly!)Remove from the oven, top with the saut\xe9ed mushrooms, finish with the top bun and serve.This post is brought to you by our friends at Amstel Light', u'spoonacularSourceUrl': u'https://spoonacular.com/chicago-burger-week-the-chicago-deep-dish-pizza-burger-493634', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}