{u'recipes': [{u'sourceName': u'Cocina Dominicana', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/629329-556x370.jpg', u'cheap': True, u'gaps': u'no', u'cookingMinutes': 45, u'id': 629329, u'veryPopular': True, u'lowFodmap': False, u'title': u'Arroz con Lentejas y Cebolla Frita – Mi Viaje a Israel, 1', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 1.5, u'creditText': u'Cocina Dominicana', u'extendedIngredients': [{u'originalString': u'1 cucharadita de cilantro en polvo', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u''}, {u'originalString': u'Cilantro para servir', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'\xbc taza de garbanzos hervidos', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'garbanzos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 16057, u'unit': u''}, {u'originalString': u'2 cucharadas de harina todo uso', u'aisle': u'Ethnic Foods;Baking', u'name': u'masa harina', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-flour.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 20317, u'unit': u''}, {u'originalString': u'5 cebollas rojas grandes, 3 picadas en pedazos peque\xf1itos, 2 cortadas en aros finos', u'aisle': u'?', u'name': u'cebollas rojas grandes', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'unit': u''}, {u'originalString': u'4 cucharadas de aceite de oliva', u'aisle': u'?', u'name': u'cucharadas de aceite de oliva', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'unit': u''}, {u'originalString': u'\xbd cucharadita de pimienta', u'aisle': u'?', u'name': u'cucharadita de pimienta', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'unit': u''}, {u'originalString': u'2\xbd cucharadita de sal de mesa', u'aisle': u'?', u'name': u'cucharadita de sal de mesa', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 2.5, u'unit': u''}, {u'originalString': u'2 cucharaditas de c\xfarcuma', u'aisle': u'?', u'name': u'cucharaditas de c\xfarcuma', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'unit': u''}, {u'originalString': u'1 cucharaditas de sal molida gruesa', u'aisle': u'?', u'name': u'cucharaditas de sal molida gruesa', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'unit': u''}, {u'originalString': u'\xbc taza de aceite vegetal (ma\xedz, man\xed, y soya)', u'aisle': u'?', u'name': u'taza de aceite vegetal', u'metaInformation': [u'(ma\xedz, man\xed, y soya)'], u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.cocinadominicana.com/8889/arroz-lentejas-cebolla-frita-comida-israel.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Hierve las lentejas, con suficiente agua para cubrirlas ms una pulgada [2.5 cm], y cuece por 15 minutos, contando a partir de que empiece a hervir vigorosamente. Retire del fuego y separa las lentejas del lquido. Reserva ambos.Caliente el aceite de oliva en una sartn de fondo grueso a fuego alto. Agrega la cebolla y cuece removiendo hasta que se torne dorado oscuro. Sazona con comino, crcuma, semillas de cilantro, canela, sal de mesa y pimienta. Agrega el arroz y lentejas, y mezcla revolviendo hasta que los granos estn cubiertos de aceite. Agrega 3 tazas del lquido en que hirvieron las habichuelas (agrega agua si no tienes suficiente). Baja el fuego a medio-alto.Cuece hasta que casi todo el lquido haya evaporado, removiendo frecuentemente para evitar que el arroz se pegue al fondo. Mezcla con los molondrones y garbanzos. Cubre con una tapa hermtica y baja el fuego al mnimo.Cuece por 15 minutos. Destapa y remueve. El arroz debe estar cocido pero firme. Si es necesario, tapa y cuece otros cinco minutos.Mientras el arroz se cuece, cubre los aros de cebollas con harina y sal gruesa.Calienta el aceite vegetal a fuego alto. Fre las cebollas hasta que estn doradas oscuras. Coloca sobre una toalla de papel para absorber el exceso de aceite.Sirve el arroz caliente, cubre con las cebollas fritas y el cilantro.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 16186, u'instructions': u'Hierve las lentejas, con suficiente agua para cubrirlas ms una pulgada [2.5 cm], y cuece por 15 minutos, contando a partir de que empiece a hervir vigorosamente. Retire del fuego y separa las lentejas del lquido. Reserva ambos.Caliente el aceite de oliva en una sartn de fondo grueso a fuego alto. Agrega la cebolla y cuece removiendo hasta que se torne dorado oscuro. Sazona con comino, crcuma, semillas de cilantro, canela, sal de mesa y pimienta. Agrega el arroz y lentejas, y mezcla revolviendo hasta que los granos estn cubiertos de aceite. Agrega 3 tazas del lquido en que hirvieron las habichuelas (agrega agua si no tienes suficiente). Baja el fuego a medio-alto.Cuece hasta que casi todo el lquido haya evaporado, removiendo frecuentemente para evitar que el arroz se pegue al fondo. Mezcla con los molondrones y garbanzos. Cubre con una tapa hermtica y baja el fuego al mnimo.Cuece por 15 minutos. Destapa y remueve. El arroz debe estar cocido pero firme. Si es necesario, tapa y cuece otros cinco minutos.Mientras el arroz se cuece, cubre los aros de cebollas con harina y sal gruesa.Calienta el aceite vegetal a fuego alto. Fre las cebollas hasta que estn doradas oscuras. Coloca sobre una toalla de papel para absorber el exceso de aceite.Sirve el arroz caliente, cubre con las cebollas fritas y el cilantro.', u'spoonacularSourceUrl': u'https://spoonacular.com/arroz-con-lentejas-y-cebolla-frita-mi-viaje-a-israel-1-629329', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}