{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/377408-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 377408, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bruschetta with Shrimp, Tarragon and Arugula', u'diets': [u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 337.79, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 packed cup arugula, chopped', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [u'packed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cup'}, {u'originalString': u'1 (1-pound) loaf ciabatta bread, trimmed and cut into 14 (1/2-inch thick) slices', u'aisle': u'Bakery/Bread', u'name': u'ciabatta bread', u'metaInformation': [u'trimmed', u'cut into 14 (1/) slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93655, u'unit': u'pound'}, {u'originalString': u'3 tablespoons chopped fresh tarragon leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh tarragon leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2041, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 garlic clove, halved', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/4 cup low-sodium chicken stock', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken stock', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1006970, u'unit': u'cup'}, {u'originalString': u'1/2 cup mascarpone cheese, at room temperature', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93820, u'unit': u'cup'}, {u'originalString': u'Olive oil, for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'6 Roma tomatoes, chopped', u'aisle': u'Produce', u'name': u'roma tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}, {u'originalString': u'1 large or 2 small shallots, thinly sliced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 pound extra-large shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'extra-large', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1/4 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpeg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/bruschetta-with-shrimp-tarragon-and-arugula-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the toasts: Put an oven rack in the center of the oven. Preheat the oven to 400 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Arrange the bread slices in a single layer on a baking sheet and drizzle with olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Bake until light golden, about 10 minutes. Cool for 2 minutes. Rub the warm toasts with the cut side of the garlic. Set aside.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the topping: In a medium skillet, heat 3 tablespoons of oil over medium-high heat.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the shallots and garlic and cook, stirring frequently, until soft, about 2 minutes. Season the shrimp with salt and pepper, to taste, and add them to the skillet. Cook until the shrimp are pink and cooked through about 3 to 4 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Remove the shrimp and chop into 1/2-inch pieces. Set aside.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In the same skillet, add the tomatoes and season with salt and pepper, to taste. Cook over medium-high heat until the tomatoes start to soften, about 4 minutes. Turn the heat to high.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the wine and scrape up the brown bits that cling to the bottom of the pan with a wooden spoon. Cook for 2 minutes. Stir in the stock and cook until most of the liquid has evaporated, about 2 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat and add the tarragon, arugula, mascarpone cheese, and chopped shrimp. Stir until the mixture is creamy. Season with salt and pepper, to taste. Arrange the toasts on serving plates and drizzle with the sauce. Sprinkle with salt and pepper before serving.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood on the menu? Try pairing with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Perrier-Jouet Nuit Blanche. It has 4.9 out of 5 stars and a bottle costs about 68 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'The sweeter taste, combined with the rounded and smooth mouth feel give the wine, a full body and richness that makes Perrier-Jou\xebt Nuit Blanche the perfect champagne to awaken the senses.Perrier-Jou\xebt Nuit Blanche is an exceptional Non-Vintage blend of 20% Chardonnay, 40% Pinot Noir and 40% Pinot Meunier, sweetened to taste with a 20g/l dosage of cane sugar to create a sensual style.   View More', u'title': u'Perrier-Jouet Nuit Blanche', u'price': u'$67.99', u'id': 461023, u'link': u'https://www.wine.com/product/perrier-jouet-nuit-blanche/137331', u'imageUrl': u'https://spoonacular.com/productImages/461023-312x231.jpg'}]}, u'aggregateLikes': 23, u'instructions': u'Watch how to make this recipe.                    For the toasts: Put an oven rack in the center of the oven. Preheat the oven to 400 degrees F.                          Arrange the bread slices in a single layer on a baking sheet and drizzle with olive oil. Bake until light golden, about 10 minutes. Cool for 2 minutes. Rub the warm toasts with the cut side of the garlic. Set aside.                          For the topping: In a medium skillet, heat 3 tablespoons of oil over medium-high heat. Add the shallots and garlic and cook, stirring frequently, until soft, about 2 minutes. Season the shrimp with salt and pepper, to taste, and add them to the skillet. Cook until the shrimp are pink and cooked through about 3 to 4 minutes. Remove the shrimp and chop into 1/2-inch pieces. Set aside.                          In the same skillet, add the tomatoes and season with salt and pepper, to taste. Cook over medium-high heat until the tomatoes start to soften, about 4 minutes. Turn the heat to high. Add the wine and scrape up the brown bits that cling to the bottom of the pan with a wooden spoon. Cook for 2 minutes. Stir in the stock and cook until most of the liquid has evaporated, about 2 minutes. Remove the pan from the heat and add the tarragon, arugula, mascarpone cheese, and chopped shrimp. Stir until the mixture is creamy. Season with salt and pepper, to taste. Arrange the toasts on serving plates and drizzle with the sauce. Sprinkle with salt and pepper before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/bruschetta-with-shrimp-tarragon-and-arugula-377408', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}