{u'recipes': [{u'sourceName': u'Life as a Strawberry', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/532911-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532911, u'veryPopular': False, u'lowFodmap': False, u'title': u'Boozy Slow-Cooker French Dips', u'diets': [u'dairy free'], u'pricePerServing': 676.7, u'creditText': u'Life as a Strawberry', u'extendedIngredients': [{u'originalString': u'2 french baguettes, sliced in half and cut into sandwich-sized lengths', u'aisle': u'Bakery/Bread', u'name': u'baguettes', u'metaInformation': [u'french', u'sliced in half and cut into sandwich-sized lengths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u"1 cup beef stock (if you'd like to make a separate au jus sauce, plan on about 4 cups of stock)", u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [u"(if you'd like to make a separate au jus sauce, plan on 4 cups of stock)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'cup'}, {u'originalString': u"1 beer (I used a Coors. No shame. But I'd also recommend a pilsner or a dark malt-y beer like Guinness, depending on what you've got floating around your fridge)", u'aisle': u'Alcoholic Beverages', u'name': u'dark beer', u'metaInformation': [u'dark', u"(I used a Coors. No shame. But I'd also recommend a pilsner or a malt-y beer like Guinness, depending on what you've got floating around your fridge)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 14006, u'unit': u''}, {u'originalString': u'3 Tbsp. dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'Tbsp'}, {u'originalString': u'2 cloves garlic, smashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 lb beef roast (I used a sirloin roast)', u'aisle': u'Meat', u'name': u'roast beef', u'metaInformation': [u'(I used a sirloin roast)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roast-beef-slices.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 93713, u'unit': u'lb'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u"2 Tbsp. whiskey (I used Maker's Mark)", u'aisle': u'Alcoholic Beverages', u'name': u'whiskey', u'metaInformation': [u"(I used Maker's Mark)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14052, u'unit': u'Tbsp'}, {u'originalString': u'1/2 large yellow onion, sliced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 63.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.lifeasastrawberry.com/boozy-french-dips/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Sprinkle your roast with salt and pepper, then lightly rub the mustard into the meat on all sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place roast in a crock pot.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add beer, onions, whiskey, garlic, and beef stock to the crock pot (just pour the liquids right over the roast!). Cover and cook on low for 6-8 hours.Pull roast out of crock pot and let it rest on a cutting board. While meat is resting, use a large spoon to skim any fat off the surface of the liquid left in the crock pot. I use those reserved juices as my au jus dipping sauce, but if you’d like to make a separate au jus, just saut\xe9 some onions and garlic in a bit of butter and add a few cups of beef stock to make a new sauce for dipping.Slice the roast beef and pile it high between two baguette halves. Ladle up a cup of reserved liquid from the crock pot to dip each sandwich in and serve immediately.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6170, u'name': u'beef stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roast-beef-slices.jpg', u'id': 93713, u'name': u'roast beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'id': 14052, u'name': u'whiskey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 360, u'instructions': u'Sprinkle your roast with salt and pepper, then lightly rub the mustard into the meat on all sides.Place roast in a crock pot. Add beer, onions, whiskey, garlic, and beef stock to the crock pot (just pour the liquids right over the roast!). Cover and cook on low for 6-8 hours.Pull roast out of crock pot and let it rest on a cutting board. While meat is resting, use a large spoon to skim any fat off the surface of the liquid left in the crock pot. I use those reserved juices as my au jus dipping sauce, but if you’d like to make a separate au jus, just saut\xe9 some onions and garlic in a bit of butter and add a few cups of beef stock to make a new sauce for dipping.Slice the roast beef and pile it high between two baguette halves. Ladle up a cup of reserved liquid from the crock pot to dip each sandwich in and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/boozy-slow-cooker-french-dips-532911', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}