{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/448379-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 448379, u'veryPopular': False, u'lowFodmap': False, u'title': u'Greek Pizzas', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 181.76, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup crumbled feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1 teaspoon minced fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons chopped green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1/4 to 1/2 cup shredded part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1028, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 whole pita breads (6 inches)', u'aisle': u'Bakery/Bread', u'name': u'pita breads', u'metaInformation': [u'whole', u'(es)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'6-inchs', u'unitShort': u'6-inch', u'amount': 2.0, u'consistency': u'solid', u'id': 18413, u'unit': u'6-inch'}, {u'originalString': u'4 cups torn fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'4 tomato slices, halved', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u'slices'}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/greek-pizzas', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place pita breads on a baking sheet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'id': 18413, u'name': u'pita'}]}, {u'equipment': [], u'step': u'Brush each with 1/4 teaspoon oil. Broil 6 in. from the heat for 1-2 minutes or until lightly browned. Turn pitas over; brush with remaining oil. Broil 1-2 minutes longer.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'id': 18413, u'name': u'pita'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'In a microwave-safe dish, microwave spinach on high for 1 to 1-1/2 minutes or until wilted; drain well. Stir in onion and dill.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}]}, {u'equipment': [], u'step': u'Top the pitas with tomatoes, spinach mixture and cheeses. Sprinkle with oregano and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'id': 18413, u'name': u'pita'}]}, {u'equipment': [], u'step': u'Bake at 450\xb0 for 7-9 minutes or until cheese is lightly browned.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are great choices for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Selvapiana Chianti Rufina with a 4.3 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses. View More', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Directions                                                                                Place pita breads on a baking sheet. Brush each with 1/4 teaspoon oil. Broil 6 in. from the heat for 1-2 minutes or until lightly browned. Turn pitas over; brush with remaining oil. Broil 1-2 minutes longer.                                                                                           In a microwave-safe dish, microwave spinach on high for 1 to 1-1/2 minutes or until wilted; drain well. Stir in onion and dill.                                                                                           Top the pitas with tomatoes, spinach mixture and cheeses. Sprinkle with oregano and pepper. Bake at 450\xb0 for 7-9 minutes or until cheese is lightly browned.                                        Yield: 2 servings.                                                                                                                         Originally published as Greek Pizzas in  Cooking for 2Winter 2005, p11                                                                                                                                                                                                        Nutritional Facts                                                                             One pizza (prepared with reduced-fat feta cheese and 1/4 cup part-skim mozzarella) equals 295 calories, 9 g fat (4 g saturated fat), 18 mg cholesterol, 810 mg sodium, 39 g carbohydrate, 4 g fiber, 17 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/greek-pizzas-448379', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}