{u'recipes': [{u'sourceName': u'Cbsop', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/496476-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 496476, u'veryPopular': True, u'lowFodmap': False, u'title': u'The Ultimate Fettuccine Alfredo', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 247.14, u'creditText': u'Cbsop', u'extendedIngredients': [{u'originalString': u'1/2 lb (2 sticks) butter, cut in small cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'small', u'cut in  cubes', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'lb'}, {u'originalString': u'18 oz. fresh fettucine, cooked, drained and piping hot', u'aisle': u'Pasta and Rice', u'name': u'fettucine', u'metaInformation': [u'fresh', u'hot', u'cooked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.0, u'consistency': u'solid', u'id': 10020409, u'unit': u'oz'}, {u'originalString': u'3 1/4 cups grated Parmesan Cheese (Roughly 1/2 lb.)', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'(Roughly 1/2 lb.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cups'}, {u'originalString': u'Aproximately 3/4 cup pasta water', u'aisle': u'Beverages', u'name': u'pasta water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://cbsop.com/recipes/fettuccine-alfredo-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 44, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Bring 6 quarts salted water to a rolling boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add pasta and cook until it is just al dente. (for fresh pasta this takes approximately 2 minutes. For dried pasta it will take approximately 8 minutes.)', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain pasta, reserving about a cup of the pasta water.Bring 3/4 cup pasta water and butter to a boil in a large skillet.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add pasta and sprinkle with cheese. Toss until a rich creamy sauce is formed, adding more water as necessary. (about 2 minutes)', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Fettuccine Alfredo on the menu? Try pairing with Pinot Grigio and Unoaked Chardonnay. Creamy, cheesy, buttery alfredo dishes can pair beautifully with an unoaked chardonnay or a pinot grigio. One wine you could try is Casa Catelli Pinot Grigio. It has 4.2 out of 5 stars and a bottle costs about 8 dollars.', u'pairedWines': [u'pinot grigio', u'unoaked chardonnay'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 11125, u'instructions': u'Bring 6 quarts salted water to a rolling boil. Add pasta and cook until it is just al dente. (for fresh pasta this takes approximately 2 minutes. For dried pasta it will take approximately 8 minutes.)Drain pasta, reserving about a cup of the pasta water.Bring 3/4 cup pasta water and butter to a boil in a large skillet. Add pasta and sprinkle with cheese. Toss until a rich creamy sauce is formed, adding more water as necessary. (about 2 minutes)', u'spoonacularSourceUrl': u'https://spoonacular.com/the-ultimate-fettuccine-alfredo-496476', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}