{u'recipes': [{u'sourceName': u'Boulder Locavore', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522182-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 522182, u'veryPopular': True, u'lowFodmap': False, u'title': u'Blood Orange Ginger Margarita {fresh-style}', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 251.01, u'creditText': u'Boulder Locavore', u'extendedIngredients': [{u'originalString': u'1 ounce Light Agave Nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'ounce'}, {u'originalString': u'Juice of 2 Blood Oranges (aproximately 2 ounces)', u'aisle': u'Beverages', u'name': u'blood orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blood-orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1009206, u'unit': u''}, {u'originalString': u'1/2 teaspoon fresh Ginger Root; sliced or diced', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'fresh', u'diced', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 ounces freshly squeezed Lime Juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'ounces'}, {u'originalString': u'3 ounces Silver Tequila (preferably organic)', u'aisle': u'Alcoholic Beverages', u'name': u'tequila', u'metaInformation': [u'organic', u'(preferably )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 10814037, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://boulderlocavore.com/2014/02/blood-orange-ginger-margarita-fresh-style.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'In a glass or jar, combine the blood orange juice and ginger.  Muddle the ginger.  Allow the mixture to sit for 20 minutes.  Taste and if the flavor is desirable, strain retaining the liquid (or allow to sit longer before straining).  NOTE:  chilled liquids will not taste as strongly as room temperature liquids.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blood-orange-juice.jpg', u'id': 1009206, u'name': u'blood orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Combine the blood orange-ginger juice, tequila, lime juice and agave in a shaker with ice.  Shake and strain into 2 Old Fashioned glasses full of fresh ice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'id': 10814037, u'name': u'tequila'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1230, u'instructions': u'In a glass or jar, combine the blood orange juice and ginger.  Muddle the ginger.  Allow the mixture to sit for 20 minutes.  Taste and if the flavor is desirable, strain retaining the liquid (or allow to sit longer before straining).  NOTE:  chilled liquids will not taste as strongly as room temperature liquids.Combine the blood orange-ginger juice, tequila, lime juice and agave in a shaker with ice.  Shake and strain into 2 Old Fashioned glasses full of fresh ice.', u'spoonacularSourceUrl': u'https://spoonacular.com/blood-orange-ginger-margarita-fresh-style-522182', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}