{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520024-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 520024, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Baked Double Cheese and Onion Dip (gluten-free)', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 78.11, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon cayenne pepper, optional and to taste', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'6 to 8 ounces grated cheese, divided (I used 7-ounces Blarney Castle Gouda, use your favorite cheese)', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'divided', u'grated', u'your favorite', u'(I used 7-ounces Blarney Castle Gouda, use cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tablespoon'}, {u'originalString': u"8 ounces cream cheese, softened (light is okay, I used TJ's Soft Spreadable Light)", u'aisle': u'Cheese', u'name': u'light cream cheese', u'metaInformation': [u'light', u'soft', u'softened', u"( is okay, I used TJ's Spreadable )"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounces'}, {u'originalString': u'1 cup mayonnaise (light is okay, I used Best Foods Light Mayo)', u'aisle': u'Condiments', u'name': u'light mayonnaise', u'metaInformation': [u'light', u'( is okay, I used Best Foods Mayo)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4641, u'unit': u'cup'}, {u'originalString': u'1 medium/large sweet Vidalia onion, peeled and diced (about 1 heaping cup)', u'aisle': u'Produce', u'name': u'vidalia onion', u'metaInformation': [u'diced', u'sweet', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.averiecooks.com/2013/11/creamy-baked-double-cheese-and-sweet-onion-dip.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350F. Spray a 9-inch pie dish (or 1o-inch, or similar-sized oven-safe baking dish) with cooking spray; set aside. In a large bowl, add all ingredients (except reserve about 1/2 cup cheese to be sprinkled on top) and stir to combine. Turn mixture out into prepared dish, smoothing the top lightly with a spatula. Evenly sprinkle reserved 1/2 cup cheese over the top.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u"Bake for about 45 to 50 minutes, or until top is golden browned, bubbly, and dip is done to your liking (I baked for 47 minutes). Allow dip to cool momentarily before serving. Dip is best warm and fresh, but extra will keep airtight in the refrigerator for up to 5 days. Gently re-heat in micro before serving leftover portion. Read product labels to ensure all products are gluten-free if that's a consideration for you.", u'length': {u'number': 92, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Onion Dip works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 49357, u'instructions': u"Preheat oven to 350F. Spray a 9-inch pie dish (or 1o-inch, or similar-sized oven-safe baking dish) with cooking spray; set aside. In a large bowl, add all ingredients (except reserve about 1/2 cup cheese to be sprinkled on top) and stir to combine. Turn mixture out into prepared dish, smoothing the top lightly with a spatula. Evenly sprinkle reserved 1/2 cup cheese over the top. Bake for about 45 to 50 minutes, or until top is golden browned, bubbly, and dip is done to your liking (I baked for 47 minutes). Allow dip to cool momentarily before serving. Dip is best warm and fresh, but extra will keep airtight in the refrigerator for up to 5 days. Gently re-heat in micro before serving leftover portion. Read product labels to ensure all products are gluten-free if that's a consideration for you.", u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-baked-double-cheese-and-onion-dip-gluten-free-520024', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}