{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/753673-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 230, u'id': 753673, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roman Pizza Bianca', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 533.42, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 1/4 teaspoons active dry yeast (one 1/4-ounce envelope)', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry', u'(one 1/4-ounce envelope)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'4 ounces baby arugula', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11959, u'unit': u'ounces'}, {u'originalString': u'2 cups fresh ricotta cheese', u'aisle': u'Cheese', u'name': u'fresh ricotta cheese', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1036, u'unit': u'cups'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/4 cup olive oil, plus more for the bowl', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'plus more for the bowl'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 cup grated Parmigiano-Reggiano', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 teaspoons fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoons'}, {u'originalString': u'1 pound taleggio cheese, rind removed and cut into thin slices', u'aisle': u'Cheese', u'name': u'taleggio cheese', u'metaInformation': [u'cut into thin slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/taleggio-cheese.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93792, u'unit': u'pound'}, {u'originalString': u'White truffle oil, for garnish', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'truffle oil', u'metaInformation': [u'white', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/truffle-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 1024053, u'unit': u'servings'}, {u'originalString': u'5 to 5 1/2 cups unbleached all-purpose flour, plus more for dusting, preferably organic', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'for dusting', u'organic', u'all-purpose', u'plus more , preferably '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 10020081, u'unit': u'cups'}, {u'originalString': u'2 cups warm water (105 degrees F to 115 degrees F)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(105 degrees F to 115 degrees F)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 14.0, u'imageType': u'jpeg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/bobby-flay/roman-pizza-bianca-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-scraper.jpg', u'id': 404649, u'name': u'dough scraper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Dissolve the yeast in warm water in a large bowl and let stand for 5 minutes. Stir in 3 cups flour and the salt, stirring until smooth. Stir in an additional 2 cups flour; continue adding flour 1 tablespoon at a time (up to 1/2 cup), stirring until the dough comes away from the bowl but is still sticky. Turn the dough out onto a lightly floured work surface and knead with lightly floured hands. Start by slapping the dough onto the counter, pulling it toward you with one hand and pushing it away from you with the other. Fold the dough back over itself (use a bench scraper or a wide knife to help scrape the dough from the surface). Repeat until it's easier to handle, about 10 times. Finish kneading normally until the dough is smooth, elastic and soft, but a little tacky, about 10 minutes. Shape the dough into a ball and transfer to a lightly oiled bowl; turn to coat. Cover with plastic and let rise in a warm place until it doubles in volume, about 3 hours. Press it with your finger to see if it's done; an indent should remain.", u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Prepare the charcoal in a chimney starter (allowing the charcoal to burn until all the charcoal is covered with a thin layer of gray ash) and add to the grill, creating a two-level fire by spreading the coals out over half the grill bottom, piling them up in a mound 3 briquettes high, leaving the other half with no coals.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Gently remove the dough from the bowl and divide in 4 pieces. Shape the pieces into rounds and let them rest on a sheet pan, covered with a clean side towel, for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Stretch and shape each piece of dough into a large rectangle or circle on a flat surface.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the tops of each with the some olive oil and season with salt and pepper.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place on the grill directly over the coals, oiled-side down, and grill until lightly golden brown, about 1 minute. Flip over and grill for 1 minute longer.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove from the grill and arrange the taleggio over the top. Then dollop on some ricotta and sprinkle with Parmigiano-Reggiano. Return to the grill on the opposite side (for indirect grilling). Cover and grill until the cheese is melted and bubbly. Top each pizza with the arugula and drizzle with truffle oil.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/truffle-oil.jpg', u'id': 1024053, u'name': u'truffle oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}], u'name': u''}], u'aggregateLikes': 231, u'instructions': u"Watch how to make this recipe.                    Dissolve the yeast in warm water in a large bowl and let stand for 5 minutes. Stir in 3 cups flour and the salt, stirring until smooth. Stir in an additional 2 cups flour; continue adding flour 1 tablespoon at a time (up to 1/2 cup), stirring until the dough comes away from the bowl but is still sticky. Turn the dough out onto a lightly floured work surface and knead with lightly floured hands. Start by slapping the dough onto the counter, pulling it toward you with one hand and pushing it away from you with the other. Fold the dough back over itself (use a bench scraper or a wide knife to help scrape the dough from the surface). Repeat until it's easier to handle, about 10 times. Finish kneading normally until the dough is smooth, elastic and soft, but a little tacky, about 10 minutes. Shape the dough into a ball and transfer to a lightly oiled bowl; turn to coat. Cover with plastic and let rise in a warm place until it doubles in volume, about 3 hours. Press it with your finger to see if it's done; an indent should remain.                          Prepare the charcoal in a chimney starter (allowing the charcoal to burn until all the charcoal is covered with a thin layer of gray ash) and add to the grill, creating a two-level fire by spreading the coals out over half the grill bottom, piling them up in a mound 3 briquettes high, leaving the other half with no coals.                          Gently remove the dough from the bowl and divide in 4 pieces. Shape the pieces into rounds and let them rest on a sheet pan, covered with a clean side towel, for 30 minutes.                          Stretch and shape each piece of dough into a large rectangle or circle on a flat surface. Brush the tops of each with the some olive oil and season with salt and pepper. Place on the grill directly over the coals, oiled-side down, and grill until lightly golden brown, about 1 minute. Flip over and grill for 1 minute longer. Remove from the grill and arrange the taleggio over the top. Then dollop on some ricotta and sprinkle with Parmigiano-Reggiano. Return to the grill on the opposite side (for indirect grilling). Cover and grill until the cheese is melted and bubbly. Top each pizza with the arugula and drizzle with truffle oil.", u'spoonacularSourceUrl': u'https://spoonacular.com/roman-pizza-bianca-753673', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 260, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}