{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/735544-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 735544, u'veryPopular': False, u'lowFodmap': False, u'title': u'Basic Potpie', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 284.69, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 1/2 cups chicken or beef stock*', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6170, u'unit': u'cups'}, {u'originalString': u'1 large carrot, sliced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'3 cups diced cooked chicken or meat', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'cups'}, {u'originalString': u'1 tablespoon cornstarch mixed with 4 tablespoons liquid, such as dry Sherry, Sercial Madeira, or water', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [u'mixed', u'dry', u' such as  sherry, sercial madeira, or water', u'with 4 tablespoons liquid,'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'*can substitute 1/2 cup cream and 2 cups stock, if desired', u'aisle': u'Canned and Jarred', u'name': u'stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon dried rosemary, crumbled', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon dried thyme, crumbled', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'Egg wash (1 large egg beaten with 1 teaspoon water and a pinch of salt)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'with 1 teaspoon water and a pinch of salt)', u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 tablespoons minced fresh parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 cup frozen corn, thawed and drained', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen', u'thawed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'2 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'2 cups sliced mushrooms, cultivated or wild', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'wild', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 cup minced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 cup frozen peas, thawed and drained', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen', u'thawed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'1 pound frozen puff pastry, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'pound'}, {u'originalString': u'Salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 21.0, u'imageType': u'jpeg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/basic-potpie-recipe-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil and butter in a large skillet, set over moderate heat until hot.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion, carrot, garlic, salt, and pepper and cook the mixture, stirring occasionally, for 3 minutes, or until softened.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the mushrooms and cook, stirring occasionally, for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add the wine and reduce 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the broth, thyme, and rosemary, and simmer, covered, 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Meanwhile combine cornstarch/arrowroot with the liquid.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [], u'step': u'Add to simmering mixture and stir until thickened. Off the heat, fold in the meat/chicken, peas, corn, and parsley. Correct seasoning, adding more salt and pepper, to taste.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Let cool. Filling can be made one day ahead, covered and chilled. Divide the mixture between 5 (1 1/2-cup) individual baking dishes.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'On a lightly floured surface roll out the puff pastry 1/4-inch thick and cut it into 6-inch rounds. Lightly brush the tops of the rounds with some of the egg wash, being careful to not brush the edges or the pastry will not puff. Invert the rounds onto the baking dishes, pressing edges onto rims to secure.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Brush tops of pastry with additional egg wash.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Cut 3 small steam vents in the tops of the pastries.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Arrange baking dishes on a baking sheet and bake for 20 to 25 minutes, or until pastry is puffed and golden and filling is bubbling.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with mixed baby greens salad with red and yellow pear tomatoes.', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 165, u'instructions': u'Heat the oil and butter in a large skillet, set over moderate heat until hot. Add the onion, carrot, garlic, salt, and pepper and cook the mixture, stirring occasionally, for 3 minutes, or until softened. Add the mushrooms and cook, stirring occasionally, for 5 minutes. Add the wine and reduce 1 minute. Add the broth, thyme, and rosemary, and simmer, covered, 10 minutes.                          Meanwhile combine cornstarch/arrowroot with the liquid. Add to simmering mixture and stir until thickened. Off the heat, fold in the meat/chicken, peas, corn, and parsley. Correct seasoning, adding more salt and pepper, to taste. Let cool. Filling can be made one day ahead, covered and chilled. Divide the mixture between 5 (1 1/2-cup) individual baking dishes.                          Preheat the oven to 375 degrees F.                          On a lightly floured surface roll out the puff pastry 1/4-inch thick and cut it into 6-inch rounds. Lightly brush the tops of the rounds with some of the egg wash, being careful to not brush the edges or the pastry will not puff. Invert the rounds onto the baking dishes, pressing edges onto rims to secure. Brush tops of pastry with additional egg wash. Cut 3 small steam vents in the tops of the pastries.                          Arrange baking dishes on a baking sheet and bake for 20 to 25 minutes, or until pastry is puffed and golden and filling is bubbling.                          Serve with mixed baby greens salad with red and yellow pear tomatoes.', u'spoonacularSourceUrl': u'https://spoonacular.com/basic-potpie-735544', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}