{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/225285-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 225285, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted poussin with oregano, orange & sherry', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'pricePerServing': 42.28, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 tbsp medium or dry sherry', u'aisle': u'Alcoholic Beverages', u'name': u'dry sherry', u'metaInformation': [u'dry', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 10114106, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 oranges', u'aisle': u'Produce', u'name': u'oranges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'2 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1957/roasted-poussin-with-oregano-orange-and-sherry', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 190.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 190C/fan 170C/gas 5.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Put the poussin in a roasting tin, drizzle with the oil, sprinkle over the oregano and season with some salt and pepper. Roast for 15 mins, then add the zest from one of the oranges, then squeeze the juice from both. Sprinkle over the birds with the sherry. Return to the oven and roast for a further 20-25 mins.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-sherry.jpg', u'id': 10214106, u'name': u'sherry'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 33, u'instructions': u'Heat oven to 190C/fan 170C/gas 5. Put the poussin in a roasting tin, drizzle with the oil, sprinkle over the oregano and season with some salt and pepper. Roast for 15 mins, then add the zest from one of the oranges, then squeeze the juice from both. Sprinkle over the birds with the sherry. Return to the oven and roast for a further 20-25 mins.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-poussin-with-oregano-orange-sherry-225285', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}