{u'recipes': [{u'sourceName': u'The Baker Chick', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/571027-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 571027, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blueberry Crisp for Two', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 108.0, u'creditText': u'The Baker Chick', u'extendedIngredients': [{u'originalString': u'1/4 cup AP flour', u'aisle': u'Baking', u'name': u'AP flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 1/4 cup fresh blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'1/4 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3 T cold butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'T'}, {u'originalString': u'1/4 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'2 tsp cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tsp'}, {u'originalString': u'1/4 cup rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'1 tsp white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.the-baker-chick.com/2013/08/blueberry-crisp-for-two/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 F. In a small bowl toss together the blueberries with the cornstarch and the sugar until well-coated. Fill into two small ramekins and set aside on a rimmed, foil-lined baking sheet. In another small bowl combine the flour, oats, brown sugar, and cinnamon.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [], u'step': u'Cut in the butter and use your hands to work it all together, working the butter into the dry ingredients until the mixture is crumbly. Sprinkle the crumble mixture over the berries and bake for 25-30 minutes, or until the berries are bubbly and the topping is golden.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Crisp. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 95, u'instructions': u'Preheat oven to 350 F. In a small bowl toss together the blueberries with the cornstarch and the sugar until well-coated. Fill into two small ramekins and set aside on a rimmed, foil-lined baking sheet. In another small bowl combine the flour, oats, brown sugar, and cinnamon. Cut in the butter and use your hands to work it all together, working the butter into the dry ingredients until the mixture is crumbly. Sprinkle the crumble mixture over the berries and bake for 25-30 minutes, or until the berries are bubbly and the topping is golden.', u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-crisp-for-two-571027', u'dishTypes': [u'dessert'], u'occasions': [u"valentine's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}