{u'recipes': [{u'sourceName': u'Handle the Heat', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/559977-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 559977, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mexican Brownies with Brown Sugar Glaze', u'diets': [], u'pricePerServing': 40.84, u'creditText': u'Handle the Heat', u'extendedIngredients': [{u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tablespoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'1 cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup milk chocolate chips (about 6 ounces)', u'aisle': u'Baking', u'name': u'milk chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 stick (4 ounces) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}, {u'originalString': u'4 ounces unsweetened chocolate, finely chopped', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.handletheheat.com/2012/05/mexican-brownies-with-brown-sugar-glaze.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the brownies:Preheat oven to 325\xb0F. Line an 8-inch square baking pan with foil, extending foil over the sides. Spray foil with nonstick cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat the chocolate and butter in a large microwave-safe bowl on high for for 45 seconds, then stir and heat for 20 seconds more. Stir again, and, if necessary, repeat in 15-second increments until mixture is completely smooth but not overheated. Cool for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add brown sugar, cinnamon, and salt to chocolate mixture and stir with a rubber spatula to combine. Stir in eggs, one at a time, then add vanilla.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add flour and stir until incorporated. Fold in chocolate chips.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour batter into prepared baking pan and smooth the surface.', u'number': 5, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk sugar, cream, butter, and vanilla in a small saucepan set over low heat until mixture is smooth and begins to boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Remove from heat and let cool for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk mixture again until thick and smooth.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over brownies, spreading into a thin even layer.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let brownies stand at room temperature until glaze sets, about 1 hour. Brownies can be stored covered in the refrigerator for 1 day.To serve, use the foil to remove brownie from pan.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into 16 squares and serve cold or at room temperature.', u'number': 6, u'ingredients': []}], u'name': u'Bake until a toothpick or cake tester inserted into the center comes out with a few moist crumbs attached, about 30 minutes. Cool brownies completely in pan on a wire rack.For the brown sugar glaze'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 339, u'instructions': u'For the brownies:Preheat oven to 325\xb0F. Line an 8-inch square baking pan with foil, extending foil over the sides. Spray foil with nonstick cooking spray.Heat the chocolate and butter in a large microwave-safe bowl on high for for 45 seconds, then stir and heat for 20 seconds more. Stir again, and, if necessary, repeat in 15-second increments until mixture is completely smooth but not overheated. Cool for 5 minutes.Add brown sugar, cinnamon, and salt to chocolate mixture and stir with a rubber spatula to combine. Stir in eggs, one at a time, then add vanilla. Add flour and stir until incorporated. Fold in chocolate chips.Pour batter into prepared baking pan and smooth the surface. Bake until a toothpick or cake tester inserted into the center comes out with a few moist crumbs attached, about 30 minutes. Cool brownies completely in pan on a wire rack.For the brown sugar glaze:Whisk sugar, cream, butter, and vanilla in a small saucepan set over low heat until mixture is smooth and begins to boil. Remove from heat and let cool for 10 minutes. Whisk mixture again until thick and smooth. Pour over brownies, spreading into a thin even layer. Let brownies stand at room temperature until glaze sets, about 1 hour. Brownies can be stored covered in the refrigerator for 1 day.To serve, use the foil to remove brownie from pan. Cut into 16 squares and serve cold or at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-brownies-with-brown-sugar-glaze-559977', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}