{u'recipes': [{u'sourceName': u'Pies and Plots', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/689806-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 689806, u'veryPopular': False, u'lowFodmap': False, u'title': u'Marshmallow Popcorn Balls #SundaySupper', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 17.76, u'creditText': u'Pies and Plots', u'extendedIngredients': [{u'originalString': u'10 ounces candy corn marshmallows', u'aisle': u'Sweet Snacks', u'name': u'candy corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-corn.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 93637, u'unit': u'ounces'}, {u'originalString': u'2/3 cup popcorn kernels', u'aisle': u'Savory Snacks', u'name': u'popcorn kernels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn-kernels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 25002, u'unit': u'cup'}, {u'originalString': u'4 tablespoons unsalted butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://piesandplots.net/marshmallow-popcorn-balls-sundaysupper/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Line a baking sheet with parchment.Pop the popcorn kernels.  You may use any method.  I always put the kernels in a paper bag, fold the top down a few times and microwave until the popping begins to subside.  It usually takes 1:30-2 minutes.  Allow the popcorn to cool slightly and sift through to remove any unpopped kernels.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn-kernels.jpg', u'id': 25002, u'name': u'popcorn kernels'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the marshmallows and butter in a large microwave safe bowl.  Melt in the microwave in 30 second increments, stirring in between, until fully melted.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the popcorn and stir until fully coated.Oil or butter your hands.  Grab some of the popcorn mixture and mold into a ball.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place on the parchment and repeat with the remaining popcorn.  Store at room temperature in an airtight container for up to 3 days.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 6, u'instructions': u'Line a baking sheet with parchment.Pop the popcorn kernels.  You may use any method.  I always put the kernels in a paper bag, fold the top down a few times and microwave until the popping begins to subside.  It usually takes 1:30-2 minutes.  Allow the popcorn to cool slightly and sift through to remove any unpopped kernels.Place the marshmallows and butter in a large microwave safe bowl.  Melt in the microwave in 30 second increments, stirring in between, until fully melted.  Add the popcorn and stir until fully coated.Oil or butter your hands.  Grab some of the popcorn mixture and mold into a ball.  Place on the parchment and repeat with the remaining popcorn.  Store at room temperature in an airtight container for up to 3 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/marshmallow-popcorn-balls-sundaysupper-689806', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}