{u'recipes': [{u'sourceName': u'Sallys Baking Addiction', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573194-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': -25, u'id': 573194, u'veryPopular': True, u'lowFodmap': False, u'title': u'Caramel Molasses Cookies', u'diets': [], u'preparationMinutes': 85, u'pricePerServing': 94.96, u'creditText': u'Sallys Baking Addiction', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'Easy Caramel Sauce', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 19364, u'unit': u'servings'}, {u'originalString': u"14 Werther's Original\xae Baking Caramels, unwrapped", u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramels', u'metaInformation': [u'original\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 14.0, u'consistency': u'solid', u'id': 19074, u'unit': u''}, {u'originalString': u'Molasses Cookies', u'aisle': u'Sweet Snacks', u'name': u'cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'liquid', u'id': 10118192, u'unit': u'servings'}, {u'originalString': u'3/4 cup (150g) dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'g'}, {u'originalString': u'1/3 cup (104g) dark molasses', u'aisle': u'Baking', u'name': u'dark molasses', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 104.0, u'consistency': u'solid', u'id': 19304, u'unit': u'g'}, {u'originalString': u'1 egg, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups (375g) all-purpose flour (careful not to overmeasure)', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'(careful not to overmeasure)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 375.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1 Tablespoon heavy cream, half-and-half, or full fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'full fat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tablespoon'}, {u'originalString': u'1 1/4 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoons'}, {u'originalString': u'1/4 teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup (170g) unsalted butter, softened to room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 170.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://sallysbakingaddiction.com/2013/11/26/caramel-molasses-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Make the cookies: In a large bowl, mix the flour, baking soda, ginger, cinnamon, cloves, nutmeg, and salt. Set aside. In the bowl of a stand or handheld mixer, cream the softened butter for about 1 minute on medium speed.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the brown sugar and beat until light and fluffy, about 2 full minutes. Scrape down the sides as needed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [], u'step': u'Add the molasses, egg, and vanilla. Beat well on high, scraping down the sides as needed again.Slowly add the dry ingredients to the wet on low speed. Do not overmix. Cover dough tightly and chill for 1 hour.Make the caramel as the dough chills:\xa0', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the caramels and cream to a small saucepan over low-medium heat. Constantly stir, allowing the caramels to fully melt. Once melted, turn off the stove and let the caramel sit in the pan until ready to use. You could also use a microwave to melt the caramels and cream together, but you would have to stop and stir every minute or so. I find the stove melts the caramels more evenly and it is much easier. Set aside to cool until the cookies are done.Preheat oven to 350F. Line a large baking sheet with parchment paper or a silicone mat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel candy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the granulated sugar into a bowl. Take 2 Tablespoons of dough and roll into a ball, then roll into the sugar.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for precisely 8-9 minutes.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Remove from the oven and gently press the top of the cookie down with the back of a utensil or even use your fingers. You're trying to obtain a crinkly top.", u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Place back into the oven for 1 more minute. Cookies will be puffy and still appear very soft in the middle. That's ok.\xa0", u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and allow to cool on the baking sheet for ten minutes. \xa0', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Transfer to a wire rack to cool completely before drizzling with caramel sauce.Store cookies in an airtight container at room temperature for 3 days or in the refrigerator for 5 days. Molasses cookies without caramel may be frozen up to 3 months.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [], u'step': u'Rolled cookie dough may be frozen up to three months. Allow to thaw in the refrigerator overnight and bake as directed.', u'number': 11, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 4078, u'instructions': u"Make the cookies: In a large bowl, mix the flour, baking soda, ginger, cinnamon, cloves, nutmeg, and salt. Set aside. In the bowl of a stand or handheld mixer, cream the softened butter for about 1 minute on medium speed. Add the brown sugar and beat until light and fluffy, about 2 full minutes. Scrape down the sides as needed. Add the molasses, egg, and vanilla. Beat well on high, scraping down the sides as needed again.Slowly add the dry ingredients to the wet on low speed. Do not overmix. Cover dough tightly and chill for 1 hour.Make the caramel as the dough chills:\xa0Add the caramels and cream to a small saucepan over low-medium heat. Constantly stir, allowing the caramels to fully melt. Once melted, turn off the stove and let the caramel sit in the pan until ready to use. You could also use a microwave to melt the caramels and cream together, but you would have to stop and stir every minute or so. I find the stove melts the caramels more evenly and it is much easier. Set aside to cool until the cookies are done.Preheat oven to 350F. Line a large baking sheet with parchment paper or a silicone mat. Pour the granulated sugar into a bowl. Take 2 Tablespoons of dough and roll into a ball, then roll into the sugar. Bake for precisely 8-9 minutes. Remove from the oven and gently press the top of the cookie down with the back of a utensil or even use your fingers. You're trying to obtain a crinkly top. Place back into the oven for 1 more minute. Cookies will be puffy and still appear very soft in the middle. That's ok.\xa0Remove from the oven and allow to cool on the baking sheet for ten minutes. \xa0Transfer to a wire rack to cool completely before drizzling with caramel sauce.Store cookies in an airtight container at room temperature for 3 days or in the refrigerator for 5 days. Molasses cookies without caramel may be frozen up to 3 months. Rolled cookie dough may be frozen up to three months. Allow to thaw in the refrigerator overnight and bake as directed.", u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-molasses-cookies-573194', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}