{u'recipes': [{u'sourceName': u'Handle the Heat', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/559957-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 559957, u'veryPopular': True, u'lowFodmap': False, u'title': u'Nutella Brownies', u'diets': [], u'pricePerServing': 61.39, u'creditText': u'Handle the Heat', u'extendedIngredients': [{u'originalString': u'3/4 cup cake (soft-wheat) flour, sifted', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [u'sifted', u'(soft-wheat)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10020129, u'unit': u'cup'}, {u'originalString': u'2 large eggs, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 cup unsalted butter, cut into 4 pieces, plus extra for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'for greasing', u'cut into 4 pieces, plus extra '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'3 oz unsweetened chocolate, finely chopped', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'oz'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup bittersweet chocolate chips, semisweet chocolate chips, peanut butter chips, or white chocolate chips (optional)', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 10019087, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.handletheheat.com/2009/07/nutella-brownies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees. Lightly grease an 8-inch square baking dish, preferably glass.In a saucepan over low heat, combine the butter and chopped unsweetened chocolate.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 19078, u'name': u'unsweetened baking chocolate'}]}, {u'equipment': [], u'step': u'Heat, stirring often, until melted, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heat and stir in the sugar and salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the eggs and vanilla and stir until well blended. Sprinkle the sifted flour over the mixture and stir until just blended. Stir in the chips, if using.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour the batter into the prepared dish and spread evenly.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake the brownies until a toothpick inserted into the center comes out almost completely clean, about 30 minutes, or longer if using a metal pan. While the brownies are baking, fill a pastry bag or a freezer strength zip-lock bag with a hole cut in the bottom corner with nutella. When the brownies are done, use the back of a wooden spoon to poke 9 evenly spaced holes and use the pastry bag to squeeze out nutella into the holes. After each hole is filled, sprinkle the brownies with chocolate chips and put the baking dish back into the oven to let the chips melt.After a few minutes, take brownies out of oven and using a spatula, spread the chocolate chips so they become a smooth icing. Sprinkle chopped hazelnuts on top of brownies, if desired.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Transfer to a wire rack to cool until the chocolate icing is still tender, like a ganache, before cutting into 2 1/2 inch squares.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 525, u'instructions': u'Preheat the oven to 350 degrees. Lightly grease an 8-inch square baking dish, preferably glass.In a saucepan over low heat, combine the butter and chopped unsweetened chocolate. Heat, stirring often, until melted, about 4 minutes. Remove from the heat and stir in the sugar and salt. Add the eggs and vanilla and stir until well blended. Sprinkle the sifted flour over the mixture and stir until just blended. Stir in the chips, if using.Pour the batter into the prepared dish and spread evenly. Bake the brownies until a toothpick inserted into the center comes out almost completely clean, about 30 minutes, or longer if using a metal pan. While the brownies are baking, fill a pastry bag or a freezer strength zip-lock bag with a hole cut in the bottom corner with nutella. When the brownies are done, use the back of a wooden spoon to poke 9 evenly spaced holes and use the pastry bag to squeeze out nutella into the holes. After each hole is filled, sprinkle the brownies with chocolate chips and put the baking dish back into the oven to let the chips melt.After a few minutes, take brownies out of oven and using a spatula, spread the chocolate chips so they become a smooth icing. Sprinkle chopped hazelnuts on top of brownies, if desired.Transfer to a wire rack to cool until the chocolate icing is still tender, like a ganache, before cutting into 2 1/2 inch squares.', u'spoonacularSourceUrl': u'https://spoonacular.com/nutella-brownies-559957', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}