{u'recipes': [{u'sourceName': u'Simple Plate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/546626-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 546626, u'veryPopular': False, u'lowFodmap': True, u'title': u'Lime Granita {lim\xf2n granita}', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 93.08, u'creditText': u'Simple Plate', u'extendedIngredients': [{u'originalString': u'1 extra lime cut into cocktail wheels.', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'cut into cocktail wheels.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1\xbd cups fresh lime juice ( 12-14 limes)', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh', u'( 12-14 limes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'cups'}, {u'originalString': u'1 teaspoon grated lime zest ( 1 lime)', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [u'grated', u'( 1 lime)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'teaspoon'}, {u'originalString': u'mint sprigs for garnish', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'sprig', u'unitShort': u'sprigs', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'sprigs'}, {u'originalString': u'\xbe cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'png', u'spoonacularScore': 24.0, u'sourceUrl': u'http://simpleplate.net/lime-granita/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, combine sugar with 3 cups water.Bring to a boil.Reduce heat and simmer for 5 minutes.Chill for 1 hour.Stir in lime juice and zest.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}], u'step': u'Pour mixture into a shallow metal cake pan and freeze, crushing and stirring the lumps with a fork every 30 minutes for 2 to 3 hours, or until it has a slushy, granular texture.Spoon into individual glasses.garnish with a mint sprig and lime wheel', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Granita can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'In a small saucepan, combine sugar with 3 cups water.Bring to a boil.Reduce heat and simmer for 5 minutes.Chill for 1 hour.Stir in lime juice and zest.Pour mixture into a shallow metal cake pan and freeze, crushing and stirring the lumps with a fork every 30 minutes for 2 to 3 hours, or until it has a slushy, granular texture.Spoon into individual glasses.garnish with a mint sprig and lime wheelServe immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/lime-granita-limn-granita-546626', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}