{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619448-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 619448, u'veryPopular': False, u'lowFodmap': False, u'title': u'Traditional Bread Stuffing', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 74.19, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'21 ounces plain dried bread cubes', u'aisle': u'Bakery/Bread', u'name': u'bread cubes', u'metaInformation': [u'dried', u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 18064, u'unit': u'ounces'}, {u'originalString': u'2 medium stalks celery, finely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'3\xbd cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'\xbd teaspoon dried marjoram', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried marjoram', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2023, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried sage', u'aisle': u'Spices and Seasonings', u'name': u'dried sage', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002038, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'2 eggs, beaten lightly', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup minced fresh parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 medium onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'6 tablespoons unsalted butter, plus extra for greasing baking dish', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'for greasing baking dish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.browneyedbaker.com/bread-stuffing-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F. Butter a 9x13-inch casserole dish; set aside.2. In a large skillet, melt the butter over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the celery and onion and saut until softened, stirring occasionally, about 8 to 10 minutes. Stir in the parsley, sage, thyme and marjoram, and cook until fragrant, about 1 additional minute.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'id': 2023, u'name': u'marjoram'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Transfer to a very large mixing bowl.3.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add the bread cubes, chicken stock, eggs, salt and pepper, and stir with a rubber spatula or wooden spoon to distribute the dry and wet ingredients evenly. Turn the mixture into the prepared casserole dish.4. Cover with foil and bake for 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'id': 18064, u'name': u'bread cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove the foil and continue to bake until golden brown, 25 to 30 additional minutes. Allow to sit for 10 minutes before serving.Make-Ahead: The stuffing can be assembled in the baking dish, then wrapped tightly in plastic wrap and refrigerated for up to 24 hours before baking. To bake, let the stuffing stand at room temperature for 30 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Remove the plastic wrap and proceed with step #4.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 272, u'instructions': u'1. Preheat oven to 400 degrees F. Butter a 9x13-inch casserole dish; set aside.2. In a large skillet, melt the butter over medium-high heat. Add the celery and onion and saut until softened, stirring occasionally, about 8 to 10 minutes. Stir in the parsley, sage, thyme and marjoram, and cook until fragrant, about 1 additional minute. Transfer to a very large mixing bowl.3. Add the bread cubes, chicken stock, eggs, salt and pepper, and stir with a rubber spatula or wooden spoon to distribute the dry and wet ingredients evenly. Turn the mixture into the prepared casserole dish.4. Cover with foil and bake for 25 minutes. Remove the foil and continue to bake until golden brown, 25 to 30 additional minutes. Allow to sit for 10 minutes before serving.Make-Ahead: The stuffing can be assembled in the baking dish, then wrapped tightly in plastic wrap and refrigerated for up to 24 hours before baking. To bake, let the stuffing stand at room temperature for 30 minutes. Remove the plastic wrap and proceed with step #4.', u'spoonacularSourceUrl': u'https://spoonacular.com/traditional-bread-stuffing-619448', u'dishTypes': [u'side dish'], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}