{u'recipes': [{u'sourceName': u'Slender Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611456-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 611456, u'veryPopular': False, u'lowFodmap': True, u'title': u'Turkey Sausage, Spinach, and Egg White Wrap', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 387.16, u'creditText': u'Slender Kitchen', u'extendedIngredients': [{u'originalString': u'3 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'serving'}, {u'originalString': u'2-3 cups fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'3 small turkey breakfast sausage links, chopped (I use Jennie refrigerated precooked ones)', u'aisle': u'Meat', u'name': u'turkey sausage', u'metaInformation': [u'refrigerated', u'small', u'chopped', u'(I use Jennie precooked ones)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 7955, u'unit': u''}, {u'originalString': u'1 low carb wrap (I use Flatout Light)', u'aisle': u'Bakery/Bread', u'name': u'wrap', u'metaInformation': [u'light', u'low carb', u'(I use Flatout )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10018364, u'unit': u''}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.slenderkitchen.com/turkey-sausage-spinach-and-egg-white-wrap/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Spray a mug with cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the spinach and sausage and cook until spinach is wilted. If using raw sausage, start with the sausage and cook until completely cooked. Then add spinach.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the egg whites to the pan. Scramble until cooked through.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [], u'step': u'Add the eggs to the center of the wrap and roll to close.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 243, u'instructions': u'Spray a mug with cooking spray. Add the spinach and sausage and cook until spinach is wilted. If using raw sausage, start with the sausage and cook until completely cooked. Then add spinach.Add the egg whites to the pan. Scramble until cooked through.Add the eggs to the center of the wrap and roll to close.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-sausage-spinach-and-egg-white-wrap-611456', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}