{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/223526-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 223526, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pea & tarragon risotto', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 208.65, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'25g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 small garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'small', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tbsp grated parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tbsp'}, {u'originalString': u'85g frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}, {u'originalString': u'140g risotto rice', u'aisle': u'Pasta and Rice', u'name': u'risotto rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 10020052, u'unit': u'g'}, {u'originalString': u'2 tbsp chopped tarragon (basil and parsley work well, too)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'tarragon', u'metaInformation': [u'chopped', u'well', u'(basil and parsley work , too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2041, u'unit': u'tbsp'}, {u'originalString': u'600ml hot vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 600.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/313612/pea-and-tarragon-risotto', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt the butter in a saucepan, then addthe onion and garlic. Cook for 4-5 minsuntil softened, then stir in the rice.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Pour in a ladleful of stock and simmeruntil all the liquid has been absorbed,stirring occasionally. Continue addingthe stock in this way, until it has all beenused up and the rice is tender. Stir in thepeas and tarragon, then heat through for2 mins. Check seasoning, then stir inthe Parmesan and serve straight away.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Risotto. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. One wine you could try is Ruffino Riserva Ducale Oro Chianti Classico. It has 4.3 out of 5 stars and a bottle costs about 35 dollars.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Ruby red with garnet hues. The wine expresses a distinctive Tuscan bouquet of violet, cherry, and plum, with aromas of chocolate and spice. Intense aromas of violet, blackberry, cherry, and ripe plum with intriguing notes of cinnamon and clove. Classic elegance and structure in which the fruit, tannins, and spices form a tightly woven balance, with a lingering fi nish of chocolate and coffee.Pairs exquisitely with traditional Italian dishes such as a classic bisteca Fiorentina, pasta Bolognese, wild boar ragu, and eggplant Parmesan. It’s also wonderful with dishes such as grilled ribeye and roasted vegetables.', u'title': u'Ruffino Riserva Ducale Oro Chianti Classico', u'price': u'$34.99', u'id': 442701, u'link': u'https://www.wine.com/product/ruffino-riserva-ducale-oro-chianti-classico-2011/166890', u'imageUrl': u'https://spoonacular.com/productImages/442701-312x231.jpg'}]}, u'aggregateLikes': 75, u'instructions': u'Melt the butter in a saucepan, then addthe onion and garlic. Cook for 4-5 minsuntil softened, then stir in the rice.Pour in a ladleful of stock and simmeruntil all the liquid has been absorbed,stirring occasionally. Continue addingthe stock in this way, until it has all beenused up and the rice is tender. Stir in thepeas and tarragon, then heat through for2 mins. Check seasoning, then stir inthe Parmesan and serve straight away.', u'spoonacularSourceUrl': u'https://spoonacular.com/pea-tarragon-risotto-223526', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}