{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/514303-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 13, u'id': 514303, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stovetop BBQ Chicken: Juicy Barbecue Chicken, No Grill Required', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 2, u'pricePerServing': 146.39, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'\xbd c. barbecue sauce', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'c'}, {u'originalString': u'dash of cayenne pepper, optional', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'dash'}, {u'originalString': u'1 tsp. chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbc tsp. onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'2 boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://wearychef.com/recipes/weary-chefs-stovetop-barbecue-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix olive oil, chili powder, onion powder, garlic powder, oregano, salt, and cayenne pepper in a medium bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add raw chicken and coat evenly.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat medium skillet (preferably iron) over medium-high heat and coat with cooking spray.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place chicken breasts in skillet, cover, and cook 5 minutes.Turn chicken, replace cover, and cook an additional 5 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Remove cover and check chicken for doneness with probe thermometer or testing if juices run clear. When cooked completely, pour half of BBQ sauce over chicken. Turn chicken over, and pour remaining sauce over the other side. Cook 2-3 minutes more while using a spoon or basting brush to coat chicken with sauce.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Zinfandel and Sparkling ros\xe9 are great choices for Barbecue Chicken. Fruity, low tannin zinfandel is great for any sticky, saucy barbecue chicken dish. If you're not feeling red wine, a sparkling ros\xe9 will work too. The McFadden Old Vine Zinfandel with a 5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'zinfandel', u'sparkling rose'], u'productMatches': [{u'description': u'Raspberry, cherry, strawberry and brambleberry aromas mingle with herbaceous black pepper spice and light amounts of vanilla and oak. This is a well-structured, medium-bodied, food-friendly wine that\'s well-balanced and exhibits great zin character without all of the heavy baggage most zins have these days."', u'title': u'McFadden Old Vine Zinfandel', u'price': u'$24.0', u'id': 469292, u'link': u'https://www.amazon.com/2012-McFadden-Zinfandel-Mendocino-County/dp/B00NP9U5OE', u'imageUrl': u'https://spoonacular.com/productImages/469292-312x231.jpg'}]}, u'aggregateLikes': 104, u'instructions': u'Mix olive oil, chili powder, onion powder, garlic powder, oregano, salt, and cayenne pepper in a medium bowl. Add raw chicken and coat evenly.Heat medium skillet (preferably iron) over medium-high heat and coat with cooking spray. Place chicken breasts in skillet, cover, and cook 5 minutes.Turn chicken, replace cover, and cook an additional 5 minutes.Remove cover and check chicken for doneness with probe thermometer or testing if juices run clear. When cooked completely, pour half of BBQ sauce over chicken. Turn chicken over, and pour remaining sauce over the other side. Cook 2-3 minutes more while using a spoon or basting brush to coat chicken with sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/stovetop-bbq-chicken-juicy-barbecue-chicken-no-grill-required-514303', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}