{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/755525-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 755525, u'veryPopular': False, u'lowFodmap': False, u'title': u'Venison Enchiladas', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 490.43, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'2 cups canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'cups'}, {u'originalString': u'4 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup reduced chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'5 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'3/4 cup chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 2009, u'unit': u'cup'}, {u'originalString': u'1 tablespoon ground chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'1 bunch cilantro, leaves chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'bunch'}, {u'originalString': u'1 tablespoon cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoon'}, {u'originalString': u'2 cups brewed coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 14209, u'unit': u'cups'}, {u'originalString': u'5 cups shredded colby-jack cheese', u'aisle': u'Cheese', u'name': u'colby jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 1011, u'unit': u'cups'}, {u'originalString': u'10 6-inch corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'6-inchs', u'unitShort': u'6-inch', u'amount': 10.0, u'consistency': u'solid', u'id': 18363, u'unit': u'6-inch'}, {u'originalString': u'12 corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'2 tablespoons chopped garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'6 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup orange juice concentrate', u'aisle': u'Frozen', u'name': u'orange juice concentrate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9214, u'unit': u'cup'}, {u'originalString': u'1 red bell pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'2 tablespoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoons'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 cup semisweet chocolate', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19903, u'unit': u'cup'}, {u'originalString': u'2 pounds cubed venison stew meat', u'aisle': u'Meat', u'name': u'stew meat', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10013411, u'unit': u'pounds'}, {u'originalString': u'1 medium yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 44.0, u'imageType': u'jpeg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/venison-enchiladas-recipe0.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 43, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a large heavy skillet until almost smoking. Carefully add venison meat, chopped onion and chopped garlic, season with salt and pepper and brown the meat, stirring occasionally.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add chili powder, brown sugar and cilantro. Deglaze this with the chicken stock.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [], u'step': u'Removed from heat and allow to cool. Stir in 3 cups of the shredded cheese.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Soften 12 corn tortillas in a microwave oven, wrapped in a damp cloth for 10 to 20 seconds on high, until soft and pliable. Spoon 2 to 3 tablespoons of venison mix into center of tortilla and roll.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'id': 18363, u'name': u'corn tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place rolled enchiladas into a lightly oiled baking dish, seam side down. Smother with enchilada sauce and sprinkle remaining colby-jack cheese, to taste. Cover and bake for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Flame-roast bell pepper until skin is blistered, place in a bowl and wrap with plastic. Allow to cool, then peel, seed, and chop. In a heavy bottom skillet, heat canola oil.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}]}, {u'equipment': [], u'step': u'Saute onion, bell pepper, and garlic until onions are lightly caramelized.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add tortillas torn into pieces.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Add chili powder, cumin, cocoa powder, pepper and salt to release oils in the spices, about 1 minute using care not to burn the spices.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add chicken stock, coffee and orange juice concentrate.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9214, u'name': u'orange juice concentrate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}]}, {u'equipment': [], u'step': u'Add chocolate, chopped into pieces. Bring to a boil and simmer for about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Remove liquid from the heat and allow to cool for at least 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Transfer liquid to a blender or food processor and fill it no more than halfway. If using a blender, release one corner of the lid. This prevents the vacuum effect that creates heat explosions.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place a towel over the top of the machine, pulse a few times then process on high speed until smooth. Adjust the consistency with additional chicken stock if necessary.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}], u'name': u'Remove from heat, carefully blend smooth in a processor or blender in batches (sauce should be smooth but still thick). When blending hot liquids'}], u'winePairing': {u'pairingText': u'Enchilada can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Parducci Small Lot Pinot Noir New Label Wine with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'strawberry , raspberry , cedar', u'title': u'Parducci Small Lot Pinot Noir New Label Wine', u'price': u'$18.0', u'id': 428202, u'link': u'https://www.amazon.com/Parducci-Small-Mendocino-County-Wine/dp/B01HQX6G8I', u'imageUrl': u'https://spoonacular.com/productImages/428202-312x231.jpg'}]}, u'aggregateLikes': 232, u'instructions': u'Heat oil in a large heavy skillet until almost smoking. Carefully add venison meat, chopped onion and chopped garlic, season with salt and pepper and brown the meat, stirring occasionally. Add chili powder, brown sugar and cilantro. Deglaze this with the chicken stock. Removed from heat and allow to cool. Stir in 3 cups of the shredded cheese.                          Preheat oven to 375 degrees F.                          Soften 12 corn tortillas in a microwave oven, wrapped in a damp cloth for 10 to 20 seconds on high, until soft and pliable. Spoon 2 to 3 tablespoons of venison mix into center of tortilla and roll. Place rolled enchiladas into a lightly oiled baking dish, seam side down. Smother with enchilada sauce and sprinkle remaining colby-jack cheese, to taste. Cover and bake for 20 minutes.                          Flame-roast bell pepper until skin is blistered, place in a bowl and wrap with plastic. Allow to cool, then peel, seed, and chop. In a heavy bottom skillet, heat canola oil. Saute onion, bell pepper, and garlic until onions are lightly caramelized. Add tortillas torn into pieces. Add chili powder, cumin, cocoa powder, pepper and salt to release oils in the spices, about 1 minute using care not to burn the spices.                          Add chicken stock, coffee and orange juice concentrate. Add chocolate, chopped into pieces. Bring to a boil and simmer for about 45 minutes. Remove from heat, carefully blend smooth in a processor or blender in batches (sauce should be smooth but still thick). When blending hot liquids: Remove liquid from the heat and allow to cool for at least 5 minutes. Transfer liquid to a blender or food processor and fill it no more than halfway. If using a blender, release one corner of the lid. This prevents the vacuum effect that creates heat explosions. Place a towel over the top of the machine, pulse a few times then process on high speed until smooth. Adjust the consistency with additional chicken stock if necessary.', u'spoonacularSourceUrl': u'https://spoonacular.com/venison-enchiladas-755525', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}