{u'recipes': [{u'sourceName': u'Gimme Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/686630-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 686630, u'veryPopular': False, u'lowFodmap': False, u'title': u'Soft & Fluffy Pumpkin Cinnamon Rolls', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 49.22, u'creditText': u'Gimme Delicious', u'extendedIngredients': [{u'originalString': u'1 package (2\xbc teaspoons) active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'\xbd teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'\xbe cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'4 oz butter (1 stick), at room temp', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'oz'}, {u'originalString': u'4 oz cream cheese (1/2 bar), at room temp', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'(1/2 bar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'4\xbd cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/3 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbe cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1\xbd cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 teaspoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'teaspoons'}, {u'originalString': u'2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1 cup pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pumpkin spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin spice mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup vegetable oil or butter (I used oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'(I used oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1 stick (1/2 cup) butter, melted or at room temp', u'aisle': u'?', u'name': u'at room temp', u'metaInformation': [u'melted'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://gimmedelicious.com/2015/10/29/the-best-fluffy-pumpkin-cinnamon-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine the milk, oil, and granulated sugar in a large pot or plastic mixing bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Heat on medium heat until warm (not boiling) or microwave for 1-2 minutes until the liquids are warm to the touch. Stir in the pumpkin puree and yeast. Next sprinkle in the flour,pumpkin spice, baking powder, baking soda, and salt with a wooden spoon. A sticky dough should form. rub the dough with olive oil and cover with plastic for 45 mins- 1 hour to rise. While the dough is rising, go ahead and prepare the filling.', u'length': {u'number': 47, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'id': 11424, u'name': u'canned pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Combine the sugars and pumpkin spice in a small bowl. set aside. Once the dough has risen, Preheat oven to 350 degrees F. Grease 2 9'' square or round pans or 1 13x9 pan with butter or oil, very well. Set Aside.Flour your counter very well (about  cup of flour).", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Place the dough onto the floured surface and roll or press into a large rectangle, about 18x24 inches. If the dough stick to surface, sprinkle it with flour.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Spread butter over the dough, sprinkle the cinnamon sugar filling on the butter.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon-sugar.jpg', u'id': 10219335, u'name': u'cinnamon sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Roll dough into a log, as tight as you can. Pinch the seams then cut dough into 2 inch slices then place into greased pans.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the pans on-top of the stove while the oven is pre-heating. This will help them rise more. After 15 minutes place the rolls in the oven and bake for 15-20 minutes or until golden and puffed.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and top with the cream cheese frosting right away. Enjoy!!', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 18, u'instructions': u"Combine the milk, oil, and granulated sugar in a large pot or plastic mixing bowl. Heat on medium heat until warm (not boiling) or microwave for 1-2 minutes until the liquids are warm to the touch. Stir in the pumpkin puree and yeast. Next sprinkle in the flour,pumpkin spice, baking powder, baking soda, and salt with a wooden spoon. A sticky dough should form. rub the dough with olive oil and cover with plastic for 45 mins- 1 hour to rise. While the dough is rising, go ahead and prepare the filling. Combine the sugars and pumpkin spice in a small bowl. set aside. Once the dough has risen, Preheat oven to 350 degrees F. Grease 2 9'' square or round pans or 1 13x9 pan with butter or oil, very well. Set Aside.Flour your counter very well (about  cup of flour). Place the dough onto the floured surface and roll or press into a large rectangle, about 18x24 inches. If the dough stick to surface, sprinkle it with flour. Spread butter over the dough, sprinkle the cinnamon sugar filling on the butter. Roll dough into a log, as tight as you can. Pinch the seams then cut dough into 2 inch slices then place into greased pans. Place the pans on-top of the stove while the oven is pre-heating. This will help them rise more. After 15 minutes place the rolls in the oven and bake for 15-20 minutes or until golden and puffed. Remove from oven and top with the cream cheese frosting right away. Enjoy!!", u'spoonacularSourceUrl': u'https://spoonacular.com/soft-fluffy-pumpkin-cinnamon-rolls-686630', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}