{u'recipes': [{u'sourceName': u'Dessert Now Dinner Later', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/618691-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 618691, u'veryPopular': True, u'lowFodmap': False, u'title': u'Apple and Herb Turkey Brine (With Step-by-Step Tutorial for Brining)', u'diets': [u'gluten free'], u'pricePerServing': 278.17, u'creditText': u'Dessert Now Dinner Later', u'extendedIngredients': [{u'originalString': u'1 apple, cut in chunks or thick slices', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'thick', u'cut in chunks or  slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1/2 gallon apple juice or cider', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'gallons', u'unitShort': u'gallon', u'amount': 0.5, u'consistency': u'liquid', u'id': 9016, u'unit': u'gallon'}, {u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 gallon chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'gallon', u'unitShort': u'gallon', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'gallon'}, {u'originalString': u'2 Tbsp fresh rosemary, chopped', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp fresh thyme, chopped', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'Tbsp'}, {u'originalString': u'5 garlic cloves, smashed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Heavy-duty roasting pan', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'servings'}, {u'originalString': u'1 cup kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'cup'}, {u'originalString': u'A reliable oven-safe meat thermometer', u'name': u'meat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'solid', u'id': 1065062, u'unit': u'servings'}, {u'originalString': u'1 to 2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1 onion, cut in chunks or thick slices', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'thick', u'cut in chunks or  slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 sprig rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprig', u'unitShort': u'sprig', u'amount': 1.0, u'consistency': u'solid', u'id': 2036, u'unit': u'sprig'}, {u'originalString': u'1 Oven Bag - Turkey Size', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 5165, u'unit': u''}, {u'originalString': u'1 turkey (up to 12 or 14 lbs, anything bigger than that tastes gamey; if you need more meat, opt for an additional turkey breast or second turkey)', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'for an additional turkey breast or second turkey)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 5165, u'unit': u''}, {u'originalString': u'1 Tbsp whole peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'whole peppercorns', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'Tbsp'}, {u'originalString': u'1 (5-gallon) bucket and lid (like a brand-new paint bucket and lid, washed well)', u'aisle': u'?', u'name': u'bucket and lid', u'metaInformation': [u'washed', u'well', u'(5-gallon)', u'(like a brand-new paint bucket and lid, )'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'unit': u'servings'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.dessertnowdinnerlater.com/2014/10/apple-herb-turkey-brine/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'About a week before you begin brining your turkey, place it in the refrigerator to defrost.The day before you roast your turkey, combine all the brining ingredients except for the ice in a very large stockpot. Bring to a boil and then remove from heat and allow to cool to room temperature. (It takes a while to cool, maybe 1 to 2 hours.)Thoroughly clean your bucket or pot that you will be submerging the turkey in.  Rinse your turkey and remove and discard the neck and gizzards.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Place the turkey inside the bucket.  Cover completely with ice (you may need to buy a 10lb bag or two depending on where you are storing your turkey for the night.)  Then pour your cooled brine into the bucket.  Your turkey should be completely submerged.  If not, add a little more water or broth.If possible, create a spot for your turkey in the refrigerator, and let it soak for 12 to 24 hours before baking time.If your fridge is stuffed with pies and other Thanksgiving ingredients, you may keep your bucket outside, if its cold, with a tight fitting lid.You may also store it inside the coldest room of your house (the basement is great  if you have one) where it wont be disturbed by little children and periodically add ice to it throughout the night/day to keep it cold.When you are ready to start roasting, remove the turkey from the brine and set it in a clean sink.  You may discard the brine at this point.Thoroughly rinse the turkey and then pat it dry with a paper towel.Rub the outside of the turkey with a light coating of olive oil and then some fresh chopped herbs, in this case, thyme and rosemary.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 165.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place the turkey in an oven bag (which has been shaken with flour, if stated in the directions on the box) and place the bagged turkey inside of a heavy duty roasting pan.  Stuff the cavity of the turkey with aromatics, such as onions and apples. (Celery is good too, if you have it.)Close up the bag, cut 1/2-inch air pockets if instructed to do so from the oven bag box, and insert your thermometer in the thickest part of the turkey breast.  Set your thermometer to beep at you once it hits 165 degrees Fahrenheit.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake at 350 degrees Fahrenheit until the thermometer beeps.  Our 9 1/2 lb turkey took just under 2 hours to hit 165 degrees.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the turkey from the oven, cut off the bag, save the juices for gravy, and let the turkey REST FOR 15 MINUTES before slicing.  This way the juices will stay inside the meat instead of running over your cutting board.  Enjoy your juicy turkey!', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 370, u'instructions': u'About a week before you begin brining your turkey, place it in the refrigerator to defrost.The day before you roast your turkey, combine all the brining ingredients except for the ice in a very large stockpot. Bring to a boil and then remove from heat and allow to cool to room temperature. (It takes a while to cool, maybe 1 to 2 hours.)Thoroughly clean your bucket or pot that you will be submerging the turkey in.  Rinse your turkey and remove and discard the neck and gizzards.Place the turkey inside the bucket.  Cover completely with ice (you may need to buy a 10lb bag or two depending on where you are storing your turkey for the night.)  Then pour your cooled brine into the bucket.  Your turkey should be completely submerged.  If not, add a little more water or broth.If possible, create a spot for your turkey in the refrigerator, and let it soak for 12 to 24 hours before baking time.If your fridge is stuffed with pies and other Thanksgiving ingredients, you may keep your bucket outside, if its cold, with a tight fitting lid.You may also store it inside the coldest room of your house (the basement is great  if you have one) where it wont be disturbed by little children and periodically add ice to it throughout the night/day to keep it cold.When you are ready to start roasting, remove the turkey from the brine and set it in a clean sink.  You may discard the brine at this point.Thoroughly rinse the turkey and then pat it dry with a paper towel.Rub the outside of the turkey with a light coating of olive oil and then some fresh chopped herbs, in this case, thyme and rosemary.Place the turkey in an oven bag (which has been shaken with flour, if stated in the directions on the box) and place the bagged turkey inside of a heavy duty roasting pan.  Stuff the cavity of the turkey with aromatics, such as onions and apples. (Celery is good too, if you have it.)Close up the bag, cut 1/2-inch air pockets if instructed to do so from the oven bag box, and insert your thermometer in the thickest part of the turkey breast.  Set your thermometer to beep at you once it hits 165 degrees Fahrenheit.Bake at 350 degrees Fahrenheit until the thermometer beeps.  Our 9 1/2 lb turkey took just under 2 hours to hit 165 degrees.Remove the turkey from the oven, cut off the bag, save the juices for gravy, and let the turkey REST FOR 15 MINUTES before slicing.  This way the juices will stay inside the meat instead of running over your cutting board.  Enjoy your juicy turkey!', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-and-herb-turkey-brine-with-step-by-step-tutorial-for-brining-618691', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}