{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600520-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 600520, u'veryPopular': False, u'lowFodmap': False, u'title': u'Piccadilly Cafeteria Lemon Ice Box Pie', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 81.7, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'3 Egg Yolks (beaten)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'beaten', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'5 tablespoons Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons Granulated Sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup Lemon Juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon Vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces Whipped Topping (Cool Whip)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'(Cool Whip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounces'}, {u'originalString': u'1 Box Jiffy Mix Yellow Cake Mix (prepared as directed)', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'yellow', u'prepared', u'( as directed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'Box', u'unitShort': u'Box', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'Box'}, {u'originalString': u'2 1/4 cups Whole Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.copykat.com/2009/02/06/piccadilly-cafeteria-lemon-ice-box-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Crumble cooled prepared cake and measure 2 cups of crumbs, pat crumbs lightly down when measuring.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place crumbs in small bowl and mix in the sugar. Spray a none stick spray in 9" pie pan and pat cake crumbs in pie pan along the sides and on the bottom.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place pie crust in a preheated oven at 275 for 7 minutes. Watch crust carefully so the crumbs will not scorch. This process will help to lightly set the crust. When done remove and cool crust.Filling', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a 2 quart sauce pan mix sugar, flour, salt and milk. While stirring constantly bring ingredients to a low boil and cook for two or three minutes until filling becomes thick.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from heat and add 1/2 cup of hot mixture to beaten egg yolks and whisk together.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Place filling back on stove at a low heat and slowly pour egg yolks into filling while whisking together.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour lemon juice and vanilla into filling and bring to a soft boil and cook for two to three minutes longer. Using a whisk through out the cooking helps to eliminate lumps. When filling is thick remove from heat and set aside to cool down. The filling may be poured into the crust while still a little warm but not hot.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Place pie in refrigerator for several hours to set and chill completely. When chilled, top with whipped topping and sprinkle the two tablespoons of crumbled cake crumbs.Fresh lemon zest may be added to garnish.Please note if you can not find Jiffy Cake mix, you can use a regular cake mix, but you will have twice as much crust than you need. So making two pies might be a solution.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Chateau Chantal Late Harvest Riesling. It has 4.5 out of 5 stars and a bottle costs about 21 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': None, u'title': u'Chateau Chantal Late Harvest Riesling', u'price': u'$21.0', u'id': 430249, u'link': u'https://www.amazon.com/Chateau-Chantal-Late-Harvest-Riesling/dp/B00IJI3V3I', u'imageUrl': u'https://spoonacular.com/productImages/430249-312x231.jpg'}]}, u'aggregateLikes': 110, u'instructions': u'Crumble cooled prepared cake and measure 2 cups of crumbs, pat crumbs lightly down when measuring. Place crumbs in small bowl and mix in the sugar. Spray a none stick spray in 9" pie pan and pat cake crumbs in pie pan along the sides and on the bottom. Place pie crust in a preheated oven at 275 for 7 minutes. Watch crust carefully so the crumbs will not scorch. This process will help to lightly set the crust. When done remove and cool crust.FillingIn a 2 quart sauce pan mix sugar, flour, salt and milk. While stirring constantly bring ingredients to a low boil and cook for two or three minutes until filling becomes thick. Remove pan from heat and add 1/2 cup of hot mixture to beaten egg yolks and whisk together. Place filling back on stove at a low heat and slowly pour egg yolks into filling while whisking together. Pour lemon juice and vanilla into filling and bring to a soft boil and cook for two to three minutes longer. Using a whisk through out the cooking helps to eliminate lumps. When filling is thick remove from heat and set aside to cool down. The filling may be poured into the crust while still a little warm but not hot.Place pie in refrigerator for several hours to set and chill completely. When chilled, top with whipped topping and sprinkle the two tablespoons of crumbled cake crumbs.Fresh lemon zest may be added to garnish.Please note if you can not find Jiffy Cake mix, you can use a regular cake mix, but you will have twice as much crust than you need. So making two pies might be a solution.', u'spoonacularSourceUrl': u'https://spoonacular.com/piccadilly-cafeteria-lemon-ice-box-pie-600520', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}