{u'recipes': [{u'sourceName': u'Jans Sushi Bar', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/476862-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 476862, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grain-Free Peach Cobbler', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 85.52, u'creditText': u'Jans Sushi Bar', u'extendedIngredients': [{u'originalString': u'1/2 cup almond flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93740, u'unit': u'cup'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons ghee or clarified butter, melted', u'aisle': u'Ethnic Foods', u'name': u'clarified butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons evaporated cane juice or coconut sugar', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93831, u'unit': u'tablespoons'}, {u'originalString': u'2 large eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'5 cups sliced peaches', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 9236, u'unit': u'cups'}, {u'originalString': u'4 tablespoons potato flour', u'aisle': u'Baking', u'name': u'Potato Starch Flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 11413, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons tapioca flour', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93696, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.janssushibar.com/grain-free-peach-cobbler/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'In a large bowl, stir together the sliced peaches and evaporated cane juice. Cover loosely with plastic wrap and set aside for 30 minutes. Stir in the tapioca flour until well-blended and set aside again.Preheat oven to 350 F.In a large bowl, whisk together the eggs, ghee, vanilla and evaporated cane juice. Stir in the almond flour, then the tapioca flour and baking soda until a smooth batter forms. Stir in the potato flour, one tablespoon at a time, until a soft dough is formed (you may not need all 4 tablespoons).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93696, u'name': u'tapioca starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'id': 93740, u'name': u'almond flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/glass-baking-tray.jpg', u'id': 406921, u'name': u'glass baking pan'}], u'step': u'Spread the macerated peaches into a 1 1/2 quart glass baking dish; using a spoon, drop the biscuit dough topping over the surface of the peaches.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [], u'step': u'Bake for 35 to 45 minutes, or until the peach mixture has thickened and the biscuit topping is golden brown.Allow to cool for at least 30 minutes before serving.Nutrition (per serving): 238 calories, 7.4g total fat, 54.1mg cholesterol, 178.9mg sodium, 320mg potassium, 39.7g carbohydrates, 3g fiber, 24g sugar, 3g protein', u'length': {u'number': 65, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cobbler can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port', u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 77, u'instructions': u'In a large bowl, stir together the sliced peaches and evaporated cane juice. Cover loosely with plastic wrap and set aside for 30 minutes. Stir in the tapioca flour until well-blended and set aside again.Preheat oven to 350 F.In a large bowl, whisk together the eggs, ghee, vanilla and evaporated cane juice. Stir in the almond flour, then the tapioca flour and baking soda until a smooth batter forms. Stir in the potato flour, one tablespoon at a time, until a soft dough is formed (you may not need all 4 tablespoons).Spread the macerated peaches into a 1 1/2 quart glass baking dish; using a spoon, drop the biscuit dough topping over the surface of the peaches. Bake for 35 to 45 minutes, or until the peach mixture has thickened and the biscuit topping is golden brown.Allow to cool for at least 30 minutes before serving.Nutrition (per serving): 238 calories, 7.4g total fat, 54.1mg cholesterol, 178.9mg sodium, 320mg potassium, 39.7g carbohydrates, 3g fiber, 24g sugar, 3g protein', u'spoonacularSourceUrl': u'https://spoonacular.com/grain-free-peach-cobbler-476862', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}