{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/695284-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 695284, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tuna Steaks Proven\xe7al', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 469.07, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'4 4-ounce tuna steaks, (about 1 inch thick)', u'aisle': u'Seafood', u'name': u'ahi tuna steaks', u'metaInformation': [u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-steak-or-ahi-tuna.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 15117, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons sliced, pitted, good-quality black olives', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'pitted', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons dry red wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14097, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup fish stock or water', u'aisle': u'Canned and Jarred', u'name': u'fish stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6963, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons chopped fresh rosemary, or 1/2 teaspoon dried', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'dried', u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoons'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon extra-virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 red bell pepper, chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 small red onion, sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'Salt & freshly ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 tomatoes, peeled, seeded and chopped (see Tip)', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'peeled', u'seeded', u'chopped', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 yellow bell pepper, chopped', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/tuna_steaks_proven_al.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat 2 teaspoons oil in a wide saucepan over medium heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add peppers, onions and garlic and saut until softened, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add tomatoes, fish stock (or water) and wine and bring to a boil. Cook, uncovered, over high heat until thickened, about 10 minutes, stirring frequently. Stir in olives and rosemary and season with salt and pepper.Meanwhile, brush both sides of the tuna steaks with remaining 1 teaspoon oil and season both sides lightly with salt and pepper.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6963, u'name': u'fish stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat an ovenproof, nonstick skillet over medium-high heat until almost very hot. Sear the tuna until lightly browned, 1 to 2 minutes per side.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the pan in the oven and bake until the fish is opaque, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Place the tuna on individual plates and spoon the tomato mixture on top.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fresh Tuna works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Miranda Lambert Kerosene Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'light , pear , apple', u'title': u'Miranda Lambert Kerosene Pinot Grigio Wine', u'price': u'$26.0', u'id': 428324, u'link': u'https://www.amazon.com/Miranda-Lambert-Kerosene-Pinot-Grigio/dp/B0184UHJRO', u'imageUrl': u'https://spoonacular.com/productImages/428324-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'Preheat oven to 400F.Heat 2 teaspoons oil in a wide saucepan over medium heat. Add peppers, onions and garlic and saut until softened, 2 to 3 minutes. Add tomatoes, fish stock (or water) and wine and bring to a boil. Cook, uncovered, over high heat until thickened, about 10 minutes, stirring frequently. Stir in olives and rosemary and season with salt and pepper.Meanwhile, brush both sides of the tuna steaks with remaining 1 teaspoon oil and season both sides lightly with salt and pepper. Heat an ovenproof, nonstick skillet over medium-high heat until almost very hot. Sear the tuna until lightly browned, 1 to 2 minutes per side. Place the pan in the oven and bake until the fish is opaque, about 10 minutes. Place the tuna on individual plates and spoon the tomato mixture on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/tuna-steaks-provenal-695284', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}