{u'recipes': [{u'sourceName': u'Lady Behind the Curtain', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/572006-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 572006, u'veryPopular': False, u'lowFodmap': False, u'title': u'{Guilt Free} Snickers Cake', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 4.94, u'creditText': u'Lady Behind the Curtain', u'extendedIngredients': [{u'originalString': u'1/8 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon fat-free, low-fat, or light caramel ice cream topping', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel ice cream topping', u'metaInformation': [u'light', u'fat-free', u'low-fat,'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19364, u'unit': u'teaspoon'}, {u'originalString': u"3 tablespoons Pillsbury Devil's Food cake mix", u'aisle': u'Baking', u'name': u'angel food cake mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18087, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon fat-free liquid egg substitute', u'aisle': u'Health Foods;Baking;Milk, Eggs, Other Dairy', u'name': u'liquid egg substitute', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1226, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon chopped peanuts (ice cream topping)', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'chopped', u'(ice cream topping)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16091, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon mini semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoons fat-free sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'fat-free', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.ladybehindthecurtain.com/guilt-free-snickers-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'In a half pint jar or microwave safe mug, combine cake mix, egg substitute, sour cream, baking powder and water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/liquid-egg-substitute.jpg', u'id': 1226, u'name': u'egg substitute'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Mix until well combined.  Microwave 1 minute and 45 seconds, or until set.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool completely, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle cake with caramel, peanuts and chocolate chips.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 356, u'instructions': u'In a half pint jar or microwave safe mug, combine cake mix, egg substitute, sour cream, baking powder and water.  Mix until well combined.  Microwave 1 minute and 45 seconds, or until set. Let cool completely, about 15 minutes.  Drizzle cake with caramel, peanuts and chocolate chips.', u'spoonacularSourceUrl': u'https://spoonacular.com/guilt-free-snickers-cake-572006', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 7, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}