{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/701017-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 701017, u'veryPopular': False, u'lowFodmap': False, u'title': u'BBQ Bacon Cheeseburger Cupcakes', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 82.79, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'4 slices bacon, diced and cooked until crisp', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'diced', u'crisp', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'\xbd cup barbecue sauce', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'3 cups cheese, divided (whatever you like on your burgers!)', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'divided', u'(whatever you like on your burgers!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'cups'}, {u'originalString': u'\xbd cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'1 pound lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'pound'}, {u'originalString': u'1 package wonton wrappers (about 2.5-3 inches across)', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [u'( 2.5-es across)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'package'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.thereciperebel.com/bbq-bacon-cheeseburger-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat the oven to 400 degrees F.In a medium pan, cook ground beef over medium-high heat until browned.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat and stir in bacon, ketchup and barbecue sauce. Stir in 1 cup cheese.Spray 2 muffin pans with non stick spray.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Place one wonton wrapper in the bottom of each muffin cup.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place another wonton wrapper on top, turning so that the long edges are staggered (so that your muffin cup is lined completely by the wonton wrappers).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'id': 10018368, u'name': u'wonton wrappers'}]}, {u'equipment': [], u'step': u'Place about 1-2 tablespoons of beef mixture into each wonton cup. You should fill 18-24 wontons with beef mixture, depending on how full you fill them.Sprinkle with remaining cheese and bake for 12-15 minutes until cheese is bubbly and edges of the wonton are crispy and golden brown.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u"Let sit at least 5 minutes before serving (they're very hot inside!). Feel free to garnish with your favorite burger toppings!", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 51, u'instructions': u"Preheat the oven to 400 degrees F.In a medium pan, cook ground beef over medium-high heat until browned.Remove from heat and stir in bacon, ketchup and barbecue sauce. Stir in 1 cup cheese.Spray 2 muffin pans with non stick spray. Place one wonton wrapper in the bottom of each muffin cup. Place another wonton wrapper on top, turning so that the long edges are staggered (so that your muffin cup is lined completely by the wonton wrappers). Place about 1-2 tablespoons of beef mixture into each wonton cup. You should fill 18-24 wontons with beef mixture, depending on how full you fill them.Sprinkle with remaining cheese and bake for 12-15 minutes until cheese is bubbly and edges of the wonton are crispy and golden brown. Let sit at least 5 minutes before serving (they're very hot inside!). Feel free to garnish with your favorite burger toppings!", u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-bacon-cheeseburger-cupcakes-701017', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}