{u'recipes': [{u'sourceName': u'Foodess', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/548996-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 548996, u'veryPopular': True, u'lowFodmap': False, u'title': u'Oatmeal Brown Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 63.44, u'creditText': u'Foodess', u'extendedIngredients': [{u'originalString': u'2 tbsp active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18375, u'unit': u'tbsp'}, {u'originalString': u'10 cups all purpose flour (approximate)', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [u'(approximate)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 10.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbc cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'\xbd tsp granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'\xbd cup molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19304, u'unit': u'cup'}, {u'originalString': u'2 cups old fashioned rolled oats (not quick or instant)', u'aisle': u'Cereal', u'name': u'old fashioned rolled oats', u'metaInformation': [u'quick', u'(not or instant)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'2 tbsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tbsp'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://foodess.com/2014/02/oatmeal-brown-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bring 3 cups of water to a boil in a medium saucepan.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add milk and bring back up to a near-boil; remove from heat when steaming and small bubbles begin to form at edges.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add molasses, butter and salt; stir until molasses is dissolved and butter is melted.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}], u'step': u'Add oats and let stand until only lukewarm.Meanwhile, combine yeast and sugar with 1 cup lukewarm water in your largest mixing bowl; set aside ten minutes to activate (it will become bubbly and grow).When the oatmeal mixture is cool, add to the yeast mixture, beating well with a wooden spoon to combine. Beat in the flour, a cup at a time, until it is too difficult to incorporate with the spoon, then dump it out onto a clean counter and start to knead, adding more flour as needed to create a smooth, workable ball of dough. Knead about 10 minutes total. Set dough aside to rise in a warm spot with a tea towel draped over top for about an hour, until doubled in size. Punch down, then divide into 4 equal pieces, forming each into a ball.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Let rise once again, for another hour.Meanwhile, preheat oven to 350 degrees F. Line a baking sheet with parchment paper. Dust dough balls with additional flour for a rustic look, then use a sharp serrated knife to make a few \xbd”-deep slashes.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake 1-2 loaves at a time (refrigerating remaining dough balls in the meantime to prevent over-proofing) on the lowest rack of the oven.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake about 45 minutes, or until well-browned and the bottom sounds hollow when tapped.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1022, u'instructions': u'Bring 3 cups of water to a boil in a medium saucepan. Add milk and bring back up to a near-boil; remove from heat when steaming and small bubbles begin to form at edges. Add molasses, butter and salt; stir until molasses is dissolved and butter is melted. Add oats and let stand until only lukewarm.Meanwhile, combine yeast and sugar with 1 cup lukewarm water in your largest mixing bowl; set aside ten minutes to activate (it will become bubbly and grow).When the oatmeal mixture is cool, add to the yeast mixture, beating well with a wooden spoon to combine. Beat in the flour, a cup at a time, until it is too difficult to incorporate with the spoon, then dump it out onto a clean counter and start to knead, adding more flour as needed to create a smooth, workable ball of dough. Knead about 10 minutes total. Set dough aside to rise in a warm spot with a tea towel draped over top for about an hour, until doubled in size. Punch down, then divide into 4 equal pieces, forming each into a ball. Let rise once again, for another hour.Meanwhile, preheat oven to 350 degrees F. Line a baking sheet with parchment paper. Dust dough balls with additional flour for a rustic look, then use a sharp serrated knife to make a few \xbd”-deep slashes. Bake 1-2 loaves at a time (refrigerating remaining dough balls in the meantime to prevent over-proofing) on the lowest rack of the oven. Bake about 45 minutes, or until well-browned and the bottom sounds hollow when tapped.', u'spoonacularSourceUrl': u'https://spoonacular.com/oatmeal-brown-bread-548996', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}