{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/465229-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 465229, u'veryPopular': False, u'lowFodmap': False, u'title': u'Rich Green Bean Casserole', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 143.7, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 teaspoon Cajun seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'cajun seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032028, u'unit': u'teaspoon'}, {u'originalString': u'1 (10.75 ounce) can condensed cream of chicken soup', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of chicken soup', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.75, u'consistency': u'liquid', u'id': 6016, u'unit': u'ounce'}, {u'originalString': u'1 (2.8 ounce) can French-fried onions', u'aisle': u'Canned and Jarred', u'name': u'fried onions', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fried-onions.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.8, u'consistency': u'solid', u'id': 93709, u'unit': u'ounce'}, {u'originalString': u'2 (15 ounce) cans green beans, drained', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 11052, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces processed cheese food, cubed', u'aisle': u'Cheese', u'name': u'processed american cheese', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1253, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Rich-Green-Bean-Casserole/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F (175 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the processed cheese into a large microwave-safe bowl along with the cream of chicken soup.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'id': 6016, u'name': u'cream of chicken soup'}]}, {u'equipment': [], u'step': u'Heat on full power for 2 minutes, stirring occasionally, or until cheese is melted. Season with salt, pepper, and Cajun seasoning. Stir in the green beans.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1032028, u'name': u'cajun seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Pour into a 1 1/2 quart casserole dish, and sprinkle the French fried onions over the top.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for about 20 minutes in the preheated oven, or until the top is crispy.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 51, u'instructions': u'Preheat the oven to 350 degrees F (175 degrees C).                            Place the processed cheese into a large microwave-safe bowl along with the cream of chicken soup. Heat on full power for 2 minutes, stirring occasionally, or until cheese is melted. Season with salt, pepper, and Cajun seasoning. Stir in the green beans. Pour into a 1 1/2 quart casserole dish, and sprinkle the French fried onions over the top.                            Bake for about 20 minutes in the preheated oven, or until the top is crispy.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/rich-green-bean-casserole-465229', u'dishTypes': [u'side dish'], u'occasions': [u'fall', u'thanksgiving', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}