{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/544077-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 3, u'id': 544077, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheaters Fried Ice Cream', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 231.4, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u'honey or caramel sauce, store bought or homemade', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'homemade', u'store bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 19364, u'unit': u'servings'}, {u'originalString': u'cherries, fresh or Marachino, for garnish', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 9070, u'unit': u'servings'}, {u'originalString': u'5 cups corn flakes cereal*', u'aisle': u'Cereal', u'name': u'corn flakes cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 8020, u'unit': u'cups'}, {u'originalString': u'chocolate fudge sauce, store bought or homemade', u'aisle': u'Frozen', u'name': u'chocolate sauce', u'metaInformation': [u'homemade', u'store bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 10019348, u'unit': u'servings'}, {u'originalString': u'2 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/2 cup salted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001001, u'unit': u'cup'}, {u'originalString': u'sweetened whipped cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sweetened whipped cream', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1054, u'unit': u'servings'}, {u'originalString': u'Vanilla bean ice cream, firm enough to shape but just soft enough to scoop (I prefer Breyers All Natural Vanilla)', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [u'firm', u'soft', u'(I prefer Breyers All Natural Vanilla)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'scoop'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.cookingclassy.com/2013/01/fried-ice-cream/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour cornflakes into a large Ziplog bag, seal bag and use a rolling pin to crush cornflakes. Melt butter in a non-stick 10-inch fry pan over medium heat. Once butter is melted, stir in crushed corn flakes and cinnamon and increase heat slightly. Cook mixture, stirring constantly until golden brown and fragrant (color will deepen and begin to smell lightly toasty and corn flakes should be crisp), about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes', u'id': 1008020, u'name': u'corn flake crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes.jpg', u'id': 8020, u'name': u'corn flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Remove from heat, pour mixture in a shallow dish and allow to cool slightly. Use a fork to break mixture down if desired.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u"Remove ice cream from freezer, scoop out desired serving size (you should be able to get 3 baseball size ice cream balls, or more if you do a thinner coating or smaller size ice cream balls) and shape into a ball with clean hands (yeah, it will be seriously cold, like rolling a snowball without gloves so work quickly. If you don't care to have a uniform shape then you can simply just scoop out the ice cream and drop into toasted corn flake mixture without shaping), then immediately drop shaped ice cream ball into corn flake mixture and roll to evenly coat, while pressing corn flake mixture around outer surface for a thicker coating as desired.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Serve immediately topped with optional toppings, or place in freezer in an airtight container (without toppings) and chill until serving.*You could also replace some of the corn flakes with sweetened shredded coconut or finely chopped pecans.Recipe Source: Cooking Classy', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes.jpg', u'id': 8020, u'name': u'corn flakes'}]}], u'name': u''}], u'aggregateLikes': 332, u'instructions': u"Pour cornflakes into a large Ziplog bag, seal bag and use a rolling pin to crush cornflakes. Melt butter in a non-stick 10-inch fry pan over medium heat. Once butter is melted, stir in crushed corn flakes and cinnamon and increase heat slightly. Cook mixture, stirring constantly until golden brown and fragrant (color will deepen and begin to smell lightly toasty and corn flakes should be crisp), about 2 minutes. Remove from heat, pour mixture in a shallow dish and allow to cool slightly. Use a fork to break mixture down if desired. Remove ice cream from freezer, scoop out desired serving size (you should be able to get 3 baseball size ice cream balls, or more if you do a thinner coating or smaller size ice cream balls) and shape into a ball with clean hands (yeah, it will be seriously cold, like rolling a snowball without gloves so work quickly. If you don't care to have a uniform shape then you can simply just scoop out the ice cream and drop into toasted corn flake mixture without shaping), then immediately drop shaped ice cream ball into corn flake mixture and roll to evenly coat, while pressing corn flake mixture around outer surface for a thicker coating as desired. Serve immediately topped with optional toppings, or place in freezer in an airtight container (without toppings) and chill until serving.*You could also replace some of the corn flakes with sweetened shredded coconut or finely chopped pecans.Recipe Source: Cooking Classy", u'spoonacularSourceUrl': u'https://spoonacular.com/cheaters-fried-ice-cream-544077', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 13, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}