{u'recipes': [{u'sourceName': u'Guilty Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/550656-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 550656, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mango Shrimp Spicy Lettuce Rice Cups', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 94.84, u'creditText': u'Guilty Kitchen', u'extendedIngredients': [{u'originalString': u'1 tsp coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tsp'}, {u'originalString': u'Club House ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 cup Thai Kitchen Jasmine Rice (dry measure)', u'aisle': u'Pasta and Rice', u'name': u'jasmine rice', u'metaInformation': [u'dry', u'( measure)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-jasmine-cooked.jpg', u'unitLong': u'measure', u'unitShort': u'measure', u'amount': 1.0, u'consistency': u'solid', u'id': 10120444, u'unit': u'measure'}, {u'originalString': u'Zest and juice of 1/2 a lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'8 lettuce leaves (butter, iceberg, red leaf, etc.)', u'aisle': u'Produce', u'name': u'lettuce leaves', u'metaInformation': [u'red', u'(butter, iceberg, leaf, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 93623, u'unit': u''}, {u'originalString': u'1 large mango, cubed', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'large', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'1/2 tsp fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'200g shrimp, cooked and peeled', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'cooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'g'}, {u'originalString': u'1/4 cup Thai Kitchen Spicy Thai Mango Sauce', u'aisle': u'Ethnic Foods', u'name': u'thai fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6179, u'unit': u'cup'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://guiltykitchen.com/2014/01/09/mango-shrimp-spicy-lettuce-rice-cups/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, place the rice, water, coconut oil and salt. Bring to a boil, cover, then lower to a simmer for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from heat and allow to sit, covered, for 5-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the shrimp, mango sauce, mangoes, lime juice and zest and pepper in a bowl and stir to combine. To make the cups, place lettuce leave in small bowls or on side plates. Top with about 2-3 tbsp of the cooked rice and 3 tbsp of the shrimp and mango combination.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Kris Pinot Grigio. It has 4.2 out of 5 stars and a bottle costs about 15 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Brilliant lemon-green in color, KRIS offers enticing aromas of acacia flowers, citrus, tangerine, and hints of almonds.Try pairing with risotto, tossed salads, homemade pasta and grilled white meats or salmon.Blend: 100% Pinot Grigio View More', u'title': u'Kris Pinot Grigio', u'price': u'$14.99', u'id': 433207, u'link': u'https://www.wine.com/product/kris-pinot-grigio-2016/206138', u'imageUrl': u'https://spoonacular.com/productImages/433207-312x231.jpg'}]}, u'aggregateLikes': 36, u'instructions': u'In a small saucepan, place the rice, water, coconut oil and salt. Bring to a boil, cover, then lower to a simmer for 15 minutes. Remove from heat and allow to sit, covered, for 5-10 minutes.Place the shrimp, mango sauce, mangoes, lime juice and zest and pepper in a bowl and stir to combine. To make the cups, place lettuce leave in small bowls or on side plates. Top with about 2-3 tbsp of the cooked rice and 3 tbsp of the shrimp and mango combination. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-shrimp-spicy-lettuce-rice-cups-550656', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}