{u'recipes': [{u'sourceName': u'The Messy Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/574046-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 574046, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Quinoa-Stuffed Peppers', u'diets': [u'gluten free'], u'preparationMinutes': 45, u'pricePerServing': 299.86, u'creditText': u'The Messy Baker', u'extendedIngredients': [{u'originalString': u'1 28-ounce can diced tomatoes, drained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup grated carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 large stalk celery, finely chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1\xbd cup grated cheese, divided (spicy jalapeno Jack or TexMex mix is good)', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'good', u'divided', u'grated', u'(spicy jalapeno Jack or TexMex mix is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1041009, u'unit': u'cup'}, {u'originalString': u'2 tablespoons chili powder (or 1 tablespoon chili powder and 1\xbd teaspoons chipotle powder))', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [u'(or 1 tablespoon chili powder and 1\xbd teaspoons chipotle powder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoons'}, {u'originalString': u'1 cup frozen corn', u'aisle': u'Frozen', u'name': u'frozen corn', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11913, u'unit': u'cup'}, {u'originalString': u'1 tablespoon garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'generous pinch fresh ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1 large onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'4 large sweet peppers (any colour)', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'sweet', u'large', u'(any colour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'\xbe cups uncooked quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20035, u'unit': u'cups'}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 19-ounce can black beans, rinsed and drained (about 2 cups cooked)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'black', u'rinsed', u'cooked', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16033, u'unit': u'cups'}, {u'originalString': u'1 10-ounce box cooked spinach, thawed and squeezed to remove moisture', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'thawed', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'ounce'}, {u'originalString': u'1\xbd cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 85.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://themessybaker.com/2010/10/05/recipe-spicy-quinoa-stuffed-peppers/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375\xb0F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the oil in a large saucepan, over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the onion and celery and cook until soft, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the chili powder, chipotle powder (if using), cumin, oregano and garlic, and cook for one minute, stirring well to blend the spices.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1052009, u'name': u'ground chipotle chile pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add the spinach and tomatoes, and cook for 5 minutes to remove a bit of the excess moisture. Stir in the black beans, quinoa, corn, carrots and water. Cover and bring to a boil. When the liquid reaches a boil, reduce the heat and simmer, covered, until the quinoa is cooked, about 20 minutes.While the quinoa cooks, cut the peppers in half lengthwise.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove the ribs and seeds.Once the filling cooked, stir in 1 cup grated cheese. Salt and pepper to taste. Fill each pepper half with the hot quinoa mixture.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place stuffed peppers in a baking dish or roasting pan. Cover with foil and bake for 25 to 35 minutes (see note on timing), or until the peppers are beginning to get tender. You want them cooked but not falling apart.Sprinkle each stuffed pepper with 1 tablespoon of the grated cheese.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Bake uncovered for another 5 minutes or until the cheese melts and begins to bubble.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and let cool 5 minutes before serving.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 62, u'instructions': u'Preheat the oven to 375\xb0F.Heat the oil in a large saucepan, over medium-high heat. Add the onion and celery and cook until soft, about 5 minutes.Add the chili powder, chipotle powder (if using), cumin, oregano and garlic, and cook for one minute, stirring well to blend the spices. Add the spinach and tomatoes, and cook for 5 minutes to remove a bit of the excess moisture. Stir in the black beans, quinoa, corn, carrots and water. Cover and bring to a boil. When the liquid reaches a boil, reduce the heat and simmer, covered, until the quinoa is cooked, about 20 minutes.While the quinoa cooks, cut the peppers in half lengthwise. Remove the ribs and seeds.Once the filling cooked, stir in 1 cup grated cheese. Salt and pepper to taste. Fill each pepper half with the hot quinoa mixture. Place stuffed peppers in a baking dish or roasting pan. Cover with foil and bake for 25 to 35 minutes (see note on timing), or until the peppers are beginning to get tender. You want them cooked but not falling apart.Sprinkle each stuffed pepper with 1 tablespoon of the grated cheese. Bake uncovered for another 5 minutes or until the cheese melts and begins to bubble. Remove from oven and let cool 5 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-quinoa-stuffed-peppers-574046', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}