{u'recipes': [{u'sourceName': u'Eat Good 4 Life', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/625824-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 625824, u'veryPopular': False, u'lowFodmap': False, u'title': u'Whole wheat White broccoli pizza', u'diets': [], u'pricePerServing': 153.94, u'creditText': u'Eat Good 4 Life', u'extendedIngredients': [{u'originalString': u'10 oz fresh organic broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'fresh', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'oz'}, {u'originalString': u'5 oz goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'1/2 cup mozzarella cheese, grated', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1026, u'unit': u'cup'}, {u'originalString': u'1/3 cup parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1/4 tsp Himalayan salt', u'aisle': u'Spices and Seasonings;Gourmet', u'name': u'pink himalayan salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/himalayan-pink-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032047, u'unit': u'tsp'}, {u'originalString': u'15 oz ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'oz'}, {u'originalString': u'1 whole wheat pizza dough', u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'whole wheat pizza dough', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93771, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.eatgood4life.com/whole-wheat-white-broccoli-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 400F.On a flat surface, like your kitchen counter, place some whole wheat flour to prevent the dough from sticking.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Roll out your pizza dough with a rolling pin in aroundshape and place the pizza dough onto apizza stonemaking sure you reach the edges.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place the ricotta cheese over the dough followed by the parmesan, goat and mozzarella cheese. Arrange the broccoli pieces and sprinkle the salt over.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake the pizzas in the preheated oven for 16-18 minutes. When baked, top the pizzas with some chopped red pepper flakes if desired.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Madsen Family Cellars Sangiovese Wine with a 5 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This wine has a pronounced nose with a hint of coffee while your mouth is invaded with spices; clove, licorice, and cinnamon.The palate features cherries and notes of clove which continue on to a smooth, long finish with subtle oak, slight pepper and berry flavors. The tartness of the wine works well with food as Sangiovese is a food wine, but can be enjoyed on its own as well. Columbia Valley AVA from the vineyards of Jordan Reed.', u'title': u'Madsen Family Cellars Sangiovese Wine', u'price': u'$26.0', u'id': 431618, u'link': u'https://www.amazon.com/2009-Madsen-Family-Cellars-Sangiovese/dp/B00I0F3FJA', u'imageUrl': u'https://spoonacular.com/productImages/431618-312x231.jpg'}]}, u'aggregateLikes': 21, u'instructions': u'Preheat your oven to 400F.On a flat surface, like your kitchen counter, place some whole wheat flour to prevent the dough from sticking. Roll out your pizza dough with a rolling pin in aroundshape and place the pizza dough onto apizza stonemaking sure you reach the edges.Place the ricotta cheese over the dough followed by the parmesan, goat and mozzarella cheese. Arrange the broccoli pieces and sprinkle the salt over.Bake the pizzas in the preheated oven for 16-18 minutes. When baked, top the pizzas with some chopped red pepper flakes if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/whole-wheat-white-broccoli-pizza-625824', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}