{u'recipes': [{u'sourceName': u'Crunchy Creamy Sweet', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/668775-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 668775, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sweet Corn and Zucchini Pasta with Bacon (15-Minute Dinner)', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 91.24, u'creditText': u'Crunchy Creamy Sweet', u'extendedIngredients': [{u'originalString': u'4 strips of bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'1/4 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'8 oz. dry bow tie pasta', u'aisle': u'Pasta and Rice', u'name': u'bow tie pasta', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farfalle.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10120420, u'unit': u'oz'}, {u'originalString': u'chopped fresh basil for garnish', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2044, u'unit': u'servings'}, {u'originalString': u'1/3 cup heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup sweet corn (fresh or frozen)', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'sweet corn', u'metaInformation': [u'fresh', u'sweet', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11168, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups zucchini, cubed', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11477, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.crunchycreamysweet.com/2015/08/15/sweet-corn-and-zucchini-pasta-with-bacon-15-minute-dinner/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook pasta according to manufacturers instructions.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Drain and keep warm.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat up a large skillet (I used cast iron) over medium heat. When hot, add bacon and cook until almost all pieces are crispy.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add veggies at once and saute, stirring often. Cook 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add cream, salt and pepper and cook until thickened, stirring constantly.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in the cooked pasta. Stir until coated.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve garnished with chopped basil or green onions. Refrigerate the leftovers for up to 2 days.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'aggregateLikes': 654, u'instructions': u'Cook pasta according to manufacturers instructions. Drain and keep warm.Heat up a large skillet (I used cast iron) over medium heat. When hot, add bacon and cook until almost all pieces are crispy. Add veggies at once and saute, stirring often. Cook 3 to 4 minutes. Add cream, salt and pepper and cook until thickened, stirring constantly. Remove from heat and stir in the cooked pasta. Stir until coated.Serve garnished with chopped basil or green onions. Refrigerate the leftovers for up to 2 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-corn-and-zucchini-pasta-with-bacon-15-minute-dinner-668775', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}