{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220059-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 220059, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chard-stuffed roast lamb', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal'], u'preparationMinutes': 30, u'pricePerServing': 125.61, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'large bunch chard (about 500g - rainbow chard looks pretty), leaves and stalks separated', u'aisle': u'Produce', u'name': u'chard', u'metaInformation': [u'separated', u'large', u'( 500g - rainbow chard looks pretty)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11147, u'unit': u'bunch'}, {u'originalString': u'2 handfuls large green olives, chopped', u'aisle': u'Canned and Jarred', u'name': u'green olives', u'metaInformation': [u'green', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-olives---sliced.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 2.0, u'consistency': u'solid', u'id': 1029195, u'unit': u'handfuls'}, {u'originalString': u'1 boned shoulder of lamb (about 1\xbd kg boned weight), rolled and loosely tied (see tip, below)', u'aisle': u'Meat', u'name': u'lamb shoulder', u'metaInformation': [u'(see tip, below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 17047, u'unit': u''}, {u'originalString': u'4 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'25g pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 12147, u'unit': u'g'}, {u'originalString': u'large handful raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 9299, u'unit': u'handful'}, {u'originalString': u'200ml white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'ml'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/chard-stuffed-roast-lamb', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 220C/200C fan/gas 7. Shred the chard leaves, cut the stalks into batons and set the stalks aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat half the oil in a frying pan, add the leaves and cook for 2 mins until completely wilted, then tip into a bowl.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pine nuts, raisins and olives, a tiny drizzle of olive oil, a small splash of the wine and some seasoning.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Mix well.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the lamb on a board and push as much of the stuffing as you can into the cavity along the meat. Don’t worry if any of the stuffing falls out, but make sure you keep it. Scatter the stalks over the bottom of a shallow roasting tin and add any stray stuffing. Nestle the lamb among the stalks and pour the remaining wine over everything. Rub the lamb with the remaining olive oil, season with sea salt and ground black pepper, and put in the oven for 1 hr.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Remove and leave to rest for 15 mins, then serve in thick slices with the braised stalks, and potatoes cooked the way you like them.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 72, u'instructions': u'Heat oven to 220C/200C fan/gas 7. Shred the chard leaves, cut the stalks into batons and set the stalks aside. Heat half the oil in a frying pan, add the leaves and cook for 2 mins until completely wilted, then tip into a bowl. Add the pine nuts, raisins and olives, a tiny drizzle of olive oil, a small splash of the wine and some seasoning. Mix well.Place the lamb on a board and push as much of the stuffing as you can into the cavity along the meat. Don’t worry if any of the stuffing falls out, but make sure you keep it. Scatter the stalks over the bottom of a shallow roasting tin and add any stray stuffing. Nestle the lamb among the stalks and pour the remaining wine over everything. Rub the lamb with the remaining olive oil, season with sea salt and ground black pepper, and put in the oven for 1 hr. Remove and leave to rest for 15 mins, then serve in thick slices with the braised stalks, and potatoes cooked the way you like them.', u'spoonacularSourceUrl': u'https://spoonacular.com/chard-stuffed-roast-lamb-220059', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}