{u'recipes': [{u'sourceName': u'Alaska from Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/519674-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 519674, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shredded Brussels Sprout Salad with Citrus Vinaigrette', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 275.77, u'creditText': u'Alaska from Scratch', u'extendedIngredients': [{u'originalString': u'1 cup almonds, roughly chopped', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'6 slices cooked bacon, crisp-cooked and crumbled', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'2 dozen brussels sprouts, stems removed and finely shredded*', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'finely', u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 11098, u'unit': u''}, {u'originalString': u'1 lemon, juiced', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 orange, juiced', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9206, u'unit': u''}, {u'originalString': u'1/2 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 cup Pecorino-Romano cheese, grated', u'aisle': u'Cheese', u'name': u'pecorino romano cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1038, u'unit': u'cup'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 large shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.alaskafromscratch.com/2013/04/30/shredded-brussels-sprout-salad-with-almonds-bacon-citrus-vinaigrette/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, briskly whisk together the lemon and orange juices, shallot, olive oil, and salt and pepper until emulsified. Set aside. In a serving bowl, toss together the bacon, brussels sprouts, and almonds.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Drizzle with the vinaigrette, sprinkle with grated cheese, and toss to coat. Chill until ready to serve. Store leftovers in the refrigerator up to two days.', u'number': 2, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 3569, u'instructions': u'In a small bowl, briskly whisk together the lemon and orange juices, shallot, olive oil, and salt and pepper until emulsified. Set aside. In a serving bowl, toss together the bacon, brussels sprouts, and almonds. Drizzle with the vinaigrette, sprinkle with grated cheese, and toss to coat. Chill until ready to serve. Store leftovers in the refrigerator up to two days.', u'spoonacularSourceUrl': u'https://spoonacular.com/shredded-brussels-sprout-salad-with-citrus-vinaigrette-519674', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}