{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/463330-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 463330, u'veryPopular': False, u'lowFodmap': False, u'title': u'Florentine Chicken Soup', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 174.37, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3/4 cup Alfredo sauce', u'aisle': u'Pasta and Rice', u'name': u'alfredo sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 93606, u'unit': u'cup'}, {u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1 package (6 ounces) ready-to-use chicken breast cuts', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 5062, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 cups reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'1 tablespoon shredded Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoon'}, {u'originalString': u'1 cup uncooked penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons prepared pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons pine nuts, toasted', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12147, u'unit': u'tablespoons'}, {u'originalString': u'1 jar (7 ounces) roasted sweet red peppers, drained and sliced', u'aisle': u'Canned and Jarred', u'name': u'roasted red peppers', u'metaInformation': [u'sweet', u'red', u'drained', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 11916, u'unit': u'ounces'}, {u'originalString': u'3 fresh rosemary sprigs, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 2036, u'unit': u''}, {u'originalString': u'4 cups chopped fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/florentine-chicken-soup', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Cook pasta according to package directions. Meanwhile, in a large saucepan, saute the chicken, spinach, red peppers, rosemary, garlic powder and pepper in butter until spinach is wilted. Stir in the broth, Alfredo sauce and pesto; cook for 4-5 minutes or until heated through.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'id': 93606, u'name': u'alfredo sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [], u'step': u'Drain pasta and add to the soup. Sprinkle with pine nuts and cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Waterbrook Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 129, u'instructions': u'Directions                                                                                Cook pasta according to package directions. Meanwhile, in a large saucepan, saute the chicken, spinach, red peppers, rosemary, garlic powder and pepper in butter until spinach is wilted. Stir in the broth, Alfredo sauce and pesto; cook for 4-5 minutes or until heated through.                                                                                           Drain pasta and add to the soup. Sprinkle with pine nuts and cheese.                                        Yield: 5 cups.                                                                                                                         Originally published as Florentine Chicken Soup in  Cooking for 2Fall 2005, p31                                                                                                                                                                                                        Nutritional Facts                                                                             1 cup equals 275 calories, 14 g fat (6 g saturated fat), 44 mg cholesterol, 865 mg sodium, 21 g carbohydrate, 2 g fiber, 17 g protein. Diabetic Exchanges: 2 lean meat, 1-1/2 fat, 1 starch, 1 vegetable.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/florentine-chicken-soup-463330', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}