{u'recipes': [{u'sourceName': u'Oatmeal With a Fork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/666599-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 21, u'id': 666599, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fudgy Double Dark Chocolate Black Bean Cookies (Vegan, GF)', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 44.5, u'creditText': u'Oatmeal With a Fork', u'extendedIngredients': [{u'originalString': u'\xbd t. baking powder or baking soda (baking powder helps to hold the cookies together better, but baking soda gives a better taste to the cookie)', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [u'(baking powder helps to hold the cookies together better, but baking soda gives a better taste to the cookie)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u't'}, {u'originalString': u'2 T. brown rice flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'brown rice flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20090, u'unit': u'T'}, {u'originalString': u'1 15 oz can black beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'6 T. cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19165, u'unit': u'T'}, {u'originalString': u'2 T. olive or melted coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'T'}, {u'originalString': u'4 T. coconut sugar (or another natural granulated sweetener)', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [u'(or another natural granulated sweetener)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 93831, u'unit': u'T'}, {u'originalString': u'\xbc c. chopped dark chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19904, u'unit': u'c'}, {u'originalString': u'2 T. maple syrup or honey', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'T'}, {u'originalString': u'1 T. milk (I like using light coconut milk for its richness and flavor, but any will work)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'light', u'for its richness and flavor, but any will work)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'T'}, {u'originalString': u'\xbd t. sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u't'}, {u'originalString': u'\xbc t. (scant) powdered stevia extract', u'aisle': u'Baking', u'name': u'stevia extract', u'metaInformation': [u'(scant)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 93628, u'unit': u't'}, {u'originalString': u'2 t. vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u't'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.oatmealwithafork.com/2014/02/17/fudgy-double-dark-chocolate-black-bean-cookies-vegan-gf-nut-free/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees.Put all of the ingredients into a food processor in the order listed (except for the chopped chocolate).Process until smooth and well combined (2-3 minutes), scraping down the sides as needed.Using a spoon, scoop the dough out onto a parchment paper-lined cookie sheet (I get 12 decent-sized cookies).Top each cookie with a sprinkle of the chopped dark chocolate.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'id': 19904, u'name': u'dark chocolate'}]}, {u'equipment': [], u'step': u'Bake the cookies for 19-21 minutes.Cool completely. This is VERY important, as it allows the cookies to set and hold together upon being picked up, as they have no binder or gluten.Enjoy!', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 218, u'instructions': u'Preheat the oven to 350 degrees.Put all of the ingredients into a food processor in the order listed (except for the chopped chocolate).Process until smooth and well combined (2-3 minutes), scraping down the sides as needed.Using a spoon, scoop the dough out onto a parchment paper-lined cookie sheet (I get 12 decent-sized cookies).Top each cookie with a sprinkle of the chopped dark chocolate.Bake the cookies for 19-21 minutes.Cool completely. This is VERY important, as it allows the cookies to set and hold together upon being picked up, as they have no binder or gluten.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/fudgy-double-dark-chocolate-black-bean-cookies-vegan-gf-666599', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 26, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}