{u'recipes': [{u'sourceName': u'Moms with Crock Pots', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/629029-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 330, u'id': 629029, u'veryPopular': False, u'lowFodmap': True, u'title': u'Crock Pot Caesar Chicken Wraps', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 193.6, u'creditText': u'Moms with Crock Pots', u'extendedIngredients': [{u'originalString': u'1 cup Caesar dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'caesar dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 43015, u'unit': u'cup'}, {u'originalString': u'\xbd cup shredded Parmesan cheese (Optional)', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded', u'(Optional)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'3 cups chopped green leaf OR romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cups'}, {u'originalString': u'2 pounds boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}, {u'originalString': u'6 large Tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}, {u'originalString': u'\xbd cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://momswithcrockpots.com/2015/02/crock-pot-caesar-chicken-wraps/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Start by spraying the inside of crock pot with cooking spray or put in one of those fancy crock pot liners.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the  cup water inside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the chicken breasts in the water, and cover crock pot with lid.Cook on Low heat 4 - 5 hours. OR on High heat for 2 hours.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Remove chicken from crock pot and shred chicken.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Pour water out of the crock pot.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place shredded chicken back in the crock pot.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the Caesar dressing over the chicken. Stir to combine. Cover with lid, and cook for 30 minutes on low, or until thoroughly heated.Top each tortilla with  cup of lettuce, a little Parmesan cheese, and  cup of Caesar chicken. Wrap up tightly and serve!Use gluten free tortilla and a gluten free caesar dressing', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'id': 43015, u'name': u'caesar salad dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 240, u'instructions': u'Start by spraying the inside of crock pot with cooking spray or put in one of those fancy crock pot liners.Pour the  cup water inside. Place the chicken breasts in the water, and cover crock pot with lid.Cook on Low heat 4 - 5 hours. OR on High heat for 2 hours.Remove chicken from crock pot and shred chicken. Pour water out of the crock pot.Place shredded chicken back in the crock pot. Pour the Caesar dressing over the chicken. Stir to combine. Cover with lid, and cook for 30 minutes on low, or until thoroughly heated.Top each tortilla with  cup of lettuce, a little Parmesan cheese, and  cup of Caesar chicken. Wrap up tightly and serve!Use gluten free tortilla and a gluten free caesar dressing', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-caesar-chicken-wraps-629029', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 335, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}