{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/779023-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 779023, u'veryPopular': True, u'lowFodmap': False, u'title': u'Caramel Filled Rice Krispies Treats', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 77.25, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'16 oz chocolate candy coating', u'aisle': u'Baking', u'name': u'candy coating', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 98857, u'unit': u'oz'}, {u'originalString': u'16 square caramel candies, unwrapped', u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramel candies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'squares', u'unitShort': u'square', u'amount': 16.0, u'consistency': u'solid', u'id': 19074, u'unit': u'square'}, {u'originalString': u'8 Rice Krispies Treats bars (0.78 oz each), unwrapped', u'aisle': u'Cereal', u'name': u'rice krispies cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.24, u'consistency': u'solid', u'id': 8065, u'unit': u'oz'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.tasteandtellblog.com/caramel-filled-rice-krispies-treats/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Using a sharp knife, cut each of the Rice Krispies Treats bars in half to form 2 thinner bars.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place the caramel candies on a microwave safe plate and microwave on high for 10-15 seconds, just until pliable. Using your hands, flatten 2 of the candies to be the same size as the cut side of the Rice Krispies Treat bar.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel candy'}]}, {u'equipment': [], u'step': u'Place the caramel on the bar, then place the second half on the top so that the caramel is sandwiched in the middle. Repeat with the remaining bars and candies.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}, {u'equipment': [], u'step': u'Heat the candy coating according to the package directions. Using 2 forks, dip each of the caramel filled Rice Krispies Treats into the chocolate, coating all sides.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 98857, u'name': u'almond bark'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Let the excess coating drip off, then place on a sheet of parchment paper or waxed paper and allow the candy coating to harden.If giving the treats as gifts, wrap individually in plastic wrap and place them in a box or bag.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 98857, u'name': u'almond bark'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Rice Crispy Treats. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1380, u'instructions': u'Using a sharp knife, cut each of the Rice Krispies Treats bars in half to form 2 thinner bars.Place the caramel candies on a microwave safe plate and microwave on high for 10-15 seconds, just until pliable. Using your hands, flatten 2 of the candies to be the same size as the cut side of the Rice Krispies Treat bar. Place the caramel on the bar, then place the second half on the top so that the caramel is sandwiched in the middle. Repeat with the remaining bars and candies.Heat the candy coating according to the package directions. Using 2 forks, dip each of the caramel filled Rice Krispies Treats into the chocolate, coating all sides. Let the excess coating drip off, then place on a sheet of parchment paper or waxed paper and allow the candy coating to harden.If giving the treats as gifts, wrap individually in plastic wrap and place them in a box or bag.', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-filled-rice-krispies-treats-779023', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}