{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/742350-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 188, u'id': 742350, u'veryPopular': False, u'lowFodmap': False, u'title': u'Girdlebuster Pie', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 158.79, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'tablespoons'}, {u'originalString': u'3 ounces (75g) soft butter, plus 3 ounces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'2 ounces (50g) dark chocolate pieces or chips', u'aisle': u'Sweet Snacks', u'name': u'candy coated chocolate pieces', u'metaInformation': [u'dark'], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19157, u'unit': u'g'}, {u'originalString': u'13 ounces (375g) digestive biscuits', u'aisle': u'Sweet Snacks', u'name': u'digestive biscuits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/digestive-biscuits.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 375.0, u'consistency': u'solid', u'id': 18173, u'unit': u'g'}, {u'originalString': u'1/2 cup (125ml) double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 125.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'10 1/2 ounces (300g) golden syrup', u'aisle': u'Baking', u'name': u'golden syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 93829, u'unit': u'g'}, {u'originalString': u'4 1/2 cups (1 litre) coffee ice cream', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'litre', u'unitShort': u'litre', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'litre'}, {u'originalString': u'3 1/2 ounces (100g) packed light muscovado sugar', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'g'}, {u'originalString': u'2 ounces (50g) milk chocolate pieces or chips', u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19081, u'unit': u'g'}, {u'originalString': u'1/4 teaspoon maldon salt or pinch table salt, optional', u'aisle': u'Spices and Seasonings', u'name': u'table salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/nigella-lawson/girdlebuster-pie-recipe2.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'In a food processor, process the biscuits with the 3 ounces of the soft butter and the chocolate pieces or chips until it forms a damp but still crumb-like clump. Press into a 9-inch (23cm) pie plate or flan dish. Form a lip of biscuit dough a little higher than the plate or dish if you can. This process takes patience as you need, ideally, to form a smooth even layer. Sorry. Freeze this biscuit-lined layer for about 1 hour so it gets really hard. In the meantime, let your ice cream soften, in the refrigerator, just until it can be scooped.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Spread the ice cream into the hard biscuit-lined dish to form a layer. Then cover in cling film and return to the freezer.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the syrup, sugar, remaining 3 ounces of butter and the salt, if using, into a saucepan and let it melt over low to medium heat, before turning it up and boiling for 5 minutes. Turn off the heat and add the bourbon, letting it hiss in the pan.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the cream and stir to mix into a sauce, then remove from the heat and let cool. Once the sauce is cool, but not set cold, pour it over the pie to cover the ice cream layer and then put it back in the freezer. Once frozen, cover with cling film again.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'When ready to serve, remove the pie from the freezer, take the whole pie out of its dish and cut into slices. Should you have any pie leftover, slip it quickly back into the dish and return, covered with cling film, to the freezer.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie can be paired with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Vineyards Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 25 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'pineapple , apple , orange blossom', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'In a food processor, process the biscuits with the 3 ounces of the soft butter and the chocolate pieces or chips until it forms a damp but still crumb-like clump. Press into a 9-inch (23cm) pie plate or flan dish. Form a lip of biscuit dough a little higher than the plate or dish if you can. This process takes patience as you need, ideally, to form a smooth even layer. Sorry. Freeze this biscuit-lined layer for about 1 hour so it gets really hard. In the meantime, let your ice cream soften, in the refrigerator, just until it can be scooped. Spread the ice cream into the hard biscuit-lined dish to form a layer. Then cover in cling film and return to the freezer.                          Put the syrup, sugar, remaining 3 ounces of butter and the salt, if using, into a saucepan and let it melt over low to medium heat, before turning it up and boiling for 5 minutes. Turn off the heat and add the bourbon, letting it hiss in the pan. Add the cream and stir to mix into a sauce, then remove from the heat and let cool. Once the sauce is cool, but not set cold, pour it over the pie to cover the ice cream layer and then put it back in the freezer. Once frozen, cover with cling film again.                          When ready to serve, remove the pie from the freezer, take the whole pie out of its dish and cut into slices. Should you have any pie leftover, slip it quickly back into the dish and return, covered with cling film, to the freezer.', u'spoonacularSourceUrl': u'https://spoonacular.com/girdlebuster-pie-742350', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 218, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}