{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522260-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 7, u'id': 522260, u'veryPopular': False, u'lowFodmap': True, u'title': u'Omelets with Goat Cheese and Raspberries', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 384.04, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'1 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'8 oz cheese (use a cheese that is compatible with fruit; I like Brie, Goat Cheese or Cream Cheese).', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'with fruit; i like brie, goat cheese or cream cheese).'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'oz'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups fresh fruit', u'aisle': u'Produce', u'name': u'fresh fruit', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9431, u'unit': u'cups'}, {u'originalString': u'2-4 Tbsp Sugar or Maple Syrup to taste', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'Tbsp'}, {u'originalString': u'1 & 1/2 Tbsp water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tbsp'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.creative-culinary.com/omelets-with-goat-cheese-and-raspberries/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Beat the eggs in a medium bowl with a fork until well blended; add the water and beat just to incorporate.Melt the butter in a cast iron or non stick skillet; skillet should be hot; pour in the eggs.Immediately turn down the heat to low; cover and do not open the pan for 5 minutes', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'When the eggs appear cooked (the center is not jiggly), spread or crumple half the cheese on one side of the omelet. Cover and turn off the heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Let set for one minute or as long as it takes to melt the cheese; then fold the omelet in half to encase the cheese inside the egg.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove enough fresh berries to garish the tops of the omelet.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Put the remaining fruit into a processor or use a stick blender and blend until smooth. Strain if desired to remove seeds.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fruit'}]}, {u'equipment': [], u'step': u'Add either sugar or maple syrup to taste to sweeten.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [], u'step': u'Cut in half, top with fresh fruit, fruit sauce and garnish with powdered sugar if desired.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fresh fruit'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-fruit.jpg', u'id': 9431, u'name': u'fruit'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine are great choices for Omelet. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. One wine you could try is Perrier-Jouet Belle Epoque. It has 4.4 out of 5 stars and a bottle costs about 129 dollars.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'The 1996 vintage was superb for the Champagne region, yielding ripe, balanced, clean fruit with excellent flavors. A blend of approximately half Chardonnay and half Pinot Noir this crystal bright, light-bodied Champagne is elegant and distinctive. Opening with aromas of fresh pineapple, lemon and white florals, warming into complex scents of pear. A rich bouquet of white fruits end in subtle notes of honey and vanilla. The bead is intense with brisk effervescence, swirling up into a generous and persistent mousse. It is a balanced, extremely refined wine that, if properly stored, should keep for years, especially if bottled in magnums or jeroboams.Beyond the toasts and ship launchings, Champagne has a place at every dinner table. The 1996 Fleur de Champagne pairs is the perfect wine to serve with smoked oysters, game hens, delicate Japanese fish dishes, Fettuccini Alfredo or risotto. After a patient search for a master glassmaker capable of reproducing a bottle with the 1902 Gall\xe9 design, Perrier Jou\xebt launched in 1969, its famous "flower bottle" with an arabesque design of anemones. The first bottles of Fleur de Champagne revealed a Champagne of vivacious delicacy, the epitome of the refined and engaging style of the Art Nouveau movement.  Since then, it has been the signature Champagne of Perrier Jou\xebt and is considered one of the world\'s most celebrated Champagnes. View More', u'title': u'Perrier-Jouet Belle Epoque', u'price': u'$129.0', u'id': 433586, u'link': u'https://www.wine.com/product/perrier-jouet-belle-epoque-1996/7383', u'imageUrl': u'https://spoonacular.com/productImages/433586-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Beat the eggs in a medium bowl with a fork until well blended; add the water and beat just to incorporate.Melt the butter in a cast iron or non stick skillet; skillet should be hot; pour in the eggs.Immediately turn down the heat to low; cover and do not open the pan for 5 minutesWhen the eggs appear cooked (the center is not jiggly), spread or crumple half the cheese on one side of the omelet. Cover and turn off the heat.Let set for one minute or as long as it takes to melt the cheese; then fold the omelet in half to encase the cheese inside the egg.Remove enough fresh berries to garish the tops of the omelet.Put the remaining fruit into a processor or use a stick blender and blend until smooth. Strain if desired to remove seeds.Add either sugar or maple syrup to taste to sweeten. Cut in half, top with fresh fruit, fruit sauce and garnish with powdered sugar if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/omelets-with-goat-cheese-and-raspberries-522260', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}