{u'recipes': [{u'sourceName': u'Table', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/585010-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 585010, u'veryPopular': False, u'lowFodmap': True, u'title': u'Skinny Chocolate Peanut Butter Banana Ice Cream', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 38.47, u'creditText': u'Table', u'extendedIngredients': [{u'originalString': u'2 bananas, chopped and frozen', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'frozen', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 tbsp cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16098, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp pecans, chopped', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'tbsp'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://table.io/chocolate-peanut-butter-banana-ice-cream/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the bananas, peanut butter, and cocoa powder to a blender. Pulse until smooth. Top with pecans and chocolate syrup, if desired.For a soft ice cream, serve immediately. For a firm ice cream, transfer the ice cream back to the freezer for at least an hour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}], u'name': u''}], u'aggregateLikes': 71, u'instructions': u'Add the bananas, peanut butter, and cocoa powder to a blender. Pulse until smooth. Top with pecans and chocolate syrup, if desired.For a soft ice cream, serve immediately. For a firm ice cream, transfer the ice cream back to the freezer for at least an hour.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-chocolate-peanut-butter-banana-ice-cream-585010', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}