{u'recipes': [{u'sourceName': u'How Sweet Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/525108-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 525108, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crockpot Cheesesteak Pulled Chicken', u'diets': [], u'pricePerServing': 363.38, u'creditText': u'How Sweet Eats', u'extendedIngredients': [{u'originalString': u'8 ounces of your favorite beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'ounces'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 green peppers, sliced', u'aisle': u'Produce', u'name': u'green peppers', u'metaInformation': [u'green', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 pounds boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}, {u'originalString': u'2 teaspoons smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoons'}, {u'originalString': u'whole grain buns, toasted', u'aisle': u'Bakery/Bread', u'name': u'sub buns', u'metaInformation': [u'whole', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u'servings'}, {u'originalString': u'2 sweet onions, sliced', u'aisle': u'Produce', u'name': u'sweet onions', u'metaInformation': [u'sweet', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'8 ounces freshly grated white cheddar cheese', u'aisle': u'Cheese', u'name': u'white cheddar cheese', u'metaInformation': [u'white', u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-block.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1011009, u'unit': u'ounces'}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.howsweeteats.com/2013/05/crockpot-cheesesteak-pulled-chicken/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Season chicken breasts with salt, pepper and paprika.In the bottom of your crockpot, layer peppers and onions.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add garlic evenly over top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place chicken on top and then pour in beer. Cover and cook for 6-8 hours on low. Around 6 hours, I like to begin shredding my chicken using forks or kitchen tongs. About 15 minutes before serving, completely shred chicken and toss thoroughly to coat. Keep mixing and tossing to combine the chicken, peppers and onions and all of the liquid should become absorbed. Stir in the grated cheese then turn your crockpot to the "warm" setting (or simply turn it off and keep it covered) and cover for 5 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [], u'step': u'Serve!', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 5903, u'instructions': u'Season chicken breasts with salt, pepper and paprika.In the bottom of your crockpot, layer peppers and onions. Add garlic evenly over top. Place chicken on top and then pour in beer. Cover and cook for 6-8 hours on low. Around 6 hours, I like to begin shredding my chicken using forks or kitchen tongs. About 15 minutes before serving, completely shred chicken and toss thoroughly to coat. Keep mixing and tossing to combine the chicken, peppers and onions and all of the liquid should become absorbed. Stir in the grated cheese then turn your crockpot to the "warm" setting (or simply turn it off and keep it covered) and cover for 5 minutes. Serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/crockpot-cheesesteak-pulled-chicken-525108', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 480, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}