{u'recipes': [{u'sourceName': u'Vickiben Singer', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610305-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 610305, u'veryPopular': False, u'lowFodmap': False, u'title': u'Death by Chocolate Oreo Cheesecake Cake', u'diets': [], u'pricePerServing': 246.28, u'creditText': u'Vickiben Singer', u'extendedIngredients': [{u'originalString': u'\xbd cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'20 ounces bar cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'24 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 box Devils Food Chocolate Cake mix (no pudding added)', u'aisle': u'Baking', u'name': u'angel food cake mix', u'metaInformation': [u'(no pudding added)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18087, u'unit': u'box'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'6 coarsely crushed Oreo sandwich cookies', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'1 1/2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'2 1/2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'12 oz. package semi-sweet chocolate chips, melted', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'oz'}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'3/4 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'12 Tbsp. unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 12.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}, {u'originalString': u'1/2 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'3.4 oz. Package of Vanilla Instant Pudding mix', u'aisle': u'Baking', u'name': u'vanilla instant pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'solid', u'id': 19206, u'unit': u'oz'}, {u'originalString': u'\xbd cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.vickibensinger.com/2014/07/death-by-chocolate-oreo-cheesecake-cake-2.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 62, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'CHEESECAKE:Preheat oven to 325 degrees.**Set a kettle of water to boil for a water bath.Using an electric mixer, beat cream cheese on medium speed until fluffy, scraping down side of bowl as needed. Gradually add sugar, beating until fluffy. Beat in vanilla extract and salt. Beat in eggs, one at a time, scraping down side of bowl after each addition. Beat in sour cream. Fold in crushed Oreos.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut parchment paper in a circle and line the bottom of the cheesecake pan. Wrap bottom half of pan in heavy duty foil.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Pour in batter; place in a roasting pan.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in boiling water to come halfway up side of springform.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Bake until just set in center, about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from water; let cool 20 minutes. Run a paring knife around edge; let cool completely.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Mix first 4 ingredients well.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add Devils Food Chocolate Cake mix, Vanilla Instant Pudding mix, and Chocolate Chips', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'id': 19206, u'name': u'instant vanilla pudding mix'}]}, {u'equipment': [], u'step': u'Mix all together and pour in two 9 round cake pans that have been sprayed with non-stick spray', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350F degrees for 25-30 minutes (at 9,000 feet I baked the cake at 375F degrees for 30 minutes).', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u'Remove outer ring of springform pan, but leave metal bottom. Wrap in plastic wrap and freeze.CHOCOLATE CAKE'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Remove cheesecake from freezer and remove metal bottom. Carefully peel parchment paper off bottom of cheesecake.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove chocolate cake and cream cheese frosting from refrigerator.Lay one 9 chocolate cake round on cake plate.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread a thin layer of frosting over top of cake.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place cheesecake on top spreading another thin layer of frosting on top, then lay final chocolate layer on top of cheesecake placing another thin layer of icing on top of the cake as well as the sides.', u'number': 4, u'ingredients': []}], u'name': u'Let cool 15 minutes then invert on a rack  for best results refrigerate at least an hour before crumb coating.FROSTING Beat cream cheese, 2 1/2 cups powdered sugar, butter, and vanilla.In another bowl whisk cream and 1 1/2 cups powdered sugar to firm peaks. Fold in cream cheese mixture. Chill 1 hour or until firm but spreadable.ASSEMBLE'}], u'aggregateLikes': 119, u'instructions': u'CHEESECAKE:Preheat oven to 325 degrees.**Set a kettle of water to boil for a water bath.Using an electric mixer, beat cream cheese on medium speed until fluffy, scraping down side of bowl as needed. Gradually add sugar, beating until fluffy. Beat in vanilla extract and salt. Beat in eggs, one at a time, scraping down side of bowl after each addition. Beat in sour cream. Fold in crushed Oreos.Cut parchment paper in a circle and line the bottom of the cheesecake pan. Wrap bottom half of pan in heavy duty foil. Pour in batter; place in a roasting pan.Pour in boiling water to come halfway up side of springform. Bake until just set in center, about 45 minutes. Remove pan from water; let cool 20 minutes. Run a paring knife around edge; let cool completely. Remove outer ring of springform pan, but leave metal bottom. Wrap in plastic wrap and freeze.CHOCOLATE CAKE: Mix first 4 ingredients well.Add Devils Food Chocolate Cake mix, Vanilla Instant Pudding mix, and Chocolate ChipsMix all together and pour in two 9 round cake pans that have been sprayed with non-stick sprayBake at 350F degrees for 25-30 minutes (at 9,000 feet I baked the cake at 375F degrees for 30 minutes).Let cool 15 minutes then invert on a rack  for best results refrigerate at least an hour before crumb coating.FROSTING: Beat cream cheese, 2 1/2 cups powdered sugar, butter, and vanilla.In another bowl whisk cream and 1 1/2 cups powdered sugar to firm peaks. Fold in cream cheese mixture. Chill 1 hour or until firm but spreadable.ASSEMBLE: Remove cheesecake from freezer and remove metal bottom. Carefully peel parchment paper off bottom of cheesecake.Remove chocolate cake and cream cheese frosting from refrigerator.Lay one 9 chocolate cake round on cake plate. Spread a thin layer of frosting over top of cake. Place cheesecake on top spreading another thin layer of frosting on top, then lay final chocolate layer on top of cheesecake placing another thin layer of icing on top of the cake as well as the sides.', u'spoonacularSourceUrl': u'https://spoonacular.com/death-by-chocolate-oreo-cheesecake-cake-610305', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}