{u'recipes': [{u'sourceName': u'Recipes Food and Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/513628-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 513628, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Dumpling Soup', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 187.37, u'creditText': u'Recipes Food and Cooking', u'extendedIngredients': [{u'originalString': u'1/2 t. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u't'}, {u'originalString': u'2 T. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'T'}, {u'originalString': u'3 carrots diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery ribs diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'1 3 to 3 1/2 lb. chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'lb'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 C. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'C'}, {u'originalString': u'1 C. chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'C'}, {u'originalString': u'1/2 t. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u't'}, {u'originalString': u'2 T. sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1056, u'unit': u'T'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://recipesfoodandcooking.com/2011/11/10/chicken-dumpling-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the chicken in a 5-6 qt. pan and cover with water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Add vegetables. Cook about 30 minutes over medium heat until chicken is done.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove chicken from pot and cool chicken. When chicken can be handled take the meat from the bones and add bones back to pot and cook 1/2 hour more over medium heat.Strain stock and return to pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Add 2 cups of water, chicken and prepared vegetables. Cook another 20-25 minutes until vegetables are cooked.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Mix up dumplings.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add butter, eggs, sour cream and salt.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix well.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add flour and baking soda. If needed add milk to make dough the consistency of mashed potatoes. Do not overmix or dumplings will be tough.When vegetables are cooked in broth, bring to a boil and add dumplings. Use a teaspoon, they should be quite small.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add all the dumpling mix and cook another 15 minutes. Thicken soup with a roux:4 T. flour6 T. water', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Cook 5 more minutes. Season with salt and pepper.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is District 7 Estate Chardonnay. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 295, u'instructions': u'Put the chicken in a 5-6 qt. pan and cover with water. Add vegetables. Cook about 30 minutes over medium heat until chicken is done. Remove chicken from pot and cool chicken. When chicken can be handled take the meat from the bones and add bones back to pot and cook 1/2 hour more over medium heat.Strain stock and return to pan. Add 2 cups of water, chicken and prepared vegetables. Cook another 20-25 minutes until vegetables are cooked. Mix up dumplings.Add butter, eggs, sour cream and salt. Mix well. Add flour and baking soda. If needed add milk to make dough the consistency of mashed potatoes. Do not overmix or dumplings will be tough.When vegetables are cooked in broth, bring to a boil and add dumplings. Use a teaspoon, they should be quite small. Add all the dumpling mix and cook another 15 minutes. Thicken soup with a roux:4 T. flour6 T. waterCook 5 more minutes. Season with salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-dumpling-soup-513628', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}