{u'recipes': [{u'sourceName': u'She Wears Many Hats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/625057-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 625057, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hoppin John', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 41.49, u'creditText': u'She Wears Many Hats', u'extendedIngredients': [{u'originalString': u'1\xbd cups dried black-eyed peas (note: there will be peas leftover to serve as a side)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black eyed peas', u'metaInformation': [u'dried', u'leftover', u'(note: there will be peas to serve as a side)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-eyed-peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 16063, u'unit': u'cups'}, {u'originalString': u'1 small ham hock (or \xbc lb. hog jowl)', u'aisle': u'Meat', u'name': u'ham hock', u'metaInformation': [u'small', u'(or \xbc lb. hog jowl)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93669, u'unit': u''}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 teaspoon dried red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'dried', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'3 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'5 slices of thick cut bacon (or hog jowl)', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'thick cut', u'(or hog jowl)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 5.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'8 cups water, divided', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'2 cups long-grain white rice, uncooked', u'aisle': u'Pasta and Rice', u'name': u'white rice', u'metaInformation': [u'long-grain', u'white', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://shewearsmanyhats.com/hoppin-john-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Over medium heat, place the dried black-eyed peas, 6 cups of water, salt and ham hock. Cook covered over medium heat until tender.While the peas are cooking, fry the bacon until crisp.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-ham-hocks.jpg', u'id': 93669, u'name': u'ham hock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Remove bacon, crumble and set aside, reserving the bacon grease.Saut chopped onion in the bacon grease until softened.In a large sized sauce pan, with a tight-fitting lid, add the rice, 2 cups of the the pea liquid, 2 cups of water, 2 cups of the cooked black-eyed peas, sauted onions, bacon grease, crumbled bacon and red pepper flakes.Cook covered over medium-low heat until rice is done, about 15-20 minutes. If needed add more pea liquid if rice gets too dry.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sparkling Wine, and Zinfandel are my top picks for Hoppin John. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Chateau Ste. Michelle Dry Riesling. It has 4.5 out of 5 stars and a bottle costs about 10 dollars.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Chateau Ste. Michelle Dry Riesling is a dry, crisp, refreshing style of Riesling with beautiful fruit flavors, crisp acidity and an elegant finish. It offers inviting floral and mandarin aromas with a clean finish. This is an incredibly versatile food wine and my favorite with oysters. View More', u'title': u'Chateau Ste. Michelle Dry Riesling', u'price': u'$9.99', u'id': 443227, u'link': u'https://www.wine.com/product/chateau-ste-michelle-dry-riesling-2012/125428', u'imageUrl': u'https://spoonacular.com/productImages/443227-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'Over medium heat, place the dried black-eyed peas, 6 cups of water, salt and ham hock. Cook covered over medium heat until tender.While the peas are cooking, fry the bacon until crisp. Remove bacon, crumble and set aside, reserving the bacon grease.Saut chopped onion in the bacon grease until softened.In a large sized sauce pan, with a tight-fitting lid, add the rice, 2 cups of the the pea liquid, 2 cups of water, 2 cups of the cooked black-eyed peas, sauted onions, bacon grease, crumbled bacon and red pepper flakes.Cook covered over medium-low heat until rice is done, about 15-20 minutes. If needed add more pea liquid if rice gets too dry.', u'spoonacularSourceUrl': u'https://spoonacular.com/hoppin-john-625057', u'dishTypes': [], u'occasions': [u"new year's eve"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}