{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/213896-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 213896, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesy celeriac, potato & bacon pie', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 167.31, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 smoked streaky bacon rashers, cut into small chunks', u'aisle': u'Meat', u'name': u'bacon rashers', u'metaInformation': [u'smoked', u'small', u'cut into  chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'150ml pot double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'150g Gruy\xe8re, finely sliced', u'aisle': u'Cheese', u'name': u'gruyere', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 1023, u'unit': u'g'}, {u'originalString': u'2 large potatoes, sliced', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'2 x 500g packs puff pastry', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18337, u'unit': u''}, {u'originalString': u'few rosemary sprigs, leaves chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 3.0, u'consistency': u'solid', u'id': 2036, u'unit': u'leaves'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/845645/cheesy-celeriac-potato-and-bacon-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Put the celeriac and potatoes in a largepan, cover with salted water and bring tothe boil. Turn down the heat and simmeruntil just tender, about 5 mins.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Drain,then toss with the cream, rosemaryand seasoning. Set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Roll one of the blocks of pastry untiljust bigger than a large dinner plate, cutinto a neat circle and place onto a flatbaking sheet. Leaving a 3cm border,spread out a layer of celeriac andpotatoes, top with some cheese andbacon, then repeat the layers untilall the ingredients are piled up.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out the second block of pastrylarge enough to completely cover thebottom sheet and filling with someoverhang.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the bottom border witha little of the egg, then drape the pastrysheet over, pushing down to seal theedges. Trim off the excess with a sharpknife and crimp edge together with afork. Can be made a day ahead andchilled before baking or frozen for up to 1month. Defrost completely before baking.Pierce a steam hole in the top of thepie, brush all over with remaining egg andscore the pastry lightly with spoke marks,if you like.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 25 mins until goldenbrown. Stand for 5 mins before serving.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie can be paired with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Snake River Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'honey , minerality , lime', u'title': u'Snake River Late Harvest Riesling', u'price': u'$16.0', u'id': 431450, u'link': u'https://www.amazon.com/2010-Snake-River-Harvest-Riesling/dp/B00GWUM1A4', u'imageUrl': u'https://spoonacular.com/productImages/431450-312x231.jpg'}]}, u'aggregateLikes': 26, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Put the celeriac and potatoes in a largepan, cover with salted water and bring tothe boil. Turn down the heat and simmeruntil just tender, about 5 mins. Drain,then toss with the cream, rosemaryand seasoning. Set aside.Roll one of the blocks of pastry untiljust bigger than a large dinner plate, cutinto a neat circle and place onto a flatbaking sheet. Leaving a 3cm border,spread out a layer of celeriac andpotatoes, top with some cheese andbacon, then repeat the layers untilall the ingredients are piled up.Roll out the second block of pastrylarge enough to completely cover thebottom sheet and filling with someoverhang. Brush the bottom border witha little of the egg, then drape the pastrysheet over, pushing down to seal theedges. Trim off the excess with a sharpknife and crimp edge together with afork. Can be made a day ahead andchilled before baking or frozen for up to 1month. Defrost completely before baking.Pierce a steam hole in the top of thepie, brush all over with remaining egg andscore the pastry lightly with spoke marks,if you like. Bake for 25 mins until goldenbrown. Stand for 5 mins before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-celeriac-potato-bacon-pie-213896', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}