{u'recipes': [{u'sourceName': u'Lemon Sugar', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/579712-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 579712, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lentil & Vegetable Stew', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 83.25, u'creditText': u'Lemon Sugar', u'extendedIngredients': [{u'originalString': u'1 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 large carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 ribs celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'ribs', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'ribs'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups dry lentils, washed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'lentils', u'metaInformation': [u'dry', u'washed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16069, u'unit': u'cups'}, {u'originalString': u'3 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'1 large russet potato, chopped', u'aisle': u'Produce', u'name': u'russet potato', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'3 Tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoons'}, {u'originalString': u'8 cups vegetable (or beef or chicken) stock, low sodium', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'low sodium', u'(or beef or chicken)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'2 yellow onions, chopped', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://lemon-sugar.com/2013/01/lentil-vegetable-stew.html/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Chop carrots, onion, celery and potato into 1/2 inch pieces.  All vegetables should be cut into similar sized pieces so they cook evenly.Wash and drain lentils.In a large dutch oven, heat olive oil and butter until butter melts.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute onions, celery, carrots and potatoes until onions are soft and translucent, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add lentils, vegetable stock, salt, pepper, garlic powder and paprika.  Simmer for 30-45 minutes or until lentils are tender.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6615, u'name': u'vegetable stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add additional stock or water if needed.Once lentils are tender, add frozen peas and simmer 5 minutes more.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Serve with crusty, buttered bread.Enjoy!', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Chablis, and Malbec are my top picks for Stew. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. The Double Canyon Horse Heaven Hills Cabernet Sauvignon with a 4.2 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'This Cabernet embodies an enticing array of ripe red and black plum, intermixed with notes of fresh red cherry. Characteristic of the appellation and 2014 vintage, the nose offers spiced potpourri with a touch of raspberry preserves. The addition of Syrah leads to a full and rich texture on the mid-palate, further accented by bright acidity from the Petit Verdot, sweet red fruit from the Merlot and luscious blackberry notes supplied by the Malbec. The soft and supple mouthfeel is supported by the complexity of sweet oak tannins and fresh fruit character, finishing with the juicy acidity that is characteristic of Horse Heaven Hills.', u'title': u'Double Canyon Horse Heaven Hills Cabernet Sauvignon', u'price': u'$19.99', u'id': 441790, u'link': u'https://www.wine.com/product/double-canyon-horse-heaven-hills-cabernet-sauvignon-2014/160719', u'imageUrl': u'https://spoonacular.com/productImages/441790-312x231.jpg'}]}, u'aggregateLikes': 27, u'instructions': u'Chop carrots, onion, celery and potato into 1/2 inch pieces.  All vegetables should be cut into similar sized pieces so they cook evenly.Wash and drain lentils.In a large dutch oven, heat olive oil and butter until butter melts.Saute onions, celery, carrots and potatoes until onions are soft and translucent, about 5 minutes.Add lentils, vegetable stock, salt, pepper, garlic powder and paprika.  Simmer for 30-45 minutes or until lentils are tender.  Add additional stock or water if needed.Once lentils are tender, add frozen peas and simmer 5 minutes more.Serve with crusty, buttered bread.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/lentil-vegetable-stew-579712', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}