{u'recipes': [{u'sourceName': u'Healthy Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610703-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 610703, u'veryPopular': False, u'lowFodmap': False, u'title': u'Steak Sandwiches with Spinach + Strawberry Salad', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 308.03, u'creditText': u'Healthy Delicious', u'extendedIngredients': [{u'originalString': u'4 cups baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'3 tablespoons balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup blue cheese crumbles', u'aisle': u'Cheese', u'name': u'blue cheese crumbles', u'metaInformation': [u'blue'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001004, u'unit': u'cup'}, {u'originalString': u'1 tablespoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'1 loaf ciabatta , or other crusty bread', u'aisle': u'Bakery/Bread', u'name': u'ciabatta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 93655, u'unit': u'loaf'}, {u'originalString': u'2 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 small red onion, thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 pound boneless sirloin, trimmed', u'aisle': u'Meat', u'name': u'sirloin', u'metaInformation': [u'boneless', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sirloin-raw.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23625, u'unit': u'pound'}, {u'originalString': u'\xbc cup Marzetti Simply Dressed Champagne Dressing', u'aisle': u'Alcoholic Beverages', u'name': u'champagne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10043155, u'unit': u'cup'}, {u'originalString': u'3 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'\xbd pint strawberries, chopped', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 0.5, u'consistency': u'solid', u'id': 9316, u'unit': u'pint'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.healthy-delicious.com/2014/08/steak-sandwiches-with-wilted-spinach-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a shallow dish, whisk together the soy sauce, balsamic vinegar, brown sugar, and garlic.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add the steak, turning to coat. Cover and let rest 15 minutes. (You can also refrigerate the steaks in the marinade for up to 8 hours.)Grill over medium-high heat for 4-5 minutes on each side, or until cooked to our desired level of doneness.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer to a cutting board; cover loosely with foil and let rest 10 minutes. Slice thinly, across the grain.While the steak rests, heat the olive oil in a large skillet.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onions and cook, stirring frequently, until soft, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the spinach and cook one minute, or until just wilted.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a serving bowl; add the strawberries, blue cheese, and dressing.Slice the ciabatta into 6 sections; split each piece crosswise. Assemble your sandwiches by piling sliced steak on a piece of bread then topping with the spinach salad.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'id': 1004, u'name': u'blue cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta-loaf.jpg', u'id': 93655, u'name': u'ciabatta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is NV The Big Kahuna Merlot. It has 4.5 out of 5 stars and a bottle costs about 7 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'A ripe and rounded Merlot with notes of plum, blackberry, and hint of spice .', u'title': u'NV The Big Kahuna Merlot', u'price': u'$6.99', u'id': 430475, u'link': u'https://www.amazon.com/Big-Kahuna-Merlot-Red-Wine/dp/B01F5XPTUW', u'imageUrl': u'https://spoonacular.com/productImages/430475-312x231.jpg'}]}, u'aggregateLikes': 81, u'instructions': u'In a shallow dish, whisk together the soy sauce, balsamic vinegar, brown sugar, and garlic. Add the steak, turning to coat. Cover and let rest 15 minutes. (You can also refrigerate the steaks in the marinade for up to 8 hours.)Grill over medium-high heat for 4-5 minutes on each side, or until cooked to our desired level of doneness. Transfer to a cutting board; cover loosely with foil and let rest 10 minutes. Slice thinly, across the grain.While the steak rests, heat the olive oil in a large skillet. Add the onions and cook, stirring frequently, until soft, about 5 minutes. Add the spinach and cook one minute, or until just wilted. Transfer to a serving bowl; add the strawberries, blue cheese, and dressing.Slice the ciabatta into 6 sections; split each piece crosswise. Assemble your sandwiches by piling sliced steak on a piece of bread then topping with the spinach salad.', u'spoonacularSourceUrl': u'https://spoonacular.com/steak-sandwiches-with-spinach-+-strawberry-salad-610703', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"mother's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}