{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/698912-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 698912, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Chicken Broth', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 35, u'pricePerServing': 279.98, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'4 medium carrots, peeled and cut into 2-inch pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'peeled', u'cut into 2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'4 stalks celery, (with leaves), trimmed and cut into 2-inch pieces', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'with leaves), trimmed and cut into 2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 4.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'1 3-pound chicken, (or use parts, such as wings and backs)', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u' such as wings and backs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'pound'}, {u'originalString': u'1 small bunch fresh parsley, washed', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'washed', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'bunch'}, {u'originalString': u'6 sprigs fresh thyme, or 1 teaspoon dried', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'dried', u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 6.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'6 cloves garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon kosher salt, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 medium onion, peeled and quartered', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'peeled', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 quarts cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'quarts'}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/homemade_chicken_broth.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine chicken, celery, carrots, onion, garlic, parsley, thyme, salt and water in a large stockpot and bring to a boil over medium-high heat. Reduce heat to medium-low and simmer, partially covered, until the chicken is falling apart, about 2 hours. Skim the foam from the surface as it builds up.Strain the broth through a large sieve or colander into a large bowl. Use a wooden spoon to press on the solids to extract as much of the broth as possible. Divide the broth among several shallow containers so it will cool quickly. Cover loosely and refrigerate overnight. Use a spoon to remove the fat that congeals on the surface.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 46, u'instructions': u'Combine chicken, celery, carrots, onion, garlic, parsley, thyme, salt and water in a large stockpot and bring to a boil over medium-high heat. Reduce heat to medium-low and simmer, partially covered, until the chicken is falling apart, about 2 hours. Skim the foam from the surface as it builds up.Strain the broth through a large sieve or colander into a large bowl. Use a wooden spoon to press on the solids to extract as much of the broth as possible. Divide the broth among several shallow containers so it will cool quickly. Cover loosely and refrigerate overnight. Use a spoon to remove the fat that congeals on the surface.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-chicken-broth-698912', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 155, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}