{u'recipes': [{u'sourceName': u'The Messy Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573882-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 573882, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lavender Honey Chicken', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 133.98, u'creditText': u'The Messy Baker', u'extendedIngredients': [{u'originalString': u'1 heaping tablespoon fresh tarragon, finely minced', u'aisle': u'Produce', u'name': u'fresh tarragon', u'metaInformation': [u'fresh', u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'tablespoon'}, {u'originalString': u'6 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon dried lavender buds', u'aisle': u'Gourmet', u'name': u'lavender', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93811, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup Madeira (dry sherry, dry port or dry Vermouth will do just as well)', u'aisle': u'Alcoholic Beverages', u'name': u'madeira', u'metaInformation': [u'dry', u'well', u'( sherry, port or Vermouth will do just as )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10014106, u'unit': u'cup'}, {u'originalString': u'freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'\xbc cup toasted pine nuts, optional', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'freshly ground sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://themessybaker.com/2014/01/27/lavender-honey-chicken-2/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'In a small saucepan over medium-high heat, bring the Madeira, lavender and honey to a boil. Reduce the heat to a simmer and cook for a few minutes or until the sauce smells fragrant and thickens slightly. Set aside for 30 to 60 minutes for the lavender to permeate the honey while you prepare the rest of the meal. Stir in a good grinding of salt and pepper.Preheat the oven to 400\xb0F and place a rack in the middle of the oven.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender.jpg', u'id': 93811, u'name': u'fresh lavender'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 10014106, u'name': u'madeira'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place the chicken breasts in a shallow baking dish, skin-side up.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Pour the lavender honey sauce over the chicken and cook for 45 to 60 minutes, basting once or twice. The timing will vary with the size of the chicken breasts but a meat thermometer inserted into the thickest part of the breast should read 165\xb0F.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lavender-honey.jpg', u'id': 10019296, u'name': u'lavender honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Serve drizzled with some of the pan sauce, a sprinkling of tarragon and pine nuts, if using.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}]}], u'name': u''}], u'aggregateLikes': 153, u'instructions': u'In a small saucepan over medium-high heat, bring the Madeira, lavender and honey to a boil. Reduce the heat to a simmer and cook for a few minutes or until the sauce smells fragrant and thickens slightly. Set aside for 30 to 60 minutes for the lavender to permeate the honey while you prepare the rest of the meal. Stir in a good grinding of salt and pepper.Preheat the oven to 400\xb0F and place a rack in the middle of the oven.Place the chicken breasts in a shallow baking dish, skin-side up. Pour the lavender honey sauce over the chicken and cook for 45 to 60 minutes, basting once or twice. The timing will vary with the size of the chicken breasts but a meat thermometer inserted into the thickest part of the breast should read 165\xb0F.Serve drizzled with some of the pan sauce, a sprinkling of tarragon and pine nuts, if using.', u'spoonacularSourceUrl': u'https://spoonacular.com/lavender-honey-chicken-573882', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}