{u'recipes': [{u'sourceName': u'The Comfort of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/590742-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590742, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peach and Mint Iced Tea', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 48.09, u'creditText': u'The Comfort of Cooking', u'extendedIngredients': [{u'originalString': u'2 small bunches fresh mint sprigs', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'fresh', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'bunches', u'unitShort': u'bunches', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'bunches'}, {u'originalString': u'3 ripe peaches, sliced', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'ripe', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'2 tbsp. sugar, optional', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'6 tea bags', u'aisle': u'Tea and Coffee', u'name': u'tea bags', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10111111, u'unit': u''}, {u'originalString': u'8 cups boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.thecomfortofcooking.com/2010/07/peach-and-mint-iced-tea.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Set 8 cups of water to boil in a medium saucepan. Once boiling, remove from heat, add tea bags and let steep for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 10111111, u'name': u'tea bag'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove and discard the bags.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add sliced peaches, mint and sugar, if desired.Allow the tea to cool to room temperature.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Pour tea into a large pitcher and refrigerate.Before serving, add additional peaches and mint and pour over ice.Enjoy!', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 81, u'instructions': u'Set 8 cups of water to boil in a medium saucepan. Once boiling, remove from heat, add tea bags and let steep for 20 minutes. Remove and discard the bags. Add sliced peaches, mint and sugar, if desired.Allow the tea to cool to room temperature. Pour tea into a large pitcher and refrigerate.Before serving, add additional peaches and mint and pour over ice.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/peach-and-mint-iced-tea-590742', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}