{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/761297-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 761297, u'veryPopular': False, u'lowFodmap': False, u'title': u'Classic Cheese Fondue', u'diets': [], u'pricePerServing': 438.99, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 to 2 loaves French bread, cubed', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'french', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18064, u'unit': u''}, {u'originalString': u'2 dozen bread sticks', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 18064, u'unit': u''}, {u'originalString': u'2\xbd cups Chardonnay or other dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'chardonnay', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 14160, u'unit': u'cups'}, {u'originalString': u'2 Tbs. cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'Tbs'}, {u'originalString': u'1 lb. Emmenthaler cheese, shredded, about 4 cups', u'aisle': u'Cheese', u'name': u'emmenthaler cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1040, u'unit': u'lb'}, {u'originalString': u'1 clove garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 lb. Gruy\xe8re cheese, shredded, about 4 cups', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1023, u'unit': u'lb'}, {u'originalString': u'2 Tbs. Kirsch, optional', u'aisle': u'Alcoholic Beverages', u'name': u'kirsch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 10614037, u'unit': u'Tbs'}, {u'originalString': u'1 loaf unsliced pumpernickel, cubed', u'aisle': u'Bakery/Bread', u'name': u'pumpernickel', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpernickel.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18044, u'unit': u'loaf'}, {u'originalString': u'\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/classic-cheese-fondue/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wine Suggestions', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'When a recipe calls for wine as an ingredient, try cooking with the wine you will drink with the finished dish—in this case, Chardonnay. In addition to the bread, offer Chardonnay-friendly foods for dipping, such as mushrooms, squashes, roasted peppers and potatoes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14160, u'name': u'chardonnay'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}], u'name': u''}], u'aggregateLikes': 40, u'instructions': u'Wine SuggestionsWhen a recipe calls for wine as an ingredient, try cooking with the wine you will drink with the finished dish—in this case, Chardonnay. In addition to the bread, offer Chardonnay-friendly foods for dipping, such as mushrooms, squashes, roasted peppers and potatoes.', u'spoonacularSourceUrl': u'https://spoonacular.com/classic-cheese-fondue-761297', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}