{u'recipes': [{u'sourceName': u'Everyday Home Cook', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/530401-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 530401, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Enchiladas', u'diets': [], u'pricePerServing': 133.07, u'creditText': u'Everyday Home Cook', u'extendedIngredients': [{u'originalString': u'1 cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1 cup cooked long grain rice', u'aisle': u'Pasta and Rice', u'name': u'cooked long grain rice', u'metaInformation': [u'long grain', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cup'}, {u'originalString': u'8 10" flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'1/4 cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 7-oz can chopped green chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'green', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 31015, u'unit': u'oz'}, {u'originalString': u'2 10-oz cans green enchilada sauce, divided', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'green enchilada sauce', u'metaInformation': [u'green', u'divided', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 6599, u'unit': u'oz'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups shredded Monterey Jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001025, u'unit': u'cups'}, {u'originalString': u'1/4 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 plum tomatoes, chopped', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'3 cups cubed cooked turkey (or chicken)', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'cubed', u'cooked', u'(or chicken)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 5165, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.everydayhomecook.com/2011/06/turkey-enchiladas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine first 10 ingredients (all except tortillas, enchilada sauce, and cheese) in a medium saucepan.  Bring to a boil.  Reduce heat and simmer uncovered for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Remove from heat.Divide turkey mixture evenly among tortillas (~1/2 cup each).  Top each with 1 teaspoon enchilada sauce, then 1 tablespoon cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll up and place seam side down in a greased 13?x9? pan.  Top with remaining enchilada sauce, then cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake, uncovered, in a preheated 350 degree F oven for about 20 minutes, until bubbly and cheese is melted.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Enchilada. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Beaux Freres The Beaux Freres Vineyard Pinot Noir. It has 4.1 out of 5 stars and a bottle costs about 56 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Shows dark plum/garnet with some amber and orange at the edge. The nose shows roasted herbs and meatiness with some background notes of sweet cherry, truffle and vegetal qualities. This is a distinctive Pinot Noir with aromatics that are very old-world. In the mouth the wine has always had a certain austerity but a bit of a gap in the middle. The wine has held up nicely over time but has never really developed the sweetness and charm that we would expect of our best Pinot Noirs. View More', u'title': u'Beaux Freres The Beaux Freres Vineyard Pinot Noir', u'price': u'$55.99', u'id': 445451, u'link': u'https://www.wine.com/product/beaux-freres-the-beaux-freres-vineyard-pinot-noir-1996/126352', u'imageUrl': u'https://spoonacular.com/productImages/445451-312x231.jpg'}]}, u'aggregateLikes': 147, u'instructions': u'Combine first 10 ingredients (all except tortillas, enchilada sauce, and cheese) in a medium saucepan.  Bring to a boil.  Reduce heat and simmer uncovered for 20 minutes.  Remove from heat.Divide turkey mixture evenly among tortillas (~1/2 cup each).  Top each with 1 teaspoon enchilada sauce, then 1 tablespoon cheese.  Roll up and place seam side down in a greased 13?x9? pan.  Top with remaining enchilada sauce, then cheese.Bake, uncovered, in a preheated 350 degree F oven for about 20 minutes, until bubbly and cheese is melted.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-enchiladas-530401', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}