{u'recipes': [{u'sourceName': u'Cravings of a Lunatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/604408-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 604408, u'veryPopular': False, u'lowFodmap': False, u'title': u'Garlic Scape Pesto #FarmFreshFridays', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 39.8, u'creditText': u'Cravings of a Lunatic', u'extendedIngredients': [{u'originalString': u'1/4 almonds (you could use pistachios, pine nuts or walnuts)', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'(you could use pistachios, pine nuts or walnuts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 12061, u'unit': u''}, {u'originalString': u'10 fresh basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'1 cup garlic scapes, cut into pieces', u'aisle': u'Produce', u'name': u'garlic scapes', u'metaInformation': [u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-scapes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93750, u'unit': u'cup'}, {u'originalString': u'1/2 cup good quality olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/4 cup parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.cravingsofalunatic.com/2014/07/garlic-scape-pesto.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Combine the basil leaves, garlic scapes, and almonds in a food processor. Pulse until everything is broken up into small chunks.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-scapes.jpg', u'id': 93750, u'name': u'garlic scapes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the parmesan cheese, salt and white pepper. Pulse briefly. Turn the food processor on and slowly add the olive oil until the pesto is the consistency you like.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Remove and transfer to an air tight container, pop in the fridge until needed.Or just shove it all in your mouth immediately, whatever works for you.You can use this over pasta, crostini, sandwiches or for dip for some great crackers. However you use it make lots because it will be gobbled up quickly.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with a big old garlic scape loving smile!', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 33, u'instructions': u'Combine the basil leaves, garlic scapes, and almonds in a food processor. Pulse until everything is broken up into small chunks. Add the parmesan cheese, salt and white pepper. Pulse briefly. Turn the food processor on and slowly add the olive oil until the pesto is the consistency you like. Remove and transfer to an air tight container, pop in the fridge until needed.Or just shove it all in your mouth immediately, whatever works for you.You can use this over pasta, crostini, sandwiches or for dip for some great crackers. However you use it make lots because it will be gobbled up quickly. Serve with a big old garlic scape loving smile!', u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-scape-pesto-farmfreshfridays-604408', u'dishTypes': [u'condiment', u'dip', u'sauce', u'spread'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}