{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/245178-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 245178, u'veryPopular': True, u'lowFodmap': False, u'title': u'Green Chile Enchiladas', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 220.36, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'3-4 large Anaheim chiles', u'aisle': u'Produce', u'name': u'anaheim chiles', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10031015, u'unit': u''}, {u'originalString': u'Cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'12 corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'3 cloves garlic, still in their peels', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Canola or grapeseed oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'servings'}, {u'originalString': u'2 jalapenos', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1/2 pound to a pound Monterey Jack cheese, grated (quantity depends on how cheesy you want the enchiladas to be)', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'grated', u'(quantity depends on how cheesy you want the enchiladas to be)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1001025, u'unit': u'pound'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}, {u'originalString': u'1 1/2 pounds tomatillos', u'aisle': u'Produce', u'name': u'tomatillos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11954, u'unit': u'pounds'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/green_chile_enchiladas/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1 Prepare the tomatillo sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'id': 11954, u'name': u'tomatillos'}]}, {u'equipment': [], u'step': u'Remove the husks from the tomatillos.  Rinse off the tomatillos.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'id': 11954, u'name': u'tomatillos'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Cut them in half and place them cut-side down on a roasting pan lined with aluminum foil.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the garlic and jalape\xf1os on the pan with the tomatillos.  Broil on the top rack on the oven for 5-7 minutes until the tomatillos are lightly charred.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'id': 11954, u'name': u'tomatillos'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and let cool to touch.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove garlic from the garlic skins, discard the skins.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Cut open the jalape\xf1os and remove and discard the seeds and the stems.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Place tomatillos, cooked garlic, the jalape\xf1os, and 1 teaspoon of salt in a blender, pulse until well pur\xe9ed. Set aside. (You can make several days in advance and store in the refrigerator.)2 Prepare the Anaheim chiles.  If you have a stove-top gas burner, you can roast the chiles directly over the flame of the burner (see How to roast chile peppers over a gas flame), otherwise use a broiler and broil the chiles in a roasting pan, turning them until they are blackened all over.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 10031015, u'name': u'anaheim pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'id': 11954, u'name': u'tomatillos'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Place the blackened chiles in a small brown paper bag.  Close the bag and let sit for at least 5 minutes.  Then remove the chiles from the bag and peel off and discard the blackened skin. Slice open the chiles and remove and discard the seed pod, any seeds (they're hot!) and the stems.  Slice the chiles into strips.3 Cook the tortillas.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat a couple tablespoons of canola or grapeseed oil in a frying pan (cast iron works well) on medium high heat.  Once the oil is hot, add a corn tortilla to the pan.  The tortilla should sizzle as it hits the pan. Turn it over and let it cook until little pockets of air start to bubble up in the tortilla.  Then use a metal spatula to remove the tortilla from the pan, shaking off any excess oil, to a plate lined with paper towels.  Continue to the tortillas this way, adding more oil as needed, separating the tortillas that are cooling with paper towels.4  Preheat the oven to 350\xb0F.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'id': 18363, u'name': u'corn tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4517, u'name': u'grape seed oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Spread a little of the tomatillo sauce in the bottom of a 9x13 casserole pan.  One by one, place a little grated cheese and a strip or two of green chiles in the center of the tortillas, roll them up, and place them in the casserole.  Once you have filled the casserole with the rolled tortillas, spread the remaining tomatillo sauce over them, and sprinkle with the remaining cheese.5', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'id': 11954, u'name': u'tomatillos'}]}, {u'equipment': [], u'step': u'Bake for 15 minutes at 350\xb0F, until cheese is melted', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with sour cream (thinned with some water) drizzled over, and some chopped fresh cilantro.  Also good with it is thinly sliced iceberg lettuce that has been sprinkled with cider or white vinegar and salt.  Makes for excellent leftovers, will keep in the refrigerator for days.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Enchilada works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Beaux Freres The Beaux Freres Vineyard Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 56 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Shows dark plum/garnet with some amber and orange at the edge. The nose shows roasted herbs and meatiness with some background notes of sweet cherry, truffle and vegetal qualities. This is a distinctive Pinot Noir with aromatics that are very old-world. In the mouth the wine has always had a certain austerity but a bit of a gap in the middle. The wine has held up nicely over time but has never really developed the sweetness and charm that we would expect of our best Pinot Noirs.', u'title': u'Beaux Freres The Beaux Freres Vineyard Pinot Noir', u'price': u'$55.99', u'id': 445451, u'link': u'https://www.wine.com/product/beaux-freres-the-beaux-freres-vineyard-pinot-noir-1996/126352', u'imageUrl': u'https://spoonacular.com/productImages/445451-312x231.jpg'}]}, u'aggregateLikes': 1115, u'instructions': u"1 Prepare the tomatillo sauce.  Remove the husks from the tomatillos.  Rinse off the tomatillos.  Cut them in half and place them cut-side down on a roasting pan lined with aluminum foil.  Place the garlic and jalape\xf1os on the pan with the tomatillos.  Broil on the top rack on the oven for 5-7 minutes until the tomatillos are lightly charred.  Remove from the oven and let cool to touch.  Remove garlic from the garlic skins, discard the skins. Cut open the jalape\xf1os and remove and discard the seeds and the stems.  Place tomatillos, cooked garlic, the jalape\xf1os, and 1 teaspoon of salt in a blender, pulse until well pur\xe9ed. Set aside. (You can make several days in advance and store in the refrigerator.)2 Prepare the Anaheim chiles.  If you have a stove-top gas burner, you can roast the chiles directly over the flame of the burner (see How to roast chile peppers over a gas flame), otherwise use a broiler and broil the chiles in a roasting pan, turning them until they are blackened all over.  Place the blackened chiles in a small brown paper bag.  Close the bag and let sit for at least 5 minutes.  Then remove the chiles from the bag and peel off and discard the blackened skin. Slice open the chiles and remove and discard the seed pod, any seeds (they're hot!) and the stems.  Slice the chiles into strips.3 Cook the tortillas.  Heat a couple tablespoons of canola or grapeseed oil in a frying pan (cast iron works well) on medium high heat.  Once the oil is hot, add a corn tortilla to the pan.  The tortilla should sizzle as it hits the pan. Turn it over and let it cook until little pockets of air start to bubble up in the tortilla.  Then use a metal spatula to remove the tortilla from the pan, shaking off any excess oil, to a plate lined with paper towels.  Continue to the tortillas this way, adding more oil as needed, separating the tortillas that are cooling with paper towels.4  Preheat the oven to 350\xb0F. Spread a little of the tomatillo sauce in the bottom of a 9x13 casserole pan.  One by one, place a little grated cheese and a strip or two of green chiles in the center of the tortillas, roll them up, and place them in the casserole.  Once you have filled the casserole with the rolled tortillas, spread the remaining tomatillo sauce over them, and sprinkle with the remaining cheese.5 Bake for 15 minutes at 350\xb0F, until cheese is meltedServe with sour cream (thinned with some water) drizzled over, and some chopped fresh cilantro.  Also good with it is thinly sliced iceberg lettuce that has been sprinkled with cider or white vinegar and salt.  Makes for excellent leftovers, will keep in the refrigerator for days.", u'spoonacularSourceUrl': u'https://spoonacular.com/green-chile-enchiladas-245178', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}