{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/605448-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 605448, u'veryPopular': False, u'lowFodmap': True, u'title': u'Kale Salad with Tomato, Pomegranate Seeds, and Feta', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 73.34, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1/2 cup of broccoli slaw with shredded carrots', u'aisle': u'Produce', u'name': u'broccoli slaw', u'metaInformation': [u'shredded', u'with  carrots'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-slaw.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11741, u'unit': u'cup'}, {u'originalString': u'1-2 tbsp feta cheese crumbles', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1019, u'unit': u'tbsp'}, {u'originalString': u'Handful of grape tomatoes, sliced', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'Handful'}, {u'originalString': u'1/2 cup of green cabbage, shredded', u'aisle': u'Produce', u'name': u'green cabbage', u'metaInformation': [u'shredded', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11109, u'unit': u'cup'}, {u'originalString': u'2 cups of kale, chopped', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'2-3 tbsp pomegranate seeds', u'aisle': u'Produce', u'name': u'pomegranate seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9286, u'unit': u'tbsp'}, {u'originalString': u'1 cup of romaine, chopped', u'aisle': u'Produce', u'name': u'romaine', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'cup'}, {u'originalString': u"Fran's Vinaigrette (recipe link up above), to taste", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinaigrette', u'metaInformation': [u'to taste', u'(recipe link up above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinaigrette.jpg', u'unitLong': u'link', u'unitShort': u'link', u'amount': 1.0, u'consistency': u'liquid', u'id': 4135, u'unit': u'link'}], u'healthScore': 80.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2014/07/kale-salad-with-tomato-pomegranate-seeds-and-feta.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Make Fran's Vinaigrette - click link up above for recipe. Set aside to allow flavors to mingle.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinaigrette.jpg', u'id': 4135, u'name': u'vinaigrette'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the chopped kale, romaine, broccoli slaw, and green cabbage together in a bowl. Top with the sliced grape tomatoes, pomegranate seeds, and feta cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'id': 9286, u'name': u'pomegranate seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10111529, u'name': u'grape tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-slaw.png', u'id': 11741, u'name': u'broccoli slaw'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'green cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Drizzle the top of the salad with the vinaigrette and toss to coat evenly. Season with a bit of freshly cracked pepper and serve. Enjoy.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinaigrette.jpg', u'id': 4135, u'name': u'vinaigrette'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try NV Mindbender Chardonnay. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u"Make Fran's Vinaigrette - click link up above for recipe. Set aside to allow flavors to mingle.Combine the chopped kale, romaine, broccoli slaw, and green cabbage together in a bowl. Top with the sliced grape tomatoes, pomegranate seeds, and feta cheese. Drizzle the top of the salad with the vinaigrette and toss to coat evenly. Season with a bit of freshly cracked pepper and serve. Enjoy.", u'spoonacularSourceUrl': u'https://spoonacular.com/kale-salad-with-tomato-pomegranate-seeds-and-feta-605448', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}