{u'recipes': [{u'sourceName': u'Kirbie Cravings', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/228523-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 228523, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pure Nutella Mug Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 118.18, u'creditText': u'Kirbie Cravings', u'extendedIngredients': [{u'originalString': u'4 tablespoons all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1/4 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 tablespoons white granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons Nutella', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19125, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://kirbiecravings.com/2012/2012/02/pure-nutella-mug-cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 51, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine all ingredients in an oversized coffee mug.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk well with a small whisk until smooth. Microwave on high for 1 1/2 minutes and then take it out to check to see if it is done. If not, microwave for another 30 seconds. You don’t want to overcook it or it will become rubbery. You can also make this into two smaller-sized mugs. You can mix the batter all in one mug and then pour half into another mug. Make sure you cook each one individually.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 280, u'instructions': u'Combine all ingredients in an oversized coffee mug. Whisk well with a small whisk until smooth. Microwave on high for 1 1/2 minutes and then take it out to check to see if it is done. If not, microwave for another 30 seconds. You don’t want to overcook it or it will become rubbery. You can also make this into two smaller-sized mugs. You can mix the batter all in one mug and then pour half into another mug. Make sure you cook each one individually.', u'spoonacularSourceUrl': u'https://spoonacular.com/pure-nutella-mug-cake-228523', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 7, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}