{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/407588-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 407588, u'veryPopular': False, u'lowFodmap': False, u'title': u'Marinated Steak & Pepper Fajitas', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 192.69, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 pounds beef skirt steaks or flank steak', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'pounds'}, {u'originalString': u'4 garlic cloves, sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4 jalapeno peppers, halved and seeded', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'halved', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1/2 cup lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'1 teaspoon grated lime peel', u'aisle': u'Produce', u'name': u'lime peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup tequila or reduced-sodium beef broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium beef broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10093741, u'unit': u'cup'}, {u'originalString': u'3/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'4 poblano peppers or medium sweet red peppers, halved and seeded', u'aisle': u'Produce', u'name': u'red sweet peppers', u'metaInformation': [u'sweet', u'red', u'medium', u'halved', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup shredded Mexican cheese blend', u'aisle': u'Cheese', u'name': u'shredded mexican cheese blend', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1251, u'unit': u'cup'}, {u'originalString': u'1 large sweet onion, cut crosswise into 3/4-inch-thick slices', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u'slices'}, {u'originalString': u'8 whole wheat tortillas (8 inches), warmed', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'whole wheat tortillas', u'metaInformation': [u'whole wheat', u'warmed', u'(es)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortillas-whole-wheat.jpg', u'unitLong': u'8-inchs', u'unitShort': u'8-inch', u'amount': 8.0, u'consistency': u'solid', u'id': 93675, u'unit': u'8-inch'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/marinated-steak---pepper-fajitas', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, whisk the first seven ingredients until blended. Divide marinade between two large resealable plastic bags.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add peppers and onion to one bag; seal bag and turn gently to coat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut skirt steaks in half and add to the second bag; seal bag and turn to coat. Refrigerate vegetables and beef 8 hours or overnight.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Drain vegetables and beef, discarding marinade. Grill onion and poblanos, covered, over medium heat 4-6 minutes on each side or until tender. Grill jalapenos 2-3 minutes on each side or until crisp-tender. Grill steaks, covered, over medium heat 4-6 minutes on each side or until meat reaches desired doneness (for medium-rare, a thermometer should read 145\xb0; medium, 160\xb0; well-done, 170\xb0).', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}]}, {u'equipment': [], u'step': u'Let steaks stand 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut peppers into strips; coarsely chop onion. Thinly slice steaks across the grain.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve vegetables and beef on tortillas; top with cheese.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Ghost Pines Napa County Sonoma County Merlot with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"Working without sourcing constraints, our winemakers selected Merlot clusters contributing layered flavors of dark berries, licorice and espresso alongside lots of richness, full-bodied structure, and desirable length. In addition to these flavors, you'll taste hints of cigar paper, cocoa, caramel and nutmeg wrapped around a remarkably smooth mid-palate full of velvety texture and depth. On the long finish, you'll find suggestions of toasty oak, mouth-filling black fruit, and cola framed by plush tannins.", u'title': u'Ghost Pines Napa County Sonoma County Merlot', u'price': u'$26.65', u'id': 428399, u'link': u'https://www.amazon.com/Ghost-Pines-County-Sonoma-Merlot/dp/B01A8WOVRW', u'imageUrl': u'https://spoonacular.com/productImages/428399-312x231.jpg'}]}, u'aggregateLikes': 159, u'instructions': u"Directions                                                                                In a small bowl, whisk the first seven ingredients until blended. Divide marinade between two large resealable plastic bags. Add peppers and onion to one bag; seal bag and turn gently to coat. Cut skirt steaks in half and add to the second bag; seal bag and turn to coat. Refrigerate vegetables and beef 8 hours or overnight.                                                                                           Drain vegetables and beef, discarding marinade. Grill onion and poblanos, covered, over medium heat 4-6 minutes on each side or until tender. Grill jalapenos 2-3 minutes on each side or until crisp-tender. Grill steaks, covered, over medium heat 4-6 minutes on each side or until meat reaches desired doneness (for medium-rare, a thermometer should read 145\xb0; medium, 160\xb0; well-done, 170\xb0). Let steaks stand 5 minutes.                                                                                           Cut peppers into strips; coarsely chop onion. Thinly slice steaks across the grain. Serve vegetables and beef on tortillas; top with cheese.                                        Yield: 8 servings.                                                                                                     Editor's Note: Wear disposable gloves when cutting hot peppers; the oils can burn skin. Avoid touching your face.                                                                                                Originally published as Marinated Steak & Pepper Fajitas in  Taste of Home                                                                                                                                                                                                Nutritional Facts                                                                             1 fajita equals 375 calories, 14 g fat (5 g saturated fat), 56 mg cholesterol, 325 mg sodium, 29 g carbohydrate, 4 g fiber, 29 g protein. Diabetic Exchanges: 3 lean meat, 1-1/2 starch, 1 vegetable, 1 fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/marinated-steak-pepper-fajitas-407588', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}