{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/743816-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 743816, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Cheese with Caramelized Onions', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 265.34, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces Gruyere, thinly sliced', u'aisle': u'Cheese', u'name': u'gruyere', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1023, u'unit': u'ounces'}, {u'originalString': u'2 large onions, sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'12 slices rustic Italian bread (each about 1/2-inch thick)', u'aisle': u'Bakery/Bread', u'name': u'rustic bread', u'metaInformation': [u'italian', u'(each 1/)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 12.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'slices'}, {u'originalString': u'2 teaspoons sherry vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sherry vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012068, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'5 tablespoons unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/grilled-cheese-with-caramelized-onions.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the canola oil and 1 tablespoon butter in a large saute pan over medium heat. When the butter is melted, add the onions and cook, stirring occasionally, until dark brown and caramelized, about 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the vinegar, sugar and 2 tablespoons water, scrapping up any dark bits that have accumulated on the bottom of the pan. Continue to cook until all the liquid has evaporated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the onions to a bowl and reserve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Butter 1 side of each bread slice. Lay 6 slices butter-side down on a work surface. Top each with 2 slices of Gruyere, a dollop of the onions and 2 more slices of Gruyere. Top with another slice of bread, butter-side up.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'id': 1023, u'name': u'gruyere'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}], u'step': u'Heat a cast-iron griddle over medium heat.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sandwiches and cook until the cheese begins to melt and the bread is golden brown, 2 to 4 minutes. Flip and continue to cook until golden brown and the cheese is melted through, 2 to 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Cut in half and serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 268, u'instructions': u'Heat the canola oil and 1 tablespoon butter in a large saute pan over medium heat. When the butter is melted, add the onions and cook, stirring occasionally, until dark brown and caramelized, about 25 minutes. Add the vinegar, sugar and 2 tablespoons water, scrapping up any dark bits that have accumulated on the bottom of the pan. Continue to cook until all the liquid has evaporated. Transfer the onions to a bowl and reserve.                          Butter 1 side of each bread slice. Lay 6 slices butter-side down on a work surface. Top each with 2 slices of Gruyere, a dollop of the onions and 2 more slices of Gruyere. Top with another slice of bread, butter-side up.                          Heat a cast-iron griddle over medium heat. Add the sandwiches and cook until the cheese begins to melt and the bread is golden brown, 2 to 4 minutes. Flip and continue to cook until golden brown and the cheese is melted through, 2 to 4 minutes. Cut in half and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-cheese-with-caramelized-onions-743816', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}