{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/201006-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 201006, u'veryPopular': True, u'lowFodmap': False, u'title': u'Dinner for Two: Crispy Broiled Scallops and Chorizo', u'diets': [u'dairy free'], u'pricePerServing': 447.78, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'14 ounces bay scallops', u'aisle': u'Seafood', u'name': u'bay scallops', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 15172, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons panko-style bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'panko-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18079, u'unit': u'tablespoons'}, {u'originalString': u'2 ounces Spanish chorizo, diced to the same size as the scallops', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [u'diced', u'spanish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 7019, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon chopped flat leaf parsley (optional)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/05/dinner-for-two-crispy-broiled-scallops-and-chorizo.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Preheat the broiler to high and adjust rack to 6-inches from element.  Pat the scallops dry with a paper towel.  Toss scallops and chorizo with 2 teaspoons olive oil in a medium bowl and season lightly with salt. Divide mixture evenly between two broiler-safe gratin dishes or one broiler-safe 8- by 8-inch square baking dish. Toss the remaining teaspoon of olive oil with the panko and parsley (if using) in a separate bowl, then top scallop mixture with crumbs. Cover each gratin dish tightly with foil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the dishes on a baking sheet and broil for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove foil, and broil an addition 3 to 4 minutes until the chorizo has blistered and the crumbs are lightly toasted.  Top each dish with a handful of greens lightly tossed with olive oil and salt.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Casa Catelli Pinot Grigio. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food. View More', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 729, u'instructions': u'Procedures                                                                              1                                                                            Preheat the broiler to high and adjust rack to 6-inches from element.  Pat the scallops dry with a paper towel.  Toss scallops and chorizo with 2 teaspoons olive oil in a medium bowl and season lightly with salt. Divide mixture evenly between two broiler-safe gratin dishes or one broiler-safe 8- by 8-inch square baking dish. Toss the remaining teaspoon of olive oil with the panko and parsley (if using) in a separate bowl, then top scallop mixture with crumbs. Cover each gratin dish tightly with foil. Place the dishes on a baking sheet and broil for 10 minutes.  Remove foil, and broil an addition 3 to 4 minutes until the chorizo has blistered and the crumbs are lightly toasted.  Top each dish with a handful of greens lightly tossed with olive oil and salt.  Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-for-two-crispy-broiled-scallops-and-chorizo-201006', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}