{u'recipes': [{u'sourceName': u'Bon Appetit', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/716396-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 716396, u'veryPopular': True, u'lowFodmap': False, u'title': u'Tecate Skirt-Steak Tacos', u'diets': [u'dairy free'], u'pricePerServing': 361.49, u'creditText': u'Bon Appetit', u'extendedIngredients': [{u'originalString': u'Avocado slices, crumbled Cotija cheese, and lime wedges (for serving)', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'crumbled', u'(for serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u'slices'}, {u'originalString': u'\xbc teaspoon freshly ground black pepper, plus more', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'plus more'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'\xbd canned chipotle chile in adobo, coarsely chopped', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chile in adobo', u'metaInformation': [u'canned', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'8 fresh corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'3 tablespoons chopped fresh cilantro, plus leaves for serving', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'2 garlic cloves, thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 teaspoon kosher salt, plus more', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'plus more'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 12-ounce can pale lager (such as Tecate)', u'aisle': u'Alcoholic Beverages', u'name': u'lager', u'metaInformation': [u'canned', u'(such as Tecate)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 14003, u'unit': u'ounce'}, {u'originalString': u'4 tablespoons fresh lime juice, divided', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'\xbc medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 large plum tomatoes, cored', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'cored', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'1 pound skirt steak, silver skinless, cut into 6-inch pieces', u'aisle': u'Meat', u'name': u'skirt steak', u'metaInformation': [u'skinless', u'cut into 6-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 23167, u'unit': u'pound'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.bonappetit.com/recipe/tecate-skirt-steak-tacos', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine steak, beer, 1 Tbsp. lime juice, 1 tsp. salt, and  tsp. pepper in a resealable plastic bag. Seal; chill 3 hours.Cook onion, garlic, and oil in a small skillet over medium heat until soft and translucent, 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Let cool.Prepare a grill for high heat (if using charcoal, prepare two zones of heat,  high and medium-high). Grill tomatoes over high heat, turning occasionally,  until well charred but still holding their shape, 68 minutes.Reduce grill to medium-high heat (or use medium-high zone if using a charcoal grill).', u'length': {u'number': 68, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove steak from marinade and pat dry. Season with salt and pepper and grill until charred, about 3 minutes per side for medium-rare.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Transfer to a cutting board and let steak rest 10 minutes. Meanwhile, blend onion and garlic, tomatoes, chipotle, and remaining 3 Tbsp. lime juice in a blender until smooth.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add chopped cilantro, season with salt, and pulse until just combined.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer salsa to a small bowl.Grill tortillas until soft and beginning to char, about 30 seconds per side.  Slice steak against the grain into " strips. Top each tortilla with a few pieces of steak, then some salsa, cilantro leaves, avocado, and Cotija cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Serve  with lime wedges for squeezing over.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Tacos. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Garnet Monterey Pinot Noir. It has 4.2 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"This is a Pinot with power, but also with finesse. Aromas include ripe blackberries, cherry preserves, vanilla toffee and toasted French oak. You'll love the velvety richness of the attack. The flavors of dark red fruits and exotic spices just make this a juicy, delicious mouthful of wine. View More", u'title': u'Garnet Monterey Pinot Noir', u'price': u'$15.99', u'id': 444323, u'link': u'https://www.wine.com/product/garnet-monterey-pinot-noir-2011/123633', u'imageUrl': u'https://spoonacular.com/productImages/444323-312x231.jpg'}]}, u'aggregateLikes': 16475, u'instructions': u'Combine steak, beer, 1 Tbsp. lime juice, 1 tsp. salt, and  tsp. pepper in a resealable plastic bag. Seal; chill 3 hours.Cook onion, garlic, and oil in a small skillet over medium heat until soft and translucent, 5 minutes. Let cool.Prepare a grill for high heat (if using charcoal, prepare two zones of heat,  high and medium-high). Grill tomatoes over high heat, turning occasionally,  until well charred but still holding their shape, 68 minutes.Reduce grill to medium-high heat (or use medium-high zone if using a charcoal grill). Remove steak from marinade and pat dry. Season with salt and pepper and grill until charred, about 3 minutes per side for medium-rare. Transfer to a cutting board and let steak rest 10 minutes. Meanwhile, blend onion and garlic, tomatoes, chipotle, and remaining 3 Tbsp. lime juice in a blender until smooth. Add chopped cilantro, season with salt, and pulse until just combined. Transfer salsa to a small bowl.Grill tortillas until soft and beginning to char, about 30 seconds per side.  Slice steak against the grain into " strips. Top each tortilla with a few pieces of steak, then some salsa, cilantro leaves, avocado, and Cotija cheese. Serve  with lime wedges for squeezing over.', u'spoonacularSourceUrl': u'https://spoonacular.com/tecate-skirt-steak-tacos-716396', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}