{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507344-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 507344, u'veryPopular': False, u'lowFodmap': False, u'title': u'Decker Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 66.5, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 (20-ounce) can crushed pineapple', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 9354, u'unit': u'ounce'}, {u'originalString': u'3 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbd cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbe cup warm milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 (18-ounce) jar prune butter (lekvar)', u'aisle': u'Dried Fruits;Produce', u'name': u'prune', u'metaInformation': [u'(lekvar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prunes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.0, u'consistency': u'solid', u'id': 9291, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'1 pound walnuts, ground', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'pound'}, {u'originalString': u'\xbd cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.browneyedbaker.com/2013/12/17/decker-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the ground walnuts in a large bowl and set aside. In a small saucepan, combine the sugar, water and butter over medium-high heat, and cook, stirring occasionally, until the sugar is dissolved and it comes to a boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from the heat and stir in the vanilla extract.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pour the hot syrup over the ground nuts, leaving about \xbd cup of the syrup back. Stir together and if still a little dry, add more liquid a bit at a time. You want a moist, spreadable consistency, but you do not want it to be soupy. Set aside. 2. Prepare the Pineapple Filling: In a small saucepan, combine the crushed pineapple (including the liquid), sugar and cornstarch over low heat. Cook, stirring constantly, until the mixture thickens, about 3 to 5 minutes. Set aside to cool. 3. Make the Cake: Preheat oven to 350 degrees F. Line two half-sheet pans (13x18-inches) with parchment paper; set aside. In a medium bowl, whisk together the flour and baking powder; set aside.4. Using an electric mixer, beat together the shortening and sugar on medium speed until light and fluffy, about 2 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1019354, u'name': u'crushed pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add the eggs and vanilla extract and mix until completely combined. Reduce the mixer speed to low and add the flour in three additions, alternating with two additions of the warm milk, mixing until completely combined. 5. Divide the dough between the two baking sheets and use an offset spatula to spread the dough into an even layer on each sheet (the dough will be thick, like cookie dough, and will spread very thin).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Bake until the cake springs back when the top is lightly pressed, about 10 to 15 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pans from the oven and place on wire racks to cool completely.6. Assemble the Cake: In a 9x13-inch pan, layer the sponge cake, cutting it as necessary to make a layer fit. Top with the walnut filling, spreading it into an even layer. Top with another layer of cake, again cutting and fitting pieces if need be. Top with the pineapple filling, spreading it into an even layer. Top with the final layer of cake, reserving a small strip of cake.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u"Spread the entire jar of prune butter over the top and crumble the reserved strip of cake over the top. (My grandma mentioned that if you can't spare a strip of cake to crumble on the top, you can also use crushed up Nilla wafers.)7. The assembled cake should be stored in the refrigerator and set out at room temperature about 30 minutes before serving. It will keep in the refrigerator covered with plastic wrap and foil for 1 week. This cake also freezes very well, wrapped tightly with plastic wrap and foil for up to 1 month.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prunes.jpg', u'id': 9291, u'name': u'prunes'}]}], u'name': u'Prepare the Walnut Filling'}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 326, u'instructions': u"1. Prepare the Walnut Filling: Place the ground walnuts in a large bowl and set aside. In a small saucepan, combine the sugar, water and butter over medium-high heat, and cook, stirring occasionally, until the sugar is dissolved and it comes to a boil. Remove from the heat and stir in the vanilla extract. Pour the hot syrup over the ground nuts, leaving about \xbd cup of the syrup back. Stir together and if still a little dry, add more liquid a bit at a time. You want a moist, spreadable consistency, but you do not want it to be soupy. Set aside. 2. Prepare the Pineapple Filling: In a small saucepan, combine the crushed pineapple (including the liquid), sugar and cornstarch over low heat. Cook, stirring constantly, until the mixture thickens, about 3 to 5 minutes. Set aside to cool. 3. Make the Cake: Preheat oven to 350 degrees F. Line two half-sheet pans (13x18-inches) with parchment paper; set aside. In a medium bowl, whisk together the flour and baking powder; set aside.4. Using an electric mixer, beat together the shortening and sugar on medium speed until light and fluffy, about 2 minutes. Add the eggs and vanilla extract and mix until completely combined. Reduce the mixer speed to low and add the flour in three additions, alternating with two additions of the warm milk, mixing until completely combined. 5. Divide the dough between the two baking sheets and use an offset spatula to spread the dough into an even layer on each sheet (the dough will be thick, like cookie dough, and will spread very thin). Bake until the cake springs back when the top is lightly pressed, about 10 to 15 minutes. Remove the pans from the oven and place on wire racks to cool completely.6. Assemble the Cake: In a 9x13-inch pan, layer the sponge cake, cutting it as necessary to make a layer fit. Top with the walnut filling, spreading it into an even layer. Top with another layer of cake, again cutting and fitting pieces if need be. Top with the pineapple filling, spreading it into an even layer. Top with the final layer of cake, reserving a small strip of cake. Spread the entire jar of prune butter over the top and crumble the reserved strip of cake over the top. (My grandma mentioned that if you can't spare a strip of cake to crumble on the top, you can also use crushed up Nilla wafers.)7. The assembled cake should be stored in the refrigerator and set out at room temperature about 30 minutes before serving. It will keep in the refrigerator covered with plastic wrap and foil for 1 week. This cake also freezes very well, wrapped tightly with plastic wrap and foil for up to 1 month.", u'spoonacularSourceUrl': u'https://spoonacular.com/decker-cake-507344', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}