{u'recipes': [{u'sourceName': u'Seasonal and Savory', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478397-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 478397, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vanilla Bean Sweet Potatoes with Buttered Black Walnuts', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 139.5, u'creditText': u'Seasonal and Savory', u'extendedIngredients': [{u'originalString': u'2 tablespoons Vermont Creamery Lightly Salted Cultured Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces Vermont Creamery Madagascar Vanilla Creme Fraiche', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'creme fraiche', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001056, u'unit': u'ounces'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2\xbd pounds sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 11507, u'unit': u'pounds'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.seasonalandsavory.com/2013/11/vanilla-bean-sweet-potatoes-with-buttered-black-walnuts.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Roast the sweet potatoes until soft. I roast them at 375 degrees for about 40 minutes, but the time will depend on the size of the potatoes. When you can easily insert the tip of a knife into the center of a potato, it is ready.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Let the sweet potatoes cool just enough to handle.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Remove the skins and cut them into large chunks.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the chunks to the food processor, along with the salt, vanilla, and creme fraiche. Pulse until the mixture is smooth, and then transfer to a serving bowl. Note: You may also mash or rice the potatoes, if you do not have a food processor.In a small skillet, heat the butter over medium-high heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1001056, u'name': u'creme fraiche'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the black walnut pieces and let them warm in the butter, stirring frequently. When the walnuts begin to smell a little toasty, remove from heat and pour them over the sweet potatoes.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 93, u'instructions': u'Roast the sweet potatoes until soft. I roast them at 375 degrees for about 40 minutes, but the time will depend on the size of the potatoes. When you can easily insert the tip of a knife into the center of a potato, it is ready.Let the sweet potatoes cool just enough to handle. Remove the skins and cut them into large chunks. Add the chunks to the food processor, along with the salt, vanilla, and creme fraiche. Pulse until the mixture is smooth, and then transfer to a serving bowl. Note: You may also mash or rice the potatoes, if you do not have a food processor.In a small skillet, heat the butter over medium-high heat. Add the black walnut pieces and let them warm in the butter, stirring frequently. When the walnuts begin to smell a little toasty, remove from heat and pour them over the sweet potatoes.', u'spoonacularSourceUrl': u'https://spoonacular.com/vanilla-bean-sweet-potatoes-with-buttered-black-walnuts-478397', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}