{u'recipes': [{u'sourceName': u'China Sichuan Food', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/608554-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 608554, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chinese Peking (Beijing Style) Ribs', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 469.91, u'creditText': u'China Sichuan Food', u'extendedIngredients': [{u'originalString': u'1/2 tablespoon of chili sauce (optional)', u'aisle': u'Ethnic Foods', u'name': u'chili sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 6972, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon starch (any type you prefer)', u'aisle': u'Baking', u'name': u'corn starch', u'metaInformation': [u'(any type you prefer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'2 garlic cloves, sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 slices of ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'slices'}, {u'originalString': u'4 green onions cut 1 into sections and chop the left', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tablespoon light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'tablespoon'}, {u'originalString': u'1 pound (around 500g) ribs, cut into sections', u'aisle': u'Meat', u'name': u'ribs', u'metaInformation': [u'cut into sections', u'(around 500g)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribs.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23236, u'unit': u'pound'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'Sesame seeds for garnish', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12023, u'unit': u'servings'}, {u'originalString': u'2 tablespoons tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11549, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon cooking wine', u'aisle': u'Alcoholic Beverages', u'name': u'wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14084, u'unit': u'tablespoon'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.chinasichuanfood.com/chinese-peking-beijing-style-ribs/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Wash the ribs and soak in clean water for around 10 minutes. Boiling some water in a pot; put the ribs into cook for 1 to 2 minutes. Then rinse the boiled ribs under running water and replace the boiled water with fresh and clean water.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribs.jpg', u'id': 23236, u'name': u'ribs'}]}, {u'equipment': [], u'step': u'Add sections of one green onion, pinch of salt and ginger slices. Bring all the content to a boiling and then use medium fire to simmer for around 15 minutes or until you can easily insert a chop sticker in.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the ribs out and drain. In a small bowl, mix all the ingredients for sauce together.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribs.jpg', u'id': 23236, u'name': u'ribs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat up around 3 tablespoons of oil in wok; add garlic slices in to stir fry until aroma. Discard the garlic slices because they will be easily burnt in the following process.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add ribs in. Stay for a while before moving or turning around. Saut\xe9 until all sides are slightly brown. Swirl the sauce in. Turn up the fire to thicken the sauce.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribs.jpg', u'id': 23236, u'name': u'ribs'}]}, {u'equipment': [], u'step': u'Garnish with sesame seeds and green onion before serving.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian can be paired with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Ken Forrester Old Vine Reserve Chenin Blanc with a 4.9 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This full-bodied Chenin harmoniously balances ripe fruit with delicate oak nuances. It flaunts a rich, luscious mouthfeel, with flavors of melon and tropical fruit enhanced by complex mineral notes and hints of spice. Extended lees contact imparts an alluring honeycomb character.  View More', u'title': u'Ken Forrester Old Vine Reserve Chenin Blanc', u'price': u'$15.99', u'id': 442201, u'link': u'https://www.wine.com/product/ken-forrester-old-vine-reserve-chenin-blanc-2010/112605', u'imageUrl': u'https://spoonacular.com/productImages/442201-312x231.jpg'}]}, u'aggregateLikes': 268, u'instructions': u'Wash the ribs and soak in clean water for around 10 minutes. Boiling some water in a pot; put the ribs into cook for 1 to 2 minutes. Then rinse the boiled ribs under running water and replace the boiled water with fresh and clean water. Add sections of one green onion, pinch of salt and ginger slices. Bring all the content to a boiling and then use medium fire to simmer for around 15 minutes or until you can easily insert a chop sticker in.  Transfer the ribs out and drain. In a small bowl, mix all the ingredients for sauce together. Heat up around 3 tablespoons of oil in wok; add garlic slices in to stir fry until aroma. Discard the garlic slices because they will be easily burnt in the following process.Add ribs in. Stay for a while before moving or turning around. Saut\xe9 until all sides are slightly brown. Swirl the sauce in. Turn up the fire to thicken the sauce. Garnish with sesame seeds and green onion before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/chinese-peking-beijing-style-ribs-608554', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}