{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/536810-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 536810, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chestnut Ravioli', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 229.0, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'4 Tablespoons butter for brown butter sauce', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for brown butter sauce'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'1 pound chestnuts (about 20)', u'aisle': u'Produce', u'name': u'chestnuts', u'metaInformation': [u'( 20)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chestnuts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 12098, u'unit': u'pound'}, {u'originalString': u'Very tiny pinch of cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'pinch'}, {u'originalString': u'1 egg for egg wash (plus a Tablespoon of water)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'for egg wash (plus a tablespoon of water)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u"3 1/2 cups all-purpose flour (you probably won't use all of it)", u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u"(you probably won't use all of it)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'8 ounces Mascarpone', u'aisle': u'Cheese', u'name': u'mascarpone', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93820, u'unit': u'ounces'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 Teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'Teaspoon'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.macheesmo.com/2009/11/chestnut-ravioli/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the peeled chestnuts to a bowl and mush them up a bit with a fork. Then add mascarpone cheese and the pinch of cinnamon and salt.10) To make ravioli, cut dough ball into quarters. You should end up getting about 7 or 8 large ravioli from each quarter of dough. Then take each quarter and roll it out. Keep the dough well-floured so it doesnt stick. If you want it to look nice, you can trim the edges of the dough with a knife so the edges are straight.11)', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chestnuts.jpg', u'id': 12098, u'name': u'chestnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place about a Tablespoon of filling on the right side of the dough. Leave about 1/2 inch in between each ball of filling.12)', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Brush egg wash on all the edges and in between each filling piece. So basically there should be a square of egg wash around each ball of filling. Then fold the left half of dough over the right side and press down between each piece of ravioli. The key is to make sure you dont have any air bubbles in each ravioli as those might cause your ravioli to explode while its boiling.13) Use a knife to slice up your raviolis. If you have a ravioli mold, go around each piece to seal.14) Get a large pot of salted water going. Once its boiling (gentle boil not rolling boil) toss in your ravioli. When they float, theyre done! It should only take a few minutes.15) Melt some butter in a large pan and just when it was starting to brown, I tossed in my ravioli to coat them in the lovely brown butter sauce.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Ravioli. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Santa Margherita Chianti Classico Riserva. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The aromas of this complex red wine range from cherries and plums to gladiolus flowers and earthy flint. The tannic, oak-aged flavors are bright and round, with a dry, warm, earthy finish. Recommended for barbecued meat, like sliced Chianina steak, or with game, such as pheasant stuffed with truffles. It is also excellent with mature cheese. View More', u'title': u'Santa Margherita Chianti Classico Riserva', u'price': u'$26.99', u'id': 436659, u'link': u'https://www.wine.com/product/santa-margherita-chianti-classico-riserva-2013/167314', u'imageUrl': u'https://spoonacular.com/productImages/436659-312x231.jpg'}]}, u'aggregateLikes': 69, u'instructions': u'Directions1) For pasta, in a bowl, beat eggs and egg yolks together and then add salt. Then, on a clean surface, add 3-4 cups of flour and make a large well in the middle. Then pour egg mixture right in the middle.2) Using a fork (or your fingers), gently stir the egg mixture around  slowly incorporate more flour into the mixture. Dont worry if there are some lumps.3) Work it with your hands, kneading it, for about 10 minutes. If it starts to get really sticky at any point, just add a bit more flour from your outer ring. You most likely will not use all the flour.4) Once you have a smooth dough, wrap in plastic wrap and let it rest for at least an hour in the fridge. You can make it 24 hours in advance without a problem.5) For filling, heat your oven to 350 degrees.6) Using a paring knife, make a small X on the flat side of each chestnut. Lay out all the chestnuts on a baking sheet as you work.7) Roast the chestnuts for about 25 minutes at 350 degrees.8) While chestnuts are warm, peel them. To keep the chestnuts warm while you peel them, leave batches in the oven at 200 degrees and pull out as needed. For those that dont peel easily, treat them like a clove of garlic. Chop them in half and then give them a good smash with the side of the knife!9) Add the peeled chestnuts to a bowl and mush them up a bit with a fork. Then add mascarpone cheese and the pinch of cinnamon and salt.10) To make ravioli, cut dough ball into quarters. You should end up getting about 7 or 8 large ravioli from each quarter of dough. Then take each quarter and roll it out. Keep the dough well-floured so it doesnt stick. If you want it to look nice, you can trim the edges of the dough with a knife so the edges are straight.11) Place about a Tablespoon of filling on the right side of the dough. Leave about 1/2 inch in between each ball of filling.12) Brush egg wash on all the edges and in between each filling piece. So basically there should be a square of egg wash around each ball of filling. Then fold the left half of dough over the right side and press down between each piece of ravioli. The key is to make sure you dont have any air bubbles in each ravioli as those might cause your ravioli to explode while its boiling.13) Use a knife to slice up your raviolis. If you have a ravioli mold, go around each piece to seal.14) Get a large pot of salted water going. Once its boiling (gentle boil not rolling boil) toss in your ravioli. When they float, theyre done! It should only take a few minutes.15) Melt some butter in a large pan and just when it was starting to brown, I tossed in my ravioli to coat them in the lovely brown butter sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/chestnut-ravioli-536810', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}