{u'recipes': [{u'sourceName': u'My Colombian Recipes', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/227393-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 227393, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sobrebarriga en Salsa Criolla (Flank Steak with Colombian Creole Sauce)', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'pricePerServing': 316.34, u'creditText': u'My Colombian Recipes', u'extendedIngredients': [{u'originalString': u'2 pounds flank steak', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'pounds'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground achiote', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'ground achiote', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93648, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 large onion, thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 red bell pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 scallions, diced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'4 tomatoes, diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'8 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.mycolombianrecipes.com/sobrebarriga-en-salsa-criolla-flank-steak-with-colombian-creole-sauce', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a pot, place the flank steak, water, onion, scallions, garlic, salt and pepper. Cook over medium-low heat for about 3 hours or until the meat is tender.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23657, u'name': u'flank steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the beef from the pot and set aside', u'number': 2, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place the cooked flank steak on a plate and drizzle with the creole sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23657, u'name': u'flank steak'}]}], u'name': u'To make the sauce In a saucepan, place the oil, tomatoes, red bell pepper, onions, scallions, garlic, achiote, cumin, salt and pepper. Cook for 6 to 8 minutes, stirring occasionally.To serve'}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are great choices for Flank Steak. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. One wine you could try is Clos Du Val Merlot. It has 4.1 out of 5 stars and a bottle costs about 30 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"A dense, inky color and rich aromas of intense black currant and blackberry pervade our 2002 Merlot. Hints of herbs, black olives and toast are also present in the nose, leading to a well-structured wine with an abundance of dark red and black fruit flavors, balanced with sweet toast and some spice. The wine's soft tannins, lingering finish, and rich, complex taste make this a delightful accompaniment to roast chicken, pork, or beef.", u'title': u'Clos Du Val Merlot', u'price': u'$29.99', u'id': 433037, u'link': u'https://www.wine.com/product/clos-du-val-merlot-2002/83430', u'imageUrl': u'https://spoonacular.com/productImages/433037-312x231.jpg'}]}, u'aggregateLikes': 473, u'instructions': u'In a pot, place the flank steak, water, onion, scallions, garlic, salt and pepper. Cook over medium-low heat for about 3 hours or until the meat is tender.Remove the beef from the pot and set asideTo make the sauce: In a saucepan, place the oil, tomatoes, red bell pepper, onions, scallions, garlic, achiote, cumin, salt and pepper. Cook for 6 to 8 minutes, stirring occasionally.To serve: Place the cooked flank steak on a plate and drizzle with the creole sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/sobrebarriga-en-salsa-criolla-flank-steak-with-colombian-creole-sauce-227393', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}