{u'recipes': [{u'sourceName': u'When is Dinner', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/534282-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 534282, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Chicken Teryaki', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 120.72, u'creditText': u'When is Dinner', u'extendedIngredients': [{u'originalString': u'4-6 Carrots, sliced thin Julienne Style', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'julienne style', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 cup of Chicken Broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'4 Garlic Cloves – MINCED', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Sweet Yellow Onion Chopped into large chunks', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sweet', u'yellow', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'chunk', u'unitShort': u'chunks', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'chunks'}, {u'originalString': u'1 Large Can of Sliced Pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'Can', u'unitShort': u'Can', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u'Can'}, {u'originalString': u'4 Chicken Breasts – Boneless, Skinless', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'Entire Bottle of Teryaki Sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'Bottle', u'unitShort': u'Bottle', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'Bottle'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://whenisdinner.com/slow-cooker-chicken-teryaki/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Dump all ingredients in slow cooker and cook on LOW for 4-6 hours', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Remove Chicken and shred', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve over hot cooked rice', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Downton Abbey Countess of Grantham Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 213, u'instructions': u'Dump all ingredients in slow cooker and cook on LOW for 4-6 hoursRemove Chicken and shredServe over hot cooked rice', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-chicken-teryaki-534282', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 375, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}