{u'recipes': [{u'sourceName': u'Damn Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/799787-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 799787, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peach Bacon Brie Grilled Cheese', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 183.02, u'creditText': u'Damn Delicious', u'extendedIngredients': [{u'originalString': u'8 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'4 ounces Brie cheese, thinly sliced', u'aisle': u'Cheese', u'name': u'brie cheese', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1006, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup peach preserves', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peach preserves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-preserves.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11319297, u'unit': u'cup'}, {u'originalString': u'2 peaches, thinly sliced', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'4 tablespoons unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'8 slices whole wheat bread', u'aisle': u'Bakery/Bread', u'name': u'whole wheat bread', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18075, u'unit': u'slices'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://damndelicious.net/2016/08/26/peach-bacon-brie-grilled-cheese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u'Preheat a waffle iron to medium-high heat. Lightly oil the top and bottom of the waffle iron or coat with nonstick spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add bacon and cook until brown and crispy, about 6-8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404725, u'name': u'butter knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer to a paper towel-lined plate and set aside.With a butter knife, spread butter on one side of each slice of bread.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Spread preserves on each of 4 bread slices with buttered side down. Divide peaches, brie and baconevenly on allslices. Top with remaining slices, buttered side up.', u'number': 5, u'ingredients': [{u'image': None, u'id': 19297, u'name': u'preserves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u'Place sandwiches in the waffle iron. Close gently and cook until golden brown and the cheese has just melted, about 3-4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately, drizzled with honey, if desired.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 137, u'instructions': u'Preheat a waffle iron to medium-high heat. Lightly oil the top and bottom of the waffle iron or coat with nonstick spray.Heat a large skillet over medium high heat. Add bacon and cook until brown and crispy, about 6-8 minutes. Transfer to a paper towel-lined plate and set aside.With a butter knife, spread butter on one side of each slice of bread. Spread preserves on each of 4 bread slices with buttered side down. Divide peaches, brie and baconevenly on allslices. Top with remaining slices, buttered side up.Place sandwiches in the waffle iron. Close gently and cook until golden brown and the cheese has just melted, about 3-4 minutes.Serve immediately, drizzled with honey, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/peach-bacon-brie-grilled-cheese-799787', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}