{u'recipes': [{u'sourceName': u'Barbara Bakes', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/477994-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 477994, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lemon Ricotta Crepes', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 45.28, u'creditText': u'Barbara Bakes', u'extendedIngredients': [{u'originalString': u'1 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 tablespoons canola oil + more for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'2 – 4 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'8 oz. ricotta cheese*', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'oz'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.barbarabakes.com/2013/05/lemon-ricotta-crepes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place ingredients into a blender in the order listed. Blend until smooth, scraping sides as you go. Cover and refrigerate 1-2 hours. (I skipped the refrigeration and just strain out any lumps.)To fry crepes, heat a skillet over medium high heat. Be sure to choose one that holds heat well that you can hold comfortably with one hand. Cast iron is great for this. (I have a special non-stick crepe pan.)', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in about \xbd teaspoon oil and swirl to coat bottom of pan. Hold the pan up off the heat and pour a small stream of batter into the hot pan with one hand while simultaneously rotating the pan with your other hand to cover the batter evenly across the bottom. Continue rotating the pan until the batter is evenly coated. Fry until golden brown spots form on the bottom {about 20 seconds}. Flip and cook the other side another 15 seconds and remove to a plate. It might take you a few tries to get the technique down, but once you get it, you’ll be a pro.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add in a few dribbles of oil as needed, usually after every 3 or 4 crepes. Cover cooked crepes with foil to keep warm.For the Lemon Ricotta filling, whip all listed ingredients together in food processor until smooth.To serve, fill warm crepes with filling and roll or fold together. Top with powdered sugar, if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 639, u'instructions': u'Place ingredients into a blender in the order listed. Blend until smooth, scraping sides as you go. Cover and refrigerate 1-2 hours. (I skipped the refrigeration and just strain out any lumps.)To fry crepes, heat a skillet over medium high heat. Be sure to choose one that holds heat well that you can hold comfortably with one hand. Cast iron is great for this. (I have a special non-stick crepe pan.) Pour in about \xbd teaspoon oil and swirl to coat bottom of pan. Hold the pan up off the heat and pour a small stream of batter into the hot pan with one hand while simultaneously rotating the pan with your other hand to cover the batter evenly across the bottom. Continue rotating the pan until the batter is evenly coated. Fry until golden brown spots form on the bottom {about 20 seconds}. Flip and cook the other side another 15 seconds and remove to a plate. It might take you a few tries to get the technique down, but once you get it, you’ll be a pro. Add in a few dribbles of oil as needed, usually after every 3 or 4 crepes. Cover cooked crepes with foil to keep warm.For the Lemon Ricotta filling, whip all listed ingredients together in food processor until smooth.To serve, fill warm crepes with filling and roll or fold together. Top with powdered sugar, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-ricotta-crepes-477994', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}