{u'recipes': [{u'sourceName': u'Cup Cake Project', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/518670-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 518670, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rainbow Potato', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 153.19, u'creditText': u'Cup Cake Project', u'extendedIngredients': [{u'originalString': u'2 tablespoons blue cheese crumbles', u'aisle': u'Cheese', u'name': u'blue cheese crumbles', u'metaInformation': [u'blue'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001004, u'unit': u'tablespoons'}, {u'originalString': u"1/2 tablespoon butter (frozen butter works best but it's not required)", u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'frozen', u"( butter works best but it's not required)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons finely sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons finely diced orange peppers', u'aisle': u'Produce', u'name': u'orange peppers', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10011821, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'tablespoons'}, {u'originalString': u'1 small Russet potato, washed and dried', u'aisle': u'Produce', u'name': u'russet potato', u'metaInformation': [u'dried', u'washed and ', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'2 tablespoons shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons finely diced tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u'tablespoons'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.cupcakeproject.com/2014/03/rainbow-hasselback-potatoes.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chopsticks.jpg', u'id': 405596, u'name': u'chopsticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut a small slice off of the long side of the potato so it can lay flat.Line up two cheap chopsticks like railroad tracks on either side of the potato.Make about 10 slices into the potato.  For each slice, cut into the potato until the knife hits the chopsticks.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the butter into really thin slices (as thin as you can).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Place a slice in each potato slot.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Place potato on a baking sheet, drizzle with olive oil, and sprinkle with salt.Either bake for 45 minutes, fill each slot with prepared fillings in color order, and bake for another 15 minutes OR bake for one hour and then fill each slot with prepared fillings in color order.  The second method will look more vibrant, however the the vegetables won't be cooked.  You could also do a combination of the two methods by adding the fillings after 45 minutes, and then adding additional fillings after the full hour.", u'length': {u'number': 105, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let the potato rest for five minutes (it continues to cook internally) and EAT!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 625, u'instructions': u"Preheat oven to 400 F.Cut a small slice off of the long side of the potato so it can lay flat.Line up two cheap chopsticks like railroad tracks on either side of the potato.Make about 10 slices into the potato.  For each slice, cut into the potato until the knife hits the chopsticks.  Cut the butter into really thin slices (as thin as you can).  Place a slice in each potato slot.Place potato on a baking sheet, drizzle with olive oil, and sprinkle with salt.Either bake for 45 minutes, fill each slot with prepared fillings in color order, and bake for another 15 minutes OR bake for one hour and then fill each slot with prepared fillings in color order.  The second method will look more vibrant, however the the vegetables won't be cooked.  You could also do a combination of the two methods by adding the fillings after 45 minutes, and then adding additional fillings after the full hour.Let the potato rest for five minutes (it continues to cook internally) and EAT!", u'spoonacularSourceUrl': u'https://spoonacular.com/rainbow-potato-518670', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}