{u'recipes': [{u'sourceName': u'Well Plated', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/691392-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 16, u'id': 691392, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Gingerbread Muffins', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 83.59, u'creditText': u'Well Plated', u'extendedIngredients': [{u'originalString': u'1 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u"1/2 cup Bob's Red Mill Coconut Sugar (or substitute light or dark brown sugar)", u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [u'dark', u'light', u'red', u'(or substitute or brown sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'4 ounces chopped dark chocolate or 2/3 cup semi-sweet chocolate chips', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'1 large egg, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup, plus 2 tablespoons white whole wheat flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoons'}, {u'originalString': u'1/4 teaspoon ground nutmeg (freshly grated if possible)', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [u'freshly grated', u'( if possible)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup molasses (not blackstrap)', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [u'(not blackstrap)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19304, u'unit': u'cup'}, {u'originalString': u'3/4 cup plain non-fat Greek yogurt, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'non-fat greek yogurt', u'metaInformation': [u'plain', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}, {u'originalString': u'1/2 cup non-fat milk, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'non-fat milk', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u"Bob's Red Mill Sparkling Sugar, for topping", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'red', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}, {u'originalString': u'1/3 cup unsweetened cocoa powder, sifted if clumpy', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened', u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://www.wellplated.com/chocolate-gingerbread-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place a rack in the center of youroven, then preheat the oven to 375 degrees. Lightly coat amuffin tin with nonstick cooking spray or line with paper liners. In a small bowl, melt the coconut oil, then set aside to cool to room temperature.In a large mixing bowl, whisk together the yogurt, milk, coconut sugar, molasses, and egg.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let rest 5 minutes for the coconut sugar to dissolve slightly. If the mixture is not yet at room temperature, wait for a few additionalminutes, then add the coconut oil. (If the wet ingredients are much colder than the coconut oil, the oil will resolidify and not incorporate properly.)In a separate bowl, stir together the white whole wheat flour, all purpose flour, cocoa powder, baking soda, ginger, cinnamon, salt, cloves, and nutmeg until evenly combined and no clumps remain.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u'Add all at once to the wetingredients, then stir gently, just until combined. Fold in the chopped chocolate or chocolate chips.Divide the batter evenly between the prepared muffin cups, thensprinkle the tops with sparkling sugar.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake the muffins for16-18minutes, until the tops are dry to the touch and a toothpick inserted in the center comes out clean.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cool in the pan for 5 minutes, then transfer to a wire rack to cool completely.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 187, u'instructions': u'Place a rack in the center of youroven, then preheat the oven to 375 degrees. Lightly coat amuffin tin with nonstick cooking spray or line with paper liners. In a small bowl, melt the coconut oil, then set aside to cool to room temperature.In a large mixing bowl, whisk together the yogurt, milk, coconut sugar, molasses, and egg. Let rest 5 minutes for the coconut sugar to dissolve slightly. If the mixture is not yet at room temperature, wait for a few additionalminutes, then add the coconut oil. (If the wet ingredients are much colder than the coconut oil, the oil will resolidify and not incorporate properly.)In a separate bowl, stir together the white whole wheat flour, all purpose flour, cocoa powder, baking soda, ginger, cinnamon, salt, cloves, and nutmeg until evenly combined and no clumps remain. Add all at once to the wetingredients, then stir gently, just until combined. Fold in the chopped chocolate or chocolate chips.Divide the batter evenly between the prepared muffin cups, thensprinkle the tops with sparkling sugar.Bake the muffins for16-18minutes, until the tops are dry to the touch and a toothpick inserted in the center comes out clean.Let cool in the pan for 5 minutes, then transfer to a wire rack to cool completely.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-gingerbread-muffins-691392', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 31, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}