{u'recipes': [{u'sourceName': u'A Zesty Bite', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/789723-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 4, u'id': 789723, u'veryPopular': False, u'lowFodmap': False, u'title': u'Guacamole and Prosciutto Toast', u'diets': [], u'preparationMinutes': 4, u'pricePerServing': 164.56, u'creditText': u'A Zesty Bite', u'extendedIngredients': [{u'originalString': u'2 heirloom tomatoes, sliced', u'aisle': u'Produce', u'name': u'heirloom tomatoes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'6 slices Italian white bread', u'aisle': u'Bakery/Bread', u'name': u'italian bread', u'metaInformation': [u'white', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'slices'}, {u'originalString': u'shredded parmesan cheese for topping', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'3 ounces prosciutto slices', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'ounces'}, {u'originalString': u'salt and pepper to season', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'7-ounce container Sabra Veggie Fusion Garden Vegetable (guacamole)', u'aisle': u'Produce', u'name': u'vegetable', u'metaInformation': [u'(guacamole)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 11583, u'unit': u'ounce'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.azestybite.com/guacamole-and-prosciutto-toast/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Put the oven on broil.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the bread directly on the grates for 1 minute. Flip and then broil for an additional 2 minutes; remove from oven.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the guacamole evenly over all 6 slices of bread. Top with 2-3 slices of heirloom tomatoes and season with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'heirloom tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Add one slice of prosciutto and then grate some parmesan cheese over the top.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place back in the oven on broil for 45 seconds.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Mexican works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Trombetta Gap's Crown Vineyard Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 59 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Rich garnet color. Aromas of vanilla, clove and cooking spiceswith hints of ripe berry, pomegranate and toast. Soft entry,balanced tannin and berry fruit mingled with pleasant acidityand lingering finish. View More', u'title': u"Trombetta Gap's Crown Vineyard Pinot Noir", u'price': u'$58.99', u'id': 439275, u'link': u'https://www.wine.com/product/trombetta-gaps-crown-vineyard-pinot-noir-2012/138834', u'imageUrl': u'https://spoonacular.com/productImages/439275-312x231.jpg'}]}, u'aggregateLikes': 26, u'instructions': u'Put the oven on broil. Place the bread directly on the grates for 1 minute. Flip and then broil for an additional 2 minutes; remove from oven.Spread the guacamole evenly over all 6 slices of bread. Top with 2-3 slices of heirloom tomatoes and season with salt and pepper. Add one slice of prosciutto and then grate some parmesan cheese over the top.Place back in the oven on broil for 45 seconds.', u'spoonacularSourceUrl': u'https://spoonacular.com/guacamole-and-prosciutto-toast-789723', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 8, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}