{u'recipes': [{u'sourceName': u'Picky Eater Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/516679-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 516679, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mushroom and Spinach Tartines with Roasted Garlic Spread', u'diets': [], u'pricePerServing': 128.41, u'creditText': u'Picky Eater Blog', u'extendedIngredients': [{u'originalString': u'6oz-10oz fresh baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11457, u'unit': u'oz'}, {u'originalString': u'1 whole-wheat baguette, sliced lengthwise and toasted', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'whole-wheat', u'toasted', u'sliced lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'10 oz of sliced crimini mushrooms', u'aisle': u'Produce', u'name': u'crimini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11266, u'unit': u'oz'}, {u'originalString': u'1 1/2 tsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u"1-2 Tbsp freshly grated Parmesan cheese per tartine (so if you're making 8 tartines, that's 8-16 Tbsp total)", u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated', u"per tartine (so if you're making 8 tartines, that's 8-16 tbsp total)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'Tbsp'}, {u'originalString': u"6-9 cloves roasted garlic (I say the more garlic the better, but if you're not a garlic lover like I am, go with 6 cloves)", u'aisle': u'Produce', u'name': u'roasted garlic', u'metaInformation': [u'with 6 cloves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'6 oz. soft tofu, drained', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'soft', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 16162, u'unit': u'oz'}, {u'originalString': u'1 yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 96.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://pickyeaterblog.com/2012/01/12/mushroon-and-spinach-tartines-with-roasted-garlic-spread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place tofu and garlic in blender or food processor, season with salt and pepper, and blend until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in skillet over medium heat. Saut\xe9 mushroom and onion 3 to 5 minutes, or until softened.Stir in spinach, and saut\xe9 2 minutes, or until wilted.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 1 Tbs. Parmesan cheese to pan, and remove from heat. I also added salt and pepper to taste for more flavor.If you have any roasted garlic left over, spread one clove over each baguette half. Top with tofu-garlic spread, then with mushroom-spinach mixture, and sprinkle with remaining Parmesan cheese. Toast under broiler 1 to 2 minutes, or until cheese begins to brown. I also added a bit of salt and pepper on top (just a sprinkle) for extra flavor.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-roasted.jpg', u'id': 11215, u'name': u'roasted garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}], u'name': u'Roast the garlic. This is very easy to do simply trim the tops of whole garlic bulbs to expose the cloves, set on a piece of foil, and drizzle with olive oil (about 1 tsp).Wrap the garlic tightly in foil, and bake 30 to 35 minutes at 400\xb0F, or until garlic bulbs are soft. When it’s done, it looks like this'}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Korbel Organic Brut. It has 4.3 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'#73 Wine Spectator Top 100 of 2016Korbel Brut – Made with Organically Grown Grapes is created in the classic Korbel style, crisp, delicate and bright. We always strive to present the pure flavors of the grape in all of our champagnes. The organically grown grapes in this cuvee deliver well-integrated aromas and flavors of apple, pear and white peaches. The finish is medium dry, with a slight savory note at the end. View More', u'title': u'Korbel Organic Brut', u'price': u'$12.98', u'id': 443895, u'link': u'https://www.wine.com/product/korbel-organic-brut/105310', u'imageUrl': u'https://spoonacular.com/productImages/443895-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Roast the garlic. This is very easy to do: simply trim the tops of whole garlic bulbs to expose the cloves, set on a piece of foil, and drizzle with olive oil (about 1 tsp).Wrap the garlic tightly in foil, and bake 30 to 35 minutes at 400\xb0F, or until garlic bulbs are soft. When it’s done, it looks like this:Place tofu and garlic in blender or food processor, season with salt and pepper, and blend until smooth.Heat oil in skillet over medium heat. Saut\xe9 mushroom and onion 3 to 5 minutes, or until softened.Stir in spinach, and saut\xe9 2 minutes, or until wilted. Add 1 Tbs. Parmesan cheese to pan, and remove from heat. I also added salt and pepper to taste for more flavor.If you have any roasted garlic left over, spread one clove over each baguette half. Top with tofu-garlic spread, then with mushroom-spinach mixture, and sprinkle with remaining Parmesan cheese. Toast under broiler 1 to 2 minutes, or until cheese begins to brown. I also added a bit of salt and pepper on top (just a sprinkle) for extra flavor.', u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-and-spinach-tartines-with-roasted-garlic-spread-516679', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}