{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/436440-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 436440, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fresh Vegetable Pasta Salad', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 52.96, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup fresh broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011090, u'unit': u'cup'}, {u'originalString': u'1/4 cup thinly sliced fresh carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1/4 cup fresh cauliflowerets', u'aisle': u'Produce', u'name': u'cauliflowerets', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011135, u'unit': u'cup'}, {u'originalString': u'Leaf lettuce, optional', u'aisle': u'Produce', u'name': u'lettuce leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'Leaf', u'unitShort': u'Leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 93623, u'unit': u'Leaf'}, {u'originalString': u'1/2 cup uncooked small pasta shells', u'aisle': u'Pasta and Rice', u'name': u'pasta shells', u'metaInformation': [u'small', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shell-pasta.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11020420, u'unit': u'cup'}, {u'originalString': u'1/4 cup creamy Italian salad dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'salad dressing', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4114, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped seeded tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped sweet yellow pepper', u'aisle': u'Produce', u'name': u'yellow sweet pepper', u'metaInformation': [u'sweet', u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11951, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/fresh-vegetable-pasta-salad', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cook pasta according to package directions. Meanwhile, in a small saucepan, cook the cauliflower, broccoli, carrots and yellow pepper in boiling water for 2 minutes. Rinse in cold water and drain well; place in a bowl.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'id': 11951, u'name': u'yellow pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Drain pasta and rinse in cold water; add to vegetables. Cover and refrigerate for at least 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Stir in tomatoes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add dressing and toss to coat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve on lettuce-lined plates if desired.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 25, u'instructions': u'Directions                                                                                Cook pasta according to package directions. Meanwhile, in a small saucepan, cook the cauliflower, broccoli, carrots and yellow pepper in boiling water for 2 minutes. Rinse in cold water and drain well; place in a bowl. Drain pasta and rinse in cold water; add to vegetables. Cover and refrigerate for at least 30 minutes.                                                                                            Stir in tomatoes. Add dressing and toss to coat. Serve on lettuce-lined plates if desired.                                        Yield: 2 servings.                                                                                                                         Originally published as Fresh Vegetable Pasta Salad in  ReminisceOctober/November 2006, p49                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 218 calories, 12 g fat (2 g saturated fat), 0 cholesterol, 266 mg sodium, 24 g carbohydrate, 2 g fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/fresh-vegetable-pasta-salad-436440', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}