{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/607229-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 607229, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Wafer Ice Cream Sandwiches', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 69.08, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 (12 ounce) package mini chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'ounce'}, {u'originalString': u'1 (9 ounce) box chocolate wafer cookies', u'aisle': u'Sweet Snacks', u'name': u'chocolate wafer cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 10118157, u'unit': u'ounce'}, {u'originalString': u'1 quart ice cream, softened', u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'quart'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Chocolate-Wafer-Ice-Cream-Sandwiches/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'On a cookie sheet place 15 chocolate wafers flat side up. Working quickly, top each wafer with a small scoop of ice cream. Top each sandwich with another wafer, flat side down. Gently push the top wafers down until the ice cream comes to the edge of the wafer cookies. Freeze for one hour, or until firm.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'id': 10118157, u'name': u'chocolate wafer cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Roll each ice cream sandwich in mini chocolates chips so that all the exposed ice cream is covered. Cover and freeze until ready to serve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Ice Cream Sandwiches on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 214, u'instructions': u'On a cookie sheet place 15 chocolate wafers flat side up. Working quickly, top each wafer with a small scoop of ice cream. Top each sandwich with another wafer, flat side down. Gently push the top wafers down until the ice cream comes to the edge of the wafer cookies. Freeze for one hour, or until firm. Roll each ice cream sandwich in mini chocolates chips so that all the exposed ice cream is covered. Cover and freeze until ready to serve.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-wafer-ice-cream-sandwiches-607229', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 15, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}