{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479994-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479994, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegetarian White Bean and Chard Stew', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 306.66, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'4 carrots, peeled and diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 pound chard leaves, center ribs and stems removed', u'aisle': u'Produce', u'name': u'chard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11147, u'unit': u'pound'}, {u'originalString': u'1 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'2 tablespoons roughly chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tablespoons freshly grated pecorino (plus more for passing)', u'aisle': u'Cheese', u'name': u'pecorino', u'metaInformation': [u'freshly grated', u'plus more for passing)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1038, u'unit': u'tablespoons'}, {u'originalString': u'4 shallots, roughly chopped', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 tablespoon Sherry wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sherry wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012068, u'unit': u'tablespoon'}, {u'originalString': u'3 fresh thyme sprigs', u'aisle': u'Produce', u'name': u'thyme sprigs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'4 cups vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'2 15-ounce cans white beans, drained (or use dried, see note)', u'aisle': u'Pasta and Rice;Canned and Jarred;Produce', u'name': u'white beans', u'metaInformation': [u'dried', u'white', u'drained', u'canned', u'(or use , see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.0, u'consistency': u'solid', u'id': 10516050, u'unit': u'ounce'}], u'healthScore': 92.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://feedmephoebe.com/2012/01/vegetarian-white-bean-and-chard-stew/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat 2 tablespoons of olive oil in medium Dutch Oven or heavy lidded saucepan over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the carrots, shallots, and garlic, and cook until soft, stirring, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the white wine and simmer until liquid is slightly reduced, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}]}, {u'equipment': [], u'step': u'Add the white beans, 4 cups of broth, the thyme sprigs, and bay leaf and bring to boil. Reduce heat to medium-low and simmer 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-beans.jpg', u'id': 10516050, u'name': u'white beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Add the chard and simmer for 10 more minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}, {u'equipment': [], u'step': u'Remove thyme sprigs and bay leaf.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [], u'step': u'Add more broth by 1/2 cupfuls to thin stew, if desired.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Mix in Sherry wine vinegar, half the pecorino and parsley. Taste for seasoning, and add salt and pepper as necessary.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 1012068, u'name': u'sherry vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'pecorino'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Garnish with the remaining cheese and herbs.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with more cheese for passing, and a good piece of crusty, toasty country bread. For an even more substantial plate, spoon the stew over orchiette or another short past shape, and enjoy.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Stew on the menu? Try pairing with Cabernet Sauvignon, Chablis, and Malbec. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. The Ringbolt Cabernet Sauvignon with a 4.1 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'Ringbolt Cabernet Sauvignon 2009 is deep crimson red in color. The nose is complex with ripe blackcurrant cassis and red cherry fruit anchored by attractive base notes of oak, earthiness and a wisp of woodsmoke. The wine attacks with bright fleshy cherry fruit built upon by layers of leaf and leather. The finish is mouthfilling and lingering and the tannins giving persistent flesh and presence.', u'title': u'Ringbolt Cabernet Sauvignon', u'price': u'$17.99', u'id': 437917, u'link': u'https://www.wine.com/product/ringbolt-cabernet-sauvignon-2009/112598', u'imageUrl': u'https://spoonacular.com/productImages/437917-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'Heat 2 tablespoons of olive oil in medium Dutch Oven or heavy lidded saucepan over medium heat. Add the carrots, shallots, and garlic, and cook until soft, stirring, about 10 minutes. Add the white wine and simmer until liquid is slightly reduced, about 5 minutes. Add the white beans, 4 cups of broth, the thyme sprigs, and bay leaf and bring to boil. Reduce heat to medium-low and simmer 15 minutes. Add the chard and simmer for 10 more minutes. Remove thyme sprigs and bay leaf. Add more broth by 1/2 cupfuls to thin stew, if desired. Mix in Sherry wine vinegar, half the pecorino and parsley. Taste for seasoning, and add salt and pepper as necessary.Garnish with the remaining cheese and herbs. Serve with more cheese for passing, and a good piece of crusty, toasty country bread. For an even more substantial plate, spoon the stew over orchiette or another short past shape, and enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetarian-white-bean-and-chard-stew-479994', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}