{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/930701-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 930701, u'veryPopular': False, u'lowFodmap': False, u'title': u'Andouille and Chicken Jambalaya', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 165.03, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons extra-virgin olive oil, plus more for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 3-ounce fully cooked andouille sausages, sliced 1/4 inch thick', u'aisle': u'Meat', u'name': u'andouille sausages', u'metaInformation': [u'fully cooked', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 7064, u'unit': u'ounce'}, {u'originalString': u'2 stalks celery, chopped, plus leaves for topping', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 green bell pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'serving'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon Cajun seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'cajun seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032028, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup converted white rice', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20444, u'unit': u'cup'}, {u'originalString': u'1 15-ounce can diced fire-roasted tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 15-ounce can no-salt-added kidney beans, drained and rinsed', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'kidney beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16033, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups shredded rotisserie chicken or leftover turkey (skinless; about 8 ounces)', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'shredded', u'skinless', u'leftover', u'(; 8 ounces)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 5112, u'unit': u'cups'}], u'healthScore': 31.0, u'imageType': u'jpeg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchen/andouille-and-chicken-jambalaya-3562882', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat 2 tablespoons olive oil in a large pot over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the sausage and cook, stirring occasionally, until browned, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the celery, onion and bell pepper, season with salt and cook, stirring occasionally, until the vegetables soften, 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the tomato paste and Cajun seasoning and cook, stirring occasionally, until the vegetables are coated, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1032028, u'name': u'cajun seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Add the rice and cook, stirring, until coated, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the diced tomatoes and 5 cups water to the pot. Increase the heat to high and bring to a boil. Reduce the heat to a simmer, cover and cook until the rice is tender and the sauce thickens, 10 to 15 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Stir the beans and chicken into the pot and cook until warmed through, about 1 minute. Top each serving with celery leaves and drizzle with olive oil.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'id': 11143, u'name': u'celery leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Photograph by Justin Walker', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Ros\xe9 Wine, Sauvignon Blanc, and Albarino are my top picks for Jambalaya. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. One wine you could try is Cecchi Chianti Classico Riserva di Famiglia. It has 4.1 out of 5 stars and a bottle costs about 27 dollars.', u'pairedWines': [u'rose wine', u'sauvignon blanc', u'albarino'], u'productMatches': [{u'description': u'Chianti Classico Riserva di Famiglia is certainly the most representative wine of Cecchi. Produced only in years in which the grapes reach the quality desired it comes from the area of Castellina in Chianti. The color of excellent limpidity is of an intense ruby red. The aroma reveals broad and ethereal notes of ripe fruit and spices. The structure is elegant.', u'title': u'Cecchi Chianti Classico Riserva di Famiglia', u'price': u'$26.99', u'id': 459422, u'link': u'https://www.wine.com/product/cecchi-chianti-classico-riserva-di-famiglia-2014/240545', u'imageUrl': u'https://spoonacular.com/productImages/459422-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u'Heat 2 tablespoons olive oil in a large pot over medium-high heat. Add the sausage and cook, stirring occasionally, until browned, about 3 minutes. Add the celery, onion and bell pepper, season with salt and cook, stirring occasionally, until the vegetables soften, 3 to 5 minutes. Add the tomato paste and Cajun seasoning and cook, stirring occasionally, until the vegetables are coated, about 1 minute. Add the rice and cook, stirring, until coated, about 1 minute.                          Add the diced tomatoes and 5 cups water to the pot. Increase the heat to high and bring to a boil. Reduce the heat to a simmer, cover and cook until the rice is tender and the sauce thickens, 10 to 15 minutes.                          Stir the beans and chicken into the pot and cook until warmed through, about 1 minute. Top each serving with celery leaves and drizzle with olive oil.                          Photograph by Justin Walker', u'spoonacularSourceUrl': u'https://spoonacular.com/andouille-and-chicken-jambalaya-930701', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}