{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/214920-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 214920, u'veryPopular': True, u'lowFodmap': False, u'title': u'Christmas muffin mix', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 45.59, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'2 tsp ground mixed spice', u'aisle': u'Spices and Seasonings', u'name': u'ground all spice', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'2 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'140g tropical dried fruits medley', u'aisle': u'Produce', u'name': u'kiwi fruits', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 9148, u'unit': u'g'}, {u'originalString': u'100g light muscovado sugar', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'g'}, {u'originalString': u'100g pecans or walnuts', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 12142, u'unit': u'g'}, {u'originalString': u'300g self-raising flour', u'aisle': u'Baking', u'name': u'self-raising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 20129, u'unit': u'g'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2920/christmas-muffin-mix', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Layer all the ingredients in a 1 litre glass or plastic preserving jar in the order the ingredients are listed.Write the following method on a gift label: ‘Tip the contents of the jar into a large mixing bowl. Make a well in the centre and add 2 beaten eggs, 300ml/\xbdpt milk and 100g/4oz melted butter.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix quickly and lightly to a soft batter. Divide between 12 muffin cases.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Bake at 190C/fan 170C/gas 5 for 18-20 mins. Use within 4 weeks.’ Attach the label and a wooden spoon to the top of the jar with some raffia or coloured ribbon.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 9921, u'instructions': u'Layer all the ingredients in a 1 litre glass or plastic preserving jar in the order the ingredients are listed.Write the following method on a gift label: ‘Tip the contents of the jar into a large mixing bowl. Make a well in the centre and add 2 beaten eggs, 300ml/\xbdpt milk and 100g/4oz melted butter. Mix quickly and lightly to a soft batter. Divide between 12 muffin cases. Bake at 190C/fan 170C/gas 5 for 18-20 mins. Use within 4 weeks.’ Attach the label and a wooden spoon to the top of the jar with some raffia or coloured ribbon.', u'spoonacularSourceUrl': u'https://spoonacular.com/christmas-muffin-mix-214920', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}