{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/690723-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 690723, u'veryPopular': True, u'lowFodmap': False, u'title': u'White Chocolate Cranberry Sweet Rolls', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 47.95, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'4 cups all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbd cup butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 teaspoons corn starch', u'aisle': u'Baking', u'name': u'corn starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'3 cups cranberries (fresh or frozen)', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 9078, u'unit': u'cups'}, {u'originalString': u'\xbc cup 10% cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'10%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbe cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 teaspoons instant yeast', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10118375, u'unit': u'teaspoons'}, {u'originalString': u'1 cup warm milk (I put mine in the microwave for about 30-45 seconds)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'for 30-45 seconds)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'\xbd-3/4 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'\xbe teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'2 teaspoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup white chocolate, chopped (or chips)', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white', u'chopped', u'(or chips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19087, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.thereciperebel.com/white-chocolate-cranberry-sweet-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"In the bowl of a stand mixer (you can do it by hand too, you'll just need a little extra muscle), combine milk, butter, sugar, yeast and eggs.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to combine.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Put the dough hook on the mixer.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add salt and 4 cups of flour, one cup at a time with the mixer on low.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u"Add just enough flour so that the dough comes together in a ball away from the sides -- once it's not sticking to the sides anymore, stop adding flour (even if you haven't used all 4 cups). If you've used all 4 cups and the dough is still sticking, add a little bit of extra flour as necessary.Spray a piece of plastic wrap with non stick spray and cover the dough.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Place in a somewhat warm, draft-free spot (like an oven that's not on) for 1-1.5 hours until doubled.Meanwhile, make your filling.In a medium pot, combine cranberries, water and sugar and bring to a simmer over medium high heat. Reduce to medium heat and simmer, uncovered, for 10 minutes, stirring occasionally, until cranberries have burst and are soft. Smash cranberries with the back of your spatula.Stir together corn starch and 2 teaspoons water. Stir into cranberry sauce and let thicken.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from heat and let cool to room temperature (you can speed this up in the fridge or freezer).Preheat oven to 350 degrees F and lightly grease a 9x13" pan and an 8x8" pan.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Place dough on a floured surface.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out to a rectangle about 10" by 20-24".', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}], u'step': u'Spread cooled cranberry filling to within 1" of the edge and roll up, starting at the long edge (be sure not to squeeze too much or you\'ll lose all your filling!). Slice in 1.5" slices with a serrated knife and place in your prepared pans.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in a warm spot to rise for 20-30 minutes while the oven heats.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 25-30 minutes, until the tops are light golden brown all over (even in the middle).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and make your glaze.In a medium bowl, combine white chocolate and cream. Microwave on high for 1 minute, then stir until chocolate is smooth and melted.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'id': 19087, u'name': u'white chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in powdered sugar, adding a bit more if necessary to reach desired consistency (knowing that it will thicken somewhat as it cools). My glaze was pretty thin, and it soaked into all the cracks and crevices. If you prefer a thicker glaze, simply add more powdered sugar.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drizzle over warm rolls. Be sure to sneak one out of the pan immediately!', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Rolls can be stored at room temperature for 2-3 days, in the fridge for up to a week, or freeze for longer storage.', u'number': 16, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 741, u'instructions': u'In the bowl of a stand mixer (you can do it by hand too, you\'ll just need a little extra muscle), combine milk, butter, sugar, yeast and eggs. Whisk to combine.Put the dough hook on the mixer. Add salt and 4 cups of flour, one cup at a time with the mixer on low. Add just enough flour so that the dough comes together in a ball away from the sides -- once it\'s not sticking to the sides anymore, stop adding flour (even if you haven\'t used all 4 cups). If you\'ve used all 4 cups and the dough is still sticking, add a little bit of extra flour as necessary.Spray a piece of plastic wrap with non stick spray and cover the dough. Place in a somewhat warm, draft-free spot (like an oven that\'s not on) for 1-1.5 hours until doubled.Meanwhile, make your filling.In a medium pot, combine cranberries, water and sugar and bring to a simmer over medium high heat. Reduce to medium heat and simmer, uncovered, for 10 minutes, stirring occasionally, until cranberries have burst and are soft. Smash cranberries with the back of your spatula.Stir together corn starch and 2 teaspoons water. Stir into cranberry sauce and let thicken. Remove from heat and let cool to room temperature (you can speed this up in the fridge or freezer).Preheat oven to 350 degrees F and lightly grease a 9x13" pan and an 8x8" pan.Place dough on a floured surface. Roll out to a rectangle about 10" by 20-24". Spread cooled cranberry filling to within 1" of the edge and roll up, starting at the long edge (be sure not to squeeze too much or you\'ll lose all your filling!). Slice in 1.5" slices with a serrated knife and place in your prepared pans. Place in a warm spot to rise for 20-30 minutes while the oven heats.Bake for 25-30 minutes, until the tops are light golden brown all over (even in the middle). Remove from the oven and make your glaze.In a medium bowl, combine white chocolate and cream. Microwave on high for 1 minute, then stir until chocolate is smooth and melted. Whisk in powdered sugar, adding a bit more if necessary to reach desired consistency (knowing that it will thicken somewhat as it cools). My glaze was pretty thin, and it soaked into all the cracks and crevices. If you prefer a thicker glaze, simply add more powdered sugar.Drizzle over warm rolls. Be sure to sneak one out of the pan immediately!Rolls can be stored at room temperature for 2-3 days, in the fridge for up to a week, or freeze for longer storage.', u'spoonacularSourceUrl': u'https://spoonacular.com/white-chocolate-cranberry-sweet-rolls-690723', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}