{u'recipes': [{u'sourceName': u'Table for Two Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/594073-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 594073, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chicken and Chorizo Rice', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 366.59, u'creditText': u'Table for Two Blog', u'extendedIngredients': [{u'originalString': u'1.25 pounds of chorizo sausage, casings removed', u'aisle': u'Meat', u'name': u'chorizo sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 7019, u'unit': u'pounds'}, {u'originalString': u'2 cups white rice (already cooked)', u'aisle': u'Pasta and Rice', u'name': u'cooked white rice', u'metaInformation': [u'white', u'cooked', u'(already )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cups'}, {u'originalString': u'2 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3-4 tbsp. herbs de provence', u'aisle': u'Produce;Spices and Seasonings', u'name': u'herbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1002044, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 cup frozen peas, thawed', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'Salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 boneless, skinless chicken thighs', u'aisle': u'Meat', u'name': u'skinless boneless chicken thighs', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 5096, u'unit': u''}, {u'originalString': u'3 tbsp. tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tbsp'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.tablefortwoblog.com/chicken-and-chorizo-rice/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat outdoor grill. Season both sides of the chicken thighs with herbs de provence and salt and pepper. Set aside.In a large, heavy bottomed pan, saut\xe9 onions and garlic with 2 tbsp. of olive oil, stirring until onion is translucent, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'id': 1002044, u'name': u'herbs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add the chorizo sausage to the pan and break it up with a wooden spoon until they're in small pieces.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}]}, {u'equipment': [], u'step': u'Add the white rice and tomato paste to the mixture and stir until everything is combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Add the thawed frozen peas last.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the rice sit in the pan to keep warm while you grill the chicken. Grill the chicken on your preheated grill for about 5 minutes on each side.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the chicken and chorizo rice together.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}]}], u'name': u''}], u'aggregateLikes': 679, u'instructions': u"Preheat outdoor grill. Season both sides of the chicken thighs with herbs de provence and salt and pepper. Set aside.In a large, heavy bottomed pan, saut\xe9 onions and garlic with 2 tbsp. of olive oil, stirring until onion is translucent, about 3 minutes. Add the chorizo sausage to the pan and break it up with a wooden spoon until they're in small pieces. Add the white rice and tomato paste to the mixture and stir until everything is combined. Add the thawed frozen peas last.Let the rice sit in the pan to keep warm while you grill the chicken. Grill the chicken on your preheated grill for about 5 minutes on each side.Serve the chicken and chorizo rice together.", u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-and-chorizo-rice-594073', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}