{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/491039-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 491039, u'veryPopular': True, u'lowFodmap': False, u'title': u'BLT Chicken Braid', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 172.51, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'3/4 cup crumbled cooked bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'crumbled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 10123, u'unit': u'cup'}, {u'originalString': u'1 cup chopped cooked chicken', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'cooked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 5112, u'unit': u'cup'}, {u'originalString': u'chopped lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'3/4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 package refrigerated crescent rolls (Pillsbury 8 oz.)', u'aisle': u'Refrigerated', u'name': u'refrigerated crescent rolls', u'metaInformation': [u'refrigerated', u'(Pillsbury 8 oz.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 93618, u'unit': u'package'}, {u'originalString': u'1 1/2 cups shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cups'}, {u'originalString': u'diced tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11529, u'unit': u'servings'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://insidebrucrewlife.com/2013/07/blt-chicken-braid/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a mixing bowl, stir together the chicken, cheese, bacon, and mayonnaise. Set aside.Open the crescent rolls. Lay out the dough on a non stick baking sheet. Press together all the seams.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Cut small strips 1 1/2 inches apart along both sides. Leave about a 3 inch row in the center that is uncut.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the chicken mixture down the center evenly. Cross the strips over each other in a braid pattern. Press the end together.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375* for 20 minutes.Top the braid with lettuce and tomato before serving.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Cut into 8 pieces.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 18265, u'instructions': u'In a mixing bowl, stir together the chicken, cheese, bacon, and mayonnaise. Set aside.Open the crescent rolls. Lay out the dough on a non stick baking sheet. Press together all the seams. Cut small strips 1 1/2 inches apart along both sides. Leave about a 3 inch row in the center that is uncut. Spread the chicken mixture down the center evenly. Cross the strips over each other in a braid pattern. Press the end together. Bake at 375* for 20 minutes.Top the braid with lettuce and tomato before serving. Cut into 8 pieces.', u'spoonacularSourceUrl': u'https://spoonacular.com/blt-chicken-braid-491039', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}