{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/918478-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 200, u'id': 918478, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beef Wellington', u'diets': [], u'preparationMinutes': 50, u'pricePerServing': 559.83, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 2-pound center-cut beef tenderloin, tied by your butcher', u'aisle': u'Meat', u'name': u'beef tenderloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-tenderloin.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 13926, u'unit': u'pound'}, {u'originalString': u'2 tablespoons dried breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18079, u'unit': u'tablespoons'}, {u'originalString': u'4 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 pound button mushrooms', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'pound'}, {u'originalString': u'2 tablespoons Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons finely chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 tablespoons prepared horseradish', u'aisle': u'Produce', u'name': u'horseradish', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1002055, u'unit': u'tablespoons'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 sheet frozen puff pastry (from a 17.3-ounce package), thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'frozen', u'thawed', u'(from a 17.3-ounce package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheet'}, {u'originalString': u'Flaky sea salt, for sprinkling', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpeg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/nancy-fuller/beef-wellington-2383007', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Sprinkle the tenderloin generously on all sides with salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tablespoons oil in a large skillet over high heat. Sear the beef on all sides, 8 to 10 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Remove to a baking sheet and cool completely, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add half of the mushrooms to a food processor and pulse until they are very finely chopped.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the finely chopped mushrooms to a bowl and continue with the other half of the mushrooms. Reserve.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the butter and remaining tablespoon of oil in a large pan over medium-high heat. Once melted and foaming, add the shallots and sweat until fully softened, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the mushrooms to the pan and saute until they release all their moisture and then dry, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add the heavy cream and simmer until thick, about 2 minutes. Turn off the heat and stir in the breadcrumbs and parsley.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the mushrooms to a small bowl, cool completely and chill in the refrigerator for at least 1 hour. The mushrooms should now look like a paste.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Combine the Dijon and horseradish in a small bowl. Once the meat is cool to the touch, snip off the butcher's twine and discard, and then spread the mustard and horseradish mixture all over the beef.", u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'id': 1002055, u'name': u'horseradish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Place in the refrigerator to chill for 1 hour.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Adjust a rack to the center of the oven and preheat to 400 degrees F. Line a baking sheet with parchment paper.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Crack the egg into a small bowl and beat until smooth. Dust the work area lightly with flour.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u"Roll out the puff pastry with a rolling pin so it's 4 inches longer than the tenderloin and 6 to 7 inches wider.", u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [], u'step': u'Brush a 3-inch edge of the pastry with the beaten egg.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Spread and pat the mushroom mixture all over the top and sides of the beef. Lay the beef mushroom-side down in the center of the pastry and pat the remaining mushrooms onto the exposed side. Tuck the 2 ends of the pastry into the beef and then fold up the other sides.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the beef seam-side down on the baking sheet.', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Brush all over with the egg wash.', u'number': 18, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Cut 3 slits on the top of the roast and sprinkle lightly with flaky sea salt.', u'number': 19, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Roast until a thermometer inserted into the beef reads 120 degrees F, about 40 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 20, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 125.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove from the oven and rest for 20 minutes before slicing into 1-inch-thick pieces. The temperature will rise to 125 degrees F, leaving you with a nice ruby red medium rare.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 21, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 52, u'instructions': u"Sprinkle the tenderloin generously on all sides with salt and pepper. Heat 2 tablespoons oil in a large skillet over high heat. Sear the beef on all sides, 8 to 10 minutes. Remove to a baking sheet and cool completely, about 20 minutes.                          Add half of the mushrooms to a food processor and pulse until they are very finely chopped. Remove the finely chopped mushrooms to a bowl and continue with the other half of the mushrooms. Reserve.                          Heat the butter and remaining tablespoon of oil in a large pan over medium-high heat. Once melted and foaming, add the shallots and sweat until fully softened, about 4 minutes. Add the mushrooms to the pan and saute until they release all their moisture and then dry, about 10 minutes. Add the heavy cream and simmer until thick, about 2 minutes. Turn off the heat and stir in the breadcrumbs and parsley. Remove the mushrooms to a small bowl, cool completely and chill in the refrigerator for at least 1 hour. The mushrooms should now look like a paste.                          Combine the Dijon and horseradish in a small bowl. Once the meat is cool to the touch, snip off the butcher's twine and discard, and then spread the mustard and horseradish mixture all over the beef. Place in the refrigerator to chill for 1 hour.                          Adjust a rack to the center of the oven and preheat to 400 degrees F. Line a baking sheet with parchment paper.                          Crack the egg into a small bowl and beat until smooth. Dust the work area lightly with flour. Roll out the puff pastry with a rolling pin so it's 4 inches longer than the tenderloin and 6 to 7 inches wider. Brush a 3-inch edge of the pastry with the beaten egg. Spread and pat the mushroom mixture all over the top and sides of the beef. Lay the beef mushroom-side down in the center of the pastry and pat the remaining mushrooms onto the exposed side. Tuck the 2 ends of the pastry into the beef and then fold up the other sides. Place the beef seam-side down on the baking sheet. Brush all over with the egg wash. Cut 3 slits on the top of the roast and sprinkle lightly with flaky sea salt.                          Roast until a thermometer inserted into the beef reads 120 degrees F, about 40 minutes. Remove from the oven and rest for 20 minutes before slicing into 1-inch-thick pieces. The temperature will rise to 125 degrees F, leaving you with a nice ruby red medium rare.", u'spoonacularSourceUrl': u'https://spoonacular.com/beef-wellington-918478', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}