{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/698128-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 698128, u'veryPopular': False, u'lowFodmap': False, u'title': u'Veal Stew', u'diets': [u'dairy free'], u'preparationMinutes': 45, u'pricePerServing': 242.95, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 14-ounce can plum tomatoes, drained and chopped', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'drained', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'4 carrots, thickly sliced on the diagonal', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 3-inch sprig fresh rosemary or 1 teaspoon dried, chopped', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'dried', u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprig', u'unitShort': u'sprig', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'sprig'}, {u'originalString': u'2 cloves garlic, finely chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 cup reduced-sodium chicken broth, or water', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'1 1/2 tablespoons extra-virgin olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 ounce pancetta, country ham or bacon, finely chopped', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 10410123, u'unit': u'ounce'}, {u'originalString': u'4 sprigs sprigs parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'sprigs'}, {u'originalString': u'4 cups fresh pearl onions, or 2 cups frozen pearl onions', u'aisle': u'Produce', u'name': u'pearl onions', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10111282, u'unit': u'cups'}, {u'originalString': u'1 pound portobello mushrooms, cut into large pieces, or cremini mushrooms, quartered', u'aisle': u'Produce', u'name': u'portobello mushrooms', u'metaInformation': [u'large', u'quartered', u'cut into  pieces, or cremini mushrooms, '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11265, u'unit': u'pound'}, {u'originalString': u'Salt & freshly ground pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/2 pounds lean stewing veal (from the leg), trimmed and cut into 1 1/2-inch cubes', u'aisle': u'Meat', u'name': u'veal', u'metaInformation': [u'lean', u'trimmed', u'cut into 1 1/2-inch cubes', u'(from the leg)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 17142, u'unit': u'pounds'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/veal_stew.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To make a bouquet garni, tie together parsley sprigs, rosemary and bay leaves with kitchen twine, or place in a cheesecloth bag; set aside.Preheat oven to 325F.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat 1 1/2 teaspoons oil in a large ovenproof pot or Dutch oven over high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add half of the veal and brown well on all sides, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer to a plate lined with paper towels and repeat with another 1 1/2 teaspoons oil and the remaining veal. Set aside.Reduce the heat to low, add pancetta (or ham or bacon) and cook, stirring, until it begins to brown.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [], u'step': u'Add carrots and cook, stirring, until they begin to soften, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Add chopped onion and cook, stirring, for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic and flour and stir for 30 seconds.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour in wine, scraping the solids from the bottom of the pot.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add tomatoes, broth (or water), the browned veal and the bouquet garni. Bring the stew to a simmer, cover the pot and transfer to the oven.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bake the stew, stirring occasionally, until the veal is tender when pierced with a fork, about 1 1/2 hours.Meanwhile, if using fresh pearl onions, bring a large saucepan of water to a boil.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'id': 10111282, u'name': u'pearl onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [], u'step': u'Add the onions (unpeeled) and cook for 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drain and rinse under cold water. When they are cool enough to handle, trim the ends and peel off the papery skins. (If using frozen pearl onions, thaw under cool running water and pat dry.)', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'id': 10111282, u'name': u'pearl onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining 1 1/2 teaspoons oil in a large nonstick skillet over medium-high heat.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pearl onions and saut until golden, 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'id': 10111282, u'name': u'pearl onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the onions to a bowl and return the pan to the heat.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add mushrooms and saut until they begin to exude some liquid, 4 to 6 minutes.Stir the pearl onions and mushrooms into the stew during the last 10 minutes of cooking. Just before serving, remove the bouquet garni and stir in chopped parsley. Season with salt and pepper.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'id': 10111282, u'name': u'pearl onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Stew can be paired with Cabernet Sauvignon, Chablis, and Malbec. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. The Ringbolt Cabernet Sauvignon with a 4.1 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'Ringbolt Cabernet Sauvignon 2009 is deep crimson red in color. The nose is complex with ripe blackcurrant cassis and red cherry fruit anchored by attractive base notes of oak, earthiness and a wisp of woodsmoke. The wine attacks with bright fleshy cherry fruit built upon by layers of leaf and leather. The finish is mouthfilling and lingering and the tannins giving persistent flesh and presence.', u'title': u'Ringbolt Cabernet Sauvignon', u'price': u'$17.99', u'id': 437917, u'link': u'https://www.wine.com/product/ringbolt-cabernet-sauvignon-2009/112598', u'imageUrl': u'https://spoonacular.com/productImages/437917-312x231.jpg'}]}, u'aggregateLikes': 23, u'instructions': u'To make a bouquet garni, tie together parsley sprigs, rosemary and bay leaves with kitchen twine, or place in a cheesecloth bag; set aside.Preheat oven to 325F. Heat 1 1/2 teaspoons oil in a large ovenproof pot or Dutch oven over high heat. Add half of the veal and brown well on all sides, about 4 minutes. Transfer to a plate lined with paper towels and repeat with another 1 1/2 teaspoons oil and the remaining veal. Set aside.Reduce the heat to low, add pancetta (or ham or bacon) and cook, stirring, until it begins to brown. Add carrots and cook, stirring, until they begin to soften, about 5 minutes. Add chopped onion and cook, stirring, for 2 minutes. Add garlic and flour and stir for 30 seconds. Pour in wine, scraping the solids from the bottom of the pot. Add tomatoes, broth (or water), the browned veal and the bouquet garni. Bring the stew to a simmer, cover the pot and transfer to the oven. Bake the stew, stirring occasionally, until the veal is tender when pierced with a fork, about 1 1/2 hours.Meanwhile, if using fresh pearl onions, bring a large saucepan of water to a boil. Add the onions (unpeeled) and cook for 3 minutes. Drain and rinse under cold water. When they are cool enough to handle, trim the ends and peel off the papery skins. (If using frozen pearl onions, thaw under cool running water and pat dry.)Heat the remaining 1 1/2 teaspoons oil in a large nonstick skillet over medium-high heat. Add the pearl onions and saut until golden, 6 to 8 minutes. Transfer the onions to a bowl and return the pan to the heat. Add mushrooms and saut until they begin to exude some liquid, 4 to 6 minutes.Stir the pearl onions and mushrooms into the stew during the last 10 minutes of cooking. Just before serving, remove the bouquet garni and stir in chopped parsley. Season with salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/veal-stew-698128', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 135, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}