{u'recipes': [{u'sourceName': u'A Cedar Spoon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/810784-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 810784, u'veryPopular': True, u'lowFodmap': False, u'title': u'4 Ingredient Slow Cooker Shredded Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 178.0, u'creditText': u'A Cedar Spoon', u'extendedIngredients': [{u'originalString': u'1-15.5 oz can of black beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'1-4 oz can of diced green chilies', u'aisle': u'Produce', u'name': u'green chilies', u'metaInformation': [u'diced', u'green', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 31015, u'unit': u'oz'}, {u'originalString': u'1-15.5 oz jar of salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'liquid', u'id': 6164, u'unit': u'oz'}, {u'originalString': u'2 lbs. boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lbs'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.acedarspoon.com/4-ingredient-slow-cooker-shredded-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the chicken breasts on the bottom of the slow cooker. Cover the chicken with the remaining ingredients, spreading the salsa, beans and green chilies over the chicken breasts to make sure they are covered.Cook on low for 5-6 hours or high for 3-4 hours. With 30 minutes left remove the chicken breasts from the slow cooker and shred with two forks. Return the chicken to the slow cooker and stir to make sure the chicken gets covered with the juices again. Finish cooking.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'id': 31015, u'name': u'green chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve on tacos, salad, sandwiches, burrito bowls and more.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 925, u'instructions': u'Place the chicken breasts on the bottom of the slow cooker. Cover the chicken with the remaining ingredients, spreading the salsa, beans and green chilies over the chicken breasts to make sure they are covered.Cook on low for 5-6 hours or high for 3-4 hours. With 30 minutes left remove the chicken breasts from the slow cooker and shred with two forks. Return the chicken to the slow cooker and stir to make sure the chicken gets covered with the juices again. Finish cooking.Serve on tacos, salad, sandwiches, burrito bowls and more.', u'spoonacularSourceUrl': u'https://spoonacular.com/4-ingredient-slow-cooker-shredded-chicken-810784', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 365, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}