{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/204179-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 204179, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bloody Mary-Flavored Gazpacho', u'diets': [u'dairy free'], u'pricePerServing': 139.03, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 rib celery, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'rib', u'unitShort': u'rib', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'Finely sliced chives, to garnish', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11156, u'unit': u'servings'}, {u'originalString': u'1 cucumber, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'Grated fresh or prepared horseradish, to garnish', u'aisle': u'Produce', u'name': u'fresh horseradish', u'metaInformation': [u'fresh', u'grated', u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 98949, u'unit': u'servings'}, {u'originalString': u'Sliced green olives, to garnish', u'aisle': u'Canned and Jarred', u'name': u'green olives', u'metaInformation': [u'green', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-olives---sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1029195, u'unit': u'servings'}, {u'originalString': u'Dash hot sauce', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'Dash'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/2 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Finely chopped dill or parsley, to garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1 small red onion, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 tablespoon sherry vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sherry vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012068, u'unit': u'tablespoon'}, {u'originalString': u'3 large tomatoes, cut into large chunks', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'large', u'cut into  chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 slice white bread, crust removed, torn into pieces', u'aisle': u'Bakery/Bread', u'name': u'white bread', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slice'}, {u'originalString': u'Dash Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'Dash'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/07/bloody-mary-gazpacho-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Toss tomatoes, cucumber, red onion, and celery with a good pinch of salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a strainer over a large bowl, then place torn bread beneath the strainer and let sit for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place half of vegetables and bread in a blender. Blend on high speed until smooth, about 1 minute. With blender running, drizzle in half of olive oil in a thin, steady stream. Strain through a fine mesh strainer. Repeat with remaining half of vegetables, bread, and olive oil.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add vineger then season to taste with Worcestershire sauce, hot sauce, salt and pepper. Divide soup between  4 bowls and arrange all the optional garnishes on a platter and serve along side to be added to the soup at the table. Some suggestions for more garnishes: pickles (cucumber is the classic, but green bean, asparagus and carrots are excellent as well), shucked oysters or clams, celery stems with leaves, and beefy jerky. Vodka optional.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Albarino, Manzanilla Sherry, and Verdejo are great choices for Gazpacho. Though gazpacho is said to be a tricky pairing, all these Spanish wines can work. One wine you could try is Martin Codax Albarino. It has 4.1 out of 5 stars and a bottle costs about 17 dollars.', u'pairedWines': [u'albarino', u'manzanilla sherry', u'verdejo'], u'productMatches': [{u'description': u'The Martin Codax 2011 Rias Baixas Albarino is delicate and medium-bodied with a crisp, dry finish. Flavors of ripe apple, peach, pear and lemon zest are framed by bright minerality and hints of spice. This Albari\xf1o displays intense floral aromas and an attractive acidity, making it a versatile, food-friendly wine. View More', u'title': u'Martin Codax Albarino', u'price': u'$16.99', u'id': 436904, u'link': u'https://www.wine.com/product/martin-codax-albarino-2011/121023', u'imageUrl': u'https://spoonacular.com/productImages/436904-312x231.jpg'}]}, u'aggregateLikes': 83, u'instructions': u'Procedures                                                                              1                                                                            Toss tomatoes, cucumber, red onion, and celery with a good pinch of salt.  Place in a strainer over a large bowl, then place torn bread beneath the strainer and let sit for 30 minutes.                                                                                                                            2                                                                            Place half of vegetables and bread in a blender. Blend on high speed until smooth, about 1 minute. With blender running, drizzle in half of olive oil in a thin, steady stream. Strain through a fine mesh strainer. Repeat with remaining half of vegetables, bread, and olive oil.                                                                                                                            3                                                                            Add vineger then season to taste with Worcestershire sauce, hot sauce, salt and pepper. Divide soup between  4 bowls and arrange all the optional garnishes on a platter and serve along side to be added to the soup at the table. Some suggestions for more garnishes: pickles (cucumber is the classic, but green bean, asparagus and carrots are excellent as well), shucked oysters or clams, celery stems with leaves, and beefy jerky. Vodka optional.', u'spoonacularSourceUrl': u'https://spoonacular.com/bloody-mary-flavored-gazpacho-204179', u'dishTypes': [u'soup'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}