{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/215147-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 215147, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy risotto layer cake', u'diets': [u'gluten free'], u'preparationMinutes': 50, u'pricePerServing': 325.03, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'about 50g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 large butternut squash (about 1.2kg unprepped weight), peeled and cut into small cubes', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'small', u'large', u'peeled', u'cut into  cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'2 Savoy cabbages (you only need the outside leaves)', u'aisle': u'Produce', u'name': u'cabbages', u'metaInformation': [u'(you only need the outside leaves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11109, u'unit': u''}, {u'originalString': u'200g pack vacuum-packed chestnuts, roughly chopped', u'aisle': u'Produce', u'name': u'chestnuts', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chestnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 12098, u'unit': u'g'}, {u'originalString': u'2 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'250g tub mascarpone', u'aisle': u'Cheese', u'name': u'mascarpone', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 93820, u'unit': u'g'}, {u'originalString': u'4 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'100g vegetarian parmesan -style cheese, finely grated (we used Twineham Grange Itlaian-style cheese)', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'itlaian-style', u'finely grated', u'(we used Twineham Grange cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'100g pack pine nuts, toasted', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 12147, u'unit': u'g'}, {u'originalString': u'500g pack risotto rice (we used arborio)', u'aisle': u'Pasta and Rice', u'name': u'risotto rice', u'metaInformation': [u'(we used arborio)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10020052, u'unit': u'g'}, {u'originalString': u'2 sprigs rosemary, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2036, u'unit': u'sprigs'}, {u'originalString': u'small bunch sage, chopped', u'aisle': u'Spices and Seasonings', u'name': u'sage', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'bunch'}, {u'originalString': u'300g shallots, half chopped, the rest thinly sliced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'thinly sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 11677, u'unit': u'g'}, {u'originalString': u'1.2-1.4l/2-2\xbd pts hot vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.2, u'consistency': u'liquid', u'id': 6615, u'unit': u''}, {u'originalString': u'200ml white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'ml'}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipe/creamy-risotto-layer-cake', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tbsp oil in a large pan and fry the chopped shallots over a low heat for 10 mins until well softened.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the garlic, cook for another min, then tip in the rice. Stir the rice until coated in the oil, and keep stirring until the grains are really hot and starting to hiss.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Pour in the wine and stir. Once it’s almost all been absorbed, start adding the stock,a ladle at a time, allowing each ladleful to absorb before adding the next. Stir in a good knob of butter and 25g of the vegetarian parmesan and season to taste. Tip onto a large baking tray and spread out so that it cools quickly (see Know-how, below). Once cool, keep covered in the fridge. Can be cooked and cooled up to 2 days ahead.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/fan 180C/gas 6. Tip the squash into a roasting pan. Toss with 1 tbsp oil and roast for about 30 mins until softened and golden, turning it occasionally. Meanwhile, melt another knob of butter in a frying pan, add 1 tbsp oil, then fry the sliced shallots until softened and dark golden, about 15 mins. Stir in the chestnuts, pine nuts and herbs, season, then cook for another 2 mins until heated through.', u'length': {u'number': 47, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chestnuts.jpg', u'id': 12098, u'name': u'chestnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix with the roasted squash. Can be made up to 2 days ahead.Bring a large pan of salted water to the boil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove any tough outer leaves from the cabbage, then separate the large green leaves from the heads. You’ll need about 10. Blanch for 2 mins or until just tender, then plunge into cold water and drain. Line a 23cm springform cake tin with cling film (or, if reheating in the oven, just butter the tin liberally), then line with most of the cabbage leaves, overlapping slightly and leaving an overhanging edge.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Mix the remaining vegetarian parmesan and the mascarpone together, seasoning well with salt and pepper. Spoon half the risotto into the tin (if you’ve chilled the risotto overnight,it’ll need breaking up a little with a fork), then top with the squash mix. Spoon the mascarpone mix over the top, then finish with a second layer of risotto, pressing in firmly.Fold the overhanging edges of the cabbage over the risotto and then ‘seal’ it in with the remaining leaves. Cover with the overhanging cling film; weight down with a dinner plate. Can be made up to 2 days ahead (if risotto is cooked, cooled and layered on the day).To reheat, turn the cake (still in its cling film) out of the tin onto a microwave-proof plate and cook on Medium for 10 mins or until piping hot throughout. (Microwaving will give you the best results as it keeps the cabbage green and vibrant.) To reheat in the oven, leave the cake in its tin, cover with buttered foil and heat for 30 mins at 180C/fan 160C/gas 4 until hot through.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Heat 2 tbsp oil in a large pan and fry the chopped shallots over a low heat for 10 mins until well softened. Add the garlic, cook for another min, then tip in the rice. Stir the rice until coated in the oil, and keep stirring until the grains are really hot and starting to hiss. Pour in the wine and stir. Once it’s almost all been absorbed, start adding the stock,a ladle at a time, allowing each ladleful to absorb before adding the next. Stir in a good knob of butter and 25g of the vegetarian parmesan and season to taste. Tip onto a large baking tray and spread out so that it cools quickly (see Know-how, below). Once cool, keep covered in the fridge. Can be cooked and cooled up to 2 days ahead.Heat oven to 200C/fan 180C/gas 6. Tip the squash into a roasting pan. Toss with 1 tbsp oil and roast for about 30 mins until softened and golden, turning it occasionally. Meanwhile, melt another knob of butter in a frying pan, add 1 tbsp oil, then fry the sliced shallots until softened and dark golden, about 15 mins. Stir in the chestnuts, pine nuts and herbs, season, then cook for another 2 mins until heated through. Mix with the roasted squash. Can be made up to 2 days ahead.Bring a large pan of salted water to the boil. Remove any tough outer leaves from the cabbage, then separate the large green leaves from the heads. You’ll need about 10. Blanch for 2 mins or until just tender, then plunge into cold water and drain. Line a 23cm springform cake tin with cling film (or, if reheating in the oven, just butter the tin liberally), then line with most of the cabbage leaves, overlapping slightly and leaving an overhanging edge. Mix the remaining vegetarian parmesan and the mascarpone together, seasoning well with salt and pepper. Spoon half the risotto into the tin (if you’ve chilled the risotto overnight,it’ll need breaking up a little with a fork), then top with the squash mix. Spoon the mascarpone mix over the top, then finish with a second layer of risotto, pressing in firmly.Fold the overhanging edges of the cabbage over the risotto and then ‘seal’ it in with the remaining leaves. Cover with the overhanging cling film; weight down with a dinner plate. Can be made up to 2 days ahead (if risotto is cooked, cooled and layered on the day).To reheat, turn the cake (still in its cling film) out of the tin onto a microwave-proof plate and cook on Medium for 10 mins or until piping hot throughout. (Microwaving will give you the best results as it keeps the cabbage green and vibrant.) To reheat in the oven, leave the cake in its tin, cover with buttered foil and heat for 30 mins at 180C/fan 160C/gas 4 until hot through.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-risotto-layer-cake-215147', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 175, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}