{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/839836-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 839836, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sheet Pan Chicken and Veggie "Stir Fry', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 172.21, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'1/2 pound asparagus, cut into bite-sized pieces', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11011, u'unit': u'pound'}, {u'originalString': u'1 bell pepper, cored and sliced into bite-sized pieces', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'cored', u'sliced into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'3 cups broccoli florets', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'cups'}, {u'originalString': u'2 cups Brussels sprouts, halved (with ends trimmed off)', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'with ends trimmed off)', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11098, u'unit': u'cups'}, {u'originalString': u'1 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons avocado oil or olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon oyster sauce', u'aisle': u'Ethnic Foods', u'name': u'oyster sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6176, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon freshly-cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 small red onion, peeled and thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'3 tablespoons rice wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoon'}, {u'originalString': u'optional: thinly-sliced green onions and toasted sesame seeds, for garnish', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'toasted', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 12023, u'unit': u'servings'}, {u'originalString': u'1.25 pounds boneless skinless chicken breasts, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}, {u'originalString': u'1/3 cup soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'1 batch stir-fry sauce (see below)', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'(see below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u''}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.gimmesomeoven.com/sheet-pan-chicken-stir-fry/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk all ingredients together until combined.', u'number': 1, u'ingredients': []}], u'name': u'Remove from the oven and serve immediately.How To Make The Stir-Fry Sauce'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 425F. Grease a large baking sheet with cooking spray, and set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the chicken and stir-fry sauce together in a large bowl, and toss until combined. Refrigerate and let the chicken marinate while you chop the remaining veggies. (Or you can let it marinate in the refrigerator in a sealed container for up to 8 hours in advance for maximum flavor.)Once the veggies are ready, add them to the bowl with the chicken, and toss until the veggies are evenly coated with the sauce.Turn the chicken and veggies out onto the prepared baking sheet, and spread them out so that they are in an even layer.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 14-16 minutes, stirring once halfway through, until the chicken is cooked through and no longer pink inside.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u'How To Make The Stir-Fry'}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 427, u'instructions': u'How To Make The Stir-Fry:Heat oven to 425F. Grease a large baking sheet with cooking spray, and set aside.Combine the chicken and stir-fry sauce together in a large bowl, and toss until combined. Refrigerate and let the chicken marinate while you chop the remaining veggies. (Or you can let it marinate in the refrigerator in a sealed container for up to 8 hours in advance for maximum flavor.)Once the veggies are ready, add them to the bowl with the chicken, and toss until the veggies are evenly coated with the sauce.Turn the chicken and veggies out onto the prepared baking sheet, and spread them out so that they are in an even layer.Bake for 14-16 minutes, stirring once halfway through, until the chicken is cooked through and no longer pink inside.Remove from the oven and serve immediately.How To Make The Stir-Fry Sauce:Whisk all ingredients together until combined.', u'spoonacularSourceUrl': u'https://spoonacular.com/sheet-pan-chicken-and-veggie-stir-fry-839836', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}