{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597755-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 597755, u'veryPopular': False, u'lowFodmap': False, u'title': u'Carrot Soup with Chicken and Thyme', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 173.35, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 1/2 pounds carrots, peeled and cut crossways into 1/4-inch slices', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11124, u'unit': u'pounds'}, {u'originalString': u'4 cups homemade chicken stock or canned chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'homemade', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'1 1/2 teaspoons fresh thyme leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'1 lemon, halved', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 cup shredded roast or rotisserie chicken', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 5112, u'unit': u'cup'}, {u'originalString': u'Fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'1 medium white onion, coarsely chopped', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'medium', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}, {u'originalString': u'Freshly ground peppercorns, preferably white', u'aisle': u'Spices and Seasonings', u'name': u'white peppercorns', u'metaInformation': [u'white', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002032, u'unit': u'servings'}, {u'originalString': u'1/2 pound new or Yukon Gold Potatoes, peeled and cut into 1/4-inch cubes', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'peeled', u'cut into 1/4-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 10211362, u'unit': u'pound'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://leitesculinaria.com/70989/recipes-carrot-soup.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the oil and butter in a large saucepan over medium heat until the butter melts.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion and reduce the heat to low. Cover and cook until softened, about 15 minutes. (This is commonly known as “sweating” the onion, as the pieces will throw off some perspiration, er, moisture and will soften and sweeten but not brown.)2. Stir in the carrots, potatoes, and 1/2 teaspoon of the salt and cook, covered, for 10 minutes more.3.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the stock or broth, increase the heat to medium, and gently simmer, uncovered, until the vegetables are tender, 25 to 30 minutes. Pur\xe9e the soup with an immersion blender or let the soup cool for about 10 minutes and then pur\xe9e it in a blender, working in batches if necessary. Return the soup to the pan and gently reheat. Taste and adjust the seasonings, adding a pinch or two of sugar to sweeten the soup, if desired.4. Divide the soup among serving bowls. Top each portion with some chicken, a pinch each of thyme leaves and coarsely or finely ground white pepper, and, if you’d like a little something sour to offset the sweet, a scant drop or two of juice from half the lemon.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'id': 2032, u'name': u'ground white pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the other half of the lemon into 4 thin slices and garnish each bowl with a slice, just to make it look a little extra lovely.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}], u'name': u''}], u'aggregateLikes': 170, u'instructions': u'1. Heat the oil and butter in a large saucepan over medium heat until the butter melts. Add the onion and reduce the heat to low. Cover and cook until softened, about 15 minutes. (This is commonly known as “sweating” the onion, as the pieces will throw off some perspiration, er, moisture and will soften and sweeten but not brown.)2. Stir in the carrots, potatoes, and 1/2 teaspoon of the salt and cook, covered, for 10 minutes more.3. Add the stock or broth, increase the heat to medium, and gently simmer, uncovered, until the vegetables are tender, 25 to 30 minutes. Pur\xe9e the soup with an immersion blender or let the soup cool for about 10 minutes and then pur\xe9e it in a blender, working in batches if necessary. Return the soup to the pan and gently reheat. Taste and adjust the seasonings, adding a pinch or two of sugar to sweeten the soup, if desired.4. Divide the soup among serving bowls. Top each portion with some chicken, a pinch each of thyme leaves and coarsely or finely ground white pepper, and, if you’d like a little something sour to offset the sweet, a scant drop or two of juice from half the lemon. Cut the other half of the lemon into 4 thin slices and garnish each bowl with a slice, just to make it look a little extra lovely.', u'spoonacularSourceUrl': u'https://spoonacular.com/carrot-soup-with-chicken-and-thyme-597755', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}