{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536038-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 536038, u'veryPopular': False, u'lowFodmap': False, u'title': u'Asparagus Tart with Balsamic Reduction', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 277.51, u'extendedIngredients': [{u'originalString': u'1 bunch (12-ounces) asparagus spears, trimmed, cut into thirds', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'trimmed', u'cut into thirds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11011, u'unit': u'ounces'}, {u'originalString': u'1/4 cup balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'1 cup shredded Gruyere cheese', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1023, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'1 sheet frozen puff pastry, thawed, cut into 4 squares', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'frozen', u'thawed', u'cut into 4 squares'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheet'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://DAMNDELICIOUS.NET/2013/05/13/asparagus-tart-with-balsamic-reduction/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F. Line a baking sheet with parchment paper or a silicone baking mat; set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place puff pastry squares onto prepared baking sheet. Using a fork, pierce each square to create a 1/2-inch border. Sprinkle Gruyere and Parmesan evenly over the top. Arrange asparagus spears in a single layer over the cheese, alternating ends and tips.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'id': 1023, u'name': u'gruyere'}]}, {u'equipment': [], u'step': u'Drizzle with olive oil; season with salt and pepper, to taste.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into oven and bake until golden brown, about 15-20 minutes. Meanwhile, to make the balsamic reduction, add balsamic vinegar to a small saucepan over medium heat. Bring to a boil until thick and reduced, about 4-5 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}]}, {u'equipment': [], u'step': u'Serve asparagus tart squares immediately, drizzled with balsamic reduction.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Preheat oven to 400 degrees F. Line a baking sheet with parchment paper or a silicone baking mat; set aside. Place puff pastry squares onto prepared baking sheet. Using a fork, pierce each square to create a 1/2-inch border. Sprinkle Gruyere and Parmesan evenly over the top. Arrange asparagus spears in a single layer over the cheese, alternating ends and tips. Drizzle with olive oil; season with salt and pepper, to taste. Place into oven and bake until golden brown, about 15-20 minutes. Meanwhile, to make the balsamic reduction, add balsamic vinegar to a small saucepan over medium heat. Bring to a boil until thick and reduced, about 4-5 minutes. Serve asparagus tart squares immediately, drizzled with balsamic reduction.', u'spoonacularSourceUrl': u'https://spoonacular.com/asparagus-tart-with-balsamic-reduction-536038', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}