{u'recipes': [{u'sourceName': u'Life as a Strawberry', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/532906-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532906, u'veryPopular': True, u'lowFodmap': False, u'title': u'Italian Sausage Bolognese', u'diets': [], u'pricePerServing': 388.05, u'creditText': u'Life as a Strawberry', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 large carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery stalks', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'2 Tbsp. extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tbsp'}, {u'originalString': u'1/2 cup fresh basil, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 lb. italian sausage', u'aisle': u'Meat', u'name': u'italian sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7036, u'unit': u'lb'}, {u'originalString': u'1 cup parmesan cheese, for garnishing', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'for garnishing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 lb. pasta (I used spaghetti)', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'(I used spaghetti)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u'lb'}, {u'originalString': u'2 cups hearty red wine (Cabernet Sauvignons, Merlots, or Syrahs work well)', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red', u'hearty', u'well', u'(Cabernet Sauvignons, Merlots, or Syrahs work )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cups'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 cup tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11887, u'unit': u'cup'}, {u'originalString': u'2-4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1/2 of a large yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.lifeasastrawberry.com/italian-sausage-bolognese/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a food processor, puree carrots, celery, garlic, and onion until they form a thick paste. Make sure all the mixture is well blended.In a large saucepan, heat olive oil over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add vegetable puree, salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Saute until veggies are cooked and browned, about 10 minutes. Don’t be afraid of brown food! It tastes better. You’ll deglaze the pan later, so don’t be afraid if the veggies stick a bit.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add italian sausage to the pan. Break it apart with a spoon or spatula as you cook it and saute until meat is browned.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'id': 7036, u'name': u'italian sausage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add tomato paste to the pan. Stir to incorporate the paste with the other ingredients and cook about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Add 1/2 cup of the red wine and stir to break up any clumps of meat and veggies.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}]}, {u'equipment': [], u'step': u'Add the remaining red wine, chopped basil, and bay leaves and bring to a simmer.Cook until red wine has reduced by half, about 10-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Add 1 cup of the water. Bring back to a simmer and cook until water has reduced by 2/3, about 25-30 minutes. Repeat, adding 1 cup of water and reducing, until you are ready to eat. This is where the flavor really builds – keep adding water and reducing as needed! This is also the right time to add additional seasoning. When you’re ready to eat, reduce the sauce one final time.Cook pasta according to package or recipe directions until 1 minute less than al dente.', u'length': {u'number': 31, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain, reserving 1/2 cup of the pasta water.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add reserved pasta water to sauce and mix to incorporate.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add pasta to saucepan and mix to coat the noodles.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve immediately and top with parmesan cheese to garnish.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Italian. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Ruffino Riserva Ducale Oro Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Ruby red with garnet hues. The wine expresses a distinctive Tuscan bouquet of violet, cherry, and plum, with aromas of chocolate and spice. Intense aromas of violet, blackberry, cherry, and ripe plum with intriguing notes of cinnamon and clove. Classic elegance and structure in which the fruit, tannins, and spices form a tightly woven balance, with a lingering fi nish of chocolate and coffee.Pairs exquisitely with traditional Italian dishes such as a classic bisteca Fiorentina, pasta Bolognese, wild boar ragu, and eggplant Parmesan. It’s also wonderful with dishes such as grilled ribeye and roasted vegetables. View More', u'title': u'Ruffino Riserva Ducale Oro Chianti Classico', u'price': u'$34.99', u'id': 442701, u'link': u'https://www.wine.com/product/ruffino-riserva-ducale-oro-chianti-classico-2011/166890', u'imageUrl': u'https://spoonacular.com/productImages/442701-312x231.jpg'}]}, u'aggregateLikes': 1112, u'instructions': u'In a food processor, puree carrots, celery, garlic, and onion until they form a thick paste. Make sure all the mixture is well blended.In a large saucepan, heat olive oil over medium heat. Add vegetable puree, salt and pepper. Saute until veggies are cooked and browned, about 10 minutes. Don’t be afraid of brown food! It tastes better. You’ll deglaze the pan later, so don’t be afraid if the veggies stick a bit.Add italian sausage to the pan. Break it apart with a spoon or spatula as you cook it and saute until meat is browned.Add tomato paste to the pan. Stir to incorporate the paste with the other ingredients and cook about 1 minute.Add 1/2 cup of the red wine and stir to break up any clumps of meat and veggies. Add the remaining red wine, chopped basil, and bay leaves and bring to a simmer.Cook until red wine has reduced by half, about 10-15 minutes.Add 1 cup of the water. Bring back to a simmer and cook until water has reduced by 2/3, about 25-30 minutes. Repeat, adding 1 cup of water and reducing, until you are ready to eat. This is where the flavor really builds – keep adding water and reducing as needed! This is also the right time to add additional seasoning. When you’re ready to eat, reduce the sauce one final time.Cook pasta according to package or recipe directions until 1 minute less than al dente. Drain, reserving 1/2 cup of the pasta water.Add reserved pasta water to sauce and mix to incorporate. Add pasta to saucepan and mix to coat the noodles. Serve immediately and top with parmesan cheese to garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-sausage-bolognese-532906', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}