{u'recipes': [{u'sourceName': u'Yummy Healthy Easy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/580336-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 580336, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quick 4-Ingredient Peach Fruit Salad', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 178.19, u'creditText': u'Yummy Healthy Easy', u'extendedIngredients': [{u'originalString': u'1 (21-oz) can peach pie filling', u'aisle': u'Baking', u'name': u'apple pie filling', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-pie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 19312, u'unit': u'oz'}, {u'originalString': u'1 (15-oz) can mandarin oranges, well drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'canned mandarin oranges', u'metaInformation': [u'drained', u'well', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 9218, u'unit': u'oz'}, {u'originalString': u'1 (20-oz) can pineapple tidbits or chunks, well drained', u'aisle': u'Canned and Jarred', u'name': u'pineapple tidbits', u'metaInformation': [u'drained', u'well', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 1039354, u'unit': u'oz'}, {u'originalString': u'1-2 cups sliced fresh strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.yummyhealthyeasy.com/2013/06/quick-4-ingredient-peach-fruit-salad.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix all the ingredients together in a large bowl and refrigerate until ready to serve. Enjoy!', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Fruit Salad can be paired with Chardonnay, Sauvignon Blanc, and Gruener Veltliner. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'sauvignon blanc', u'gruener veltliner'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Mix all the ingredients together in a large bowl and refrigerate until ready to serve. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-4-ingredient-peach-fruit-salad-580336', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}