{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/583865-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 583865, u'veryPopular': False, u'lowFodmap': False, u'title': u'Portuguese Style Spicy Chorizo Hamburgers / Sliders #SundaySupper', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 366.79, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'1 cup Beef Broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cup'}, {u'originalString': u'2 Tablespoon Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoon'}, {u'originalString': u'1 teaspoon of red chili pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'chili flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 small Chorizo finely chopped', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 7019, u'unit': u''}, {u'originalString': u'4 Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 Garlic Cloves thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 pound Ground Round', u'aisle': u'Meat', u'name': u'ground round', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023562, u'unit': u'pound'}, {u'originalString': u'4 Tablespoons of olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'2 stems of fresh Parsley chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u''}, {u'originalString': u'1 cup Red Wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}, {u'originalString': u'sea salt & pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://dailydishrecipes.com/spicy-portuguese-style-chorizo-sliders-sundaysupper/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, mix the ground round and the red chili pepper flakes together with your hands. Form the meat into 4 round patties.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023562, u'name': u'ground round'}]}, {u'equipment': [], u'step': u'Brush each burger with some olive oil and season with sea salt and ground pepper.Set in the refrigerator for 30 minutes. I will admit I only did it for about 20 minutes, we were hungry!', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Heat up the grill with a medium flame and cook each burger for approximately 7 minutes for medium rare hamburgers. Flip about halfway and try to keep your flip to only once. This keeps the burgers juicier. Also, refrain from pressing down on the hamburgers with a spatula which will drain them of their juices and make them dry. You don't want a dry burger.", u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add a tablespoon or two of olive oil to a large frying pan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the sliced garlic and chopped chorizo.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u"Saute until they start popping. Don't burn the garlic!Now, add the red wine and the beef broth and bring to a boil.Once it boils, simmer on low and add the chopped parsley. Isabel recommends putting in a bay leaf, but I didn't have one.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Let me just say that while I have no idea the difference it would have made it was amazing without it. Once the sauce has boiled down and been reduced by half, remove the bay leaf (if you used it) and add the butter until melted and combined.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the burgers in the sauce and remove from heat and allow it to just sit.Cook the eggs sunny side up in a separate frying pan in a little bit of butter. (or if you are me, in a lot of butter, because face it - nothing tastes better than it does with butter)', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove the eggs and place one on top of each Burger.Spoon the Chorizo wine sauce over the eggs.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve. But make sure you serve with crusty bread, rolls or something else to soak up all that delicious sauce. We made ours into sliders, poured the sauce into deep sided dishes and used the "buns/rolls" to soak up all the sauce. Delicious!', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try NV ONEHOPE Brut. Reviewers quite like it with a 4.7 out of 5 star rating and a price of about 20 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'ONEHOPE California Brut Champagne Sparkling Wine is light in color and displays aromas of fresh green apple and nectarine with a hint of fresh baked bread. Crisp, intriguing fresh fruit reminiscent of succulent peach, sweet berries and pear linger on the plate, finishing with creamy and refreshing bubbles. This Brut Sparkling Wine can be paired with appetizers, seafood, sushi as well as a wide range of desserts and cheeses.', u'title': u'NV ONEHOPE Brut', u'price': u'$19.99', u'id': 428232, u'link': u'https://www.amazon.com/ONEHOPE-California-Brut-Sparkling-750/dp/B00C3164HC', u'imageUrl': u'https://spoonacular.com/productImages/428232-312x231.jpg'}]}, u'aggregateLikes': 159, u'instructions': u'In a bowl, mix the ground round and the red chili pepper flakes together with your hands. Form the meat into 4 round patties.Brush each burger with some olive oil and season with sea salt and ground pepper.Set in the refrigerator for 30 minutes. I will admit I only did it for about 20 minutes, we were hungry!Heat up the grill with a medium flame and cook each burger for approximately 7 minutes for medium rare hamburgers. Flip about halfway and try to keep your flip to only once. This keeps the burgers juicier. Also, refrain from pressing down on the hamburgers with a spatula which will drain them of their juices and make them dry. You don\'t want a dry burger.Add a tablespoon or two of olive oil to a large frying pan.Add the sliced garlic and chopped chorizo. Saute until they start popping. Don\'t burn the garlic!Now, add the red wine and the beef broth and bring to a boil.Once it boils, simmer on low and add the chopped parsley. Isabel recommends putting in a bay leaf, but I didn\'t have one. Let me just say that while I have no idea the difference it would have made it was amazing without it. Once the sauce has boiled down and been reduced by half, remove the bay leaf (if you used it) and add the butter until melted and combined.Put the burgers in the sauce and remove from heat and allow it to just sit.Cook the eggs sunny side up in a separate frying pan in a little bit of butter. (or if you are me, in a lot of butter, because face it - nothing tastes better than it does with butter)Remove the eggs and place one on top of each Burger.Spoon the Chorizo wine sauce over the eggs.Serve. But make sure you serve with crusty bread, rolls or something else to soak up all that delicious sauce. We made ours into sliders, poured the sauce into deep sided dishes and used the "buns/rolls" to soak up all the sauce. Delicious!', u'spoonacularSourceUrl': u'https://spoonacular.com/portuguese-style-spicy-chorizo-hamburgers-sliders-sundaysupper-583865', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}