{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/514643-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 514643, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Pesto Chicken Soup', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 443.67, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'14 oz. can quartered artichoke hearts, drained and roughly chopped', u'aisle': u'Canned and Jarred', u'name': u'artichoke hearts', u'metaInformation': [u'drained', u'roughly chopped', u'quartered', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 93828, u'unit': u'oz'}, {u'originalString': u'4-6 oz. baby spinach leaves', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11457, u'unit': u'oz'}, {u'originalString': u'2 c. chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'c'}, {u'originalString': u'2 tbsp. flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'1 c. shredded Italian blend cheese', u'aisle': u'Cheese', u'name': u'italian cheese blend', u'metaInformation': [u'shredded', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93651, u'unit': u'c'}, {u'originalString': u'a pinch of kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinch'}, {u'originalString': u'1\xbd c. milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'c'}, {u'originalString': u'2 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 c. bite-sized pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u'c'}, {u'originalString': u'3 tbsp. pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tbsp'}, {u'originalString': u'1 lb. boneless, skinless chicken breasts, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'\xbd sweet onion, diced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'diced', u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 46.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://wearychef.com/creamy-pesto-chicken-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat olive oil in a dutch oven over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onion and chicken, and sprinkle with a pinch of salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Saute until chicken is mostly cooked on the outside, about 7 minutes.Stir in flour to coat chicken, and then stir in pesto.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [], u'step': u'Add chicken broth about \xbd c. at a time, stirring well until broth mixture is smooth before adding more.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [], u'step': u'Add \xbd c. water, and bring to a simmer.Stir in pasta and artichoke hearts, and bring to a low boil. Cook for the amount of time recommended on the pasta package. Two minutes before pasta is done, stir in spinach leaves.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'artichoke hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add milk, and return to a simmer. Reduce heat to medium-low, and stir in cheese. Continue stirring until cheese is completely melted and incorporated and soup is heated through.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 13773, u'instructions': u'Heat olive oil in a dutch oven over medium-high heat. Add onion and chicken, and sprinkle with a pinch of salt. Saute until chicken is mostly cooked on the outside, about 7 minutes.Stir in flour to coat chicken, and then stir in pesto. Add chicken broth about \xbd c. at a time, stirring well until broth mixture is smooth before adding more. Add \xbd c. water, and bring to a simmer.Stir in pasta and artichoke hearts, and bring to a low boil. Cook for the amount of time recommended on the pasta package. Two minutes before pasta is done, stir in spinach leaves.Add milk, and return to a simmer. Reduce heat to medium-low, and stir in cheese. Continue stirring until cheese is completely melted and incorporated and soup is heated through.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-pesto-chicken-soup-514643', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}