{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/609262-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 609262, u'veryPopular': True, u'lowFodmap': False, u'title': u'Farmers Market Sesame Miso Noodle Bowls with Garlic Chips', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 428.04, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'4-5 mini bell peppers, sliced', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'mini', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'2 tablespoons toasted sesame seeds (black or white), plus more for serving', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'black sesame seeds', u'metaInformation': [u'white', u'black', u'plus more for serving', u'toasted', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-sesame-seeds-or-chia-seeds.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10012023, u'unit': u'tablespoons'}, {u'originalString': u'1 cup (or more) cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'2 tablespoons hot chili sesame oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'chili oil', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1014053, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons fresh basil (or cilantro), plus more for topping', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'plus more for topping', u'(or cilantro)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon fresh ginger, grated', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'1 head garlic, skinless and cloves sliced thin', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'skinless', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'head'}, {u'originalString': u'4 ounces goat cheese, crumbled (optional, but umm, soo good!)', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled', u'(optional, but umm, soo good!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'4 green onions, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 lime, juiced', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 tablespoon reduced sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'reduced sodium soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tablespoon'}, {u'originalString': u'salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1/4 cup sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4058, u'unit': u'cup'}, {u'originalString': u'1 (12 ounce) package soba noodles (or swap with angel hair or spaghetti)', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'soba noodles', u'metaInformation': [u'with angel hair or spaghetti)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 20114, u'unit': u'ounce'}, {u'originalString': u'2 zucchini and or summer squash (I used one of each)', u'aisle': u'Produce', u'name': u'summer squash', u'metaInformation': [u'(I used one of each)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11641, u'unit': u''}, {u'originalString': u'2 rounded tablespoons white miso', u'aisle': u'Ethnic Foods', u'name': u'white miso', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10116112, u'unit': u'tablespoons'}], u'healthScore': 59.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.halfbakedharvest.com/farmers-market-sesame-miso-noodle-bowls-garlic-chips/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the very thinly sliced garlic in a skillet with the sesame oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Place over medium heat and gently fry, stirring occasionally, until the garlic is golden brown. Watch it close, it cooks fast! Using a fork, remove from the hot oil to a paper towel lined plate. Toss with salt and set aside.Turn the heat off the skillet, but leave it on the stove. To the warm oil add the miso, hot chili sesame oil, soy sauce, rice vinegar, ginger and lime juice.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Whisk until smooth and combined. The miso may seem thick at first, but it should dissolve into a smooth paste. Stir in the sesame seeds and basil. Bring a large pot of salted water to a boil. Cook the soba noodles according to package directions, but be careful not to overcook. They cook in less than 3 minutes, so do not forget about them!', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'id': 20114, u'name': u'soba noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}]}, {u'equipment': [], u'step': u'Drain the noodles.While the water is coming to a boil, use a spiralizer to spiralize the zucchini + summer squash.*', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'id': 11641, u'name': u'summer squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the drained soba noodles and the spiralzed squash to the skillet with the miso dressing. Turn the heat back on to medium and toss the noodles + squash with the dressing. Cook 2 minutes or until just warmed through.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'id': 20114, u'name': u'soba noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from the heat.Divide the noodles among plates or bowls. Top with tomatoes, peppers and green onions. Sprinkle with goat cheese and toasted sesame seeds.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}]}, {u'equipment': [], u'step': u'Add the garlic chips on top and if desired garnish with fresh basil. eat!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 708, u'instructions': u'Place the very thinly sliced garlic in a skillet with the sesame oil. Place over medium heat and gently fry, stirring occasionally, until the garlic is golden brown. Watch it close, it cooks fast! Using a fork, remove from the hot oil to a paper towel lined plate. Toss with salt and set aside.Turn the heat off the skillet, but leave it on the stove. To the warm oil add the miso, hot chili sesame oil, soy sauce, rice vinegar, ginger and lime juice. Whisk until smooth and combined. The miso may seem thick at first, but it should dissolve into a smooth paste. Stir in the sesame seeds and basil. Bring a large pot of salted water to a boil. Cook the soba noodles according to package directions, but be careful not to overcook. They cook in less than 3 minutes, so do not forget about them! Drain the noodles.While the water is coming to a boil, use a spiralizer to spiralize the zucchini + summer squash.*Add the drained soba noodles and the spiralzed squash to the skillet with the miso dressing. Turn the heat back on to medium and toss the noodles + squash with the dressing. Cook 2 minutes or until just warmed through. Remove from the heat.Divide the noodles among plates or bowls. Top with tomatoes, peppers and green onions. Sprinkle with goat cheese and toasted sesame seeds. Add the garlic chips on top and if desired garnish with fresh basil. eat!', u'spoonacularSourceUrl': u'https://spoonacular.com/farmers-market-sesame-miso-noodle-bowls-with-garlic-chips-609262', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}