{u'recipes': [{u'sourceName': u'Spice Up the Curry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600647-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 600647, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tamarind Rice', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 25, u'pricePerServing': 132.89, u'creditText': u'Spice Up the Curry', u'extendedIngredients': [{u'originalString': u'Cooked rice – 3 cups, cooked and cooled **Notes', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'cooled', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'cups'}, {u'originalString': u'Cumin seeds – \xbd teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'Curry leaves – 5-6', u'aisle': u'Ethnic Foods', u'name': u'curry leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 93604, u'unit': u''}, {u'originalString': u'Chana dal (split Bengal gram)- \xbd teaspoon', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dal', u'metaInformation': [u'split', u'( Bengal gram)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 16069, u'unit': u'teaspoon'}, {u'originalString': u'Fennel seeds – \xbd teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2018, u'unit': u'teaspoon'}, {u'originalString': u'Jaggery – 1 teaspoon', u'aisle': u'Ethnic Foods', u'name': u'jaggery', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jaggery.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 99002, u'unit': u'teaspoon'}, {u'originalString': u'Tamarind paste – 2 teaspoon or small lemon size tamarind ball', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'ball', u'unitShort': u'ball', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u'ball'}, {u'originalString': u'Mustard seeds – \xbc teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'mustard seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2024, u'unit': u'teaspoon'}, {u'originalString': u'Oil – 1 tablespoon', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'Peanuts – 2 tablespoons', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 16091, u'unit': u'tablespoons'}, {u'originalString': u'Peppercorns – \xbc teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'peppercorns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}, {u'originalString': u'Dried red chili – 2', u'aisle': u'Produce', u'name': u'red chili', u'metaInformation': [u'dried', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'Salt – to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Sesame seeds – 1 tablespoon', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tablespoon'}, {u'originalString': u'Turmeric powder – \xbc teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'turmeric powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'Urad dal (split skinless black gram) – \xbd teaspoon', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'urad dal', u'metaInformation': [u'split', u'skinless', u'black', u'( gram)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-lentils.jpg', u'unitLong': u'gram', u'unitShort': u'g', u'amount': 1.0, u'consistency': u'solid', u'id': 93718, u'unit': u'gram'}, {u'originalString': u'Hot Water – 1 cup', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.spiceupthecurry.com/tamarind-rice-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook the rice and let it cool completely. Why cooled? If you add hot rice then rice grains will break while you mix.Dry roast the sesame seeds on medium heat till it get light brown and you will get nice nutty aroma of sesame.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove it to the plate and let it cool completely.In the same pan dry roast the spices listed under powder 2. Keep stirring while you roast. Roast them till they get light brown.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove it to another plate and let it cool completely.While spices are cooling make tamarind water. If using tamarind paste then dissolve it into 1 cup of hot water. Or if using tamarind then keep the tamarind in hot water for 15-20 minutes and then take out all the pulp.Now the sesame seeds and spices are cooled completely. So coarsely grind the sesame seeds and keep it aside for garnishing.And grind spices into a fine powder. And keep it aside. Below left side is coarsely grinded sesame seeds and right side fine spice powder.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a pan on medium heat. Once hot add mustard seeds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Let them pop.Then add dry red chili and curry leaves. Cook for 30 seconds.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-leaves.jpg', u'id': 93604, u'name': u'curry leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'red chili pepper'}]}, {u'equipment': [], u'step': u'Add peanuts.And roast it till it gets light brown.Then add tamarind water.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add spice powder, turmeric powder, and salt. be careful while adding salt if your cooked rice has already salt in it.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10220445, u'name': u'cooked rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix and let it cook.Cook till it thicken and become a paste like consistency.Then add cooked and cooled rice.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Mix gently till all the masala paste it coated to the rice evenly.Finally garnish with sesame powder. And serve.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}], u'name': u''}], u'aggregateLikes': 84, u'instructions': u'Cook the rice and let it cool completely. Why cooled? If you add hot rice then rice grains will break while you mix.Dry roast the sesame seeds on medium heat till it get light brown and you will get nice nutty aroma of sesame. Remove it to the plate and let it cool completely.In the same pan dry roast the spices listed under powder 2. Keep stirring while you roast. Roast them till they get light brown. Remove it to another plate and let it cool completely.While spices are cooling make tamarind water. If using tamarind paste then dissolve it into 1 cup of hot water. Or if using tamarind then keep the tamarind in hot water for 15-20 minutes and then take out all the pulp.Now the sesame seeds and spices are cooled completely. So coarsely grind the sesame seeds and keep it aside for garnishing.And grind spices into a fine powder. And keep it aside. Below left side is coarsely grinded sesame seeds and right side fine spice powder.Heat the oil in a pan on medium heat. Once hot add mustard seeds. Let them pop.Then add dry red chili and curry leaves. Cook for 30 seconds.Add peanuts.And roast it till it gets light brown.Then add tamarind water.Add spice powder, turmeric powder, and salt. be careful while adding salt if your cooked rice has already salt in it.Mix and let it cook.Cook till it thicken and become a paste like consistency.Then add cooked and cooled rice.Mix gently till all the masala paste it coated to the rice evenly.Finally garnish with sesame powder. And serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/tamarind-rice-600647', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}