{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/758974-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758974, u'veryPopular': True, u'lowFodmap': False, u'title': u'Wild Mushroom Ravioli in Sage and Brown Butter Sauce', u'diets': [], u'pricePerServing': 77.92, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'4 fresh sage leaves, plus more for garnish', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh', u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'1 tsp. fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'1 4-oz pkg. “gourmet blend” mushrooms (shiitakes, oyster mushrooms, and baby bellas), diced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'diced', u'(shiitakes, oyster mushrooms, and baby bellas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'1 Tbs. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'2 Tbs. grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'Tbs'}, {u'originalString': u'1 small shallot, minced (2 Tbs.)', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u'Tbs'}, {u'originalString': u'\xbc lb. (1 stick) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'lb'}, {u'originalString': u'2 Tbs. white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'Tbs'}, {u'originalString': u'20 square won ton wrappers', u'aisle': u'Ethnic Foods', u'name': u'won ton wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'squares', u'unitShort': u'square', u'amount': 20.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'square'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/wild-mushroom-ravioli-in-sage-and-brown-butter-sauce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add shallot, and saut\xe9 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add mushrooms, and cook 7 to 10 minutes, or until softened.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add wine and thyme, and cook 2 minutes. Season with salt and pepper, if desired. Cool.2.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Cut 1 won ton wrapper in half, to form 2 rectangles.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush edges of won ton half with water, and place 1 tsp. mushroom mixture on one side. Fold won ton wrapper in half to make square ravioli, pressing on edges to seal.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place on baking sheet. Repeat with remaining won ton wrappers and filling.3. Melt butter in large skillet over low heat.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'id': 10018368, u'name': u'wonton wrappers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add sage leaves, and cook 8 to 10 minutes, or until fatty solids in butter sink to bottom of saucepan and turn nutty brown.4. Meanwhile, cook ravioli in large pot of boiling salted water 2 minutes, or until they float to top.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer to skillet with slotted spoon, and toss to coat with brown butter sauce. Season with salt and pepper, if desired, and sprinkle with cheese.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Ravioli works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Ruffino Riserva Ducale Oro Chianti Classico. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 35 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Ruby red with garnet hues. The wine expresses a distinctive Tuscan bouquet of violet, cherry, and plum, with aromas of chocolate and spice. Intense aromas of violet, blackberry, cherry, and ripe plum with intriguing notes of cinnamon and clove. Classic elegance and structure in which the fruit, tannins, and spices form a tightly woven balance, with a lingering fi nish of chocolate and coffee.Pairs exquisitely with traditional Italian dishes such as a classic bisteca Fiorentina, pasta Bolognese, wild boar ragu, and eggplant Parmesan. It’s also wonderful with dishes such as grilled ribeye and roasted vegetables. View More', u'title': u'Ruffino Riserva Ducale Oro Chianti Classico', u'price': u'$34.99', u'id': 442701, u'link': u'https://www.wine.com/product/ruffino-riserva-ducale-oro-chianti-classico-2011/166890', u'imageUrl': u'https://spoonacular.com/productImages/442701-312x231.jpg'}]}, u'aggregateLikes': 1393, u'instructions': u'1. Heat oil in skillet over medium heat. Add shallot, and saut\xe9 2 minutes. Add mushrooms, and cook 7 to 10 minutes, or until softened. Add wine and thyme, and cook 2 minutes. Season with salt and pepper, if desired. Cool.2. Cut 1 won ton wrapper in half, to form 2 rectangles. Brush edges of won ton half with water, and place 1 tsp. mushroom mixture on one side. Fold won ton wrapper in half to make square ravioli, pressing on edges to seal. Place on baking sheet. Repeat with remaining won ton wrappers and filling.3. Melt butter in large skillet over low heat. Add sage leaves, and cook 8 to 10 minutes, or until fatty solids in butter sink to bottom of saucepan and turn nutty brown.4. Meanwhile, cook ravioli in large pot of boiling salted water 2 minutes, or until they float to top. Transfer to skillet with slotted spoon, and toss to coat with brown butter sauce. Season with salt and pepper, if desired, and sprinkle with cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/wild-mushroom-ravioli-in-sage-and-brown-butter-sauce-758974', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}