{u'recipes': [{u'sourceName': u'Moms Dish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511330-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 511330, u'veryPopular': False, u'lowFodmap': False, u'title': u'Potato Piroshki', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 20.96, u'creditText': u'Moms Dish', u'extendedIngredients': [{u'originalString': u'1/2 tablespoons Baking Powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoons'}, {u'originalString': u'1 cup Buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'2 cups All-purpose Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'Oil; for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'3 cups Mashed Potatoes', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11362, u'unit': u'cups'}, {u'originalString': u'1 teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://momsdish.com/recipe/466/potato-piroshki-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine together flour, sugar, salt and baking powder. To the mixture, add buttermilk and stir to combine. Work the dough until everything is well combined. The dough will be on a sticky side, but that is OK.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Cut the dough into 10 equal pieces. Flour the surface that you are working on and roll each one out.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place equal amounts of mashed potatoes onto each dough. Seal all edges of each one, just like you see it in the picture.Carefully roll out each one onto a flat piece, you may need to continue flouring the surface that you're working on. Preheat a skillet, filled with oil, to a medium heat, fry each pastry until it's golden brown. They are best when served immediately.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}], u'aggregateLikes': 300, u'instructions': u"Combine together flour, sugar, salt and baking powder. To the mixture, add buttermilk and stir to combine. Work the dough until everything is well combined. The dough will be on a sticky side, but that is OK. Cut the dough into 10 equal pieces. Flour the surface that you are working on and roll each one out. Place equal amounts of mashed potatoes onto each dough. Seal all edges of each one, just like you see it in the picture.Carefully roll out each one onto a flat piece, you may need to continue flouring the surface that you're working on. Preheat a skillet, filled with oil, to a medium heat, fry each pastry until it's golden brown. They are best when served immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/potato-piroshki-511330', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}