{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/199691-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199691, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cook the Book: Black and White Cookies', u'diets': [], u'pricePerServing': 77.75, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'4 cups (16 ounces) cake flour', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10020129, u'unit': u'ounces'}, {u'originalString': u"5 cups (20 ounces) confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 19336, u'unit': u'ounces'}, {u'originalString': u'Cookies', u'aisle': u'Sweet Snacks', u'name': u'cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'liquid', u'id': 10118192, u'unit': u'servings'}, {u'originalString': u'1/4 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 3/4 cups (12 1/4 ounces) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.25, u'consistency': u'solid', u'id': 19335, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon lemon extract', u'aisle': u'Baking', u'name': u'lemon extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-oil.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 12311111, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'16 tablespoons (2 sticks) unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 16.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 ounces unsweetened chocolate, melted', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2-4 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2009/12/draftcook-the-book-black-and-white-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Adjust the oven racks to the upper-middle and lower-middle positions and heat the oven to 350\xb0F.  Line 2 large baking sheets with parchment paper.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the flour, baking powder, and salt together in a medium bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, beat the butter and sugar with an electric mixer on medium speed until light and fluffy, 3 to 6 minutes.  Beat in the eggs, vanilla, and lemon extract until combined, about 30 seconds, scraping down the bowl and beaters as needed.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-oil.png', u'id': 12311111, u'name': u'lemon extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Reduce the mixer speed to low and beat in one-third of the flour mixture, followed by half of the milk.  Repeat with half of the remaining flour mixture, and the remaining milk.  Beat in the remaining flour mixture until combined.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'4', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Scoop 1/4-cup mounds of batter onto the prepared baking sheets, spaced about 2 inches apart.  Use the back of a spoon or your finger dipped in water to smooth the tops of the cookies.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake the cookies until the edges are just beginning to turn light golden brown, about 15 minutes, switching and rotating the baking sheets halfway through baking.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [], u'step': u'5', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Let the cookies cool on the baking sheets for 10 minutes, then transfer to a wire rack and let cool completely, about 1 hour.  Repeat with the remaining dough using cooled, freshly lined baking sheets.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [], u'step': u'6', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'For the icings:  Bring the corn syrup and water to a boil in a medium saucepan over medium-high heat.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Remove the pan from the heat and whisk in the confectioners' sugar and vanilla until smooth.  Measure half of the icing into a separate bowl and whisk in the melted chocolate and 2 to 4 tablespoons of water as needed until the mixture is smooth and spreadable.", u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'7', u'number': 16, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Place 2 large wire racks over parchment paper for easy clean up.', u'number': 17, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Spread about 2 tablespoons of the chocolate icing over half of each cookie with a small spatula, then let sit on the wire racks until the icing has just set, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 18, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [], u'step': u'Spread the vanilla icing over half of each cookie and let sit until the icings have hardened, about 1 hour before serving.', u'number': 19, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u"Procedures                                                                              1                                                                            Adjust the oven racks to the upper-middle and lower-middle positions and heat the oven to 350\xb0F.  Line 2 large baking sheets with parchment paper.  Whisk the flour, baking powder, and salt together in a medium bowl.                                                                                                                            2                                                                            In a large bowl, beat the butter and sugar with an electric mixer on medium speed until light and fluffy, 3 to 6 minutes.  Beat in the eggs, vanilla, and lemon extract until combined, about 30 seconds, scraping down the bowl and beaters as needed.                                                                                                                            3                                                                            Reduce the mixer speed to low and beat in one-third of the flour mixture, followed by half of the milk.  Repeat with half of the remaining flour mixture, and the remaining milk.  Beat in the remaining flour mixture until combined.                                                                                                                            4                                                                            Scoop 1/4-cup mounds of batter onto the prepared baking sheets, spaced about 2 inches apart.  Use the back of a spoon or your finger dipped in water to smooth the tops of the cookies.  Bake the cookies until the edges are just beginning to turn light golden brown, about 15 minutes, switching and rotating the baking sheets halfway through baking.                                                                                                                            5                                                                            Let the cookies cool on the baking sheets for 10 minutes, then transfer to a wire rack and let cool completely, about 1 hour.  Repeat with the remaining dough using cooled, freshly lined baking sheets.                                                                                                                            6                                                                             For the icings:  Bring the corn syrup and water to a boil in a medium saucepan over medium-high heat.  Remove the pan from the heat and whisk in the confectioners' sugar and vanilla until smooth.  Measure half of the icing into a separate bowl and whisk in the melted chocolate and 2 to 4 tablespoons of water as needed until the mixture is smooth and spreadable.                                                                                                                             7                                                                            Place 2 large wire racks over parchment paper for easy clean up.  Spread about 2 tablespoons of the chocolate icing over half of each cookie with a small spatula, then let sit on the wire racks until the icing has just set, about 15 minutes.  Spread the vanilla icing over half of each cookie and let sit until the icings have hardened, about 1 hour before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/cook-the-book-black-and-white-cookies-199691', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}