{u'recipes': [{u'sourceName': u'Chocolate Covered Katie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619803-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619803, u'veryPopular': True, u'lowFodmap': False, u'title': u'Deep-Dish Cookie Pie', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 45.12, u'creditText': u'Chocolate Covered Katie', u'extendedIngredients': [{u'originalString': u'1/4 cup unsweetened applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9019, u'unit': u'cup'}, {u'originalString': u'2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 1/2 cups brown sugar (EDIT: click for a Sugar-Free Cookie Pie.)', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'sugar-free', u'for a  cookie pie.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cups'}, {u'originalString': u'1 cup chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'2 cans white beans or garbanzos (drained and rinsed) (500g total, once drained)', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'garbanzos', u'metaInformation': [u'white', u'drained and rinsed) (500g total, once drained)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 16057, u'unit': u'cans'}, {u'originalString': u'1 cup quick oats (or certified-gf quick oats)', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'quick', u'(or certified-gf oats)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'3 tbsp oil (canola, veg, or coconut)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'(canola, veg, or coconut)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'2 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://chocolatecoveredkatie.com/2011/05/31/deep-dish-cookie-pie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Blend everything (except the chips) very well in a good food processor (not a blender).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}], u'step': u'Mix in chips, and pour into an oiled pan (I used a 10-inch springform pan, but you can use a smaller pan if you want a really deep-dish pie.) Cook at 350F for around 35-40 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Let stand at least 10 minutes before removing from the pan. (Some commenters have had success with a blender, but I did not. Try that at your own risk, and know the results will be better in a high-quality food processor such as a Cuisinart.)Inspired by this popular recipe: Chickpea Blondies.(Calorie Note: I haven't calculated the calories for this recipe, but a few of the commenters did. According to their calculations, the pie will have around 200 calories per slice, as opposed to 700 in a slice of traditional deep-dish cookie pie.)", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Chateau Chantal Late Harvest Riesling with a 4.5 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': None, u'title': u'Chateau Chantal Late Harvest Riesling', u'price': u'$21.0', u'id': 430249, u'link': u'https://www.amazon.com/Chateau-Chantal-Late-Harvest-Riesling/dp/B00IJI3V3I', u'imageUrl': u'https://spoonacular.com/productImages/430249-312x231.jpg'}]}, u'aggregateLikes': 106286, u'instructions': u"Blend everything (except the chips) very well in a good food processor (not a blender). Mix in chips, and pour into an oiled pan (I used a 10-inch springform pan, but you can use a smaller pan if you want a really deep-dish pie.) Cook at 350F for around 35-40 minutes. Let stand at least 10 minutes before removing from the pan. (Some commenters have had success with a blender, but I did not. Try that at your own risk, and know the results will be better in a high-quality food processor such as a Cuisinart.)Inspired by this popular recipe: Chickpea Blondies.(Calorie Note: I haven't calculated the calories for this recipe, but a few of the commenters did. According to their calculations, the pie will have around 200 calories per slice, as opposed to 700 in a slice of traditional deep-dish cookie pie.)", u'spoonacularSourceUrl': u'https://spoonacular.com/deep-dish-cookie-pie-619803', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 1, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}