{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/518173-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 518173, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lime- Marinated Flank Steak', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 347.58, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'coarse salt & fresh ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 1/2 pounds flank steak', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 23657, u'unit': u'pounds'}, {u'originalString': u'2 Tablespoons minced fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'Tablespoons'}, {u'originalString': u'2 green onions, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 teaspoon lime zest', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'teaspoon'}, {u'originalString': u'4 medium limes, squeezed', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1/2 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'3 Tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tablespoons'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.recipegirl.com/2008/09/05/lime-marinated-flank-steak/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place marinade ingredients in large zip bag.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add steak, seal bag and let sit in refrigerator for about an hour. Turn bag occasionally.2.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to high and spray grates with nonstick spray.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drain marinade from steak and season with salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place on grill and cover. Cook, turning once until desired doneness- probably about 6 minutes per side, or longer (best to test with an instant-read thermometer to find out the temperature inside the steak- 145 degrees for medium rare & 160 degrees for medium.)3. Slice thinly and serve.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are great choices for Flank Steak. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. You could try Franciscan Estate Merlot. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 25 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Our Oakville estate produces distinctive, supple Merlot characterized by flavors of cherries and plums. This wine shows rich, lush and velvety fruit flavors of cherries, plums and blackberries that merge with light toasted oak. Blended with a samll percentage of Cabernet Sauvignon and Cabernet Franc this wine is well balanced and structured with a lingering finish.Alcohol: 13.5%', u'title': u'Franciscan Estate Merlot', u'price': u'$25.49', u'id': 443286, u'link': u'https://www.wine.com/product/franciscan-estate-merlot-1998/7308', u'imageUrl': u'https://spoonacular.com/productImages/443286-312x231.jpg'}]}, u'aggregateLikes': 252, u'instructions': u'1. Place marinade ingredients in large zip bag. Add steak, seal bag and let sit in refrigerator for about an hour. Turn bag occasionally.2. Heat grill to high and spray grates with nonstick spray. Drain marinade from steak and season with salt and pepper. Place on grill and cover. Cook, turning once until desired doneness- probably about 6 minutes per side, or longer (best to test with an instant-read thermometer to find out the temperature inside the steak- 145 degrees for medium rare & 160 degrees for medium.)3. Slice thinly and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/lime-marinated-flank-steak-518173', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 22, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}