{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/448494-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 448494, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cashew Chicken Toss', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 177.99, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (11 ounces) mandarin oranges, drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'canned mandarin oranges', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 9218, u'unit': u'ounces'}, {u'originalString': u'1/3 cup cashews', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1/4 to 1/2 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons grated orange peel', u'aisle': u'Produce', u'name': u'orange peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoons'}, {u'originalString': u'Dash pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'Dash'}, {u'originalString': u'2 cans (8 ounces each) pineapple chunks', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'ounces'}, {u'originalString': u'4 cups ready-to-serve salad greens', u'aisle': u'Produce', u'name': u'salad greens', u'metaInformation': [u'ready-to-serve'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cups'}, {u'originalString': u'1 pound boneless skinless chicken breast halves (4 ounces)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast halves', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1045062, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cashew-chicken-toss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain pineapple, reserving juice; set pineapple aside. In a microwave-safe bowl, combine the sugar, cornstarch, orange peel, basil and pepper. Gradually whisk in pineapple juice until blended.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Microwave, uncovered, on high for 1-1/2 to 2 minutes or until boils and is thickened, stirring every 30 seconds.  Set aside, stir occasionally.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place chicken in a greased 8-in. square microwave-safe dish. Cover and microwave on high for 3-5 minutes or until juices run clear, turning every 2 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand, covered, for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into thin strips.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Arrange the salad greens, chicken, oranges and reserved pineapple on individual plates.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}]}, {u'equipment': [], u'step': u'Drizzle with warm dressing. Sprinkle with cashews.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 23, u'instructions': u"Directions                                                                                Drain pineapple, reserving juice; set pineapple aside. In a microwave-safe bowl, combine the sugar, cornstarch, orange peel, basil and pepper. Gradually whisk in pineapple juice until blended.                                                                                              Microwave, uncovered, on high for 1-1/2 to 2 minutes or until boils and is thickened, stirring every 30 seconds.  Set aside, stir occasionally.                                                                                           Place chicken in a greased 8-in. square microwave-safe dish. Cover and microwave on high for 3-5 minutes or until juices run clear, turning every 2 minutes. Let stand, covered, for 10 minutes. Cut into thin strips.                                                                                           Arrange the salad greens, chicken, oranges and reserved pineapple on individual plates. Drizzle with warm dressing. Sprinkle with cashews.                                        Yield: 4 servings.                                                                                                     Editor's Note: This recipe was tested in a 1,100-watt microwave.                                                                                                Originally published as Cashew Chicken Toss in  Quick CookingMay/June 2002, p29                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 329 calories, 10 g fat (2 g saturated fat), 63 mg cholesterol, 162 mg sodium, 35 g carbohydrate, 3 g fiber, 26 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/cashew-chicken-toss-448494', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}