{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/305753-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 305753, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy White Pizza', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 262.42, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Garlic-flavored olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'2 teaspoons chopped fresh oregano leaves, plus more for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano leaves', u'metaInformation': [u'fresh', u'plus more for garnish', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoons'}, {u'originalString': u'1 (1-pound) ball frozen pizza dough, thawed and at room temperature', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [u'frozen', u'thawed', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93610, u'unit': u'pound'}, {u'originalString': u'3 cups shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cups'}, {u'originalString': u'1/2 cup whole milk ricotta', u'aisle': u'Cheese', u'name': u'skim milk ricotta', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93630, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpeg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/claire-robinson/easy-white-pizza-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Special equipment: 14-inch round pizza pan', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F. Adjust the oven rack to the lower third of the oven.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush the pizza pan with oil. On a work surface, using your hands, press the pizza dough into a large flat disk and transfer it to the greased pan. Using your fingers, press the dough out until it has stretched to the perimeter of the pan. Create a dough "lip" around the outer edges of the pan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93610, u'name': u'pizza dough'}]}, {u'equipment': [], u'step': u'Brush the entire surface of the dough lightly with garlic oil and pierce the bottom of the crust all over with a fork, to prevent bubbling.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-oil.jpg', u'id': 1004053, u'name': u'garlic oil'}]}, {u'equipment': [], u'step': u'Evenly spread the mozzarella over the crust. Using 2 spoons, dollop teaspoon-sized mounds of ricotta evenly over the mozzarella. Season with salt and pepper, to taste, and evenly sprinkle the chopped oregano over the top.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake in the lower third of the oven until the crust is golden brown and cheese is bubbly and browning on top, 25 to 30 minutes. Cool on the pan for 10 minutes before garnishing with additional oregano and slicing into 8 pieces.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [], u'step': u"Cook's Note: Try buying fresh pizza dough from your local pizzeria; just be sure to let it sit out at room temperature for a few minutes, as warmer dough is easier to work with.", u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93610, u'name': u'pizza dough'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza can be paired with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Di Majo Norante Sangiovese with a 4.1 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Vivid ruby red in color with a fresh bouquet of violets and woodland berries. Smooth and refreshing with loads of ripe fruit. An excellent accompaniment to antipasti, first courses and grilled white meats', u'title': u'Di Majo Norante Sangiovese', u'price': u'$8.99', u'id': 434381, u'link': u'https://www.wine.com/product/di-majo-norante-sangiovese-2000/38435', u'imageUrl': u'https://spoonacular.com/productImages/434381-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Watch how to make this recipe.                    Special equipment: 14-inch round pizza pan                          Preheat the oven to 400 degrees F. Adjust the oven rack to the lower third of the oven.                          Brush the pizza pan with oil. On a work surface, using your hands, press the pizza dough into a large flat disk and transfer it to the greased pan. Using your fingers, press the dough out until it has stretched to the perimeter of the pan. Create a dough "lip" around the outer edges of the pan. Brush the entire surface of the dough lightly with garlic oil and pierce the bottom of the crust all over with a fork, to prevent bubbling.                          Evenly spread the mozzarella over the crust. Using 2 spoons, dollop teaspoon-sized mounds of ricotta evenly over the mozzarella. Season with salt and pepper, to taste, and evenly sprinkle the chopped oregano over the top.                          Bake in the lower third of the oven until the crust is golden brown and cheese is bubbly and browning on top, 25 to 30 minutes. Cool on the pan for 10 minutes before garnishing with additional oregano and slicing into 8 pieces.                          Cook\'s Note: Try buying fresh pizza dough from your local pizzeria; just be sure to let it sit out at room temperature for a few minutes, as warmer dough is easier to work with.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-white-pizza-305753', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}