{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217510-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 217510, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hot cross muffin buns', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 180, u'pricePerServing': 54.46, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'450g strong white bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 450.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'g'}, {u'originalString': u'50g butter, cut into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'golden syrup, to glaze', u'aisle': u'Baking', u'name': u'golden syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 93829, u'unit': u'servings'}, {u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'50g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'2 tsp ground mixed spice', u'aisle': u'Spices and Seasonings', u'name': u'ground all spice', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'200g luxury mixed dried fruits, cherries halved', u'aisle': u'Produce', u'name': u'kiwi fruits', u'metaInformation': [u'mixed', u'dried', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 9148, u'unit': u'g'}, {u'originalString': u'finely grated zest 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'275ml/9fl oz milk, plus extra to glaze', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 275.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'2 tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'7g sachet easy-blend dried yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 7.0, u'consistency': u'solid', u'id': 18375, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3081/hot-cross-muffin-buns', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Put all dough ingredients, exceptthe dried fruit, in the breadmaker,following the order in your manual.Set to dough programme.Once the dough is ready, turn itout onto a lightly floured surfaceand punch down to deflate. Patinto a large flat circle, tip the fruitin the centre and enclose with thedough. Knead the fruit in, cuttingthrough the mixture with a sharpknife, then re-knead a few timesto distribute the fruit evenly.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Cut out nine 14cm squares ofbaking parchment and have readya 12-hole muffin tin.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Cut the doughinto 9 even-sized pieces and rolleach into a smooth ball. Push a squareof the parchment into a tin holeand drop in a ball of dough.Repeat with the rest. Cover thetin loosely with lightly-oiled clingfilm and leave in a warm place for30-45 minutes or until doubled insize. Preheat oven to fan 180C/conventional 200C/gas 6.For the crosses, blend the flourto a smooth paste with 5-6 tsp ofcold water. Spoon into a smallplastic food bag and cut a smallhole off one corner or use a pipingbag. Pipe crosses on the buns.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake for 15 minutes or until golden.Lift onto a cooling rack.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Brush witha little golden syrup while warm.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 93829, u'name': u'golden syrup'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 170, u'instructions': u'Put all dough ingredients, exceptthe dried fruit, in the breadmaker,following the order in your manual.Set to dough programme.Once the dough is ready, turn itout onto a lightly floured surfaceand punch down to deflate. Patinto a large flat circle, tip the fruitin the centre and enclose with thedough. Knead the fruit in, cuttingthrough the mixture with a sharpknife, then re-knead a few timesto distribute the fruit evenly.Cut out nine 14cm squares ofbaking parchment and have readya 12-hole muffin tin. Cut the doughinto 9 even-sized pieces and rolleach into a smooth ball. Push a squareof the parchment into a tin holeand drop in a ball of dough.Repeat with the rest. Cover thetin loosely with lightly-oiled clingfilm and leave in a warm place for30-45 minutes or until doubled insize. Preheat oven to fan 180C/conventional 200C/gas 6.For the crosses, blend the flourto a smooth paste with 5-6 tsp ofcold water. Spoon into a smallplastic food bag and cut a smallhole off one corner or use a pipingbag. Pipe crosses on the buns.Bake for 15 minutes or until golden.Lift onto a cooling rack. Brush witha little golden syrup while warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/hot-cross-muffin-buns-217510', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}