{u'recipes': [{u'sourceName': u'Seasonal and Savory', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/478610-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 478610, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lemon-Coconut Brownies (grain free)', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 38.57, u'creditText': u'Seasonal and Savory', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup coconut flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93747, u'unit': u'cup'}, {u'originalString': u'\xbd cup coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'\xbd cup Virgin Coconut Oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u'3 eggs, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'2 teaspoons grated fresh lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoons'}, {u'originalString': u'\xbc teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'5 packets dry stevia extract', u'aisle': u'Baking', u'name': u'stevia extract', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'packets', u'unitShort': u'packets', u'amount': 5.0, u'consistency': u'solid', u'id': 93628, u'unit': u'packets'}, {u'originalString': u'\xbd cup unsweetened coconut flakes, lightly toasted', u'aisle': u'Baking', u'name': u'unsweetened coconut flakes', u'metaInformation': [u'unsweetened', u'lightly toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12108, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.seasonalandsavory.com/2012/10/lemon-coconut-brownies-grain-free.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees. In a medium, microwave-safe mixing bowl, heat the honey and coconut oil for about a minute, or until the oil is liquid. Stir in the lemon juice and vanilla, and then whisk in the eggs and lemon zest.In a small bowl, stir together the coconut flour, sea salt, stevia, and baking powder until well combined. Stir this into the coconut oil mixture. After a couple of minutes this is going to get very thick, as the coconut flour absorbs the moisture. At this point, stir in enough of the coconut milk to have the consistency of thick pancake batter (start with a \xbc cup and see if you need to add more).Spray an 8 by 8 inch baking pan with cooking spray, and spoon in the batter. Top with the toasted coconut, and bake for 35-45 minutes, or until the center feels “set” when you lightly press down with your finger.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'id': 93747, u'name': u'coconut flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'id': 93628, u'name': u'stevia'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove and cool completely before cutting (if they are still warm, they will fall apart).Note: I made these in a 6 by 10 inch pan, as well an 8 by 8–since the latter is more common, that is the size I called for, but the other pan worked well.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1193, u'instructions': u'Preheat the oven to 350 degrees. In a medium, microwave-safe mixing bowl, heat the honey and coconut oil for about a minute, or until the oil is liquid. Stir in the lemon juice and vanilla, and then whisk in the eggs and lemon zest.In a small bowl, stir together the coconut flour, sea salt, stevia, and baking powder until well combined. Stir this into the coconut oil mixture. After a couple of minutes this is going to get very thick, as the coconut flour absorbs the moisture. At this point, stir in enough of the coconut milk to have the consistency of thick pancake batter (start with a \xbc cup and see if you need to add more).Spray an 8 by 8 inch baking pan with cooking spray, and spoon in the batter. Top with the toasted coconut, and bake for 35-45 minutes, or until the center feels “set” when you lightly press down with your finger. Remove and cool completely before cutting (if they are still warm, they will fall apart).Note: I made these in a 6 by 10 inch pan, as well an 8 by 8–since the latter is more common, that is the size I called for, but the other pan worked well.', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-coconut-brownies-grain-free-478610', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}