{u'recipes': [{u'sourceName': u'Chocolate Moosey', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/554224-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 554224, u'veryPopular': False, u'lowFodmap': False, u'title': u'Portabella Mushroom Pot Pie for #SundaySupper', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 71.85, u'creditText': u'Chocolate Moosey', u'extendedIngredients': [{u'originalString': u'3 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'Few cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 Tbsp heavy cream (half and half or milk can be used)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'canned', u'(half and half or milk can be used)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'Tbsp'}, {u'originalString': u'Small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11282, u'unit': u'servings'}, {u'originalString': u'Frozen peas and carrots (or fresh carrots, chopped)', u'aisle': u'Canned and Jarred;Frozen', u'name': u'peas and carrots', u'metaInformation': [u'frozen', u'chopped', u'(or fresh carrots, )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas-and-carrots.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11322, u'unit': u'servings'}, {u'originalString': u'Portabella mushrooms, sliced', u'aisle': u'Produce', u'name': u'portabella mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11265, u'unit': u'servings'}, {u'originalString': u"1 sheet puff pastry, rolled out (thawed but don't let it get too warm or it will stick!)", u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'thawed', u"( but don't let it get too warm or it will stick!)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheet'}, {u'originalString': u'Red potatoes, peeled and chopped into bite-size pieces', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'red', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011355, u'unit': u'pieces'}, {u'originalString': u'Salt, pepper, and dried herbs (I used a mix called Bouquet Garni, but you can use any dried green herb – parsley, thyme, rosemary, basil, etc)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'dried', u'green', u'(I used a mix called Bouquet Garni, but you can use any herb - parsley, thyme, rosemary, basil, etc)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'can'}, {u'originalString': u'16 oz stock (beef is preferred)', u'aisle': u'Canned and Jarred', u'name': u'stock', u'metaInformation': [u'(beef is preferred)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'oz'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.chocolatemoosey.com/2012/01/29/portabella-mushroom-pot-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425F.In a medium saucepan, bring some water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the potatoes (and fresh carrots if using) and cook for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Drain.Meanwhile, melt butter in a dutch oven.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add onion and garlic, cook for about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add flour and stir constantly to make a roux. Cook for another 5 minutes or until the roux starts to darken.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the stock and keep stirring.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix up any brown bits that were stuck to the bottom of the pan.Bring to a boil.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add mushrooms, peas, carrots, and potatoes. Season with salt, pepper, and dried herbs. Keep tasting and adjusting. Cook for another 3-5 minutes. Turn off the heat; stir in cream.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Pour the mixture into a casserole dish and spread evenly.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the puff pastry on top; tuck under (and possibly cut) any excess dough.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [], u'step': u'Cut three slits in the middle to let steam escape.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place an empty cookie sheet below your casserole in case any filling leaks.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove and place foil on top; bake for another 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool a little bit then serve.', u'number': 15, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 43, u'instructions': u'Preheat oven to 425F.In a medium saucepan, bring some water to a boil. Add the potatoes (and fresh carrots if using) and cook for 10 minutes. Drain.Meanwhile, melt butter in a dutch oven. Add onion and garlic, cook for about 5 minutes. Add flour and stir constantly to make a roux. Cook for another 5 minutes or until the roux starts to darken. Add the stock and keep stirring. Mix up any brown bits that were stuck to the bottom of the pan.Bring to a boil. Add mushrooms, peas, carrots, and potatoes. Season with salt, pepper, and dried herbs. Keep tasting and adjusting. Cook for another 3-5 minutes. Turn off the heat; stir in cream.Pour the mixture into a casserole dish and spread evenly. Roll the puff pastry on top; tuck under (and possibly cut) any excess dough. Cut three slits in the middle to let steam escape.Place an empty cookie sheet below your casserole in case any filling leaks. Bake for 10 minutes. Remove and place foil on top; bake for another 25 minutes. Let cool a little bit then serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/portabella-mushroom-pot-pie-for-sundaysupper-554224', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}