{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599164-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 599164, u'veryPopular': True, u'lowFodmap': True, u'title': u'Cracker Barrel Old Country Store Baby Carrots', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 46.07, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'2 pounds fresh baby carrots', u'aisle': u'Produce', u'name': u'baby carrots', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11960, u'unit': u'pounds'}, {u'originalString': u'1 tablespoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'1 pinch ground nutmeg (optional)', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4073, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon salt, or more to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.copykat.com/2009/05/03/cracker-barrel-old-country-store-baby-carrots/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Rinse carrots and place in a 2-quart saucepan.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in enough water to just cover the top of the carrots. Cover the pan with a lid, place on medium heat, and bring to a boil. Turn the heat to low and simmer for 30 to 45 minutes, until the carrots are tender when pricked with a fork.When carrots are tender, pour off half of the water.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the margarine, sugar, and salt and place the lid back on the pan. Cook until completely tender but not mushy. More salt may be added if needed. For a little flair, add a pinch of ground nutmeg.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutmeg.jpg', u'id': 2025, u'name': u'ground nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 2342, u'instructions': u'Rinse carrots and place in a 2-quart saucepan. Pour in enough water to just cover the top of the carrots. Cover the pan with a lid, place on medium heat, and bring to a boil. Turn the heat to low and simmer for 30 to 45 minutes, until the carrots are tender when pricked with a fork.When carrots are tender, pour off half of the water. Add the margarine, sugar, and salt and place the lid back on the pan. Cook until completely tender but not mushy. More salt may be added if needed. For a little flair, add a pinch of ground nutmeg.', u'spoonacularSourceUrl': u'https://spoonacular.com/cracker-barrel-old-country-store-baby-carrots-599164', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}