{u'recipes': [{u'sourceName': u'Iowa Girl Eats', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/666119-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 666119, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mini Corn Dog Muffins - Iowa Girl Eats', u'diets': [], u'pricePerServing': 14.78, u'creditText': u'Iowa Girl Eats', u'extendedIngredients': [{u'originalString': u'1 cup gluten-free baking blend or all-purpose flour', u'aisle': u'Baking', u'name': u'baking mix', u'metaInformation': [u'gluten-free', u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18010, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'8-10 all-beef hot dogs, cut into 1" bites', u'aisle': u'Meat', u'name': u'beef hot dogs', u'metaInformation': [u'cut into 1" bites'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 7241, u'unit': u''}, {u'originalString': u'1/2 cup melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'1 cup certified gluten-free cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 35137, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://iowagirleats.com/2012/01/30/super-bowl-recipe-week-mini-corn-dog-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine butter and sugar in a bowl then whisk to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add eggs thenwhisk to incorporate, and then add buttermilk and whisk to incorporate.In a separate bowl, combine baking soda, cornmeal, flour, and salt then stir to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mini-muffin-tray.jpg', u'id': 405905, u'name': u'mini muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk into wet ingredients in two batches.Spray a mini muffin tin very well with non-stick spray then spoon 1 Tablespoon batter into each mini muffin cup.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place one hot dog bite into the middle of each cup.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mini-muffin-tray.jpg', u'id': 405905, u'name': u'mini muffin tray'}], u'step': u'Bake for 8-12 minutes or until cornbread is golden brown. Cool in mini muffin tin for 5 minutes before serving. Store leftovers in the refrigerator then re-heat for 20-30 seconds before serving.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Gewurztraminer, and ros\xe9 Wine are great choices for Hot Dogs. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. You could try Pacific Rim Riesling. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 12 dollars per bottle.', u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u'Portraying bright crispness, subtle sweetness and aromas of jasmine, pear and apple, Pacific Rim Riesling exemplifies the harmony of Riesling. The sweetness plays wonderfully with fiery fare (from Thai to Mexican), while the natural acidity stands up to richer foods (from French to German). View More', u'title': u'Pacific Rim Riesling', u'price': u'$11.99', u'id': 446903, u'link': u'https://www.wine.com/product/pacific-rim-riesling-2011/119629', u'imageUrl': u'https://spoonacular.com/productImages/446903-312x231.jpg'}]}, u'aggregateLikes': 8796, u'instructions': u'Preheat oven to 375 degrees. Combine butter and sugar in a bowl then whisk to combine. Add eggs thenwhisk to incorporate, and then add buttermilk and whisk to incorporate.In a separate bowl, combine baking soda, cornmeal, flour, and salt then stir to combine. Whisk into wet ingredients in two batches.Spray a mini muffin tin very well with non-stick spray then spoon 1 Tablespoon batter into each mini muffin cup. Place one hot dog bite into the middle of each cup.Bake for 8-12 minutes or until cornbread is golden brown. Cool in mini muffin tin for 5 minutes before serving. Store leftovers in the refrigerator then re-heat for 20-30 seconds before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-corn-dog-muffins-iowa-girl-eats-666119', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}