{u'recipes': [{u'sourceName': u'I Adore Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/546732-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 546732, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pulled Pork Stroganoff', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 889.08, u'creditText': u'I Adore Food', u'extendedIngredients': [{u'originalString': u'1 Tablespoon of all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tablespoon'}, {u'originalString': u'1/2 cup of beef broth for the sauce', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [u'for the sauce'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6008, u'unit': u'cup'}, {u'originalString': u'1 Teaspoon of freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'Teaspoon'}, {u'originalString': u'1 Tablespoon of butter + 2 tsp', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoon'}, {u'originalString': u'2 Tablespoon of chives, finely chopped + 3 pieces to garnish', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11156, u'unit': u'Tablespoon'}, {u'originalString': u'1 1/2 Tablespoon of cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1017, u'unit': u'Tablespoon'}, {u'originalString': u'1 cup of full fat sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'full-fat milk', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'4 garlic cloves, sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 Teaspoon of garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'Teaspoon'}, {u'originalString': u'4 big white mushrooms, cleaned and sliced, or 8 small porcini mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'white', u'small', u'cleaned', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u''}, {u'originalString': u'1/2 of a medium onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 Teaspoon of onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'Teaspoon'}, {u'originalString': u"1 pork tenderloin (or shoulder,butt) a small piece since it's for 2", u'aisle': u'Meat', u'name': u'pork tenderloin', u'metaInformation': [u'small', u'for 2', u'(or shoulder,butt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10218, u'unit': u''}, {u'originalString': u'1 cup of pulled pork ( or more if you want)', u'aisle': u'Meat', u'name': u'pulled pork', u'metaInformation': [u'( if you want)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10983, u'unit': u'cup'}, {u'originalString': u'8 tagliatelle nests', u'aisle': u'Pasta and Rice', u'name': u'tagliatelle', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tagliatelle.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10220409, u'unit': u''}, {u'originalString': u'1/4 cup of white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 Liter or so, depending on the size of your piece of pork, of beef broth', u'aisle': u'?', u'name': u'so', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'unit': u''}], u'healthScore': 71.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://iadorefood.com/recipes/pulled-pork-stroganoff/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'To make the pulled pork: In a slow cooker, put your pork tenderloin (or any other piece of pork), sprinkle a 1tsp of garlic powder, a tsp of onion powder and a tsp of freshly ground black pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10218, u'name': u'pork tenderloin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"Pour in enough beef broth to cover half of your piece of meat. Start your slow cooker on high for about an hour of so and then bring it down to low and let it cook for at least 4 hours for the tenderloin and about 7 to 8 hours for bigger pieces (maybe even longer). Test your meat along the way. If it falls off easily with the pressure of a fork, it is ready. Flip your piece every 2 hours or so. Once it's done, put it on a carving board and with two forks, pull the meat appart. Put it back in it's juices until you are ready to use it. It will soak up more of the beef broth. YUM!In a medium shallow saucepan, heat up a tablespoon of butter. Throw in your chopped onions and garlic. Cook on medium high for about 2 minutes and then big your heat down to medium low and continue cooking for another 3 to 4 minutes. Don't forget to stir frequently!", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add another teaspoon of butter and your slice mushrooms and cook on medium heat for 2 minutes. Throw in your wine and deglaze the bottom of the pan and let the wine evaporate and turn the heat off. This should take about a minute or so.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer your onions/garlic/mushrooms to a small bowl and reserve for later.Boil water to cook your tagliatelle nests and follow instructions on the box.In the same sauce pan, melt a tablespoon of butter. add in a tablespoon of flour and mix well, with a whisk, so it becomes a paste. Keep on cooking the paste on medium heat for about 2 minutes, stirring constantly so it does not burn. This allows the flour to cook and get a nutty flavor. Gradually, add in your beef broth and whisk. The mixture will thicken quite quickly.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tagliatelle.jpg', u'id': 10220409, u'name': u'tagliatelle'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add in your cream cheese and mix well until it is completely blended in the sauce.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add in your sour cream and mix well.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add in your pulled pork (make sure not to bring in too much of the beef juices from the slow cooker), chives and mushrooms mixture, mix well and turn off the heat.On a plate, put your pasta and pour some sauce over top. Sprinkle with leftover chives and serve!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 25, u'instructions': u"To make the pulled pork: In a slow cooker, put your pork tenderloin (or any other piece of pork), sprinkle a 1tsp of garlic powder, a tsp of onion powder and a tsp of freshly ground black pepper. Pour in enough beef broth to cover half of your piece of meat. Start your slow cooker on high for about an hour of so and then bring it down to low and let it cook for at least 4 hours for the tenderloin and about 7 to 8 hours for bigger pieces (maybe even longer). Test your meat along the way. If it falls off easily with the pressure of a fork, it is ready. Flip your piece every 2 hours or so. Once it's done, put it on a carving board and with two forks, pull the meat appart. Put it back in it's juices until you are ready to use it. It will soak up more of the beef broth. YUM!In a medium shallow saucepan, heat up a tablespoon of butter. Throw in your chopped onions and garlic. Cook on medium high for about 2 minutes and then big your heat down to medium low and continue cooking for another 3 to 4 minutes. Don't forget to stir frequently! Add another teaspoon of butter and your slice mushrooms and cook on medium heat for 2 minutes. Throw in your wine and deglaze the bottom of the pan and let the wine evaporate and turn the heat off. This should take about a minute or so. Transfer your onions/garlic/mushrooms to a small bowl and reserve for later.Boil water to cook your tagliatelle nests and follow instructions on the box.In the same sauce pan, melt a tablespoon of butter. add in a tablespoon of flour and mix well, with a whisk, so it becomes a paste. Keep on cooking the paste on medium heat for about 2 minutes, stirring constantly so it does not burn. This allows the flour to cook and get a nutty flavor. Gradually, add in your beef broth and whisk. The mixture will thicken quite quickly. Add in your cream cheese and mix well until it is completely blended in the sauce. Add in your sour cream and mix well. Add in your pulled pork (make sure not to bring in too much of the beef juices from the slow cooker), chives and mushrooms mixture, mix well and turn off the heat.On a plate, put your pasta and pour some sauce over top. Sprinkle with leftover chives and serve!", u'spoonacularSourceUrl': u'https://spoonacular.com/pulled-pork-stroganoff-546732', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}