{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/271435-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 271435, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hero Muffuletta', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 97.23, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 round Italian bread loaf (1-1/2 lb.)', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 18064, u'unit': u'lb'}, {u'originalString': u'1 pkg. (9 oz.) OSCAR MAYER Deli Fresh Oven Roasted Turkey Breast', u'aisle': u'Meat', u'name': u'deli turkey', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/deli-turkey.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 7259, u'unit': u'oz'}, {u'originalString': u'3/4 cup sliced fresh mushrooms', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1 green pepper, cut into strips', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'2 green onions, sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'3 Tbsp. KRAFT Zesty Italian Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'italian dressing', u'metaInformation': [u'italian', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4114, u'unit': u'Tbsp'}, {u'originalString': u'5 KRAFT Singles', u'aisle': u'Cheese', u'name': u'kraft singles', u'metaInformation': [u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1190, u'unit': u''}, {u'originalString': u'2 cups torn leaf lettuce', u'aisle': u'Produce', u'name': u'lettuce leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93623, u'unit': u'cups'}, {u'originalString': u'3 Tbsp. MIRACLE WHIP Dressing', u'aisle': u'Condiments', u'name': u'miracle whip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 4014, u'unit': u'Tbsp'}, {u'originalString': u'3 tomatoes, sliced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/hero-muffuletta-113693.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Toss first 4 ingredients with Italian dressing; let stand 10 min.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'id': 4114, u'name': u'italian dressing'}]}, {u'equipment': [], u'step': u'Meanwhile, cut bread horizontally in half; hollow out each half, leaving 1/2-inch-thick shell.  Discard removed bread or reserve for another use.  (See Tip.)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Spread insides of bread shells with MIRACLE WHIP.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise', u'id': 4014, u'name': u'miracle whip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Drain vegetable mixture; discard dressing.  Layer turkey, Singles, vegetable mixture and lettuce in bottom half of bread; cover with top of bread.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Cut into wedges.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Albarino, ros\xe9 Wine, and Sauvignon Blanc are my top picks for Muffuletta. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. You could try La Canan Albarino. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'albarino', u'rose wine', u'sauvignon blanc'], u'productMatches': [{u'description': u'Pineapple, lemon, seashell and salt scents carry through on the pure, silky palate. Finishes very long with brilliant acidity, rich citrus fruit flavors, fine minerals and just the slightest touch of almond. Absolutely delicious.  View More', u'title': u'La Cana Albarino', u'price': u'$19.79', u'id': 437713, u'link': u'https://www.wine.com/product/la-cana-albarino-2009/104926', u'imageUrl': u'https://spoonacular.com/productImages/437713-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Toss first 4 ingredients with Italian dressing; let stand 10 min.                                             Meanwhile, cut bread horizontally in half; hollow out each half, leaving 1/2-inch-thick shell.  Discard removed bread or reserve for another use.  (See Tip.) Spread insides of bread shells with MIRACLE WHIP.                                            Drain vegetable mixture; discard dressing.  Layer turkey, Singles, vegetable mixture and lettuce in bottom half of bread; cover with top of bread. Cut into wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/hero-muffuletta-271435', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}