{u'recipes': [{u'sourceName': u'Pip and Debby', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/701478-556x370.', u'cheap': False, u'gaps': u'no', u'id': 701478, u'veryPopular': False, u'lowFodmap': True, u'title': u'Chocolate Buttercream Frosting', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'pricePerServing': 644.66, u'creditText': u'Pip and Debby', u'extendedIngredients': [{u'originalString': u'3 sticks butter (1 1/2 cups), softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cups'}, {u'originalString': u'4 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 18.0, u'imageType': u'', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.pipandebby.com/pip-ebby/2015/12/23/chocolate-buttercream-frosting', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 242, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a large mixing bowl, combine butter, cocoa and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix until creamy.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add powdered sugar and vanilla and mix on medium speed until creamy and free of lumps. Use immediately or store in the refrigerator in an air-tight container until ready to use. If refrigerated, bring to room temperature when ready to use.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u''}], u'aggregateLikes': 16, u'instructions': u'In a large mixing bowl, combine butter, cocoa and salt. Mix until creamy. Add powdered sugar and vanilla and mix on medium speed until creamy and free of lumps. Use immediately or store in the refrigerator in an air-tight container until ready to use. If refrigerated, bring to room temperature when ready to use.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-buttercream-frosting-701478', u'dishTypes': [u'frosting', u'icing'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}