{u'recipes': [{u'sourceName': u'Life Made Simple', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/621649-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 621649, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet Potato Biscuits', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 14.03, u'creditText': u'Life Made Simple', u'extendedIngredients': [{u'originalString': u'1 tbsp. baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tbsp'}, {u'originalString': u'\xbc tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'\xbd c. buttermilk + additional for brushing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1230, u'unit': u'c'}, {u'originalString': u'1\xbd c. all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'2 tbsp. granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbe c. pureed sweet potato (1 large sweet potato)', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'pureed', u'large', u'(1 sweet potato)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11507, u'unit': u'c'}, {u'originalString': u'6 tbsp. unsalted butter, cold and cut into cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://lifemadesimplebakes.com/2014/12/sweet-potato-biscuits/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 425 degrees. Line a baking sheet with parchment paper or a baking mat, set aside.In a small mixing bowl, whisk together the sweet potato and the buttermilk, set aside.In a large mixing bowl, whisk together the flour, sugar, baking powder, baking soda and salt. Using a pastry blender, cut in the butter until pea-size clumps form.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the sweet potato mixture, fold gently with a spatula to combine. You may need to add a little more buttermilk depending on how dry your mixture is.Dust your work surface with flour, then turn the dough onto the the surface and knead with the palms of your hands for about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Roll or pat the dough until it\'s " thick. Using a 2"-3" round cutter, cut the dough into biscuits. You can re-roll the scraps and to cut additional biscuits.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the biscuits onto the prepared baking sheet, brush tops with additional buttermilk and bake until light golden brown, about 12 to 15 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}]}, {u'equipment': [], u'step': u'Remove and allow to cool on the sheet for 5-7 minutes before eating.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Southern on the menu? Try pairing with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Columbia Winery Cellarmaster's Riesling with a 4.7 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 26, u'instructions': u'Preheat oven to 425 degrees. Line a baking sheet with parchment paper or a baking mat, set aside.In a small mixing bowl, whisk together the sweet potato and the buttermilk, set aside.In a large mixing bowl, whisk together the flour, sugar, baking powder, baking soda and salt. Using a pastry blender, cut in the butter until pea-size clumps form. Add the sweet potato mixture, fold gently with a spatula to combine. You may need to add a little more buttermilk depending on how dry your mixture is.Dust your work surface with flour, then turn the dough onto the the surface and knead with the palms of your hands for about 2 minutes. Roll or pat the dough until it\'s " thick. Using a 2"-3" round cutter, cut the dough into biscuits. You can re-roll the scraps and to cut additional biscuits.Place the biscuits onto the prepared baking sheet, brush tops with additional buttermilk and bake until light golden brown, about 12 to 15 minutes. Remove and allow to cool on the sheet for 5-7 minutes before eating.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-biscuits-621649', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 27, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}