{u'recipes': [{u'sourceName': u'In Katrinas Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/628635-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 628635, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Covered Potato Chip Popcorn', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 54.69, u'creditText': u'In Katrinas Kitchen', u'extendedIngredients': [{u'originalString': u'1 cup milk chocolate melting candy', u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19081, u'unit': u'cup'}, {u'originalString': u'1/2 tsp coarse sea salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'8 cups popped popcorn', u'aisle': u'Savory Snacks', u'name': u'popcorn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 19034, u'unit': u'cups'}, {u'originalString': u'1 cup potato chips with ridges', u'aisle': u'Savory Snacks', u'name': u'potato chips', u'metaInformation': [u'with ridges'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potato-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19411, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.inkatrinaskitchen.com/2015/02/chocolate-covered-potato-chip-popcorn.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the popcorn into a large bowl, and remove any unpopped kernels.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the chocolate melting candy in a medium microwave-safe bowl. Microwave on medium power for 1 minutes. Stir until melted and smooth. If needed, add additional heating time in 30-second increments, stirring after each time, until the candy is melted and smooth.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Pour the melted candy over the popcorn, but do not stir yet.Crumble the potato chips over the popcorn bowl (it's okay to leave big pieces). Using a large rubber spatula, gently stir to coat.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potato-chips.jpg', u'id': 19411, u'name': u'potato chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spread the popcorn mixture on a large piece of parchment paper or a large silicone baking mat, and sprinkle with the sea salt, adding more to taste if desired.Allow to cool until the chocolate coating has hardened, about 20 minutes. Break into pieces before packaging or transberring to a bowl for serving. The popcorn may be stored in an airtight container for up to 4 days.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Banfi Rosa Regale Brachetto ( half-bottle). Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"This sparkling red wine made from Brachetto d'Acqui in Piedmont, Italy is love at first sip and a perpetual crowd pleaser. The color is a festive cranberry. Aromatic with hints of raspberries, strawberries and rose petals. There is a taste of fresh raspberries, with crisp acidity, enticing the palate with an initial softness, graduating to a clean and dry finish. Perfect for any occasion. A unique and festive sparkling wine, seductive aperitif, and elegant dessert wine. Pairs well with seafood, cheeses, spicy fare and chocolate. Serve chilled.", u'title': u'Banfi Rosa Regale Brachetto ( half-bottle)', u'price': u'$12.99', u'id': 448167, u'link': u'https://www.wine.com/product/banfi-rosa-regale-brachetto-375ml-half-bottle-2012/130015', u'imageUrl': u'https://spoonacular.com/productImages/448167-312x231.jpg'}]}, u'aggregateLikes': 68, u'instructions': u"Pour the popcorn into a large bowl, and remove any unpopped kernels.Place the chocolate melting candy in a medium microwave-safe bowl. Microwave on medium power for 1 minutes. Stir until melted and smooth. If needed, add additional heating time in 30-second increments, stirring after each time, until the candy is melted and smooth.Pour the melted candy over the popcorn, but do not stir yet.Crumble the potato chips over the popcorn bowl (it's okay to leave big pieces). Using a large rubber spatula, gently stir to coat.Spread the popcorn mixture on a large piece of parchment paper or a large silicone baking mat, and sprinkle with the sea salt, adding more to taste if desired.Allow to cool until the chocolate coating has hardened, about 20 minutes. Break into pieces before packaging or transberring to a bowl for serving. The popcorn may be stored in an airtight container for up to 4 days.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-covered-potato-chip-popcorn-628635', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}