{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/622163-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 622163, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Best Ever Chocolate Mousse Ever', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 208.3, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'9 ounces bittersweet chocolate, chopped', u'aisle': u'Sweet Snacks', u'name': u'bittersweet chocolate', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'4 eggs, separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 pint heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'pint'}, {u'originalString': u'3/4 cup miniature marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'miniature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19116, u'unit': u'cup'}, {u'originalString': u'1 dash peppermint extract', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022050, u'unit': u'dash'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://allrecipes.com/Recipe/The-Best-Ever-Chocolate-Mousse-Recipe-Ever/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [], u'winePairing': {}, u'aggregateLikes': 35, u'instructions': u'In a microwave-safe bowl, microwave chocolate until melted. Stir occasionally until chocolate is smooth. Stir marshmallows into hot chocolate until melted. Set aside.Whip egg whites until stiff peaks form. Whip cream until soft peaks form. Stir egg yolks into slightly cooled chocolate mixture. Fold in egg whites and whipped cream. Stir in peppermint extract. Chill 2 to 3 hours before serving.Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/the-best-ever-chocolate-mousse-ever-622163', u'dishTypes': [], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}