{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/206086-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 206086, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cook the Book: Farro Pasta with Spicy Salami Tomato Sauce and Fresh Mint', u'diets': [u'dairy free'], u'pricePerServing': 259.82, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'Pinch freshly ground black pepper, plus additional to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1 (28-ounce) can San Marzano tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'Chopped fresh mint, for garnish', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2064, u'unit': u'servings'}, {u'originalString': u'1 garlic clove, thinly sliced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon kosher salt, plus additional to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons extra-virgin olive oil, plus additional for serving', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon dried Sicilian pepper or red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'dried', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 pound dry farro or whole wheat pasta of a short thick shape, such as penne', u'aisle': u'Pasta and Rice', u'name': u'short pasta', u'metaInformation': [u'whole wheat', u'dry', u' such as penne', u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20499, u'unit': u'pound'}, {u'originalString': u'1/2 pound spicy sopressata, casing removed', u'aisle': u'Meat', u'name': u'sopressata', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1007071, u'unit': u'pound'}, {u'originalString': u'1/2 yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/10/farro-pasta-with-spicy-salami-tomato-sauce-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'To make the tomato sauce, heat the oil in a medium saucepan over medium-low heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion, garlic, 1/2 teaspoon salt, and a small pinch of black pepper. Cook, covered, until the vegetables are very soft, 5 to 7 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour in the tomatoes and their liquid. Continue to simmer until the sauce thickens and the oil separates and rises to the surface of the sauce, about 25 minutes. Run the sauce through a food mill fitted with the large disc; season with additional salt and pepper.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'To make the pasta, bring a large pot of heavily salted water to a boil. Cook the pasta until very al dente (remove it about 2 minutes before al dente).', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Drain the pasta well.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the sopressata into batons about 2 inches long and 1/4 inch thick.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'id': 1007071, u'name': u'soppressata'}]}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large, straight-sided skillet, heat the oil over medium-high heat.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sopressata and cook, stirring occasionally, until the sausage is light golden and has rendered some of its fat.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'id': 1007071, u'name': u'soppressata'}]}, {u'equipment': [], u'step': u'Pour in the tomato sauce and Sicilian pepper or red pepper flakes. Cook over high heat until the sauce looks dry and turns golden around the edges, about 8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'5', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the sauce from the heat and stir in 1/4 cup water.', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pasta. Return the skillet to the heat and cook, tossing occasionally, until the sauce reduces and tightens around the pasta, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'6', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Divide the pasta among individual serving plates.', u'number': 18, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle each plate with olive oil, sprinkle with mint, and serve.', u'number': 19, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}], u'name': u''}], u'aggregateLikes': 28, u'instructions': u'Procedures                                                                              1                                                                            To make the tomato sauce, heat the oil in a medium saucepan over medium-low heat. Add the onion, garlic, 1/2 teaspoon salt, and a small pinch of black pepper. Cook, covered, until the vegetables are very soft, 5 to 7 minutes. Pour in the tomatoes and their liquid. Continue to simmer until the sauce thickens and the oil separates and rises to the surface of the sauce, about 25 minutes. Run the sauce through a food mill fitted with the large disc; season with additional salt and pepper.                                                                                                                            2                                                                            To make the pasta, bring a large pot of heavily salted water to a boil. Cook the pasta until very al dente (remove it about 2 minutes before al dente). Drain the pasta well.                                                                                                                            3                                                                            Cut the sopressata into batons about 2 inches long and 1/4 inch thick.                                                                                                                            4                                                                            In a large, straight-sided skillet, heat the oil over medium-high heat. Add the sopressata and cook, stirring occasionally, until the sausage is light golden and has rendered some of its fat. Pour in the tomato sauce and Sicilian pepper or red pepper flakes. Cook over high heat until the sauce looks dry and turns golden around the edges, about 8 minutes.                                                                                                                            5                                                                            Remove the sauce from the heat and stir in 1/4 cup water. Add the pasta. Return the skillet to the heat and cook, tossing occasionally, until the sauce reduces and tightens around the pasta, 2 to 3 minutes.                                                                                                                            6                                                                            Divide the pasta among individual serving plates. Drizzle each plate with olive oil, sprinkle with mint, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/cook-the-book-farro-pasta-with-spicy-salami-tomato-sauce-and-fresh-mint-206086', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}