{u'recipes': [{u'sourceName': u'Running to the Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/588460-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 588460, u'veryPopular': False, u'lowFodmap': True, u'title': u'Coconut cashew crusted salmon', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 461.49, u'creditText': u'Running to the Kitchen', u'extendedIngredients': [{u'originalString': u'\xbc cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 kiwi, diced', u'aisle': u'Produce', u'name': u'kiwi', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9148, u'unit': u''}, {u'originalString': u'\xbd cup diced pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9266, u'unit': u'cup'}, {u'originalString': u'\xbe lb. of wild Alaskan king salmon', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'wild'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 15076, u'unit': u'lb'}, {u'originalString': u'salt & pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 tomatillo, diced', u'aisle': u'Produce', u'name': u'tomatillo', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11954, u'unit': u''}, {u'originalString': u'\xbd yellow pepper, diced', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.runningtothekitchen.com/2011/12/coconut-cashew-crusted-salmon/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 425 degrees. Line a baking sheet with parchment, aluminum foil or a silpat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Combine coconut, cashews and breadcrumbs in a dish and mix together.Season salmon with salt & pepper and spray with cooking spray.Coat salmon in coconut, cashew, breadcrumb mixture and lay on baking sheet. Spray again lightly with cooking spray before putting it in the oven.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake for 12-15 minutes until cooked to your desired "doneness" (I prefer salmon more on the rare side and baked mine for 12 minutes)While salmon bakes, whisk together lime juice and sugar in a small bowl.', u'length': {u'number': 27, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add diced vegetables, fruit and cilantro and toss to combine. (This can be made ahead of time as the flavors get better as it sits)Top baked salmon with salsa.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Luna Nuda Pinot Grigio. It has 4.4 out of 5 stars and a bottle costs about 14 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste. View More', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 113, u'instructions': u'Preheat oven to 425 degrees. Line a baking sheet with parchment, aluminum foil or a silpat.Combine coconut, cashews and breadcrumbs in a dish and mix together.Season salmon with salt & pepper and spray with cooking spray.Coat salmon in coconut, cashew, breadcrumb mixture and lay on baking sheet. Spray again lightly with cooking spray before putting it in the oven.Bake for 12-15 minutes until cooked to your desired "doneness" (I prefer salmon more on the rare side and baked mine for 12 minutes)While salmon bakes, whisk together lime juice and sugar in a small bowl. Add diced vegetables, fruit and cilantro and toss to combine. (This can be made ahead of time as the flavors get better as it sits)Top baked salmon with salsa.', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-cashew-crusted-salmon-588460', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}