{u'recipes': [{u'sourceName': u'Food52', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/630466-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 630466, u'veryPopular': True, u'lowFodmap': False, u'title': u'Kale Macaroni and Cheese in Homage to Woodberry Kitchen', u'diets': [], u'pricePerServing': 263.77, u'creditText': u'Food52', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 bunch lacinato kale', u'aisle': u'Produce', u'name': u'lacinato kale', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lacinato-kale.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 10011233, u'unit': u'bunch'}, {u'originalString': u'1 tablespoon olive oil, plus some to grease', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup grated or ground Pecorino Romano cheese', u'aisle': u'Cheese', u'name': u'pecorino romano cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1038, u'unit': u'cup'}, {u'originalString': u'1 pound penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'pound'}, {u'originalString': u'15 to 20 ounces shredded cheese (I use a mix of mild and sharp aged cheddar and Asiago)', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded', u'(I use a mix of mild and sharp aged cheddar and Asiago)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'ounces'}, {u'originalString': u'2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/2 cup breadcrumbs (I like a mix of whole wheat and panko)', u'aisle': u'Pasta and Rice', u'name': u'whole wheat breadcrumbs', u'metaInformation': [u'whole wheat', u'(I like a mix of and panko)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 99025, u'unit': u'cup'}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'https://food52.com/recipes/26060-kale-macaroni-and-cheese-in-homage-to-woodberry-kitchen', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot, bring 6 cups water to a boil, then blanch the kale in the boiling water for 30 seconds. Leaving the boiled water in the pot, use a slotted spoon to scoop the kale out of the water and into a strainer, and allow the excess water to drain.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Let cool, then chop, removing and discarding the stems.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring the water in the pot back to a boil, add the penne, and cook according to the package until just under al dente, then drain and set aside. The pasta is going to be baked, so you want it to be just under cooked at this stage.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'id': 11120420, u'name': u'penne'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a large saucepan, melt the butter and olive oil over medium-low heat until the butter starts to foam. While whisking, add in the flour and continue whisking for another 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the milk slowly while whisking continuously to make sure there are no lumps. Once you have a smooth texture, turn off the heat and add the cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u"Mix well until the cheese is melted, then add the kale, making sure it doesn't stay in clumps.", u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the pasta to saucepan and combine with the cheese sauce. If your saucepan is not large enough, add the pasta and the cheesy kale mixture back into the drained pasta pot and mix well.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Grease an 11- or 12-inch cast iron pan or other oven-proof baking dish with some oil.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the pasta/cheesy kale mixture into it, then sprinkle the breadcrumbs and Pecorino Romano over the top.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1038, u'name': u'pecorino romano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Bake for 35 to 40 minutes until bubbling and golden brown on top.If after 40 minutes this has not happened, raise heat to 400 F and check again after 5 minutes.', u'length': {u'number': 80, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand for a few minutes before serving.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese works really well with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. The Tanian et Vincent Careme Terre Brulee Chenin Blanc with a 4.1 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 1386, u'instructions': u"Preheat oven to 350 F.                                  In a large pot, bring 6 cups water to a boil, then blanch the kale in the boiling water for 30 seconds. Leaving the boiled water in the pot, use a slotted spoon to scoop the kale out of the water and into a strainer, and allow the excess water to drain. Let cool, then chop, removing and discarding the stems.                                  Bring the water in the pot back to a boil, add the penne, and cook according to the package until just under al dente, then drain and set aside. The pasta is going to be baked, so you want it to be just under cooked at this stage.                                  In a large saucepan, melt the butter and olive oil over medium-low heat until the butter starts to foam. While whisking, add in the flour and continue whisking for another 2 minutes.Add the milk slowly while whisking continuously to make sure there are no lumps. Once you have a smooth texture, turn off the heat and add the cheese. Mix well until the cheese is melted, then add the kale, making sure it doesn't stay in clumps.                                   Add the pasta to saucepan and combine with the cheese sauce. If your saucepan is not large enough, add the pasta and the cheesy kale mixture back into the drained pasta pot and mix well.                                  Grease an 11- or 12-inch cast iron pan or other oven-proof baking dish with some oil. Transfer the pasta/cheesy kale mixture into it, then sprinkle the breadcrumbs and Pecorino Romano over the top.                                  Bake for 35 to 40 minutes until bubbling and golden brown on top.If after 40 minutes this has not happened, raise heat to 400 F and check again after 5 minutes. Let stand for a few minutes before serving.", u'spoonacularSourceUrl': u'https://spoonacular.com/kale-macaroni-and-cheese-in-homage-to-woodberry-kitchen-630466', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}