{u'recipes': [{u'sourceName': u'Slender Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/510439-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 510439, u'veryPopular': True, u'lowFodmap': False, u'title': u'Zucchini Beef Burgers', u'diets': [u'dairy free'], u'pricePerServing': 713.26, u'creditText': u'Slender Kitchen', u'extendedIngredients': [{u'originalString': u'1 lb. 95% lean ground beef', u'aisle': u'Meat', u'name': u'95% lean ground beef', u'metaInformation': [u'95%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lb'}, {u'originalString': u'1/4 cup breadcrumbs (replace with 1 egg white or flaxseed meal for low carb/paleo/gluten free)', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'with 1 egg white or flaxseed meal for low carb/paleo/gluten free)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'Pinch cayenne or chili pepper', u'aisle': u'Produce', u'name': u'chili pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u'pinch'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/2 tsp. ground mustard (if you have it)', u'aisle': u'Spices and Seasonings', u'name': u'ground mustard', u'metaInformation': [u'(if you have it)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002024, u'unit': u'tsp'}, {u'originalString': u'2 tsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'1/4 cup onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 tsp. onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'3/4 tsp. pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'serving'}], u'healthScore': 51.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.slenderkitchen.com/zucchini-beef-burgers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404778, u'name': u'box grater'}], u'step': u'This step is extremely important.  Use a box grater to shred your zucchini.  Then using a cheesecloth, clean towel, or paper towels – squeeze the zucchini until you remove most of the moisture.  You will be shocked at how much water comes out.  The more you can squeeze out, the better the burgers will come out.  I recommend squeezing it out in batches since smaller bunches are easier.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix together the shredded zucchini, beef, and remaining ingredients.  Form into 6 patties.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush the burgers with olive oil and then season with salt on both sides.Cook in a medium hot skillet for 4-5 minutes per side or grill.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger on the menu? Try pairing with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Ernesto Catena Padrillos Malbec. Reviewers quite like it with a 4.8 out of 5 star rating and a price of about 15 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Ripe, concentrated dark fruit aromas with hints of chocolate, black cherry and red currant fruit flavors with notes of sweet spices, soft, supple tannins and balanced bright acidity.', u'title': u'Ernesto Catena Padrillos Malbec', u'price': u'$14.99', u'id': 438162, u'link': u'https://www.wine.com/product/ernesto-catena-padrillos-malbec-2013/134759', u'imageUrl': u'https://spoonacular.com/productImages/438162-312x231.jpg'}]}, u'aggregateLikes': 432, u'instructions': u'This step is extremely important.  Use a box grater to shred your zucchini.  Then using a cheesecloth, clean towel, or paper towels – squeeze the zucchini until you remove most of the moisture.  You will be shocked at how much water comes out.  The more you can squeeze out, the better the burgers will come out.  I recommend squeezing it out in batches since smaller bunches are easier.Mix together the shredded zucchini, beef, and remaining ingredients.  Form into 6 patties.Brush the burgers with olive oil and then season with salt on both sides.Cook in a medium hot skillet for 4-5 minutes per side or grill.', u'spoonacularSourceUrl': u'https://spoonacular.com/zucchini-beef-burgers-510439', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}