{u'recipes': [{u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/181941-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_FULL', u'cookingMinutes': 0, u'id': 181941, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple Pie Yogurt Mini Trifle', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 219.2, u'extendedIngredients': [{u'originalString': u'1 crispy apple chip (from 2.5 oz bag), if desired', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'crispy', u'(from 2.5 oz bag)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 Fiber 90 calorie cinnamon coffee cake bar (from 5.34-oz box)', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'(from 5.34-oz box)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 14209, u'unit': u''}, {u'originalString': u'1/2 cup diced Granny Smith apple', u'aisle': u'Produce', u'name': u'granny smith apple', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1029003, u'unit': u'cup'}, {u'originalString': u'1 container (5.3 oz) Yoplait\xae Greek 100 apple pie yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'yoplait\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.3, u'consistency': u'liquid', u'id': 1256, u'unit': u'oz'}, {u'originalString': u'1 tablespoon toasted chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'toasted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'tablespoon'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.BettyCrocker.com/recipes/apple-pie-yogurt-mini-trifle/6d0bb410-93f0-4e7e-b593-1b0dd12c376d', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Break up bar into small crumbs. Spoon half of crumbs into bottom of mini trifle dish.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Top crumbs with half of the yogurt; top with apple.  Repeat layers; sprinkle with walnuts.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Garnish with apple chip.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Yogurt on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'1                               Break up bar into small crumbs. Spoon half of crumbs into bottom of mini trifle dish.                                                          2                               Top crumbs with half of the yogurt; top with apple.  Repeat layers; sprinkle with walnuts.  Garnish with apple chip.', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-pie-yogurt-mini-trifle-181941', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}