{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/409516-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 409516, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chili with Barley', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 53.37, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (14-1/2 ounces) diced tomatoes, undrained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounces'}, {u'originalString': u'1 can (16 ounces) chili beans, undrained', u'aisle': u'Canned and Jarred', u'name': u'chili beans', u'metaInformation': [u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 43112, u'unit': u'ounces'}, {u'originalString': u'1 envelope chili seasoning', u'aisle': u'Spices and Seasonings', u'name': u'chili seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'consistency': u'solid', u'id': 1022028, u'unit': u'envelope'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 cup quick-cooking barley', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'quick cooking barley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20005, u'unit': u'cup'}, {u'originalString': u'1 can (6 ounces) tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11887, u'unit': u'ounces'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/chili-with-barley', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, cook beef and onion over medium heat until meat is no longer pink.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic; cook 1 minute longer.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Drain.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add water; bring to a boil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Stir in barley. Reduce heat; cover and simmer for 10 minutes or until barley is tender. Stir in the beans, tomatoes, tomato paste and chili seasoning; heat through.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1022028, u'name': u'chili seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. One wine you could try is Juve Y Camps Brut Nature Reserva de la Familia Cava. It has 4.3 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale gold in color, this Cava has aromas of mature white peach, toasted bread and green tea with hints of lemon citrus and apricots. Equally rich and broad on the palate, these flavors continue to unfold on the palate.Its fresh profile makes it a perfect match for pate, seafood, tapas, paellas, grilled poultry or cured meats.', u'title': u'Juve Y Camps Brut Nature Reserva de la Familia Cava', u'price': u'$15.99', u'id': 433977, u'link': u'https://www.wine.com/product/juve-y-camps-brut-nature-reserva-de-la-familia-cava-2011/150306', u'imageUrl': u'https://spoonacular.com/productImages/433977-312x231.jpg'}]}, u'aggregateLikes': 230, u'instructions': u'Directions                                                                                In a large saucepan, cook beef and onion over medium heat until meat is no longer pink. Add garlic; cook 1 minute longer. Drain. Add water; bring to a boil.                                                                                            Stir in barley. Reduce heat; cover and simmer for 10 minutes or until barley is tender. Stir in the beans, tomatoes, tomato paste and chili seasoning; heat through.                                        Yield: 6-8 servings.                                                                                                                         Originally published as Chili with Barley in  Country WomanNovember/December 2005, p35                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/chili-with-barley-409516', u'dishTypes': [u'soup'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}