{u'recipes': [{u'sourceName': u'Jessica Gavin', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/618067-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 618067, u'veryPopular': False, u'lowFodmap': False, u'title': u'No Bake Pumpkin Cheesecake Cups', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 120, u'pricePerServing': 209.67, u'creditText': u'Jessica Gavin', u'extendedIngredients': [{u'originalString': u'1 cup canned pumpkin puree, chilled', u'aisle': u'Baking', u'name': u'canned pumpkin puree', u'metaInformation': [u'chilled', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'8 ounces cream cheese, chilled', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 cup finely crushed graham crackers (about 7 crackers)', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [u'crushed', u'finely', u'( 7 crackers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18617, u'unit': u'cup'}, {u'originalString': u'\xbc cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 pinch ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2011, u'unit': u'pinch'}, {u'originalString': u'\xbc teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'2 cups heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'6 tablespoons light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.jessicagavin.com/test-kitchen/sweets/no-bake-pumpkin-cheesecake-cups/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 44, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium sized bowl, combine crushed graham crackers and brown sugar. Stir in the melted butter, until cookies are moistened.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add 3 tablespoons of the crust mixture into 4 glasses, pressing gently into an even layer.In a mixer fitted with a whisk attachment, beat cream cheese until light and fluffy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add brown sugar and beat until combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add vanilla, cinnamon, nutmeg, ginger and cloves; beat until combined. Fold in pumpkin puree until fully combined. Cover and refrigerate.In a mixer fitted with a whisk attachment, whisk heavy whipping cream and sugar until stiff peaks are formed.Gently fold in 1 cup of the Chantilly cream into the pumpkin cheesecake mixture. Reserve the rest of the Chantilly cream for assembling the cheesecake trifle.Pipe or spoon the pumpkin cheesecake mixture into the glass cups containing the crumb crust. Pipe or spoon a layer of Chantilly cream on top of the pumpkin cheesecake. Sprinkle 2-3 tablespoons of the crumb crust over the chantilly cream. Pipe another layer of the pumpkin cheesecake on top of the crumb crust. Pipe Chantilly cream on top of the pumpkin cheesecake. Chill pumpkin cheesecakes for at least an hour before serving. Cheesecakes can be refrigerated for up to 3 days.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'id': 11424, u'name': u'canned pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'aggregateLikes': 96, u'instructions': u'In a medium sized bowl, combine crushed graham crackers and brown sugar. Stir in the melted butter, until cookies are moistened. Add 3 tablespoons of the crust mixture into 4 glasses, pressing gently into an even layer.In a mixer fitted with a whisk attachment, beat cream cheese until light and fluffy. Add brown sugar and beat until combined. Add vanilla, cinnamon, nutmeg, ginger and cloves; beat until combined. Fold in pumpkin puree until fully combined. Cover and refrigerate.In a mixer fitted with a whisk attachment, whisk heavy whipping cream and sugar until stiff peaks are formed.Gently fold in 1 cup of the Chantilly cream into the pumpkin cheesecake mixture. Reserve the rest of the Chantilly cream for assembling the cheesecake trifle.Pipe or spoon the pumpkin cheesecake mixture into the glass cups containing the crumb crust. Pipe or spoon a layer of Chantilly cream on top of the pumpkin cheesecake. Sprinkle 2-3 tablespoons of the crumb crust over the chantilly cream. Pipe another layer of the pumpkin cheesecake on top of the crumb crust. Pipe Chantilly cream on top of the pumpkin cheesecake. Chill pumpkin cheesecakes for at least an hour before serving. Cheesecakes can be refrigerated for up to 3 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-pumpkin-cheesecake-cups-618067', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}