{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479901-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 479901, u'veryPopular': False, u'lowFodmap': False, u'title': u'On the Job: Swiss Chard Gratin', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 227.91, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'12 cups thinly sliced chard leaves (about 2 large bunches), thick stems removed', u'aisle': u'Produce', u'name': u'chard', u'metaInformation': [u'thick', u'large', u'thinly sliced', u'( 2 bunches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 12.0, u'consistency': u'solid', u'id': 11147, u'unit': u'cups'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup gluten-free breadcrumbs', u'aisle': u'Bakery/Bread;Pasta and Rice;Gluten Free', u'name': u'gluten-free breadcrumbs', u'metaInformation': [u'gluten-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93694, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1 cup coarsely grated gruyere', u'aisle': u'Cheese', u'name': u'gruyere', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1023, u'unit': u'cup'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'Sea salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 large sweet onion, diced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'diced', u'sweet', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://feedmephoebe.com/2013/11/swiss-chard-gratin/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400\xb0F. In a large nonstick skillet, heat the butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Saute the onion over medium-high heat until soft, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the chard and cook until wilted and the stems are tender, about 5 minutes. In a small bowl, whisk together the milk and cornstarch.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add to the pan and simmer until slightly thickened, about 5 minutes. Season with the nutmeg and 1 teaspoon salt.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer the greens to a 3-quart ceramic baking dish and sprinkle the cheese over the top, followed by the breadcrumbs.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 15 minutes, until heated through and the top is lightly golden brown.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 178, u'instructions': u'Preheat the oven to 400\xb0F. In a large nonstick skillet, heat the butter. Saute the onion over medium-high heat until soft, about 5 minutes. Add the chard and cook until wilted and the stems are tender, about 5 minutes. In a small bowl, whisk together the milk and cornstarch. Add to the pan and simmer until slightly thickened, about 5 minutes. Season with the nutmeg and 1 teaspoon salt. Transfer the greens to a 3-quart ceramic baking dish and sprinkle the cheese over the top, followed by the breadcrumbs. Bake for 15 minutes, until heated through and the top is lightly golden brown.', u'spoonacularSourceUrl': u'https://spoonacular.com/on-the-job-swiss-chard-gratin-479901', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}