{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/273075-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 273075, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fast Tortellini Alfredo', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 154.8, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'2 pkg. (9 oz. each) refrigerated three cheese tortellini, cooked, drained', u'aisle': u'Refrigerated', u'name': u'cheese tortellini', u'metaInformation': [u'refrigerated', u'cooked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 18.0, u'consistency': u'solid', u'id': 10093727, u'unit': u'oz'}, {u'originalString': u'1/2 cup (1/2 of 8-oz. tub) PHILADELPHIA Cream Cheese Spread', u'aisle': u'Cheese', u'name': u'chive & onion cream cheese spread', u'metaInformation': [u'(1/2 of 8-oz. tub)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-onion-cream-cheese-dip.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93748, u'unit': u'cup'}, {u'originalString': u'1-1/2 pkg. (6 oz. each) OSCAR MAYER Smoked Ham (12 slices), chopped', u'aisle': u'Meat', u'name': u'ham', u'metaInformation': [u'smoked', u'chopped', u'(12 slices)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10151, u'unit': u'oz'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/4 cup KRAFT Grated Parmesan Cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 cups frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/fast-tortellini-alfredo-89326.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Mix cream cheese spread, milk and Parmesan in large saucepan until well blended.  Stir in tortellini and peas; cover.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'id': 93727, u'name': u'tortellini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Cook on medium-low heat 5 min., stirring occasionally.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Stir in ham; cook 3 to 5 min. or until heated through, stirring occasionally.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Selvapiana Chianti Rufina with a 4.3 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses. View More', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Mix cream cheese spread, milk and Parmesan in large saucepan until well blended.  Stir in tortellini and peas; cover.                                              Cook on medium-low heat 5 min., stirring occasionally.                                             Stir in ham; cook 3 to 5 min. or until heated through, stirring occasionally.', u'spoonacularSourceUrl': u'https://spoonacular.com/fast-tortellini-alfredo-273075', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}