{u'recipes': [{u'sourceName': u'Natashas Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/582866-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 582866, u'veryPopular': True, u'lowFodmap': False, u'title': u'Zesty Mini Bell Pepper Salad', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 81.77, u'creditText': u'Natashas Kitchen', u'extendedIngredients': [{u'originalString': u'1 lb sweet multi-colored mini bell pepper', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'sweet', u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u'lb'}, {u'originalString': u'Pinch of black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'3 Tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp Fresh dill, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2045, u'unit': u'Tbsp'}, {u'originalString': u'\xbd tsp garlic salt, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1062047, u'unit': u'tsp'}, {u'originalString': u'2\xbd Tbsp white vinegar or Fresh lemon juice (I preferred the vinegar)', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'white', u'(I preferred the vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'\xbd of a medium sweet onion or purple onion, thinly sliced', u'aisle': u'Produce', u'name': u'purple onion', u'metaInformation': [u'sweet', u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://natashaskitchen.com/2014/05/16/zesty-mini-bell-pepper-salad-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Remove the tops and seeds from bell peppers, then cut them in half lengthwise and cut into thin strips. It was quicker to stack two bell peppers and cut two halves at a time.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Transfer sliced bell peppers to a large mixing bowl.Thinly slice onion and add it to the bowl along with chopped fresh dill.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'fresh dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Combine 2\xbd Tbsp vinegar with 3 Tbsp extra virgin olive oil, \xbd tsp garlic salt and a pinch of pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the dressing together with a fork.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour dressing over salad ingredients and stir well to combine.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add more garlic salt to taste if desired. You can serve the salad right away or refrigerate until ready to serve. It even tastes great after being refrigerated overnight!', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are great choices for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try District 7 Estate Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 2879, u'instructions': u'Remove the tops and seeds from bell peppers, then cut them in half lengthwise and cut into thin strips. It was quicker to stack two bell peppers and cut two halves at a time. Transfer sliced bell peppers to a large mixing bowl.Thinly slice onion and add it to the bowl along with chopped fresh dill.Combine 2\xbd Tbsp vinegar with 3 Tbsp extra virgin olive oil, \xbd tsp garlic salt and a pinch of pepper. Whisk the dressing together with a fork. Pour dressing over salad ingredients and stir well to combine. Add more garlic salt to taste if desired. You can serve the salad right away or refrigerate until ready to serve. It even tastes great after being refrigerated overnight!', u'spoonacularSourceUrl': u'https://spoonacular.com/zesty-mini-bell-pepper-salad-582866', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}