{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/621774-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 621774, u'veryPopular': True, u'lowFodmap': False, u'title': u'Potato Soup', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 86.01, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'5 slices bacon, diced', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 5.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'3 tablespoons bacon grease (reserved) or butter', u'aisle': u'Meat', u'name': u'bacon grease', u'metaInformation': [u'(reserved)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 4609, u'unit': u'tablespoons'}, {u'originalString': u'2 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 cup plain Greek yogurt or sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'plain', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 teaspoon Kosher salt, or more to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups milk, warmed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon freshly-cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1.5 pounds potatoes, peeled (if desired) and diced (I recommend Yukon gold potatoes)', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'diced', u'peeled', u'(if desired)', u'(I recommend Yukon gold potatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11362, u'unit': u'pounds'}, {u'originalString': u'1 cup shredded sharp cheddar cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1 cup diced white or yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'white', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.gimmesomeoven.com/potato-soup-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a large stockpot over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add diced bacon and cook until crispy, stirring occasionally.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Transfer the bacon to a separate plate, usinga slotted spoon, reserving about 3 tablespoons of bacon grease in the stockpot. (Discard any extra grease, or you can substitute butter in place of the 3 tablespoons of bacon grease. Also, if you are short on time, you can dice the potatoes and onion while the bacon cooks to save time.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 4609, u'name': u'bacon drippings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add onion and saute for 5 minutes, stirring occasionally, until soft. Sprinkle the flour on top of the onion, and stir until combined.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute for an additional minute to cook the flour, stirring occasionally. Thenstir in the chicken stock until combined. Stir in the milk, potatoes, and cooked bacon bits until combined. Continuecooking until the mixture reaches a simmer, but is not boiling.Reduce heat to medium-low, cover, and simmer for about 10-15 minutes or until the potatoes are soft, stirring occasionally every few minutes so that the bottom does not burn. (The smaller you dice your potatoes, the faster they will cook.)When the potatoes are soft, stir in the cheddar cheese and Greek yogurt (or sour cream), salt and pepper. Taste and see if it needs more salt or pepper or cheese.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve warm, garnished with desired toppings.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 3534, u'instructions': u'Heat a large stockpot over medium-high heat. Add diced bacon and cook until crispy, stirring occasionally. Transfer the bacon to a separate plate, usinga slotted spoon, reserving about 3 tablespoons of bacon grease in the stockpot. (Discard any extra grease, or you can substitute butter in place of the 3 tablespoons of bacon grease. Also, if you are short on time, you can dice the potatoes and onion while the bacon cooks to save time.)Add onion and saute for 5 minutes, stirring occasionally, until soft. Sprinkle the flour on top of the onion, and stir until combined. Saute for an additional minute to cook the flour, stirring occasionally. Thenstir in the chicken stock until combined. Stir in the milk, potatoes, and cooked bacon bits until combined. Continuecooking until the mixture reaches a simmer, but is not boiling.Reduce heat to medium-low, cover, and simmer for about 10-15 minutes or until the potatoes are soft, stirring occasionally every few minutes so that the bottom does not burn. (The smaller you dice your potatoes, the faster they will cook.)When the potatoes are soft, stir in the cheddar cheese and Greek yogurt (or sour cream), salt and pepper. Taste and see if it needs more salt or pepper or cheese.Serve warm, garnished with desired toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/potato-soup-621774', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}