{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/597013-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 597013, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ravioli with White Wine Butter Sauce and Asparagus Tips', u'diets': [], u'pricePerServing': 582.74, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'1 bunch asparagus (about 15-20 spears), trimmed and cut into two inch pieces. You can use just the tips or if you like lots of asparagus, use the stems as well!', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed', u'cut into two inch pieces. you can use just the tips or if you like lots of asparagus, use the stems as well!', u'( 15-20 spears)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'bunch'}, {u'originalString': u'6 tablespoons cold butter, cut into cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cold', u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons fresh chopped thyme, plus more for garnish', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'plus more for garnish', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'Shaved parmesan cheese for garnish', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shaved', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1 9 ounce package chilled fresh ravioli', u'aisle': u'Refrigerated;Frozen', u'name': u'ravioli', u'metaInformation': [u'fresh', u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 93832, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon minced shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u'tablespoon'}, {u'originalString': u'3/4 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.framedcooks.com/2012/07/ravioli-white-wine-butter-sauce.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 36, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Add salt and olive oil, and then asparagus.  Cook asparagus until just crisp-tender, about 2 minutes, and remove asparagus with a slotted spoon, leaving the water boiling.  2.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add one tablespoon of butter to a medium size skillet and melt over medium high heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Add shallots and garlic and stir until soft, 2-3 minutes.3. Stir in wine and simmer until reduced by half, about 2-3 minutes. Now add butter, cube by cube, stirring until each one is melted into the sauce.4. While the sauce is cooking, add the ravioli gently to the boiling asparagus water (I like to lower them in with a slotted spoon) and cook according to package directions until just done, about 6 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'id': 93832, u'name': u'ravioli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Remove with a slotted spoon and put in a single layer on a plate until the sauce is finished.5. When all the butter is melted, stir in the chopped thyme.  6. Divide the ravioli between two plates, and tuck the asparagus tips in between the ravioli.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ravioli.png', u'id': 93832, u'name': u'ravioli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Drizzle a generous portion of sauce over each serving, garnish with fresh thyme and shaved parmesan and serve at once!', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Ravioli. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Tiamo Chianti. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 10 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Intense ruby red with garnet tones. Intense, fruity with persistent aromas of spices and licorice. Full with good acidity and balanced tannins.Tiamo is bottled at Chianti DOCG, and certified as made with 100% organic grapes.', u'title': u'Tiamo Chianti', u'price': u'$9.95', u'id': 441645, u'link': u'https://www.wine.com/product/tiamo-chianti-2009/107710', u'imageUrl': u'https://spoonacular.com/productImages/441645-312x231.jpg'}]}, u'aggregateLikes': 4761, u'instructions': u'1. Bring a large pot of water to a boil.  Add salt and olive oil, and then asparagus.  Cook asparagus until just crisp-tender, about 2 minutes, and remove asparagus with a slotted spoon, leaving the water boiling.  2. Add one tablespoon of butter to a medium size skillet and melt over medium high heat.  Add shallots and garlic and stir until soft, 2-3 minutes.3. Stir in wine and simmer until reduced by half, about 2-3 minutes. Now add butter, cube by cube, stirring until each one is melted into the sauce.4. While the sauce is cooking, add the ravioli gently to the boiling asparagus water (I like to lower them in with a slotted spoon) and cook according to package directions until just done, about 6 minutes.  Remove with a slotted spoon and put in a single layer on a plate until the sauce is finished.5. When all the butter is melted, stir in the chopped thyme.  6. Divide the ravioli between two plates, and tuck the asparagus tips in between the ravioli.  Drizzle a generous portion of sauce over each serving, garnish with fresh thyme and shaved parmesan and serve at once!', u'spoonacularSourceUrl': u'https://spoonacular.com/ravioli-with-white-wine-butter-sauce-and-asparagus-tips-597013', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}