{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/746959-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 460, u'id': 746959, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Cookies-and-Cream Ice Cream', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 440.4, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 ounces chocolate wafer cookies, such as Famous Chocolate Wafers (about 20)', u'aisle': u'Sweet Snacks', u'name': u'chocolate wafer cookies', u'metaInformation': [u' such as famous chocolate wafers ( 20)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 10118157, u'unit': u'ounces'}, {u'originalString': u'5 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'3/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tablespoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpeg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/homemade-cookies-and-cream-ice-cream.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 95, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Special equipment: An ice cream maker and a candy- or instant-read thermometer', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the cream, milk, sugar, vanilla and 1/2 teaspoon salt in a medium saucepan and bring to a simmer over medium heat. Beat the egg yolks in a medium bowl. Slowly whisk 1 cup of the hot cream mixture into the beaten yolks, then pour back into the saucepan, whisking, and return to medium heat. Cook, stirring constantly with a wooden spoon, until the mixture thickens, coats the spoon and reaches 180 degrees F on a thermometer, 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from the heat and strain the custard through a fine-mesh sieve into a large bowl or measuring cup; discard the solids. Stir often until the mixture cools to room temperature. Lightly press plastic wrap directly against the surface of the custard to prevent a skin from forming. Chill until cold, about 3 hours. (For faster chilling, set the bowl of custard in a bowl of ice water and stir until cold.)', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Place an 8-inch square metal pan in the freezer to chill then freeze the cold custard in an ice cream maker according to the manufacturer's directions.", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Put the cookies into a resealable plastic bag and lightly crush with the smooth side of a meat mallet or the bottom of a measuring cup.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove chilled pan and sprinkle in half of the crumbled cookies. Top with half of the ice cream, then repeat with remaining cookies and ice cream. Working quickly, use a spoon to incorporate the cookies into the ice cream mixing from bottom to the top. Cover with plastic wrap and freeze until firm, 2 to 3 hours.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are great choices for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 84, u'instructions': u"Special equipment: An ice cream maker and a candy- or instant-read thermometer              Whisk the cream, milk, sugar, vanilla and 1/2 teaspoon salt in a medium saucepan and bring to a simmer over medium heat. Beat the egg yolks in a medium bowl. Slowly whisk 1 cup of the hot cream mixture into the beaten yolks, then pour back into the saucepan, whisking, and return to medium heat. Cook, stirring constantly with a wooden spoon, until the mixture thickens, coats the spoon and reaches 180 degrees F on a thermometer, 6 to 8 minutes. Remove from the heat and strain the custard through a fine-mesh sieve into a large bowl or measuring cup; discard the solids. Stir often until the mixture cools to room temperature. Lightly press plastic wrap directly against the surface of the custard to prevent a skin from forming. Chill until cold, about 3 hours. (For faster chilling, set the bowl of custard in a bowl of ice water and stir until cold.)                          Place an 8-inch square metal pan in the freezer to chill then freeze the cold custard in an ice cream maker according to the manufacturer's directions. Put the cookies into a resealable plastic bag and lightly crush with the smooth side of a meat mallet or the bottom of a measuring cup.                          Remove chilled pan and sprinkle in half of the crumbled cookies. Top with half of the ice cream, then repeat with remaining cookies and ice cream. Working quickly, use a spoon to incorporate the cookies into the ice cream mixing from bottom to the top. Cover with plastic wrap and freeze until firm, 2 to 3 hours.", u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-cookies-and-cream-ice-cream-746959', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 465, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}