{u'recipes': [{u'sourceName': u'Fit Foodie Finds', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/617024-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 1, u'id': 617024, u'veryPopular': False, u'lowFodmap': False, u'title': u'Single Serve Maple Pistachio Cinnamon Roll', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 1, u'pricePerServing': 94.08, u'creditText': u'Fit Foodie Finds', u'extendedIngredients': [{u'originalString': u'1 tablespoon almond milk, unsweetened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9019, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon coconut oil, partially melted', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon coconut palm sugar', u'aisle': u'Baking', u'name': u'coconut palm sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93831, u'unit': u'teaspoon'}, {u'originalString': u'5 tablespoons gluten-free flour, all-purpose (any all-purpose mix should work!)', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'gluten-free flour', u'metaInformation': [u'gluten-free', u'all-purpose', u'(any mix should work!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 93620, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons 100% maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'100%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'teaspoons'}, {u'originalString': u'- 1 tablespoon pistachio nuts, salted, coarsely chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachio nuts', u'metaInformation': [u'salted', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12151, u'unit': u'tablespoon'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://fitfoodiefinds.com/2014/10/single-serve-maple-pistachio-cinnamon-roll/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, mix together gluten-free flour and baking powder. Then, add all of the wet ingredients and form a ball of dough.Kneed dough until dough forms a ball. Flatten in your palm, creating a log about an inch thick. Set aside.Create cinnamon/pistachio filling by mixing together 1 teaspoon coconut palm sugar and 1/4 teaspoon of cinnamon. Then, coarsely chop pistachio nuts. Sprinkle cinnamon sugar mixture on dough and then top with pistachio nuts.Take one end of the log and roll dough to form the cinnamon roll. Rub a large mug with coconut oil and then place the dough inside.Microwave on high for about 50-55 seconds.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'id': 93620, u'name': u'gluten free flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [], u'step': u'Drizzle with additional maple syrup. Enjoy!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}], u'name': u''}], u'aggregateLikes': 21, u'instructions': u'In a small bowl, mix together gluten-free flour and baking powder. Then, add all of the wet ingredients and form a ball of dough.Kneed dough until dough forms a ball. Flatten in your palm, creating a log about an inch thick. Set aside.Create cinnamon/pistachio filling by mixing together 1 teaspoon coconut palm sugar and 1/4 teaspoon of cinnamon. Then, coarsely chop pistachio nuts. Sprinkle cinnamon sugar mixture on dough and then top with pistachio nuts.Take one end of the log and roll dough to form the cinnamon roll. Rub a large mug with coconut oil and then place the dough inside.Microwave on high for about 50-55 seconds. Drizzle with additional maple syrup. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/single-serve-maple-pistachio-cinnamon-roll-617024', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 2, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}