{u'recipes': [{u'sourceName': u'Food Faith Fitness', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608257-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 608257, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crepe Cake with BAILEYS Coffee Creamer Chocolate Ganache {Whole Wheat}', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 405.25, u'creditText': u'Food Faith Fitness', u'extendedIngredients': [{u'originalString': u'3 Tbsp Light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19350, u'unit': u'Tbsp'}, {u'originalString': u'4 Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup + 2 Tbsp Heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'\xbe Cup BAILEYS Coffee Creamer Original Irish Cream Flavour', u'aisle': u'Alcoholic Beverages', u'name': u'irish cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baileys-liqueur.png', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 93764, u'unit': u'Cup'}, {u'originalString': u'2 cups BAILEYS Coffee Creamer Original Irish Cream Flavour', u'aisle': u'Alcoholic Beverages', u'name': u'irish cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baileys-liqueur.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93764, u'unit': u'cups'}, {u'originalString': u'4 tsp Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'18 Oz Semi-sweet chocolate, roughly chopped', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'Ozs', u'unitShort': u'Oz', u'amount': 18.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'Oz'}, {u'originalString': u'1 cup Strong, brewed coffee', u'aisle': u'Tea and Coffee', u'name': u'strong coffee', u'metaInformation': [u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14209, u'unit': u'cup'}, {u'originalString': u'2 cups Whole wheat pastry flour (8oz)', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'oz'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.foodfaithfitness.com/crepe-cake-chocolate/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 39, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all the crepe ingredients in a blender and blend until smooth and combined.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the crepe batter into the refrigerator for at least an hour.In a large sauce pan, combine the whipping cream, \xbe cup BAILEYS Coffee Creamer and light corn syrup over medium heat. Bring the mixture to just boiling and remove from heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add in the chopped chocolate and let stand for 30 seconds. Then, whisk the chocolate until totally smooth and melted.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the ganache into a large bowl and refrigerate until solid throughout, about 3 hours.After the batter has chilled for one hour, spray a crepe pan (or small pan) with cooking spray and heat on medium heat.Using a scant \xbc cup scoop the batter into the pan and tilt with a circular motion so that the batter coats the pan evenly.Cook the crepe until the edges begin to go golden brown and lift away from the sides of the pan. Use a thin spatula to lift the side of the crepe of the pan, and then quickly flip the crepe with your fingers and cook for an additional 30 seconds.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place the cooked crepe onto a plate and repeat until all the batter is gone, stacking the crepes on the plate.', u'number': 5, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Place one crepe down onto a plate. Drop a heaping Tbsp of whipped ganache on top and spread out very thinly to cover the whole crepe (an offset spatula will help you out A LOT here!)', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add another crepe on top and repeat until you get to the last crepe **', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add another 2 Tbsp of ganache onto the top of the cake and smooth out. Then spread some of the whipped ganache over the sides of the cake until you can no longer see the edges of the crepe, and it is smooth and even.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u"Place the cake back into the refrigerator until the ganache is set, about 30 minutes.While the cake sets, place the remaining ganache back into the microwave for 10-20 seconds until it is just melted, you don't want it too hot.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Pour it into a liquid measuring cup and let it stand and come to room temperature until the first layer of ganache sets.One the first layer is set, place the cake on a cooling rack set over top of a parchment lined baking sheet.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the ganache over (if you make the whole batch of ganache, start by pouring only half) the cake, letting it drip down the sides.Smooth the ganache out over the whole cake.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with coffee beans if desired and place back into the refrigerator until ready to serve! ***', u'number': 7, u'ingredients': []}], u'name': u'Place the cooked crepes into the refrigerator to cool until the ganache is ready.Once the ganache is solid throughout, beat it with an electric hand mixer until it turns lighter in color and is soft and fluffy.To assemble the cake'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 3843, u'instructions': u"Place all the crepe ingredients in a blender and blend until smooth and combined. Place the crepe batter into the refrigerator for at least an hour.In a large sauce pan, combine the whipping cream, \xbe cup BAILEYS Coffee Creamer and light corn syrup over medium heat. Bring the mixture to just boiling and remove from heat.Add in the chopped chocolate and let stand for 30 seconds. Then, whisk the chocolate until totally smooth and melted.Pour the ganache into a large bowl and refrigerate until solid throughout, about 3 hours.After the batter has chilled for one hour, spray a crepe pan (or small pan) with cooking spray and heat on medium heat.Using a scant \xbc cup scoop the batter into the pan and tilt with a circular motion so that the batter coats the pan evenly.Cook the crepe until the edges begin to go golden brown and lift away from the sides of the pan. Use a thin spatula to lift the side of the crepe of the pan, and then quickly flip the crepe with your fingers and cook for an additional 30 seconds. Place the cooked crepe onto a plate and repeat until all the batter is gone, stacking the crepes on the plate. Place the cooked crepes into the refrigerator to cool until the ganache is ready.Once the ganache is solid throughout, beat it with an electric hand mixer until it turns lighter in color and is soft and fluffy.To assemble the cake:Place one crepe down onto a plate. Drop a heaping Tbsp of whipped ganache on top and spread out very thinly to cover the whole crepe (an offset spatula will help you out A LOT here!) Add another crepe on top and repeat until you get to the last crepe **Add another 2 Tbsp of ganache onto the top of the cake and smooth out. Then spread some of the whipped ganache over the sides of the cake until you can no longer see the edges of the crepe, and it is smooth and even.Place the cake back into the refrigerator until the ganache is set, about 30 minutes.While the cake sets, place the remaining ganache back into the microwave for 10-20 seconds until it is just melted, you don't want it too hot. Pour it into a liquid measuring cup and let it stand and come to room temperature until the first layer of ganache sets.One the first layer is set, place the cake on a cooling rack set over top of a parchment lined baking sheet. Pour the ganache over (if you make the whole batch of ganache, start by pouring only half) the cake, letting it drip down the sides.Smooth the ganache out over the whole cake. Garnish with coffee beans if desired and place back into the refrigerator until ready to serve! ***", u'spoonacularSourceUrl': u'https://spoonacular.com/crepe-cake-with-baileys-coffee-creamer-chocolate-ganache-whole-wheat-608257', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}