{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/490734-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 490734, u'veryPopular': True, u'lowFodmap': False, u'title': u'Biscoff Fluff Brownies', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 71.07, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'1/2 c. Biscoff spread', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'Biscoff spread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 99011, u'unit': u'c'}, {u'originalString': u'1 box brownie mix (9x13 pan size)', u'aisle': u'Baking', u'name': u'brownie mix', u'metaInformation': [u'(9x13 pan size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18632, u'unit': u'box'}, {u'originalString': u'1/4 c. Biscoff cookie crumbs', u'aisle': u'Sweet Snacks', u'name': u'cookie crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10018192, u'unit': u'c'}, {u'originalString': u'1 1/4 c.Biscoff cookies, broken in chunks', u'aisle': u'Sweet Snacks', u'name': u'cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 10118192, u'unit': u'c'}, {u'originalString': u'3/4 c. marshmallow cream', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'marshmallow cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 93644, u'unit': u'c'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://insidebrucrewlife.com/2012/09/biscoff-fluff-brownies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare brownie mix according to the 2 egg directions on the back of the box.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'id': 18632, u'name': u'brownie mix'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread half the batter in a greased 9 x 13 pan.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place cookie chunks on top of batter.In a bowl, combine the marshmallow fluff and Biscoff spread until creamy. Drop by spoonfuls on top of brownie batter and cookies. Cover with the rest of the brownie batter. Sprinkle the cookie crumbs on top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 93644, u'name': u'marshmallow cream'}, {u'image': None, u'id': 99011, u'name': u'cookie butter'}, {u'image': None, u'id': 10018192, u'name': u'cookie crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [], u'step': u'Bake at 350* for 25-27 minutes.', u'length': {u'number': 27, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 540, u'instructions': u'Prepare brownie mix according to the 2 egg directions on the back of the box. Spread half the batter in a greased 9 x 13 pan. Place cookie chunks on top of batter.In a bowl, combine the marshmallow fluff and Biscoff spread until creamy. Drop by spoonfuls on top of brownie batter and cookies. Cover with the rest of the brownie batter. Sprinkle the cookie crumbs on top. Bake at 350* for 25-27 minutes. Let cool.', u'spoonacularSourceUrl': u'https://spoonacular.com/biscoff-fluff-brownies-490734', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 15, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}