{u'recipes': [{u'sourceName': u'Bakerette', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/585787-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 585787, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spider Cupcakes', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 46.6, u'creditText': u'Bakerette', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 35137, u'unit': u'cup'}, {u'originalString': u'Black decorating gel', u'aisle': u'Baking', u'name': u'decorating gel', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 98881, u'unit': u'servings'}, {u'originalString': u'2 large eggs (or egg replacement, like Ener-G)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'(or egg replacement, like Ener-G)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups whole-wheat and/or all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'whole-wheat', u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'4-5 tablespoons milk (or milk substitute, like soy milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(or milk substitute, like soy milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup each orange juice and olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup each sugar and grated carrots', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u"3 cups confectioner's sugar", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'12 plastic ring spiders (or 12 gummy spider candies)', u'aisle': u'?', u'name': u'plastic ring spiders', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://bakerette.com/clean-eating-spider-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 350F. In a bowl, combine first 6 ingredients. Stir. With a whisk, whip in the next 4 ingredients.Divide batter among 12 liners placed in muffin tin.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Bake 18-20 minutes or until done. Cool completely.In a medium-sized bowl, blend confectioners' sugar and enough milk to make a smooth glaze. Spoon 1 tablespoon of glaze over each cupcake and lightly spread.WEB:Pipe black gel in a spiral over the glaze. Starting in center of cupcake, drag toothpick through frosting to the edge of the cupcake. Repeat to create a web. Top with plastic spiders or gummy spider candies.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 76, u'instructions': u"Heat oven to 350F. In a bowl, combine first 6 ingredients. Stir. With a whisk, whip in the next 4 ingredients.Divide batter among 12 liners placed in muffin tin. Bake 18-20 minutes or until done. Cool completely.In a medium-sized bowl, blend confectioners' sugar and enough milk to make a smooth glaze. Spoon 1 tablespoon of glaze over each cupcake and lightly spread.WEB:Pipe black gel in a spiral over the glaze. Starting in center of cupcake, drag toothpick through frosting to the edge of the cupcake. Repeat to create a web. Top with plastic spiders or gummy spider candies.", u'spoonacularSourceUrl': u'https://spoonacular.com/spider-cupcakes-585787', u'dishTypes': [u'dessert'], u'occasions': [u'halloween'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 38, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}