{u'recipes': [{u'sourceName': u'Cookie Monster Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/490453-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 490453, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cornmeal Butter Cake', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 85.11, u'creditText': u'Cookie Monster Cooking', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'berries or sliced peaches', u'aisle': u'Produce', u'name': u'berries', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'servings'}, {u'originalString': u'caramel ice cream', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel ice cream topping', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19364, u'unit': u'servings'}, {u'originalString': u"1 cup confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'4 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'3 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'9 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 9.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'fresh whipped cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1054, u'unit': u'servings'}, {u'originalString': u'7 tablespoons white or yellow cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'yellow cornmeal', u'metaInformation': [u'white', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 35137, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://cookiemonstercooking.com/2013/08/16/cornmeal-butter-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Set a medium skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the butter to the pan.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the butter melt and then continue to cook, whisking frequently, until it begins to brown (this takes several minutes).  You should see brown bits on the bottom of the pan.  Once you see those bits, turn off the heat and continue to whisk constantly for about 30 seconds, until the butter is golden brown.  Be careful not to burn the butter - those bits can turn black quickly.**  Set the pan aside to cool.   In the bowl of a food processor, add the pecans, confectioners’ sugar and granulated sugar.  Pulse until the mixture is powdery.  In a large bowl, whisk together the flour, baking powder, cornmeal and salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the pecan mixture to the bowl and whisk to combine.  In a small bowl, whisk together the egg whites and vanilla.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add this mixture as well as the browned butter to the bowl with the flour and mix until incorporated.  Cover the bowl loosely and then refrigerate for at least 3 hours or up to overnight. Preheat the oven to 325 degrees.  Generously butter the sides of a 9-inch tart pan with a removable bottom.  Line the bottom of the pan with parchment paper (be sure to use parchment paper and not just grease the bottom) and then place the pan on a baking sheet.  Spoon the chilled batter into the prepared pan.  Use a spatula to smooth in the pan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for about 25 to 27 minutes, until a toothpick inserted into the middle comes out clean.  Allow the cake to cool for about 15 to 20 minutes, then remove to a wire rack to cool completely (be very careful when removing from the pan).Slice and serve with a scoop of ice cream or fresh whipped cream.  Top with berries or sliced peaches if desired.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'id': 1009054, u'name': u'berries'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Butter Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Set a medium skillet over medium heat.  Add the butter to the pan.  Let the butter melt and then continue to cook, whisking frequently, until it begins to brown (this takes several minutes).  You should see brown bits on the bottom of the pan.  Once you see those bits, turn off the heat and continue to whisk constantly for about 30 seconds, until the butter is golden brown.  Be careful not to burn the butter - those bits can turn black quickly.**  Set the pan aside to cool.   In the bowl of a food processor, add the pecans, confectioners’ sugar and granulated sugar.  Pulse until the mixture is powdery.  In a large bowl, whisk together the flour, baking powder, cornmeal and salt.  Add the pecan mixture to the bowl and whisk to combine.  In a small bowl, whisk together the egg whites and vanilla.  Add this mixture as well as the browned butter to the bowl with the flour and mix until incorporated.  Cover the bowl loosely and then refrigerate for at least 3 hours or up to overnight. Preheat the oven to 325 degrees.  Generously butter the sides of a 9-inch tart pan with a removable bottom.  Line the bottom of the pan with parchment paper (be sure to use parchment paper and not just grease the bottom) and then place the pan on a baking sheet.  Spoon the chilled batter into the prepared pan.  Use a spatula to smooth in the pan.  Bake for about 25 to 27 minutes, until a toothpick inserted into the middle comes out clean.  Allow the cake to cool for about 15 to 20 minutes, then remove to a wire rack to cool completely (be very careful when removing from the pan).Slice and serve with a scoop of ice cream or fresh whipped cream.  Top with berries or sliced peaches if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/cornmeal-butter-cake-490453', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}