{u'recipes': [{u'sourceName': u'Real Housemoms', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/799616-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 799616, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spinach Artichoke Scramble', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 229.99, u'creditText': u'Real Housemoms', u'extendedIngredients': [{u'originalString': u'1 cup chopped artichokes', u'aisle': u'Produce', u'name': u'artichokes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11007, u'unit': u'cup'}, {u'originalString': u'3 cups baby spinach leaves', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'1 TBSP butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'TBSP', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'TBSP'}, {u'originalString': u'6 egg whites (or three more whole eggs)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'whole', u'(or three more eggs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'4 oz feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1019, u'unit': u'oz'}, {u'originalString': u'1/4 tsp garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1062047, u'unit': u'tsp'}, {u'originalString': u'2 TBSPs half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'TBSPs', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1049, u'unit': u'TBSP'}, {u'originalString': u'1 cup mozzarella cheese', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1026, u'unit': u'cup'}, {u'originalString': u'6 whole eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://realhousemoms.com/spinach-artichoke-scramble/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spray a frying pan with cooking spray and place over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the spinach and cooking, staring frequently until it is completely wilted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the spinach (and any excess liquid).In a large bowl whisk the eggs and egg whites. Then whisk in the half an half and garlic salt.Return the skillet to medium heat and melt the butter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the eggs, and begin to scramble them.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add in the cheese, artichokes, and spinach. Continue cooking until the eggs are fully cooked. About five minutes.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'id': 11007, u'name': u'artichoke'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Scramble on the menu? Try pairing with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. One wine you could try is MYX Fusions Myxotica Moscato ( half-bottle). It has 4.5 out of 5 stars and a bottle costs about 12 dollars.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u"This limited edition Myxotica Moscato was released in promotion of Nicki Minaj's third album The Pink Print. A delicious passion fruit flavored moscato in a pink autographed bottle.", u'title': u'MYX Fusions Myxotica Moscato ( half-bottle)', u'price': u'$11.99', u'id': 439091, u'link': u'https://www.wine.com/product/myx-fusions-myxotica-moscato-375ml-half-bottle/140093', u'imageUrl': u'https://spoonacular.com/productImages/439091-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u'Spray a frying pan with cooking spray and place over medium heat. Add the spinach and cooking, staring frequently until it is completely wilted. Remove the spinach (and any excess liquid).In a large bowl whisk the eggs and egg whites. Then whisk in the half an half and garlic salt.Return the skillet to medium heat and melt the butter. Add the eggs, and begin to scramble them. Add in the cheese, artichokes, and spinach. Continue cooking until the eggs are fully cooked. About five minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-artichoke-scramble-799616', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}