{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'european', u'eastern european'], u'image': u'https://spoonacular.com/recipeImages/743477-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 743477, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beef Stroganoff', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 279.78, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 cups cooked barley, for serving', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'barley', u'metaInformation': [u'cooked', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20004, u'unit': u'cups'}, {u'originalString': u'8 ounces beef sirloin, cut into 2-by-1-by-1/8-inch strips', u'aisle': u'Meat', u'name': u'beef top sirloin steak', u'metaInformation': [u'cut into 2-by-1-by-1/8-inch strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/top-sirloin-steak.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 23584, u'unit': u'ounces'}, {u'originalString': u'12 ounces button mushrooms, quartered', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'2 cups beef broth, homemade or low-sodium canned', u'aisle': u'Canned and Jarred', u'name': u'canned beef broth', u'metaInformation': [u'low-sodium', u'homemade', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cups'}, {u'originalString': u'1 large carrot, peeled and sliced into 1/4-inch-thick coins', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'large', u'peeled', u'sliced into 1/4-inch-thick coins'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 teaspoons Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon chopped fresh flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'2 cups sliced hearty greens (like kale or mustard greens)', u'aisle': u'Produce', u'name': u'greens', u'metaInformation': [u'hearty', u'sliced', u'(like kale or mustard greens)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cups'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 teaspoons freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'4 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 medium parsnip, peeled and cut into 1/2-inch chunks', u'aisle': u'Produce', u'name': u'parsnip', u'metaInformation': [u'medium', u'peeled', u'cut into 1/2-inch chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'1/4 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 tablespoon tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoon'}, {u'originalString': u'1 medium yellow onion, thinly sliced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpeg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/beef-stroganoff.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium heat for 3 to 4 minutes. Raise the heat to high and heat 1 tablespoon oil. Season the beef with salt and pepper.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the beef to the skillet, arranging it in a single layer, and saute, without stirring, until well browned and still pinkish inside, 1 to 2 minutes. (It is key to only partially cook the meat at this stage, since it will finish cooking later in the sauce.)', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to a large plate and set aside. Discard any excess oil.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Return the skillet to medium-high heat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add 1 tablespoon of the oil and heat.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Add the mushrooms and cook, stirring occasionally, until well browned, about 7 minutes. Season with salt and pepper. Using a slotted spoon, transfer to the plate with the beef.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Heat another tablespoon of oil.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onions, carrots and parsnips and cook, stirring, until lightly caramelized, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the tomato paste and cook, stirring, until lightly browned, about 1 minute more.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the flour and cook, stirring, for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour in the beef broth and, whisking constantly, bring to a full boil. Reduce the heat, add the greens and simmer until the greens and veggies are crisp-tender, 5 to 10 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}]}, {u'equipment': [], u'step': u'Remove from the heat.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the sour cream, mustard and lemon juice and season with pepper to taste.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Add the beef and any juices, mushrooms and parsley to the sauce and reheat over medium heat just until hot. (Do not boil.)', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Toss the barley with the remaining 1 tablespoon olive oil and lots of freshly ground black pepper. Divide the cooked barley among 4 plates and top with the stroganoff.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'id': 20004, u'name': u'barley'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 16, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Nero D Avola, Primitivo, and Shiraz are great choices for Beef Stroganoff. For a creamy, mushroomy beef stroganoff, you'll want a bold red to match. You could try Colosi Nero d'Avola. Reviewers quite like it with a 4.7 out of 5 star rating and a price of about 12 dollars per bottle.", u'pairedWines': [u'nero d avola', u'primitivo', u'shiraz'], u'productMatches': [{u'description': u'Color is intense ruby red. Intense blackberry aromas and a fresh and tannic palate.Its fresh flavors and well-balanced tannins make it the ideal accompaniment for red meats and game.', u'title': u"Colosi Nero d'Avola", u'price': u'$11.99', u'id': 443995, u'link': u'https://www.wine.com/product/colosi-nero-davola-2008/103130', u'imageUrl': u'https://spoonacular.com/productImages/443995-312x231.jpg'}]}, u'aggregateLikes': 111, u'instructions': u'Heat a large skillet over medium heat for 3 to 4 minutes. Raise the heat to high and heat 1 tablespoon oil. Season the beef with salt and pepper. Add the beef to the skillet, arranging it in a single layer, and saute, without stirring, until well browned and still pinkish inside, 1 to 2 minutes. (It is key to only partially cook the meat at this stage, since it will finish cooking later in the sauce.) Transfer to a large plate and set aside. Discard any excess oil.                          Return the skillet to medium-high heat. Add 1 tablespoon of the oil and heat. Add the mushrooms and cook, stirring occasionally, until well browned, about 7 minutes. Season with salt and pepper. Using a slotted spoon, transfer to the plate with the beef.                          Heat another tablespoon of oil. Add the onions, carrots and parsnips and cook, stirring, until lightly caramelized, about 5 minutes. Add the tomato paste and cook, stirring, until lightly browned, about 1 minute more. Whisk in the flour and cook, stirring, for 1 minute. Pour in the beef broth and, whisking constantly, bring to a full boil. Reduce the heat, add the greens and simmer until the greens and veggies are crisp-tender, 5 to 10 minutes. Remove from the heat.                          Whisk in the sour cream, mustard and lemon juice and season with pepper to taste. Add the beef and any juices, mushrooms and parsley to the sauce and reheat over medium heat just until hot. (Do not boil.)                          Toss the barley with the remaining 1 tablespoon olive oil and lots of freshly ground black pepper. Divide the cooked barley among 4 plates and top with the stroganoff. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/beef-stroganoff-743477', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}