{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479655-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 479655, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey, Avocado, and Sprout Sandwich', u'diets': [], u'preparationMinutes': 6, u'pricePerServing': 151.86, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'\xbd cup alfalfa sprouts', u'aisle': u'Produce', u'name': u'alfalfa sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10111001, u'unit': u'cup'}, {u'originalString': u'1 avocado, sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'Miracle Whip (about 1 Tablespoon for each sandwich)', u'aisle': u'Condiments', u'name': u'miracle whip', u'metaInformation': [u'for each sandwich)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4014, u'unit': u'Tablespoon'}, {u'originalString': u'4 slices whole grain bread', u'aisle': u'Bakery/Bread', u'name': u'multi-grain bread', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18075, u'unit': u'slices'}, {u'originalString': u'Mustard (about a teaspoon for each sandwich)', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [u'for each sandwich)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'teaspoon'}, {u'originalString': u'Pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 slices swiss cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 1040, u'unit': u'slices'}, {u'originalString': u'4 thick slices turkey breast', u'aisle': u'Meat', u'name': u'turkey breast', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-breast.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 5696, u'unit': u'slices'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.neighborfoodblog.com/2012/11/turkey-avocado-and-sprout-sandwich.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Set two plates out and place two slices of bread on each one. On each plate, layer a slice of bread with half the turkey, a slice of swiss cheese, then half the avocado slices. Sprinkle with salt and pepper. Lay half the alfalfa sprouts on top.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'id': 10111001, u'name': u'alfalfa sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-slices.jpg', u'id': 1019037, u'name': u'avocado slices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'id': 1040, u'name': u'swiss cheese'}]}, {u'equipment': [], u'step': u'Spread the Miracle Whip and mustard evenly between the two remaining slices of bread.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise', u'id': 4014, u'name': u'miracle whip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [], u'step': u'Place the bread, spread side down into the sprouts.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'id': 11001, u'name': u'sprouts'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 129, u'instructions': u'Set two plates out and place two slices of bread on each one. On each plate, layer a slice of bread with half the turkey, a slice of swiss cheese, then half the avocado slices. Sprinkle with salt and pepper. Lay half the alfalfa sprouts on top.Spread the Miracle Whip and mustard evenly between the two remaining slices of bread. Place the bread, spread side down into the sprouts. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-avocado-and-sprout-sandwich-479655', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 6, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}