{u'recipes': [{u'sourceName': u'Life as a Strawberry', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/532965-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532965, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mushroom Ravioli', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 12.07, u'creditText': u'Life as a Strawberry', u'extendedIngredients': [{u'originalString': u'5 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 Tbsp. extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tbsp'}, {u'originalString': u'4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 Tbsp. chopped fresh parsley, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'2 sprigs fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'1 clove garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 lb. white button or baby portobello mushrooms, sliced', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'white', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'lb'}, {u'originalString': u'1/2 cup ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1036, u'unit': u'cup'}, {u'originalString': u'2 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 50.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 Tbsp. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp. yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u'Tbsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.lifeasastrawberry.com/mushroom-ravioli/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place the flour and salt in a large mixing bowl. Use your hands to form a well in the center of the flour.In a small, separate bowl, whisk together eggs and olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add this mixture to the well you made in the flour.Use your hands to mix ingredients together until well incorporated. The mixture should hold together but not be sticky. If the mixture is too dry, add water 1 Tbsp. at a time and mix to combine. When dough holds together and doesn’t stick to your hands, it’s ready.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let it rest for 15 minutes before you roll it out. You can also refrigerate it overnight and roll it out the next day.Break pieces of dough off in 1/2 cup increments and run them through a pasta roller (I use this one. If you don’t have a pasta roller, you can also roll the dough by hand until it is about 1-2 mm thick). If you’re using a pasta roller, start by rolling the dough through on the #1 (lowest) setting.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the dough through the next 3-4 settings until it is very thin (I usually stop rolling at a #4 or 5 setting).To form the raviolis, lay one sheet of pasta down on a flat surface. You can either use a ravioli press (that’s what I prefer, it makes them all very uniform in size), a ravioli cutter, or fill and fold them by hand. To fill and fold by hand, cut the dough into squares, place filling in the center of the square, and fold the edges over to make a triangle. With a ravioli cutter, place a little less than 1 tsp. of filling on the flat sheet of dough, repeating every 2 inches or so. Lay another sheet over the filling-covered sheet, and press down in between the fillings to hold dough together.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut around each filling with a ravioli cutter (you can also use a cookie or biscuit cutter). If using a ravioli press, follow package directions to form ravioli.Cook ravioli in boiling water for 7-8 minutes. Top with mushroom cream sauce and parsley.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Serve immediately.In a large skillet, heat olive oil over medium-high heat.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add garlic, onion, thyme, salt, and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Saute 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add sliced mushrooms.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Saute an additional 3 minutes or until onion is translucent and mushrooms have cooked through.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Remove mixture from heat and let cool.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Mix ricotta cheese into cooled mushroom mixture. Fill each ravioli with about 2/3 of a tsp. of the mixture. (see ravioli filling directions in step 5 above).Cover ravioli to chill overnight or freeze for later, or cook immediately. Cook in boiling water for 7-8 minutes or until pasta is cooked through. Top with mushroom cream sauce and parsley.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 13, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Ravioli works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Felsina Chianti Colli Senesi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 21 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 195, u'instructions': u'Place the flour and salt in a large mixing bowl. Use your hands to form a well in the center of the flour.In a small, separate bowl, whisk together eggs and olive oil. Add this mixture to the well you made in the flour.Use your hands to mix ingredients together until well incorporated. The mixture should hold together but not be sticky. If the mixture is too dry, add water 1 Tbsp. at a time and mix to combine. When dough holds together and doesn’t stick to your hands, it’s ready. Let it rest for 15 minutes before you roll it out. You can also refrigerate it overnight and roll it out the next day.Break pieces of dough off in 1/2 cup increments and run them through a pasta roller (I use this one. If you don’t have a pasta roller, you can also roll the dough by hand until it is about 1-2 mm thick). If you’re using a pasta roller, start by rolling the dough through on the #1 (lowest) setting. Roll the dough through the next 3-4 settings until it is very thin (I usually stop rolling at a #4 or 5 setting).To form the raviolis, lay one sheet of pasta down on a flat surface. You can either use a ravioli press (that’s what I prefer, it makes them all very uniform in size), a ravioli cutter, or fill and fold them by hand. To fill and fold by hand, cut the dough into squares, place filling in the center of the square, and fold the edges over to make a triangle. With a ravioli cutter, place a little less than 1 tsp. of filling on the flat sheet of dough, repeating every 2 inches or so. Lay another sheet over the filling-covered sheet, and press down in between the fillings to hold dough together. Cut around each filling with a ravioli cutter (you can also use a cookie or biscuit cutter). If using a ravioli press, follow package directions to form ravioli.Cook ravioli in boiling water for 7-8 minutes. Top with mushroom cream sauce and parsley. Serve immediately.In a large skillet, heat olive oil over medium-high heat. Add garlic, onion, thyme, salt, and pepper. Saute 2 minutes.Add sliced mushrooms. Saute an additional 3 minutes or until onion is translucent and mushrooms have cooked through. Remove mixture from heat and let cool.Mix ricotta cheese into cooled mushroom mixture. Fill each ravioli with about 2/3 of a tsp. of the mixture. (see ravioli filling directions in step 5 above).Cover ravioli to chill overnight or freeze for later, or cook immediately. Cook in boiling water for 7-8 minutes or until pasta is cooked through. Top with mushroom cream sauce and parsley. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-ravioli-532965', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 50, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}