{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/792341-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 792341, u'veryPopular': False, u'lowFodmap': False, u'title': u'Magic Bars', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 55.17, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1 cup (185 g) butterscotch chips', u'aisle': u'Baking', u'name': u'butterscotch chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 185.0, u'consistency': u'solid', u'id': 19070, u'unit': u'g'}, {u'originalString': u'2 cups (225 g) graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'g'}, {u'originalString': u'1 cup (115 g) chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 115.0, u'consistency': u'solid', u'id': 12142, u'unit': u'g'}, {u'originalString': u'1 teaspoon flaky sea salt (like Maldon), optional', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'(like Maldon)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup (185 g) semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 185.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'g'}, {u'originalString': u'14 ounces (396 g / 1 can) sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'(396 g / 1 can)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounces'}, {u'originalString': u'1 cup (105 g) shredded sweetened coconut', u'aisle': u'Baking', u'name': u'sweetened shredded coconut', u'metaInformation': [u'shredded', u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 105.0, u'consistency': u'solid', u'id': 12179, u'unit': u'g'}, {u'originalString': u'1/2 cup (115 g / 1 stick) melted unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'(115 g / 1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/magic_bars/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the graham cracker crumbs and the melted butter in a bowl. Toss with a fork until the crumbs are moist and hold together when squeezed with your hand.Dump the crumbs in the middle of the pan and then press them into an even layer with your fingers or the back of a flat-bottomed cup. 3', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}, {u'equipment': [], u'step': u'Pour the sweetened condensed milk over the graham cracker crust.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread to edges of the pan with a spatula.4 Layer on the rest of the toppings:In this order, sprinkle the chocolate chips, butterscotch chips, pecans, and then sweetened coconut over the top of the condensed milk.Gently press the ingredients down with your palm so they stick to the condensed milk.5', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'id': 19070, u'name': u'butterscotch chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the oven for 30 to 35 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake until the edges of the bars turn golden-brown and start to pull away slightly from the sides of the pan.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the oven and sprinkle with the sea salt (if using).6 Cool completely before lifting the bars out of the pan using the parchment paper.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Cut into 24 pieces and store in an airtight container with wax paper or parchment paper between layers. The flavor of the bars is even betterthe day after baking. Bars stored at room temperature will be fairly soft and are best eaten within 3 to 5 days. For firm and chewy bars, store in the fridge for up to a week.', u'number': 7, u'ingredients': []}], u'name': u'1 Preheat oven to 350F. Spray a 9 x 13-inch baking pan with cooking oil then line it with parchment paper.2 Make the graham cracker crust'}], u'winePairing': {u'pairingText': u'Southern on the menu? Try pairing with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Chateau Ste. Michelle Dry Riesling. It has 4.5 out of 5 stars and a bottle costs about 10 dollars.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Chateau Ste. Michelle Dry Riesling is a dry, crisp, refreshing style of Riesling with beautiful fruit flavors, crisp acidity and an elegant finish. It offers inviting floral and mandarin aromas with a clean finish. This is an incredibly versatile food wine and my favorite with oysters.', u'title': u'Chateau Ste. Michelle Dry Riesling', u'price': u'$9.99', u'id': 443227, u'link': u'https://www.wine.com/product/chateau-ste-michelle-dry-riesling-2012/125428', u'imageUrl': u'https://spoonacular.com/productImages/443227-312x231.jpg'}]}, u'aggregateLikes': 166, u'instructions': u'1 Preheat oven to 350F. Spray a 9 x 13-inch baking pan with cooking oil then line it with parchment paper.2 Make the graham cracker crust: Place the graham cracker crumbs and the melted butter in a bowl. Toss with a fork until the crumbs are moist and hold together when squeezed with your hand.Dump the crumbs in the middle of the pan and then press them into an even layer with your fingers or the back of a flat-bottomed cup. 3 Pour the sweetened condensed milk over the graham cracker crust. Spread to edges of the pan with a spatula.4 Layer on the rest of the toppings:In this order, sprinkle the chocolate chips, butterscotch chips, pecans, and then sweetened coconut over the top of the condensed milk.Gently press the ingredients down with your palm so they stick to the condensed milk.5 Bake in the oven for 30 to 35 minutes.Bake until the edges of the bars turn golden-brown and start to pull away slightly from the sides of the pan. Remove from the oven and sprinkle with the sea salt (if using).6 Cool completely before lifting the bars out of the pan using the parchment paper. Cut into 24 pieces and store in an airtight container with wax paper or parchment paper between layers. The flavor of the bars is even betterthe day after baking. Bars stored at room temperature will be fairly soft and are best eaten within 3 to 5 days. For firm and chewy bars, store in the fridge for up to a week.', u'spoonacularSourceUrl': u'https://spoonacular.com/magic-bars-792341', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}