{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/366253-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 366253, u'veryPopular': True, u'lowFodmap': False, u'title': u'Corn Pudding', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 77.0, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 can (14-3/4 ounces) cream-style corn', u'aisle': u'Canned and Jarred', u'name': u'canned corn', u'metaInformation': [u'cream-style', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 11177, u'unit': u'ounces'}, {u'originalString': u'1 package (8-1/2 ounces) corn bread/muffin mix', u'aisle': u'Baking', u'name': u'corn bread mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornbread.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 18022, u'unit': u'ounces'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 cup (8 ounces) sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1056, u'unit': u'ounces'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 can (15-1/4 ounces) whole kernel corn, drained', u'aisle': u'Produce', u'name': u'whole kernel corn', u'metaInformation': [u'whole', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11172, u'unit': u'ounces'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/corn-pudding', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 325\xb0. In a large bowl, cream butter and sugar until light and fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add eggs, one at a time, beating well after each addition. Beat in sour cream. Gradually add muffin mix alternately with milk. Fold in corn.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour into a greased 3-qt. baking dish.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake, uncovered, 45-50 minutes or until set and lightly browned.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 519, u'instructions': u'Directions                                                                                Preheat oven to 325\xb0. In a large bowl, cream butter and sugar until light and fluffy. Add eggs, one at a time, beating well after each addition. Beat in sour cream. Gradually add muffin mix alternately with milk. Fold in corn.                                                                                            Pour into a greased 3-qt. baking dish. Bake, uncovered, 45-50 minutes or until set and lightly browned.                                        Yield: 8 servings.                                                                                                                         Originally published as Corn Pudding in  Taste of HomeApril/May 2006, p35                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (3/4 cup) equals 435 calories, 22 g fat (12 g saturated fat), 112 mg cholesterol, 700 mg sodium, 52 g carbohydrate, 2 g fiber, 7 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/corn-pudding-366253', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}