{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/493521-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 493521, u'veryPopular': False, u'lowFodmap': False, u'title': u'Brussels Sprouts With Fried Chicken Liver', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 107.54, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'1/2 cup plain breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 pound brussels sprouts, trimmed and halved', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'trimmed', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11098, u'unit': u'pound'}, {u'originalString': u'2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'2 large chicken livers, rinsed and patted dry', u'aisle': u'Meat', u'name': u'chicken livers', u'metaInformation': [u'dry', u'large', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-liver.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5027, u'unit': u''}, {u'originalString': u'1 large egg, beaten with 1 tablespoon of water', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'with 1 tablespoon of water', u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon turbinado sugar', u'aisle': u'Health Foods;Baking', u'name': u'turbinado sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19908, u'unit': u'teaspoon'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.foodrepublic.com/2012/03/30/brussels-sprouts-fried-chicken-liver', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Season chicken livers with salt and pepper, dip in egg wash, then roll thoroughly in bread crumbs.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-liver.jpg', u'id': 5027, u'name': u'chicken liver'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the canola oil in a medium, heavy-bottomed skillet over medium-high heat, then fry the chicken livers for about 3 minutes on each side, or until golden brown.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-liver.jpg', u'id': 5027, u'name': u'chicken liver'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels and set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a large pan over medium-high heat and saute the brussels sprouts for 8-10 minutes, or until browned on the surface.\xa0', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add sugar and vinegar to pan, toss to coat thoroughly and lower heat', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Chop fried chicken livers into small cubes and add to pan. Toss to combine, taste for salt and pepper and continue to cook on low heat until brussels sprouts are cooked through (but still crisp), about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-liver.jpg', u'id': 5027, u'name': u'chicken liver'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Riesling, Sparkling Wine, and Zinfandel are great choices for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Columbia Winery Cellarmaster's Riesling. It has 4.7 out of 5 stars and a bottle costs about 12 dollars.", u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 190, u'instructions': u'Directions:\xa0                                    Season chicken livers with salt and pepper, dip in egg wash, then roll thoroughly in bread crumbs.Heat the canola oil in a medium, heavy-bottomed skillet over medium-high heat, then fry the chicken livers for about 3 minutes on each side, or until golden brown. Drain on paper towels and set aside.Heat the olive oil in a large pan over medium-high heat and saute the brussels sprouts for 8-10 minutes, or until browned on the surface.\xa0Add sugar and vinegar to pan, toss to coat thoroughly and lower heatChop fried chicken livers into small cubes and add to pan. Toss to combine, taste for salt and pepper and continue to cook on low heat until brussels sprouts are cooked through (but still crisp), about 5 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/brussels-sprouts-with-fried-chicken-liver-493521', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}