{u'recipes': [{u'sourceName': u'Baked by Rachel', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/613382-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 613382, u'veryPopular': True, u'lowFodmap': False, u'title': u'Square Pastel Layer Cake', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 141.13, u'creditText': u'Baked by Rachel', u'extendedIngredients': [{u'originalString': u'Square baking pan', u'aisle': u'Baking', u'name': u'baking mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'Square', u'unitShort': u'Square', u'amount': 1.0, u'consistency': u'solid', u'id': 18010, u'unit': u'Square'}, {u'originalString': u'McCormick neon food color', u'aisle': u'Baking', u'name': u'food color', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'6C powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 19336, u'unit': u'C'}, {u'originalString': u'1M piping tip', u'aisle': u'Meat', u'name': u'rib tip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-ribs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 98937, u'unit': u'servings'}, {u'originalString': u'1 1/4C unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 1145, u'unit': u'C'}, {u'originalString': u'McCormick extra rich pure vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'servings'}, {u'originalString': u'4 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 1/4C vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 4615, u'unit': u'C'}, {u'originalString': u'2 boxes white cake mix', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'boxes', u'unitShort': u'boxes', u'amount': 2.0, u'consistency': u'solid', u'id': 18137, u'unit': u'boxes'}, {u'originalString': u'Bench scraper', u'aisle': u'?', u'name': u'bench scraper', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'Large offset spatula', u'aisle': u'?', u'name': u'offset spatula', u'metaInformation': [u'large'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'Small offset spatula', u'aisle': u'?', u'name': u'offset spatula', u'metaInformation': [u'small'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'unit': u'servings'}, {u'originalString': u'Piping bags', u'aisle': u'?', u'name': u'piping', u'metaInformation': [], u'unitLong': u'bag', u'unitShort': u'bags', u'amount': 1.0, u'unit': u'bags'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.bakedbyrachel.com/square-pastel-layer-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 53, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Cut 6 pieces of parchment paper to fit the bottom of your square baking pan. In a large bowl, mix box cake mix according to manufacturer's directions.", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in 1/2 tsp extra rich pure vanilla per 1 box cake mix. Divide batter between clean bowls, measuring out 1 and 1/4 cup batter per bowl. Tint each bowl according to chart below. Cake tint chart:Pink layer: 3 drops pink', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'pure vanilla extract'}]}, {u'equipment': [], u'step': u'Blue layer: 3 drops blue', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Green layer: 3 drops green, 1 drop blue', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Orange layer: 4 drops green, 2 drops pink', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Purple: 3 drops purple', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'White: none', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Lightly grease pan (or multiple pans) with baking spray, insert parchment paper, lightly spray parchment paper with baking spray.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add one color to a prepared pan, spreading out evenly into all corners. Use a small offset spatula to level out the batter.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake for 17-18 minutes. Cool for several minutes before carefully transferring to a wire rack to cool completely. Repeat process with remaining batter. Once fully cooled, using a sharp knife, carefully level off tops of cakes. Keeping parchment paper in place, stack cake layers and wrap with plastic wrap. Chill overnight. When ready to frost, prepare buttercream. In the bowl of a stand mixer, beat butter and shortening until light and fluffy.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Mix in vanilla extract, followed by 1 cup of powdered sugar at a time. Beat on medium-high speed until light and fluffy. To frost cake:Choose the base layer of your cake, add strips of wax paper under each side.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Add a large dollop of frosting to the cake, smooth our with a small offset spatula.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Add another cake layer and frosting. Repeat method until all layers have been added. Top off with additional frosting. Coat cake with frosting, filling in gaps and sealing in crumbs.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to refrigerator for 1-2 hours. Cover remaining frosting until ready to proceed.', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-scraper.jpg', u'id': 404649, u'name': u'dough scraper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Add additional frosting to top and sides of cake, smoothing out with an offset spatula and/or bench scraper. If roses are desired, add frosting to a piping bag fit with a 1M tip. Pipe roses around the top edge of the cake. Chill if desired or serve immediately. To slice cake:Using a sharp knife, cut cake in half width wise.', u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Cut slices length wise into desired thickness. Remaining cake may be stored at room temperature or chilled.', u'number': 17, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1654, u'instructions': u"Preheat oven to 350F. Cut 6 pieces of parchment paper to fit the bottom of your square baking pan. In a large bowl, mix box cake mix according to manufacturer's directions. Mix in 1/2 tsp extra rich pure vanilla per 1 box cake mix. Divide batter between clean bowls, measuring out 1 and 1/4 cup batter per bowl. Tint each bowl according to chart below. Cake tint chart:Pink layer: 3 drops pinkBlue layer: 3 drops blueGreen layer: 3 drops green, 1 drop blueOrange layer: 4 drops green, 2 drops pinkPurple: 3 drops purpleWhite: noneLightly grease pan (or multiple pans) with baking spray, insert parchment paper, lightly spray parchment paper with baking spray. Add one color to a prepared pan, spreading out evenly into all corners. Use a small offset spatula to level out the batter. Bake for 17-18 minutes. Cool for several minutes before carefully transferring to a wire rack to cool completely. Repeat process with remaining batter. Once fully cooled, using a sharp knife, carefully level off tops of cakes. Keeping parchment paper in place, stack cake layers and wrap with plastic wrap. Chill overnight. When ready to frost, prepare buttercream. In the bowl of a stand mixer, beat butter and shortening until light and fluffy. Mix in vanilla extract, followed by 1 cup of powdered sugar at a time. Beat on medium-high speed until light and fluffy. To frost cake:Choose the base layer of your cake, add strips of wax paper under each side. Add a large dollop of frosting to the cake, smooth our with a small offset spatula. Add another cake layer and frosting. Repeat method until all layers have been added. Top off with additional frosting. Coat cake with frosting, filling in gaps and sealing in crumbs. Transfer to refrigerator for 1-2 hours. Cover remaining frosting until ready to proceed. Add additional frosting to top and sides of cake, smoothing out with an offset spatula and/or bench scraper. If roses are desired, add frosting to a piping bag fit with a 1M tip. Pipe roses around the top edge of the cake. Chill if desired or serve immediately. To slice cake:Using a sharp knife, cut cake in half width wise. Cut slices length wise into desired thickness. Remaining cake may be stored at room temperature or chilled.", u'spoonacularSourceUrl': u'https://spoonacular.com/square-pastel-layer-cake-613382', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 33, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}