{u'recipes': [{u'sourceName': u'A Healthy Life for Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/826189-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 24, u'id': 826189, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skillet Chicken Artichoke Spinach', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 345.51, u'creditText': u'A Healthy Life for Me', u'extendedIngredients': [{u'originalString': u'5 ounces artichoke in oil, drained and roughly chopped into 1” pieces', u'aisle': u'Produce', u'name': u'artichoke', u'metaInformation': [u'drained', u'roughly chopped', u'in oil'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichokes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11007, u'unit': u'ounces'}, {u'originalString': u'1 lb boneless skinless chicken tenders', u'aisle': u'Meat', u'name': u'chicken tenders', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1015062, u'unit': u'lb'}, {u'originalString': u'\xbc cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'4.5 ounces goat cheese, crumbled', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.5, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'\xbc teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon dried Italian Seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'dried', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup low sodium chicken stock', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken stock', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1006970, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4-5 cups fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://ahealthylifeforme.com/skillet-chicken-artichoke-spinach/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Season chicken on both sides with salt, pepper, and Italian seasoning.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil and butter in a large heavy skillet {I used cast iron} over medium-high heat and sear chicken about 2 minutes on each side, or until golden. Lower heat to medium-low, add white wine, and chicken stock, use a wooden spoon to scrape the bottom of the pan knocking loose and brown bits. Cover pan and cook chicken fro 15 minutes, or until internal temperature is 165.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the artichoke hearts and spinach to chicken. Stir until spinach starts to wilt. You can cover pan if the spinach wont wilt.Once spinach wilts, top with goat cheese, remove from heat and serve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Downton Abbey Countess of Grantham Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'citrus , fruity , pineapple', u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 159, u'instructions': u'Season chicken on both sides with salt, pepper, and Italian seasoning.Heat olive oil and butter in a large heavy skillet {I used cast iron} over medium-high heat and sear chicken about 2 minutes on each side, or until golden. Lower heat to medium-low, add white wine, and chicken stock, use a wooden spoon to scrape the bottom of the pan knocking loose and brown bits. Cover pan and cook chicken fro 15 minutes, or until internal temperature is 165.Add the artichoke hearts and spinach to chicken. Stir until spinach starts to wilt. You can cover pan if the spinach wont wilt.Once spinach wilts, top with goat cheese, remove from heat and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/skillet-chicken-artichoke-spinach-826189', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 29, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}