{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/690356-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 690356, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Orange Granola Bars', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 70.09, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'⅔ cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup honey or maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1 teaspoon orange zest, preferably organic (from 1 large orange)', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'organic', u'large', u'(from 1 orange)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoon'}, {u'originalString': u'1 cup creamy unsalted almond butter or peanut butter, packed', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [u'unsalted', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'1 cup pecan pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'pecan pieces', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10012142, u'unit': u'cup'}, {u'originalString': u'1/3 cup pepitas', u'aisle': u'Savory Snacks', u'name': u'pepitas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10012014, u'unit': u'cup'}, {u'originalString': u'1\xbe cups quick-cooking oats (or old-fashioned oats, pulsed briefly in a food processor or blender to break them up)', u'aisle': u'Cereal', u'name': u'quick cooking oats', u'metaInformation': [u'(or old-fashioned oats, pulsed briefly in a food processor or blender to break them up)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 8402, u'unit': u'cups'}, {u'originalString': u'\xbd to \xbe teaspoon salt, to taste (decrease if your almond/peanut butter is salted)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'salted', u'to taste', u'(decrease if your almond/peanut butter is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u''}, {u'originalString': u'1\xbd teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://cookieandkate.com/2015/cranberry-orange-granola-bars/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line a 9-inch square baker with two strips of criss-crossed parchment paper, cut to fit neatly against the base and up the sides. The parchment paper will make it easy for you to slice the bars later.In a medium skillet over medium heat, toast the pecans and pepitas, stirring often, until they are fragrant and the pepitas are starting to make little popping noises, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 10012014, u'name': u'raw pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Transfer the toasted pecans and pepitas to a food processor.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 10012014, u'name': u'raw pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add the cranberries and then run the machine for about 10 seconds, until the nuts and cranberries are all broken up. (If you skip the food processor step, your bars will be more difficult to slice through and more likely to crumble at the edges.)In a mixing bowl, combine the contents of the food processor with the oats, orange zest, cinnamon and salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to combine.In a smaller mixing bowl, whisk together the almond butter, honey and vanilla extract until well blended.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}]}, {u'equipment': [], u'step': u'Pour the liquid ingredients into the dry ingredients. Use a big spoon to mix them together until the two are evenly combined and no dry oats remain. This takes some arm muscles, but you can do it!', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Transfer the mixture to the prepared square baker. Use your spoon to arrange the mixture fairly evenly in the baker, then use the bottom of a flat, round surface (like a short, sturdy drinking glass), covered in a small piece of parchment paper, to pack the mixture down as firmly and evenly as possible.Cover the baker and refrigerate for at least one hour, or overnight. When youre ready to slice, lift the bars out of the baker by grabbing both pieces of parchment paper on opposite corners. Use a sharp knife to slice the bars into 1 strips, then slice them in half through the middle.For portability, you can wrap individual bars in plastic wrap or parchment paper. Bars keep well for a couple of days at room temperature, but I recommend storing individually wrapped bars in a freezer-safe bag in the freezer for best flavor.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 92, u'instructions': u'Line a 9-inch square baker with two strips of criss-crossed parchment paper, cut to fit neatly against the base and up the sides. The parchment paper will make it easy for you to slice the bars later.In a medium skillet over medium heat, toast the pecans and pepitas, stirring often, until they are fragrant and the pepitas are starting to make little popping noises, about 5 minutes. Transfer the toasted pecans and pepitas to a food processor. Add the cranberries and then run the machine for about 10 seconds, until the nuts and cranberries are all broken up. (If you skip the food processor step, your bars will be more difficult to slice through and more likely to crumble at the edges.)In a mixing bowl, combine the contents of the food processor with the oats, orange zest, cinnamon and salt. Whisk to combine.In a smaller mixing bowl, whisk together the almond butter, honey and vanilla extract until well blended.Pour the liquid ingredients into the dry ingredients. Use a big spoon to mix them together until the two are evenly combined and no dry oats remain. This takes some arm muscles, but you can do it!Transfer the mixture to the prepared square baker. Use your spoon to arrange the mixture fairly evenly in the baker, then use the bottom of a flat, round surface (like a short, sturdy drinking glass), covered in a small piece of parchment paper, to pack the mixture down as firmly and evenly as possible.Cover the baker and refrigerate for at least one hour, or overnight. When youre ready to slice, lift the bars out of the baker by grabbing both pieces of parchment paper on opposite corners. Use a sharp knife to slice the bars into 1 strips, then slice them in half through the middle.For portability, you can wrap individual bars in plastic wrap or parchment paper. Bars keep well for a couple of days at room temperature, but I recommend storing individually wrapped bars in a freezer-safe bag in the freezer for best flavor.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-orange-granola-bars-690356', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}