{u'recipes': [{u'sourceName': u'Just as Delish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497829-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 497829, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spiced Chocolate Almond Butter', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 151.86, u'creditText': u'Just as Delish', u'extendedIngredients': [{u'originalString': u'2 cups Raw Almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cups'}, {u'originalString': u'Pinch of each - Ground Cumin, Ground Cardamon and Chili Powder', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'pinch'}, {u'originalString': u"1 teaspoon Unsweetened Chocolate Powder (I use Hershey's)", u'aisle': u'Beverages', u'name': u'hot chocolate powder', u'metaInformation': [u'unsweetened', u"(I use Hershey's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14197, u'unit': u'teaspoon'}, {u'originalString': u'\xbd tablespoon Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoon Raw Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'raw honey', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'Sea salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.justasdelish.com/2011/10/spiced-chocolate-almond-butter/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Put raw almonds in the food processor. Run the processor until they become small chunks. If you like chunky nuts in your butter, put aside 1-2 tablespoon of the chunky nuts.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [], u'step': u'Add the rest of the ingredients and pulse until it start to turn sticky. Taste the almond paste to see if you want more salt, honey, or cinnamon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Transfer to a jar and close tightly. The texture is best for spreading at room temperature, but keep in the fridge if you're not going to consume it right away or if the weather is very warm.", u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 8, u'instructions': u"Put raw almonds in the food processor. Run the processor until they become small chunks. If you like chunky nuts in your butter, put aside 1-2 tablespoon of the chunky nuts.Add the rest of the ingredients and pulse until it start to turn sticky. Taste the almond paste to see if you want more salt, honey, or cinnamon.   Transfer to a jar and close tightly. The texture is best for spreading at room temperature, but keep in the fridge if you're not going to consume it right away or if the weather is very warm.", u'spoonacularSourceUrl': u'https://spoonacular.com/spiced-chocolate-almond-butter-497829', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}