{u'recipes': [{u'sourceName': u'Bobbis Kozy Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/628236-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 510, u'id': 628236, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Chicken Noodle Soup', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 110.92, u'creditText': u'Bobbis Kozy Kitchen', u'extendedIngredients': [{u'originalString': u'3 carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'3 ribs of celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'ribs', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u'ribs'}, {u'originalString': u'2 quarts chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'quarts'}, {u'originalString': u'1 (12-ounce) package frozen homestyle egg noodles', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 20409, u'unit': u'ounce'}, {u'originalString': u'1 handful fresh parsley leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Fresh cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 tablespoon dried poultry seasoning', u'aisle': u'Spices and Seasonings', u'name': u'poultry seasoning', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2034, u'unit': u'tablespoon'}, {u'originalString': u'2 large boneless skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.bobbiskozykitchen.com/2015/01/slow-cooker-chicken-noodle-soup.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place all ingredients except egg noodles in a slow cooker. Cover and cook on high for 3 to 4 hours, or low for 6 to 8 hours.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 20409, u'name': u'egg noodles'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 93, u'instructions': u'Place all ingredients except egg noodles in a slow cooker. Cover and cook on high for 3 to 4 hours, or low for 6 to 8 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-chicken-noodle-soup-628236', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 520, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}