{u'recipes': [{u'sourceName': u'Clean and Delicious', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/521491-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 521491, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oat & Berry Protein Shake', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 158.27, u'creditText': u'Clean and Delicious', u'extendedIngredients': [{u'originalString': u'\xbd banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 cup frozen mixed berries', u'aisle': u'Produce', u'name': u'berries', u'metaInformation': [u'mixed', u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'cup'}, {u'originalString': u'Dash of cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Dash'}, {u'originalString': u'1 tbsp ground flax seeds', u'aisle': u'Health Foods;Baking', u'name': u'ground flax seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tbsp'}, {u'originalString': u'2 ice cubes', u'aisle': u'Frozen', u'name': u'ice cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10014412, u'unit': u''}, {u'originalString': u'1/3 cup dry rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'\xbd cup skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1 scoop vanilla protein powder (I used Jay Robb)', u'aisle': u'Health Foods', u'name': u'vanilla protein powder', u'metaInformation': [u'(I used Jay Robb)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'solid', u'id': 99076, u'unit': u'scoop'}, {u'originalString': u'\xbd cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://cleananddelicious.com/2011/01/10/oat_and_berry_protein_shake_1/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all of the ingredients into the blender and blend for 45 seconds or until thick and creamy.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into your glass and enjoy!', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serves one or two.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Zinfandel, Riesling, and Sparkling Wine are great choices for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. One wine you could try is Rombauer California Zinfandel. It has 4.6 out of 5 stars and a bottle costs about 30 dollars.', u'pairedWines': [u'zinfandel', u'riesling', u'sparkling wine'], u'productMatches': [{u'description': u'Opening with a burst, this wine boasts aromas of blackberry and boysenberry jam. On the palate, rich, juicy fruit loaded with ripe wild berries, plum, fig and black cherry flavors. Supple tannins and smooth oak notes show in the lush, mouth-filling finish. Our favorite pairings for this wine include braised short ribs over wild mushroom risotto, pizza, and pork tenderloin. View More', u'title': u'Rombauer California Zinfandel', u'price': u'$29.99', u'id': 440433, u'link': u'https://www.wine.com/product/rombauer-california-zinfandel-2008/103442', u'imageUrl': u'https://spoonacular.com/productImages/440433-312x231.jpg'}]}, u'aggregateLikes': 135, u'instructions': u'Place all of the ingredients into the blender and blend for 45 seconds or until thick and creamy. Pour into your glass and enjoy!Serves one or two.', u'spoonacularSourceUrl': u'https://spoonacular.com/oat-berry-protein-shake-521491', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}