{u'recipes': [{u'sourceName': u'Crazy for Crust', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/703096-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 703096, u'veryPopular': False, u'lowFodmap': False, u'title': u'Skinny Oreo Cheesecake Dessert', u'diets': [], u'pricePerServing': 52.34, u'creditText': u'Crazy for Crust', u'extendedIngredients': [{u'originalString': u'1 cup fat-free or sugar-free Cool Whip', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free cool whip', u'metaInformation': [u'fat-free', u'sugar-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1200, u'unit': u'cup'}, {u'originalString': u'2 tablespoons instant cheesecake pudding mix (regular or sugar-free)', u'aisle': u'Baking', u'name': u'instant cheesecake pudding mix', u'metaInformation': [u'sugar-free', u'(regular or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 99192, u'unit': u'tablespoons'}, {u'originalString': u'1 cup nonfat vanilla greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat vanilla greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 99033, u'unit': u'cup'}, {u'originalString': u'4 Oreo Thins (or 2 regular Oreos or 1-100 calorie packet Oreos), crushed', u'aisle': u'Sweet Snacks', u'name': u'oreo', u'metaInformation': [u'crushed', u'(or 2 regular Oreos or 1-100 calorie packet Oreos)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.crazyforcrust.com/2016/01/skinny-oreo-cheesecake-dessert-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Stir together the yogurt and pudding mix (just the dry mix, not actual pudding) until smooth. Fold in the Cool Whip, then stir in the crushed cookies. Chill until ready to serve or eat.You can eat this with a spoon as a sweet evening treat, or use it as a sweet dip for fruit or pretzels.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are my top picks for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 146, u'instructions': u'Stir together the yogurt and pudding mix (just the dry mix, not actual pudding) until smooth. Fold in the Cool Whip, then stir in the crushed cookies. Chill until ready to serve or eat.You can eat this with a spoon as a sweet evening treat, or use it as a sweet dip for fruit or pretzels.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-oreo-cheesecake-dessert-703096', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}