{u'recipes': [{u'sourceName': u'Steamy Kitchen', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/602406-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 602406, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mushroom Tofu Potstickers', u'diets': [u'dairy free'], u'preparationMinutes': 45, u'pricePerServing': 23.12, u'creditText': u'Steamy Kitchen', u'extendedIngredients': [{u'originalString': u'3 cups cabbage, shredded on large holes of box grater', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'shredded', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11109, u'unit': u'cups'}, {u'originalString': u'3 tablespoons cooking oil, or more if needed', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon cornstarch + 1/4 cup cool water', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoon'}, {u'originalString': u'1 package of 50 dumpling wrappers', u'aisle': u'Ethnic Foods', u'name': u'dumpling wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10018368, u'unit': u'package'}, {u'originalString': u'1 tablespoon fresh basil, finely chopped', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons grated fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoons'}, {u'originalString': u'4 ounces fresh shiitake mushrooms, stems removed, chopped', u'aisle': u'Produce', u'name': u'fresh shiitake mushrooms', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11238, u'unit': u'ounces'}, {u'originalString': u'2 cloves garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces tofu (any firmness), crumbled', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'crumbled', u'(any firmness)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 16162, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.steamykitchen.com/27184-mushroom-tofu-potstickers-recipe-video.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a large mixing bowl, add cabbage, tofu, mushrooms, garlic, ginger, basil and soy sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place a potstickers wrapper flat in one hand.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place 1 heaping teaspoon of the potstickers filling mixture in the middle of the wrapper. Dip a finger in the slurry mixture and paint along the outside of the wrapper. Fold over to a half-moon shape. Pinch along the outside of the wrapper to close the wrapper completely around the mixture.. Repeat until all potstickers are filled and closed.Lay folded potstickers in a single layer. Cover with plastic wrap to keep them from drying out. (See headnote re: freezing)When ready to cook, in a non-stick skillet, heat 1 tablespoon of oil over medium high heat. When the oil is hot, add potstickers in a single layer along the bottom of the pan. Cook until browned on one side, about 2 minutes. Flip and brown the other side equally.Using the pan cover as a shield from splattering, add 2 tablespoons of water to the pan and cover immediately. Steam potstickers for 3-4 minutes. Uncover skillet, you should see almost all of the water has evaporated.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove potstickers, then wipe pan dry with towel and repeat for remaining batches.', u'number': 3, u'ingredients': []}], u'name': u'Mix well.Prepare the cornstarch slurry whisk together the cornstarch and water in a small bowl.To wrap'}], u'aggregateLikes': 162, u'instructions': u'In a large mixing bowl, add cabbage, tofu, mushrooms, garlic, ginger, basil and soy sauce. Mix well.Prepare the cornstarch slurry: whisk together the cornstarch and water in a small bowl.To wrap: Place a potstickers wrapper flat in one hand. Place 1 heaping teaspoon of the potstickers filling mixture in the middle of the wrapper. Dip a finger in the slurry mixture and paint along the outside of the wrapper. Fold over to a half-moon shape. Pinch along the outside of the wrapper to close the wrapper completely around the mixture.. Repeat until all potstickers are filled and closed.Lay folded potstickers in a single layer. Cover with plastic wrap to keep them from drying out. (See headnote re: freezing)When ready to cook, in a non-stick skillet, heat 1 tablespoon of oil over medium high heat. When the oil is hot, add potstickers in a single layer along the bottom of the pan. Cook until browned on one side, about 2 minutes. Flip and brown the other side equally.Using the pan cover as a shield from splattering, add 2 tablespoons of water to the pan and cover immediately. Steam potstickers for 3-4 minutes. Uncover skillet, you should see almost all of the water has evaporated. Remove potstickers, then wipe pan dry with towel and repeat for remaining batches.', u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-tofu-potstickers-602406', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 48, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}