{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/545232-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 545232, u'veryPopular': False, u'lowFodmap': False, u'title': u'Simply Amazing Greek Chicken', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 20, u'pricePerServing': 203.61, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 cucumber, chopped', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1/2 cup ATHENOS Traditional Crumbled Feta Cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled', u'traditional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1 cup grape tomatoes', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'cup'}, {u'originalString': u'1 pkt. (1.25 oz.) A.1. Savory Garlic & Herb Marinade Mix', u'aisle': u'Spices and Seasonings', u'name': u'italian herb mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.25, u'consistency': u'solid', u'id': 1022027, u'unit': u'oz'}, {u'originalString': u'1/2 cup chopped Kalamata olives', u'aisle': u'Canned and Jarred', u'name': u'kalamata olives', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/calamata-or-kalamata-olives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1009195, u'unit': u'cup'}, {u'originalString': u'1/4 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped pepperoncini peppers', u'aisle': u'Canned and Jarred', u'name': u'pepperoncini peppers', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11976, u'unit': u'cup'}, {u'originalString': u'1/2 cup chopped red onions', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'8 small boneless skinless chicken breasts (2 lb.)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u'2 Tbsp. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tbsp'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/simply-a-mazing-greek-chicken-138523.aspx', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk first 4 ingredients until blended.  Reserve 1/4 cup; pour remaining marinade over chicken in shallow dish.  Turn to evenly coat both sides of each breast.  Refrigerate 30 min., turning after 15 min.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Meanwhile, combine remaining ingredients and reserved marinade.  Refrigerate until ready to serve.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to medium-high heat. Lightly grease grill grates.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove chicken from marinade; discard marinade.  Grill chicken 10 min. on each side or until done (165F).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with vegetable mixture.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u'Whisk first 4 ingredients until blended.  Reserve 1/4 cup; pour remaining marinade over chicken in shallow dish.  Turn to evenly coat both sides of each breast.  Refrigerate 30 min., turning after 15 min.                                             Meanwhile, combine remaining ingredients and reserved marinade.  Refrigerate until ready to serve.                                            Heat grill to medium-high heat. Lightly grease grill grates.  Remove chicken from marinade; discard marinade.  Grill chicken 10 min. on each side or until done (165F).  Serve with vegetable mixture.', u'spoonacularSourceUrl': u'https://spoonacular.com/simply-amazing-greek-chicken-545232', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}