{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/249565-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 249565, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegan Chai Tiramisu', u'diets': [u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 344.9, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'1 \xbd tsp. of agar agar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agar agar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11663, u'unit': u'tsp'}, {u'originalString': u'\xbd cup of sweet agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'\xbe cup of sweet agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'1 tbsp. of baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp. of canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'2 cups of strongly brewed black masala chai', u'aisle': u'Tea and Coffee', u'name': u'chai', u'metaInformation': [u'black', u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 14355, u'unit': u'cups'}, {u'originalString': u'1 \xbd tbsp. of cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'2 servings of prepared EnerG Egg Replacer', u'aisle': u'Health Foods;Baking', u'name': u'Energ egg replacer', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 93658, u'unit': u'servings'}, {u'originalString': u'\xbc tsp. of ground fennel seeds', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2018, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. of ground cardamom', u'aisle': u'Spices and Seasonings', u'name': u'ground cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2006, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. of ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. of ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'8 oz. of firm silken tofu', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'silken tofu', u'metaInformation': [u'firm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 16161, u'unit': u'oz'}, {u'originalString': u'1 \xbd cups of soy cream cheese', u'aisle': u'Cheese;Health Foods', u'name': u'soy cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 93701, u'unit': u'cups'}, {u'originalString': u'\xbc cup of soy creamer', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy creamer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1067, u'unit': u'cup'}, {u'originalString': u'\xbd cup of finely ground turbinado sugar', u'aisle': u'Health Foods;Baking', u'name': u'turbinado sugar', u'metaInformation': [u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19908, u'unit': u'cup'}, {u'originalString': u'2 cups of whole wheat pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/chai-tiramisu-vegan-nut-free', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Whip all of the sweet cream ingredients together in a food processor until they are thoroughly combined. Simmer this on a medium heat for 5 minutes. Chill it for at least an hour.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the dry ingredients together. Prepare the EnerG Egg Replacer in the ladyfinger section.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93658, u'name': u'ener g egg replacer'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Mix this with all the wet ingredients. Fold the wet ingredients into the dry mix. Load a pastry bag with the batter. Pipe the batter into 3” long, 1” wide cookies, leaving about a 1” space between each cookie.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}], u'step': u'Bake these on 350 degrees for 18 minutes. Option:  Do not pipe the batter, but fill a rectangular cake pan with the batter about 1” high and bake the cake for 25 minutes.Brew the chai tea.', u'length': {u'number': 43, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'chai'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Mix the spices together and set them aside. Dunk each ladyfinger in the chai tea for about 3 seconds. Line the bottom of a baking dish with the lady fingers. Lightly brush them with a little chai.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'id': 14355, u'name': u'chai'}]}, {u'equipment': [], u'step': u'Spread about \xbd” of the sweet cream on top of the lady fingers. Repeat this process, making another layer of lady fingers and sweet cream. Sprinkle the spice mix over the top layer of sweet cream. Chill the tiramisu for at least 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tiramisu works really well with Cream Sherry, Chianti, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'chianti', u'moscato dasti', u'port', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u'Whip all of the sweet cream ingredients together in a food processor until they are thoroughly combined. Simmer this on a medium heat for 5 minutes. Chill it for at least an hour. Combine the dry ingredients together. Prepare the EnerG Egg Replacer in the ladyfinger section. Mix this with all the wet ingredients. Fold the wet ingredients into the dry mix. Load a pastry bag with the batter. Pipe the batter into 3” long, 1” wide cookies, leaving about a 1” space between each cookie. Bake these on 350 degrees for 18 minutes. Option:  Do not pipe the batter, but fill a rectangular cake pan with the batter about 1” high and bake the cake for 25 minutes.Brew the chai tea. Mix the spices together and set them aside. Dunk each ladyfinger in the chai tea for about 3 seconds. Line the bottom of a baking dish with the lady fingers. Lightly brush them with a little chai. Spread about \xbd” of the sweet cream on top of the lady fingers. Repeat this process, making another layer of lady fingers and sweet cream. Sprinkle the spice mix over the top layer of sweet cream. Chill the tiramisu for at least 30 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegan-chai-tiramisu-249565', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}