{u'recipes': [{u'sourceName': u'Crumb', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/673502-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 673502, u'veryPopular': False, u'lowFodmap': False, u'title': u'Game, Set, Match: Strawberry and Cream Parfaits', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 192.76, u'creditText': u'Crumb', u'extendedIngredients': [{u'originalString': u'28 small amaretti cookies', u'aisle': u'Sweet Snacks', u'name': u'amaretti cookies', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaretti.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 28.0, u'consistency': u'solid', u'id': 93766, u'unit': u''}, {u'originalString': u"2 tbsp Pimm's No. 1 cup (optional)", u'aisle': u'Bakery/Bread', u'name': u'cup cake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 18139, u'unit': u'tbsp'}, {u'originalString': u'1 dry pint fresh strawberries, hulled and sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'dry', u'hulled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'pint'}, {u'originalString': u'2 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 cup whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.crumbblog.com/2015/08/wimbledon-strawberry-and-cream-parfaits.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u"In a medium-sized mixing bowl, stir together the strawberries with sugar and Pimm's (if using).", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Let stand for 15 minutes or until the berries are softened and juicy.While the berries are macerating, whip the cream to soft peaks in a large mixing bowl.To assemble, arrange four parfait glasses (or any other pretty glass dish of your choice). Crush three amaretti into the bottom of each glass. Top with a couple spoonfuls of strawberries, and then a generous layer of whipped cream. Repeat the layers again, then finish with a slice of strawberry and an amaretti.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amaretti.jpg', u'id': 93766, u'name': u'amaretti cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Parfait can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u"In a medium-sized mixing bowl, stir together the strawberries with sugar and Pimm's (if using). Let stand for 15 minutes or until the berries are softened and juicy.While the berries are macerating, whip the cream to soft peaks in a large mixing bowl.To assemble, arrange four parfait glasses (or any other pretty glass dish of your choice). Crush three amaretti into the bottom of each glass. Top with a couple spoonfuls of strawberries, and then a generous layer of whipped cream. Repeat the layers again, then finish with a slice of strawberry and an amaretti. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/game-set-match-strawberry-and-cream-parfaits-673502', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}