{u'recipes': [{u'sourceName': u'Cbsop', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/496829-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 496829, u'veryPopular': False, u'lowFodmap': False, u'title': u'Leftover Pulled Chicken and Chipotle Sliders', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 273.73, u'creditText': u'Cbsop', u'extendedIngredients': [{u'originalString': u'1 - 6 ounce can tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounce'}, {u'originalString': u'3/4 cup chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'1 Tbsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp chipotle Sauce or 1 chipotle pepper, finely chopped', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11632, u'unit': u'Tbsp'}, {u'originalString': u'Approximately 1 pound leftover chicken, chopped or pulled from bone', u'aisle': u'Meat', u'name': u'ham bone', u'metaInformation': [u'leftover', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bone-ham.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 12011111, u'unit': u'pound'}, {u'originalString': u'3 Tbsp dehydrated onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11282, u'unit': u'Tbsp'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'12 slider sized rolls or buns (We used a serious whole wheat roll for these. it was a very good choice.)', u'aisle': u'Bakery/Bread', u'name': u'whole wheat buns', u'metaInformation': [u'whole wheat', u'good', u'for these. it was a very  choice.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-hamburger-buns.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 18351, u'unit': u''}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://cbsop.com/recipes/leftover-pulled-chicken-and-chipotle-sliders/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Place chicken, tomato sauce, stock, dehydrated onion, chipotle sauce or chipotle pepper and chili powder in a pot over medium heat. Stir to combine and bring to a boil. Reduce heat, cover and simmer, stirring occasionally' until chicken has completely broken apart and liquid is nearly absorbed. (About 45 minutes)", u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}, {u'equipment': [], u'step': u'Place approximately 2 Tbsp worth of chicken on each roll.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.Share and enjoy', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 41, u'instructions': u"Place chicken, tomato sauce, stock, dehydrated onion, chipotle sauce or chipotle pepper and chili powder in a pot over medium heat. Stir to combine and bring to a boil. Reduce heat, cover and simmer, stirring occasionally' until chicken has completely broken apart and liquid is nearly absorbed. (About 45 minutes)Place approximately 2 Tbsp worth of chicken on each roll. Serve immediately.Share and enjoy", u'spoonacularSourceUrl': u'https://spoonacular.com/leftover-pulled-chicken-and-chipotle-sliders-496829', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}