{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507839-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 507839, u'veryPopular': True, u'lowFodmap': False, u'title': u'Moon Pies', u'diets': [], u'preparationMinutes': 75, u'pricePerServing': 76.13, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'2/3 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'Pinch cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 18373, u'unit': u'pinch'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2\xbc cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbe cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup powdered sugar, sifted', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'Pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'12 ounces semisweet chocolate', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'ounces'}, {u'originalString': u'8 ounces (1 cup) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.browneyedbaker.com/2011/03/04/moon-pies-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'To Make the Cookies: With a mixer on medium speed, beat the butter until creamy, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the brown sugar and beat at medium-high speed until light and fluffy, about 3 minutes. Reduce the speed to medium, add the egg and the vanilla extract, and beat to combine. Reduce the speed to low, add the flour and the salt, and mix just until a soft dough forms. Divide the dough in two, shape into disks, wrap in plastic wrap and refrigerate for at least 30 minutes.2. Preheat the oven to 350 degrees F. Line at least two baking sheets with parchment paper or a silicone baking mat; set aside. Working with one disk at a time, roll out the dough to about 1/8-inch thickness. Using a 2\xbd-inch diameter round cutter, cut out the rounds and place them on the prepared baking sheets, about \xbd an inch apart. Refrigerate the cookies (on the baking sheets) for 10 minutes.3.', u'length': {u'number': 43, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Bake the cookies for 10 to 12 minutes, or until lightly browned. Cool on the pans for a couple of minutes, and then move to a cooling rack to cool completely.4. To Make the Marshmallow Filling: Using a mixer with the whisk attachment, beat the the egg whites with the cream of tartar and the salt until firm peaks form, gradually increasing from medium-low speed to medium-high speed as the egg whites gain volume. Meanwhile, in a small saucepan, boil the corn syrup over high heat without stirring until it registers 230 to 235 degrees F on a candy thermometer (thread ball stage). Slowly drizzle the hot corn syrup into the egg whites and beat at high speed until glossy, about 2 minutes. Reduce the speed to medium-low, beat in the vanilla extract and the powdered sugar.5. Using either a pastry bag or a spoon, mound about 1\xbd tablespoons of marshmallow filling into the center of a cookie. Top with another cookie and press lightly to spread the marshmallow to the edges.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Add another mound on top of the second cookie, and top with another cookie, again pressing slightly to spread the filling to the edges. Repeat with the rest of the cookies.6. To Make the Chocolate Coating: Using a double boiler or in the microwave on 50% power and in 30 second increments, melt the chocolate and vegetable oil together until completely smooth.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Place the assembled cookies on a wire rack set over a sheet of wax paper. Spoon the melted chocolate over each cookie so that it runs down the sides and covers most of the cookie. Allow to set at room temperature for about 2 hours (or refrigerate to speed up the process). Store in an airtight container at room temperature.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Angel Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 638, u'instructions': u'1. To Make the Cookies: With a mixer on medium speed, beat the butter until creamy, about 3 minutes. Add the brown sugar and beat at medium-high speed until light and fluffy, about 3 minutes. Reduce the speed to medium, add the egg and the vanilla extract, and beat to combine. Reduce the speed to low, add the flour and the salt, and mix just until a soft dough forms. Divide the dough in two, shape into disks, wrap in plastic wrap and refrigerate for at least 30 minutes.2. Preheat the oven to 350 degrees F. Line at least two baking sheets with parchment paper or a silicone baking mat; set aside. Working with one disk at a time, roll out the dough to about 1/8-inch thickness. Using a 2\xbd-inch diameter round cutter, cut out the rounds and place them on the prepared baking sheets, about \xbd an inch apart. Refrigerate the cookies (on the baking sheets) for 10 minutes.3. Bake the cookies for 10 to 12 minutes, or until lightly browned. Cool on the pans for a couple of minutes, and then move to a cooling rack to cool completely.4. To Make the Marshmallow Filling: Using a mixer with the whisk attachment, beat the the egg whites with the cream of tartar and the salt until firm peaks form, gradually increasing from medium-low speed to medium-high speed as the egg whites gain volume. Meanwhile, in a small saucepan, boil the corn syrup over high heat without stirring until it registers 230 to 235 degrees F on a candy thermometer (thread ball stage). Slowly drizzle the hot corn syrup into the egg whites and beat at high speed until glossy, about 2 minutes. Reduce the speed to medium-low, beat in the vanilla extract and the powdered sugar.5. Using either a pastry bag or a spoon, mound about 1\xbd tablespoons of marshmallow filling into the center of a cookie. Top with another cookie and press lightly to spread the marshmallow to the edges. Add another mound on top of the second cookie, and top with another cookie, again pressing slightly to spread the filling to the edges. Repeat with the rest of the cookies.6. To Make the Chocolate Coating: Using a double boiler or in the microwave on 50% power and in 30 second increments, melt the chocolate and vegetable oil together until completely smooth. Place the assembled cookies on a wire rack set over a sheet of wax paper. Spoon the melted chocolate over each cookie so that it runs down the sides and covers most of the cookie. Allow to set at room temperature for about 2 hours (or refrigerate to speed up the process). Store in an airtight container at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/moon-pies-507839', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}