{u'recipes': [{u'sourceName': u'Real Housemoms', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/828426-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 828426, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken & Wild Rice Casserole', u'diets': [], u'pricePerServing': 196.05, u'creditText': u'Real Housemoms', u'extendedIngredients': [{u'originalString': u'1 stick butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'stick'}, {u'originalString': u'4 boneless chicken breasts, cut into bite size pieces', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'boneless', u'cut into bite size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'\xbc cup chicken broth or water', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1 can cream of chicken soup', u'aisle': u'Canned and Jarred', u'name': u'cream of chicken soup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'can'}, {u'originalString': u'2 cups Monterey Jack cheese, grated', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cups'}, {u'originalString': u'Paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2028, u'unit': u'servings'}, {u'originalString': u"1 (6 ounce) package Uncle Ben's Long Grain and Wild Rice", u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [u'long grain', u'wild'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 20444, u'unit': u'ounce'}, {u'originalString': u'3 cups Pepperidge Farm herb seasoned stuffing', u'aisle': u'Bakery/Bread;Pasta and Rice', u'name': u'stuffing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 18082, u'unit': u'cups'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://realhousemoms.com/chicken-wild-rice-casserole/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Cook rice according to package directions.Spray a 9x13 baking dish with cooking spray and pour rice into casserole dish. Cover rice with 1 cup grated cheese and then layer on uncooked chicken pieces over the top of cheese. Sprinkle chicken with paprika and layer with the remaining 1 cup grated cheese.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Add broth (or water) to soup, mix, and spoon over top of the cheese.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the melted butter to stuffing mix and spread over the top of the casserole.You can refrigerate overnight (or freeze it for later) or cook immediately.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake at 325 degrees for 60 minutes.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 35, u'instructions': u'Cook rice according to package directions.Spray a 9x13 baking dish with cooking spray and pour rice into casserole dish. Cover rice with 1 cup grated cheese and then layer on uncooked chicken pieces over the top of cheese. Sprinkle chicken with paprika and layer with the remaining 1 cup grated cheese.Add broth (or water) to soup, mix, and spoon over top of the cheese.Add the melted butter to stuffing mix and spread over the top of the casserole.You can refrigerate overnight (or freeze it for later) or cook immediately.Bake at 325 degrees for 60 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-wild-rice-casserole-828426', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}