{u'recipes': [{u'sourceName': u'Bright Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542402-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 542402, u'veryPopular': False, u'lowFodmap': False, u'title': u'Confession #100: I’m No Good at Resolutions… Chocolate-Drizzled Cranberry and Pistachio Bars', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 86.89, u'creditText': u'Bright Eyed Baker', u'extendedIngredients': [{u'originalString': u'3 tablespoons bittersweet chocolate chips (or chopped bittersweet chocolate)', u'aisle': u'Baking', u'name': u'bittersweet chocolate chips', u'metaInformation': [u'chopped', u'(or bittersweet chocolate)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups brown rice cereal*', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20040, u'unit': u'cups'}, {u'originalString': u'2 teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1 cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1/2 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1 1/2 cup unsalted pistachio nutmeats, divided', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachio', u'metaInformation': [u'unsalted', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups rolled oats*', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1/2 cup slivered almonds', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012061, u'unit': u'cup'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.brighteyedbaker.com/2013/01/02/confession-100-im-no-good-at-resolutions-chocolate-drizzled-cranberry-and-pistachio-bars/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line an 8" square pan with foil. Spray foil with a non-stick cooking spray. In a food processor, process 1/2 cup of pistachio nutmeats with almonds until a smooth butter forms, about eight minutes. Wipe down the bottom and sides of the bowl and process for another 1-2 minutes, until smooth again. While the food processor is working, whisk together the remaining 1 cup pistachio nutmeats, brown rice cereal, rolled oats, dried cranberries, cinnamon, and salt in a large bowl until evenly combined.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'id': 9079, u'name': u'dried cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'rolled oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'id': 20040, u'name': u'brown rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the pistachio almond butter and the honey to the dry ingredients and stir in until evenly incorporated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the mixture to the prepared pan and pat down very firmly to cover the entire pan in a flat, compact layer. Cover with plastic wrap (here you can use your hands over the plastic wrap to press the mixture down further if needed) and place in the fridge to chill and firm up, about 2 hours at least. Once the mixture has chilled thoroughly, cut into bars with a sharp knife (I made 12 - two rows of 6). If the bars seem to be too fragile to hold together, keep them in the pan after cutting and chill overnight before separating. Once ready to separate, use the foil to lift the bars out of the pan, and then carefully separate out onto a large plate or tray.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place the dark chocolate in a small bowl and microwave for 30 seconds. Stir (even if they don't look melted yet), and then microwave for another 30 seconds if needed, stirring again afterwards. Lightly drizzle the melted chocolate over each bar using a small spatula or a spoon.", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Place the bars back into the fridge to chill until the chocolate hardens. Bars store well wrapped individually in plastic wrap and kept in the fridge.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pistachio Bar works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Line an 8" square pan with foil. Spray foil with a non-stick cooking spray. In a food processor, process 1/2 cup of pistachio nutmeats with almonds until a smooth butter forms, about eight minutes. Wipe down the bottom and sides of the bowl and process for another 1-2 minutes, until smooth again. While the food processor is working, whisk together the remaining 1 cup pistachio nutmeats, brown rice cereal, rolled oats, dried cranberries, cinnamon, and salt in a large bowl until evenly combined. Add the pistachio almond butter and the honey to the dry ingredients and stir in until evenly incorporated. Transfer the mixture to the prepared pan and pat down very firmly to cover the entire pan in a flat, compact layer. Cover with plastic wrap (here you can use your hands over the plastic wrap to press the mixture down further if needed) and place in the fridge to chill and firm up, about 2 hours at least. Once the mixture has chilled thoroughly, cut into bars with a sharp knife (I made 12 - two rows of 6). If the bars seem to be too fragile to hold together, keep them in the pan after cutting and chill overnight before separating. Once ready to separate, use the foil to lift the bars out of the pan, and then carefully separate out onto a large plate or tray. Place the dark chocolate in a small bowl and microwave for 30 seconds. Stir (even if they don\'t look melted yet), and then microwave for another 30 seconds if needed, stirring again afterwards. Lightly drizzle the melted chocolate over each bar using a small spatula or a spoon. Place the bars back into the fridge to chill until the chocolate hardens. Bars store well wrapped individually in plastic wrap and kept in the fridge.', u'spoonacularSourceUrl': u'https://spoonacular.com/confession-100-im-no-good-at-resolutions-chocolate-drizzled-cranberry-and-pistachio-bars-542402', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}