{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/312299-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 312299, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp Scampi', u'diets': [u'gluten free', u'primal', u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 253.07, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 teaspoons finely chopped flat-leaf parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley leaves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1 pound jumbo shrimp, shelled and deveined', u'aisle': u'Seafood', u'name': u'jumbo shrimp', u'metaInformation': [u'shelled', u'deveined'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon grated lemon zest plus 1 tablespoon freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'freshly squeezed', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup dry white vermouth', u'aisle': u'Alcoholic Beverages', u'name': u'vermouth', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14132, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpeg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/shrimp-scampi-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Put the shrimp on a large disposable pie pan or paper plate and pat them completely dry with a paper towel. Arrange the shrimp so they lay flat and are evenly spaced.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium heat. Season the shrimp with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the butter to the skillet. When the foaming subsides, raise the heat to high and invert the plate of shrimp over the skillet so the shrimp fall into the pan all at once. Cook the shrimp, without moving them, for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Add the garlic and cook for 1 minute. Turn the shrimp over and cook for 2 minutes more.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the shrimp to a bowl.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Return the skillet to the heat and pour in the vermouth and lemon juice. Boil the liquid until slightly thickened, about 30 seconds. Scrape up any browned bits from the bottom of the pan with a wooden spoon. Stir the lemon zest and parsley into the sauce.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vermouth.jpg', u'id': 14132, u'name': u'vermouth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Pour the sauce over the shrimp, season with salt and pepper to taste and toss to combine.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Divide the shrimp among plates or arrange on a platter and serve.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Shrimp Scampi works really well with Pinot Grigio, Sancerre, and Vermentino. With buttery shrimp scampi, a crisp acidic white wine will refresh the palate. Any of these wines will do the trick. You could try Luna Nuda Pinot Grigio. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 14 dollars per bottle.', u'pairedWines': [u'pinot grigio', u'sancerre', u'vermentino'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste.', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 115, u'instructions': u'Watch how to make this recipe.                    Put the shrimp on a large disposable pie pan or paper plate and pat them completely dry with a paper towel. Arrange the shrimp so they lay flat and are evenly spaced.                          Heat a large skillet over medium heat. Season the shrimp with salt and pepper. Add the butter to the skillet. When the foaming subsides, raise the heat to high and invert the plate of shrimp over the skillet so the shrimp fall into the pan all at once. Cook the shrimp, without moving them, for 1 minute. Add the garlic and cook for 1 minute. Turn the shrimp over and cook for 2 minutes more. Transfer the shrimp to a bowl.                          Return the skillet to the heat and pour in the vermouth and lemon juice. Boil the liquid until slightly thickened, about 30 seconds. Scrape up any browned bits from the bottom of the pan with a wooden spoon. Stir the lemon zest and parsley into the sauce. Pour the sauce over the shrimp, season with salt and pepper to taste and toss to combine.                          Divide the shrimp among plates or arrange on a platter and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-scampi-312299', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}