{u'recipes': [{u'sourceName': u'In Sock Monkey Slippers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619530-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619530, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sage and Garlic Roasted Chicken with Pomegranate and Black Pepper Glaze - in sock monkey slippers', u'diets': [u'gluten free', u'primal', u'ketogenic'], u'pricePerServing': 441.83, u'creditText': u'In Sock Monkey Slippers', u'extendedIngredients': [{u'originalString': u'4 pound fryer chicken, preferably free range/natural/antibiotic-free', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'pound'}, {u'originalString': u'2 Tablespoons fresh sage, chopped', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2038, u'unit': u'Tablespoons'}, {u'originalString': u'2 cloves garlic, peeled and chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 teaspoon coarsely ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups (16 oz) pomegranate juice', u'aisle': u'Beverages', u'name': u'pomegranate juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 9442, u'unit': u'oz'}, {u'originalString': u'pomegranate seeds and sage leaves for garnish, optional', u'aisle': u'Spices and Seasonings', u'name': u'sage leaves', u'metaInformation': [u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'leaves'}, {u'originalString': u'4 Tablespoons softened butter, unsalted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoons'}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.insockmonkeyslippers.com/sage-and-garlic-roasted-chicken-with-pomegranate-and-black-pepper-glaze', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425F. Finely chop the sage and garlic.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the butter, sage, garlic, and salt in a bowl and mix well until combined.2. With your hands(think of it as an expensive hand cream), rub the butter over the entire chicken including the cavity and underneath the skin.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}], u'step': u'Cut a 3 ft (arm span) of cooking twine. With the chicken breast side up and the cavity facing you, slide the twine underneath the wings at the top end of the chicken. Next, hold up both ends of the twine and bring them toward you and over the tops of the drumsticks.Then bring the twine down and underneath the drumstick ends.Next, hold the twine up and tie a bow pulling both legs together. This is optional. You can also just tie the drumstick ends together with cooking twine and tuck the wing tips in towards the chicken.4.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the chicken in the middle of a roasting pan or cast iron skillet and add any vegetables mentioned above around the chicken.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Drizzlethe vegetables lightly with olive oil and a sprinkle of salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the chicken in the oven and roast for 1 hour and 15 minutes.5. While the chicken is roasting, pour the pomegranate juice in a sauce pot and add pepper. Stir and bring to a boil. Reduce heat to medium and simmer until the juice has reduced by 3/4 and formed a syrup, about 15 minutes.The glaze will be finished when it thickly coats the back of a spoon.6.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-juice.jpg', u'id': 9442, u'name': u'pomegranate juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the chicken from the oven and pour half of the glaze over the chicken. If the glaze has hardened, heat it over low heat until fluid. Evenly spread the glaze over the chicken with a kitchen/pastry brush. Reserve leftover glaze for serving/plating. Return the chicken to the oven and roast for an additional 10 minutes.7. Allow the chicken to rest for 5 to 10 minutes before carving.Carve and plate. Spoonpomegranateblack pepper glaze over and garnish with pomegranate seeds, if desired.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}], u'name': u'Place any additional sage or garlic inside the cavity (optional).3. I like to truss (tie up) my chickens. 50 Shades of Chicken, if you will.Trussing a chicken keeps everything bound and helps with even cooking.Heres how you do it'}], u'winePairing': {u'pairingText': u'Roasted Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 3745, u'instructions': u'1. Preheat oven to 425F. Finely chop the sage and garlic.Combine the butter, sage, garlic, and salt in a bowl and mix well until combined.2. With your hands(think of it as an expensive hand cream), rub the butter over the entire chicken including the cavity and underneath the skin. Place any additional sage or garlic inside the cavity (optional).3. I like to truss (tie up) my chickens. 50 Shades of Chicken, if you will.Trussing a chicken keeps everything bound and helps with even cooking.Heres how you do it: Cut a 3 ft (arm span) of cooking twine. With the chicken breast side up and the cavity facing you, slide the twine underneath the wings at the top end of the chicken. Next, hold up both ends of the twine and bring them toward you and over the tops of the drumsticks.Then bring the twine down and underneath the drumstick ends.Next, hold the twine up and tie a bow pulling both legs together. This is optional. You can also just tie the drumstick ends together with cooking twine and tuck the wing tips in towards the chicken.4. Place the chicken in the middle of a roasting pan or cast iron skillet and add any vegetables mentioned above around the chicken.Drizzlethe vegetables lightly with olive oil and a sprinkle of salt and pepper. Place the chicken in the oven and roast for 1 hour and 15 minutes.5. While the chicken is roasting, pour the pomegranate juice in a sauce pot and add pepper. Stir and bring to a boil. Reduce heat to medium and simmer until the juice has reduced by 3/4 and formed a syrup, about 15 minutes.The glaze will be finished when it thickly coats the back of a spoon.6. Remove the chicken from the oven and pour half of the glaze over the chicken. If the glaze has hardened, heat it over low heat until fluid. Evenly spread the glaze over the chicken with a kitchen/pastry brush. Reserve leftover glaze for serving/plating. Return the chicken to the oven and roast for an additional 10 minutes.7. Allow the chicken to rest for 5 to 10 minutes before carving.Carve and plate. Spoonpomegranateblack pepper glaze over and garnish with pomegranate seeds, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/sage-and-garlic-roasted-chicken-with-pomegranate-and-black-pepper-glaze-in-sock-monkey-slippers-619530', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}