{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/758866-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758866, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vichyssoise (or Creamy Potato-Leek Soup)', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 60.23, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'1 Tbs. butter or margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbs'}, {u'originalString': u'1 medium fennel bulb, coarsely chopped', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'medium', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'\xbc cup chopped fresh chives', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11156, u'unit': u'cup'}, {u'originalString': u'1 sprig fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprig', u'unitShort': u'sprig', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprig'}, {u'originalString': u'1 clove garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3 medium leeks, white parts sliced (3 cups)', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'white', u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11246, u'unit': u'cups'}, {u'originalString': u'\xbd cup low-fat sour cream, optional', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1179, u'unit': u'cup'}, {u'originalString': u'\xbc cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'3 large russet or Yukon gold potatoes, peeled and diced (3 cups)', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'diced', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/vichyssoise-or-creamy-potato-leek-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt butter in large saucepan over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add leeks, fennel, and garlic; cover, and reduce heat to medium-low. Cook 20 minutes, or until leeks and fennel are very soft, stirring occasionally.2. Increase heat to medium-high. When leeks begin to sizzle, add wine, and cook 1 to 2 minutes. Stir in potatoes, thyme, and 5 cups water. Reduce heat to medium-low, cover, and simmer 45 minutes, or until potatoes are very soft.', u'length': {u'number': 66, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Remove thyme sprig, and pur\xe9e with immersion blender or food processor until smooth. Stir in sour cream, if using, and cool. Season with salt and pepper, if desired, and garnish with chives. To freeze and enjoy later: Measure cooled soup into two 1-qt. resealable containers; freeze. To eat later: thaw, and serve at room temperature, or heat gently in medium saucepan until hot.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}], u'name': u''}], u'aggregateLikes': 2581, u'instructions': u'1. Melt butter in large saucepan over medium heat. Add leeks, fennel, and garlic; cover, and reduce heat to medium-low. Cook 20 minutes, or until leeks and fennel are very soft, stirring occasionally.2. Increase heat to medium-high. When leeks begin to sizzle, add wine, and cook 1 to 2 minutes. Stir in potatoes, thyme, and 5 cups water. Reduce heat to medium-low, cover, and simmer 45 minutes, or until potatoes are very soft. Remove thyme sprig, and pur\xe9e with immersion blender or food processor until smooth. Stir in sour cream, if using, and cool. Season with salt and pepper, if desired, and garnish with chives. To freeze and enjoy later: Measure cooled soup into two 1-qt. resealable containers; freeze. To eat later: thaw, and serve at room temperature, or heat gently in medium saucepan until hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/vichyssoise-or-creamy-potato-leek-soup-758866', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}