{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/154196-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 154196, u'veryPopular': False, u'lowFodmap': False, u'title': u'Italian Vegetable Stew', u'diets': [], u'pricePerServing': 241.46, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 28-ounce can whole peeled tomatoes, drained', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'whole', u'peeled', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'3 15-ounce cans cannellini (white kidney) beans, rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned white cannellini beans', u'metaInformation': [u'white', u'rinsed', u'canned', u'( kidney)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 45.0, u'consistency': u'solid', u'id': 10016051, u'unit': u'ounce'}, {u'originalString': u'2 medium carrots, peeled, finely chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'peeled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery stalks, finely chopped', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 bunch collard greens, center ribs and stems removed', u'aisle': u'Produce', u'name': u'collard greens', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/collard-greens.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11161, u'unit': u'bunch'}, {u'originalString': u'4 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 leek, white and pale-green parts only, chopped', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'white', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1 sprig marjoram or oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'marjoram', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'sprig', u'unitShort': u'sprig', u'amount': 1.0, u'consistency': u'solid', u'id': 2023, u'unit': u'sprig'}, {u'originalString': u'1/2 cup olive oil, divided, plus more for serving', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided', u'plus more for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Shaved Parmesan (for serving)', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'shaved', u'(for serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoons crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoons'}, {u'originalString': u'1/2 1-pound loaf sourdough bread, torn into 2" pieces (about 6 cups)', u'aisle': u'Bakery/Bread', u'name': u'sourdough loaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sourdough-bread.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10118029, u'unit': u'cups'}, {u'originalString': u'4 sprigs thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'8 cups low-sodium vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 57.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Italian-Vegetable-Stew-51149120', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Scatter bread on a rimmed baking sheet in asingle layer.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand at room temperatureto slightly dry out, about 2 hours.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Working in batches, cook collards andkale separately in a large pot of boilingsalted water until slightly softened, about3 minutes per batch. Rinse to cool. Squeezeout excess water; roughly chop. Set aside.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/collard-greens.jpg', u'id': 11161, u'name': u'collard greens'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat 1/4 cup oil in a large heavy pot overmedium heat.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add carrots, celery, and leek;stir often until softened, 8-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Add garlic and red pepper flakes. Cook,stirring until fragrant, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Addtomatoes, crushing with your hands as youadd them. Cook, stirring frequently, untilliquid is evaporated and tomatoes begin tostick to the bottom of the pot, 10-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add broth, beans, thyme, marjoram, bayleaf, and reserved greens; season with saltand pepper. Bring to a boil, reduce heat, andsimmer until flavors meld and soup thickensslightly, 40-50 minutes. DO AHEAD: Soupcan be made 2 days ahead.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'id': 2023, u'name': u'marjoram'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Let cool slightly;chill until cold. Cover and keep chilled.Reheat before continuing. Store breadairtight at room temperature.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Just before serving, gently stir bread and1/4 cup oil into soup. Divide among bowls, topwith Parmesan, and drizzle with oil.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cabernet Sauvignon, Chablis, and Malbec are great choices for Stew. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. You could try Elway's Reserve Cabernet Sauvignon Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 78 dollars per bottle.", u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u"The 2013 Elway's Reserve Napa Valley Cabernet Sauvignon is a merge of dark fruits, delicate spiciness from carefully selected American oak barrels and intense minerality.", u'title': u"Elway's Reserve Cabernet Sauvignon Wine", u'price': u'$77.77', u'id': 428659, u'link': u'https://www.amazon.com/Elways-Reserve-Valley-Cabernet-Sauvignon/dp/B014JGLU2W', u'imageUrl': u'https://spoonacular.com/productImages/428659-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'Preparation                                                                    Scatter bread on a rimmed baking sheet in asingle layer. Let stand at room temperatureto slightly dry out, about 2 hours.                                                                            Working in batches, cook collards andkale separately in a large pot of boilingsalted water until slightly softened, about3 minutes per batch. Rinse to cool. Squeezeout excess water; roughly chop. Set aside.                                                                            Heat 1/4 cup oil in a large heavy pot overmedium heat. Add carrots, celery, and leek;stir often until softened, 8-10 minutes.                                                                            Add garlic and red pepper flakes. Cook,stirring until fragrant, about 1 minute. Addtomatoes, crushing with your hands as youadd them. Cook, stirring frequently, untilliquid is evaporated and tomatoes begin tostick to the bottom of the pot, 10-15 minutes.                                                                            Add broth, beans, thyme, marjoram, bayleaf, and reserved greens; season with saltand pepper. Bring to a boil, reduce heat, andsimmer until flavors meld and soup thickensslightly, 40-50 minutes. DO AHEAD: Soupcan be made 2 days ahead. Let cool slightly;chill until cold. Cover and keep chilled.Reheat before continuing. Store breadairtight at room temperature.                                                                            Just before serving, gently stir bread and1/4 cup oil into soup. Divide among bowls, topwith Parmesan, and drizzle with oil.', u'spoonacularSourceUrl': u'https://spoonacular.com/italian-vegetable-stew-154196', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}