{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/222265-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 222265, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stuffed tomatoes with lamb mince, dill & rice', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 307.24, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 beef tomatoes', u'aisle': u'Produce', u'name': u'beef steak tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beefsteak-tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10011529, u'unit': u''}, {u'originalString': u'100ml chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'ml'}, {u'originalString': u'4 tbsp chopped dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dill', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tbsp'}, {u'originalString': u'4 tbsp Greek extra virgin olive oil, plus extra to drizzle', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp chopped flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'2 garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'200g minced lamb', u'aisle': u'Meat', u'name': u'lamb', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10017224, u'unit': u'g'}, {u'originalString': u'50g long grain rice', u'aisle': u'Pasta and Rice', u'name': u'long grain rice', u'metaInformation': [u'long grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'g'}, {u'originalString': u'1 tbsp chopped mint', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tbsp'}, {u'originalString': u'1 Spanish onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'spanish', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'pinch sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pinch'}, {u'originalString': u'2 tbsp tomato pur\xe9e', u'aisle': u'Canned and Jarred', u'name': u'tomato puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11547, u'unit': u'tbsp'}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/12228/stuffed-tomatoes-with-lamb-mince-dill-and-rice', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4.Slice the tops off the tomatoes andreserve. Scoop out most of the pulpwith a teaspoon, being careful not tobreak the skin. Finely chop the pulp, andkeep any juices. Sprinkle the insides ofthe tomatoes with a little sugar to takeaway the acidity, then place them ona baking tray.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Heat 2 tbsp olive oil in a large fryingpan, add the onion and garlic, then gentlycook for about 10 mins until soft but notcoloured.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the lamb, cinnamon andtomato pur\xe9e, turn up the heat, thenfry until the meat is browned.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'id': 10017224, u'name': u'lamb'}]}, {u'equipment': [], u'step': u'Add thetomato pulp and juice, the rice and thestock. Season generously. Bring to theboil, then simmer for 15 mins or untilthe rice is tender and the liquid has beenabsorbed. Set aside to cool a little, thenstir in the herbs.Stuff the tomatoes up to the brim, toptomatoes with their lids, drizzle with 2tbsp more olive oil, sprinkle 3 tbsp waterinto the tray, then bake for 35 mins.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Servewith salad and crusty bread, hot or cold.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 66, u'instructions': u'Heat oven to 180C/160C fan/gas 4.Slice the tops off the tomatoes andreserve. Scoop out most of the pulpwith a teaspoon, being careful not tobreak the skin. Finely chop the pulp, andkeep any juices. Sprinkle the insides ofthe tomatoes with a little sugar to takeaway the acidity, then place them ona baking tray.Heat 2 tbsp olive oil in a large fryingpan, add the onion and garlic, then gentlycook for about 10 mins until soft but notcoloured. Add the lamb, cinnamon andtomato pur\xe9e, turn up the heat, thenfry until the meat is browned. Add thetomato pulp and juice, the rice and thestock. Season generously. Bring to theboil, then simmer for 15 mins or untilthe rice is tender and the liquid has beenabsorbed. Set aside to cool a little, thenstir in the herbs.Stuff the tomatoes up to the brim, toptomatoes with their lids, drizzle with 2tbsp more olive oil, sprinkle 3 tbsp waterinto the tray, then bake for 35 mins. Servewith salad and crusty bread, hot or cold.', u'spoonacularSourceUrl': u'https://spoonacular.com/stuffed-tomatoes-with-lamb-mince-dill-rice-222265', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}