{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/667514-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 667514, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pan-fried cod with creamy new potatoes and courgettes - delicious. magazine', u'diets': [u'pescatarian'], u'pricePerServing': 542.78, u'extendedIngredients': [{u'originalString': u'1 liter chicken/vegetable stock, hot', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'liter'}, {u'originalString': u'4 thick sustainable cod fillets', u'aisle': u'Seafood', u'name': u'cod', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cod-fillet.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 15015, u'unit': u'fillet'}, {u'originalString': u'4 courgettes, thickly sliced', u'aisle': u'Produce', u'name': u'courgettes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}, {u'originalString': u'100ml double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'Handful fresh flatleaf parsley, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flatleaf parsley', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Handful'}, {u'originalString': u'Lemon wedges, to serve', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'Grated zest of 1 lemon, plus a tablespoon of juice', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated', u'plus a tablespoon of juice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'500g new potatoes, thickly sliced', u'aisle': u'Produce', u'name': u'new potatoes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 11352, u'unit': u'g'}, {u'originalString': u'4 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}], u'healthScore': 67.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.deliciousmagazine.co.uk/recipes/pan-fried-cod-with-creamy-new-potatoes-and-courgettes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the potatoes in a saucepan with the stock and simmer for 6-7 minutes until just tender.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain, reserving the stock, and set aside. Meanwhile, heat half the olive oil in a large non-stick frying pan over a medium heat. Fry the courgettes and lemon zest in batches, until golden.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the potatoes, pour in the cream and 100ml of the reserved stock and bring to a simmer. Stir in the lemon juice and parsley.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the remaining oil in another frying pan over a medium-high heat, dust the cod with flour and fry for 2-3 minutes on each side until lightly golden and just cooked.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cod-fillet.jpg', u'id': 15015, u'name': u'cod'}]}, {u'equipment': [], u'step': u'Serve immediately with the creamy potato and courgette mixture, and some lemon wedges.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Fetzer Vineyards Valley Oaks Pinot Grigio with a 5 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': None, u'title': u'Fetzer Vineyards Valley Oaks Pinot Grigio', u'price': u'$10.99', u'id': 428373, u'link': u'https://www.amazon.com/Fetzer-Vineyards-Valley-Pinot-Grigio/dp/B0725QB94C', u'imageUrl': u'https://spoonacular.com/productImages/428373-312x231.jpg'}]}, u'aggregateLikes': 3270, u'instructions': u'Place the potatoes in a saucepan with the stock and simmer for 6-7 minutes until just tender. Drain, reserving the stock, and set aside. Meanwhile, heat half the olive oil in a large non-stick frying pan over a medium heat. Fry the courgettes and lemon zest in batches, until golden. Add the potatoes, pour in the cream and 100ml of the reserved stock and bring to a simmer. Stir in the lemon juice and parsley.Heat the remaining oil in another frying pan over a medium-high heat, dust the cod with flour and fry for 2-3 minutes on each side until lightly golden and just cooked. Serve immediately with the creamy potato and courgette mixture, and some lemon wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/pan-fried-cod-with-creamy-new-potatoes-and-courgettes-delicious-magazine-667514', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}