{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/671627-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 671627, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooked Beef Caesar Salad', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 505.67, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u"1 bottle creamy caesar salad dressing (I used Newman's Own)", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'caesar salad dressing', u'metaInformation': [u"(I used Newman's Own)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'liquid', u'id': 43015, u'unit': u'bottle'}, {u'originalString': u'3 hearts of romaine chopped', u'aisle': u'Produce', u'name': u'hearts of romaine', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10011251, u'unit': u''}, {u'originalString': u'1/2 cup shredded parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2.5 pounds beef roast (I used cross rib roast)', u'aisle': u'Meat', u'name': u'roast beef', u'metaInformation': [u'(I used cross rib roast)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roast-beef-slices.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'liquid', u'id': 93713, u'unit': u'pounds'}, {u'originalString': u'4 tomatoes chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 yellow onion sliced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 59.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://wearychef.com/slow-cooked-beef-caesar-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place sliced onions in slow cooker, and put roast on top.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Pour enough dressing over the meat to cover it completely, but not the whole bottle. (You'll want to save some for the salads.) Cook on low for 8-10 hours.Turn off slow cooker. Shred cooked meat in the pot, removing any fatty parts. Stir the shredded meat into the sauce, and allow to sit for a few minutes with the lid off.", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place lettuce and tomatoes in large salad bowls. Use a slotted spoon to scoop meat onto each salad. Sprinkle parmesan and drizzle dressing over the meat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Serve!', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Caesar Salad on the menu? Try pairing with Gavi, Albarino, and Pinot Grigio. We recommend a crisp, dry white wine such as a Gavi, Albari\xf1o, or Pinot Grigio. These wines stand up to the pungent dressing and complement the other flavors. The La Canan Albarino with a 4.1 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'gavi', u'albarino', u'pinot grigio'], u'productMatches': [{u'description': u'Pineapple, lemon, seashell and salt scents carry through on the pure, silky palate. Finishes very long with brilliant acidity, rich citrus fruit flavors, fine minerals and just the slightest touch of almond. Absolutely delicious.', u'title': u'La Cana Albarino', u'price': u'$19.79', u'id': 437713, u'link': u'https://www.wine.com/product/la-cana-albarino-2009/104926', u'imageUrl': u'https://spoonacular.com/productImages/437713-312x231.jpg'}]}, u'aggregateLikes': 75, u'instructions': u"Place sliced onions in slow cooker, and put roast on top. Pour enough dressing over the meat to cover it completely, but not the whole bottle. (You'll want to save some for the salads.) Cook on low for 8-10 hours.Turn off slow cooker. Shred cooked meat in the pot, removing any fatty parts. Stir the shredded meat into the sauce, and allow to sit for a few minutes with the lid off.Place lettuce and tomatoes in large salad bowls. Use a slotted spoon to scoop meat onto each salad. Sprinkle parmesan and drizzle dressing over the meat. Serve!", u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooked-beef-caesar-salad-671627', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 485, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}