{u'recipes': [{u'sourceName': u'The Housewife in Training Files', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556568-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_5', u'cookingMinutes': 45, u'id': 556568, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skinny Sun Dried Tomato Meatballs with Spaghetti Squash', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 450.19, u'creditText': u'The Housewife in Training Files', u'extendedIngredients': [{u'originalString': u'Olive oil, or Coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'servings'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1.25 lbs 93% lean ground turkey', u'aisle': u'Meat', u'name': u'lean ground turkey', u'metaInformation': [u'93%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 5662, u'unit': u'lbs'}, {u'originalString': u'1 jar of marinara, this is my personal favorite', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'jar'}, {u'originalString': u'\xbc c of finely chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'c'}, {u'originalString': u'\xbd tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'Salt, pepper and herbs', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 large spaghetti squash', u'aisle': u'Produce', u'name': u'spaghetti squash', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11492, u'unit': u''}, {u'originalString': u'6 sun dried tomatoes, in oil, finely chopped', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun dried tomatoes', u'metaInformation': [u'dried', u'finely chopped', u'in oil'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11955, u'unit': u''}, {u'originalString': u'Sun Dried Tomato Meatballs', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun dried tomato', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'ball', u'unitShort': u'balls', u'amount': 1.0, u'consistency': u'solid', u'id': 11955, u'unit': u'balls'}, {u'originalString': u'Optional, parmesan cheese to garnish', u'aisle': u'?', u'name': u'optional', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'unit': u'servings'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://thehousewifeintrainingfiles.com/skinny-sun-dried-tomato-meatballs-spaghetti-squash/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees. To prepare spaghetti squash, cut the squash in half and scrape out seeds. Line a rimmed baking dish with aluminum foil that is greased. Season the spaghetti squash with coconut oil or olive oil, salt, pepper and herbs of choice.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'id': 11492, u'name': u'spaghetti squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place flesh side down and roast for 30 to 40 minutes until fully cooked. Test the strands by running a fork through; if they are still slightly hard and are crunchy when you taste if, place back in oven until al dente. Once cooked through, remove from the oven and let rest until cool enough to handle. Once cool enough to handle, scrap the strands to create your spaghetti.To prepare meatballs, combine turkey, sun friend tomatoes, parsley, garlic, egg, salt and pepper.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Mix until just combined. Don’t over mix as it will create a tough meatball. In a greased baking dish, add marinara; roll meat into golf ball size meatballs.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place in marinara filled dish, and bake at 375 degrees, for 15-17 minutes, or until no longer pink on the inside and the meat reaches an internal temp of 165 degrees.Once spaghetti squash is complete, add to serving dish and add marinara sauce and meatballs on top.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'id': 11492, u'name': u'spaghetti squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10111549, u'name': u'marinara sauce'}]}, {u'equipment': [], u'step': u'Garnish with cheese, if desired, and additional parsley!', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 378, u'instructions': u'Preheat oven to 375 degrees. To prepare spaghetti squash, cut the squash in half and scrape out seeds. Line a rimmed baking dish with aluminum foil that is greased. Season the spaghetti squash with coconut oil or olive oil, salt, pepper and herbs of choice. Place flesh side down and roast for 30 to 40 minutes until fully cooked. Test the strands by running a fork through; if they are still slightly hard and are crunchy when you taste if, place back in oven until al dente. Once cooked through, remove from the oven and let rest until cool enough to handle. Once cool enough to handle, scrap the strands to create your spaghetti.To prepare meatballs, combine turkey, sun friend tomatoes, parsley, garlic, egg, salt and pepper. Mix until just combined. Don’t over mix as it will create a tough meatball. In a greased baking dish, add marinara; roll meat into golf ball size meatballs. Place in marinara filled dish, and bake at 375 degrees, for 15-17 minutes, or until no longer pink on the inside and the meat reaches an internal temp of 165 degrees.Once spaghetti squash is complete, add to serving dish and add marinara sauce and meatballs on top. Garnish with cheese, if desired, and additional parsley!', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-sun-dried-tomato-meatballs-with-spaghetti-squash-556568', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}