{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/446420-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 446420, u'veryPopular': False, u'lowFodmap': False, u'title': u'Focaccia Bread', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 28.74, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1-1/2 teaspoons active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'3 cups bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'1-1/2 teaspoons minced fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoons'}, {u'originalString': u'1/2 to 1 teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Additional olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 tablespoon grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon coarsely ground or cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup plus 3 tablespoons water (70\xb0 to 80\xb0)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(70\xb0 to 80\xb0)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/focaccia-bread', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bread-machine.jpg', u'id': 5607, u'name': u'bread machine'}], u'step': u'In bread machine pan, place the first five ingredients in order suggested by manufacturer. Select dough setting (check the dough after 5 minutes of mixing; add 1 to 2 tablespoons of water or flour if needed).', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'When cycle is complete, let dough rest in pan for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer dough to a greased baking sheet. Pat into an 8-in. circle about 3/4 in. high.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Brush with oil; sprinkle with the Parmesan cheese, rosemary and garlic salt.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake at 425\xb0 for 20-25 minutes or until golden brown. In a small bowl, combine dipping sauce ingredients; serve with warm bread.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Focaccia can be paired with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Castello di Volpaia Chianti Classico Riserva. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 24 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Color: Ruby red with a trace of garnet Nose: Elegant and intense with hints of spices connected with fruity scents Taste: Good structure with evident tannins and long persistence', u'title': u'Castello di Volpaia Chianti Classico Riserva', u'price': u'$23.99', u'id': 439055, u'link': u'https://www.wine.com/product/castello-di-volpaia-chianti-classico-riserva-2003/92756', u'imageUrl': u'https://spoonacular.com/productImages/439055-312x231.jpg'}]}, u'aggregateLikes': 38, u'instructions': u'Directions                                                                                In bread machine pan, place the first five ingredients in order suggested by manufacturer. Select dough setting (check the dough after 5 minutes of mixing; add 1 to 2 tablespoons of water or flour if needed).                                                                                           When cycle is complete, let dough rest in pan for 5 minutes.  Transfer dough to a greased baking sheet. Pat into an 8-in. circle about 3/4 in. high. Brush with oil; sprinkle with the Parmesan cheese, rosemary and garlic salt.                                                                                            Bake at 425\xb0 for 20-25 minutes or until golden brown. In a small bowl, combine dipping sauce ingredients; serve with warm bread.                                        Yield: 1 loaf (1-1/2 pounds).                                                                                                                         Originally published as Focaccia Bread in  Quick CookingJuly/August 2003, p33                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 slice) equals 115 calories, 4 g fat (1 g saturated fat), trace cholesterol, 63 mg sodium, 17 g carbohydrate, 1 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/focaccia-bread-446420', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}