{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/311474-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 311474, u'veryPopular': False, u'lowFodmap': False, u'title': u"Mary Alice's Hoagie Dip", u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 156.01, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 10-to-12-inch round loaf Italian bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 10.0, u'consistency': u'solid', u'id': 18064, u'unit': u'inch'}, {u'originalString': u'1/4 pound deli-sliced ham', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 10010151, u'unit': u'pound'}, {u'originalString': u'1/4 pound deli-sliced prosciutto', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 10010151, u'unit': u'pound'}, {u'originalString': u'1/4 pound deli-sliced roast turkey', u'aisle': u'Meat', u'name': u'deli turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/deli-turkey.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 7259, u'unit': u'pound'}, {u'originalString': u'1 1/2 teaspoons dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoons'}, {u'originalString': u'1/2 head iceberg lettuce', u'aisle': u'Produce', u'name': u'iceberg lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 11252, u'unit': u'head'}, {u'originalString': u'1/2 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 medium onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'2 pickled pepperoncini peppers', u'aisle': u'Canned and Jarred', u'name': u'pepperoncini peppers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11976, u'unit': u''}, {u'originalString': u'1/4 pound deli-sliced provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 1035, u'unit': u'pound'}, {u'originalString': u'1/4 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/4 pound deli-sliced genoa salami', u'aisle': u'Meat', u'name': u'salami', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 7071, u'unit': u'pound'}, {u'originalString': u'8 hoagie rolls, cut into pieces, for dipping', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'for dipping', u'cut into pieces, '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'1 large tomato, halved and seeded', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'large', u'halved', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpeg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/mary-alices-hoagie-dip-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Chop the onion, pepperoncini, lettuce and tomato into bite-size pieces. Dice the meats and cheese.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoncini.jpg', u'id': 11976, u'name': u'peperoncini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the chopped vegetables, meats and cheese in a large bowl.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the mayonnaise, olive oil, oregano, basil and red pepper flakes and stir until everything is all mixed up and tasty. Refrigerate until ready to serve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Carve out the center of the bread loaf to make a bowl (don't cut through the bottom) and cut the scraps into bite-size pieces.", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve the hoagie dip in the bread bowl, with the extra bread and hoagie rolls to scoop it up. Yummers!', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Photograph by Rick Lew', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Dip. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 138, u'instructions': u"Chop the onion, pepperoncini, lettuce and tomato into bite-size pieces. Dice the meats and cheese.                          Combine the chopped vegetables, meats and cheese in a large bowl. Add the mayonnaise, olive oil, oregano, basil and red pepper flakes and stir until everything is all mixed up and tasty. Refrigerate until ready to serve.                          Carve out the center of the bread loaf to make a bowl (don't cut through the bottom) and cut the scraps into bite-size pieces. Serve the hoagie dip in the bread bowl, with the extra bread and hoagie rolls to scoop it up. Yummers!                          Photograph by Rick Lew", u'spoonacularSourceUrl': u'https://spoonacular.com/mary-alices-hoagie-dip-311474', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}