{u'recipes': [{u'sourceName': u'Tickling Palates', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/564571-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 564571, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kothavarangai Paruppu Usili', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 58.52, u'creditText': u'Tickling Palates', u'extendedIngredients': [{u'originalString': u'Curry leaf – 1 sprig', u'aisle': u'Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'sprig', u'unitShort': u'sprig', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u'sprig'}, {u'originalString': u'Whole dry red chilies – 4', u'aisle': u'Produce', u'name': u'chilies', u'metaInformation': [u'dry red', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'Cumin seeds – 1/4 tsp', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2014, u'unit': u'tsp'}, {u'originalString': u'Channa Dal/Bengal gram (Kadalai Paruppu) – 1/4 cup', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'dal', u'metaInformation': [u'(Kadalai Paruppu)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16069, u'unit': u'cup'}, {u'originalString': u'Fennel seeds – 1/4 tsp', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2018, u'unit': u'tsp'}, {u'originalString': u'Mustard seeds – 1/2 tsp', u'aisle': u'Spices and Seasonings', u'name': u'mustard seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2024, u'unit': u'tsp'}, {u'originalString': u'Oil – 2 tbsp', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'Salt – to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Turmeric powder – 1/4 tsp', u'aisle': u'Spices and Seasonings', u'name': u'turmeric powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}, {u'originalString': u'Urad dal – 1 tsp', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'urad dal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-lentils.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93718, u'unit': u'tsp'}, {u'originalString': u'Kothavarangai (Cluster Beans) – 150 g', u'aisle': u'?', u'name': u'kothavarangai', u'metaInformation': [u'(Cluster Beans)'], u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'unit': u'g'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.ticklingpalates.com/2013/09/kothavarangai-paruppu-usili-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash and soak channa dal for 1 hour in enough water.  Wash and trim the ends of the kothavarangai (Cluster beans) and chop it fine.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [], u'step': u'Drain the water from the channa dal and place it in a mixie jar.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Add whole dry red chilies, fennel seeds, cumin seeds, 2 pinch salt and grind to a coarse paste without adding water.  Make goose berry shaped balls of the ground paste and steam it for 8-10 minutes. You can also flatten the balls before steaming. When you insert a toothpick it should come out clean.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'id': 2018, u'name': u'fennel seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'red chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Transfer to a plate and let it cool. Crumble the steamed balls well with your finger tips and keep aside.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a pan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add mustard seeds and when it splutters add urad dal and curry leaf and cook for 10-15 seconds will the dal becomes golden brown.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-lentils.jpg', u'id': 93718, u'name': u'urad dal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [], u'step': u'Add the crumbled, steamed dal and saute for a few seconds.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add finely chopped kothavarangai, turmeric powder, salt, 1 tsp water and mix well.  Close the pan with a lid and let it cook over low flame for 5-7 minutes.  The mixture should look well merged and dry yet moist. By this time the kothavarangai must have cooked till soft and the raw smell of the crumbled dal have gone.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}]}, {u'equipment': [], u'step': u'Transfer to a serving dish and serve hot with any spicy kulambu or rasam.', u'number': 9, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 202, u'instructions': u'Wash and soak channa dal for 1 hour in enough water.  Wash and trim the ends of the kothavarangai (Cluster beans) and chop it fine.  Drain the water from the channa dal and place it in a mixie jar. Add whole dry red chilies, fennel seeds, cumin seeds, 2 pinch salt and grind to a coarse paste without adding water.  Make goose berry shaped balls of the ground paste and steam it for 8-10 minutes. You can also flatten the balls before steaming. When you insert a toothpick it should come out clean. Transfer to a plate and let it cool. Crumble the steamed balls well with your finger tips and keep aside.  Heat oil in a pan. Add mustard seeds and when it splutters add urad dal and curry leaf and cook for 10-15 seconds will the dal becomes golden brown.  Add the crumbled, steamed dal and saute for a few seconds. Add finely chopped kothavarangai, turmeric powder, salt, 1 tsp water and mix well.  Close the pan with a lid and let it cook over low flame for 5-7 minutes.  The mixture should look well merged and dry yet moist. By this time the kothavarangai must have cooked till soft and the raw smell of the crumbled dal have gone.  Transfer to a serving dish and serve hot with any spicy kulambu or rasam.', u'spoonacularSourceUrl': u'https://spoonacular.com/kothavarangai-paruppu-usili-564571', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}