{u'recipes': [{u'sourceName': u'Panning The Globe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/669478-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 669478, u'veryPopular': True, u'lowFodmap': False, u'title': u'FISH IN CRAZY WATER', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 464.76, u'creditText': u'Panning The Globe', u'extendedIngredients': [{u'originalString': u'3 celery stalks, washed, ends trimmed, cut into matchsticks or chopped (1\xbd cups)', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'washed', u'trimmed', u'chopped', u'cut into matchsticks or  (1\xbd cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 pint of ripe cherry tomatoes, washed and cut into quarters (10-11 ounces)', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'washed and cut into quarters (10-11 ounces)', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'pint'}, {u'originalString': u'Coarse salt and fresh ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'\xbc cup extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'1\xbd pounds fresh fish fillets, such as snapper, sea bass, Branzino or Orata, cut into 4 servings.', u'aisle': u'Seafood', u'name': u'fish fillets', u'metaInformation': [u'fresh', u' such as snapper, sea bass, branzino or orata, cut into 4 servings.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10115261, u'unit': u'pounds'}, {u'originalString': u'1 large garlic clove, slightly smashed and peeled (see how to smash garlic here)', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'large', u'peeled', u'smashed', u'(see how to smash garlic here)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbc cup chopped parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1\xbd cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 medium yellow onion, chopped (1\xbd cups)', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10511282, u'unit': u'cups'}], u'healthScore': 83.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.panningtheglobe.com/2015/08/05/fish-in-crazy-water/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil and garlic in a large skillet over medium heat for a minute or so, until the garlic starts to sizzle a bit.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u"Add the carrots, celery and onions. Saut, stirring, for 2 minutes or so, until the vegetables start to soften (regulate the heat so they don't brown)", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the cherry tomatoes and cook, stirring, for a minute or so, to heat the tomatoes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}]}, {u'equipment': [], u'step': u'Add the fish, tucking it down into the vegetables.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add  teaspoon salt and 1 cups water. Bring the liquid to a simmer. Cover and cook over medium low heat (gentle simmer) for 10 minutes or until the fish is just cooked through and the vegetables are softened. Stir in half the parsley.Divide fish, veggies and broth among 4 shallow bowls. Season with black pepper, to taste.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve right away, while hot, with additional chopped parsley sprinkled on top.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try King Estate Signature Collection Pinot Gris. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 16 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light straw with emerald green hue. Aromas of green apple, citrus, honeysuckle, white peach, apricot and floral notes. Flavors of pear, melon, lemon and lime, wet stone, kiwi and honey. The palate has a soft, rich entry, nice texture, good weight and a long, lively crisp finish.', u'title': u'King Estate Signature Collection Pinot Gris', u'price': u'$15.99', u'id': 441154, u'link': u'https://www.wine.com/product/king-estate-signature-collection-pinot-gris-2011/116609', u'imageUrl': u'https://spoonacular.com/productImages/441154-312x231.jpg'}]}, u'aggregateLikes': 423, u'instructions': u"Heat olive oil and garlic in a large skillet over medium heat for a minute or so, until the garlic starts to sizzle a bit. Add the carrots, celery and onions. Saut, stirring, for 2 minutes or so, until the vegetables start to soften (regulate the heat so they don't brown)Add the cherry tomatoes and cook, stirring, for a minute or so, to heat the tomatoes. Add the fish, tucking it down into the vegetables. Add  teaspoon salt and 1 cups water. Bring the liquid to a simmer. Cover and cook over medium low heat (gentle simmer) for 10 minutes or until the fish is just cooked through and the vegetables are softened. Stir in half the parsley.Divide fish, veggies and broth among 4 shallow bowls. Season with black pepper, to taste. Serve right away, while hot, with additional chopped parsley sprinkled on top.", u'spoonacularSourceUrl': u'https://spoonacular.com/fish-in-crazy-water-669478', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}