{u'recipes': [{u'sourceName': u'An Edible Mosaic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/809984-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 809984, u'veryPopular': False, u'lowFodmap': False, u'title': u'Patriotic Cheesecake Parfaits', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 185.63, u'creditText': u'An Edible Mosaic', u'extendedIngredients': [{u'originalString': u'1 cup (140 g) frozen blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 9050, u'unit': u'g'}, {u'originalString': u'\xbd teaspoon gelatin dissolved in 1 tablespoon cold water', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [u'dissolved in 1 tablespoon cold water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19177, u'unit': u'teaspoon'}, {u'originalString': u'8 oz (225 g) goat cheese (see Note)', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 1159, u'unit': u'g'}, {u'originalString': u'6 tablespoons heavy cream, whipped to stiff peaks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'6 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'4 tablespoons powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tablespoons'}, {u'originalString': u'1 pinch sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1 cup whole strawberries, washed, hulled, and chopped', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'whole', u'washed', u'hulled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.anediblemosaic.com/patriotic-cheesecake-parfaits/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the cheesecake layer, add the gelatin and cold water to a small bowl and swirl it around; let it sit until the gelatin absorbs the water, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the boiling water and stir until the gelatin is completely dissolved. Cool to room temperature.Whip the cream to soft peaks and set aside.Whip together the goat cheese, milk, powdered sugar, and vanilla in a large bowl. Once the gelatin mixture is cooled, whip it into the goat cheese mixture. Fold in the whipped cream  at a time. Cover and refrigerate until slightly chilled and starting to set, about 30 minutes, whisking it every 10 minutes. Once chilled, use a handheld electric mixer to beat until the mixture is very thick and you can see the trail of beaters as it whips.For the blueberry layer, add the gelatin and cold water to a small bowl and swirl it around; let it sit until the gelatin absorbs the water, about 2 minutes.', u'length': {u'number': 42, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add the boiling water and stir until the gelatin is completely dissolved.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add the blueberries, 2 tablespoons water, powdered sugar, and salt to a small/medium saucepan. Cover the saucepan and bring to a boil over medium heat, then add the gelatin mixture and continue boiling (uncovered) for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from the heat and cool to room temperature.Layer the cheesecake, blueberry sauce, and strawberries into 6 (5 fluid ounce) juice glasses. (I add a layer of cheesecake on the bottom, then a layer of blueberry sauce, and then a layer of strawberries and repeat this one time.)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}]}, {u'equipment': [], u'step': u'Serve chilled.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Parfait. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 212, u'instructions': u'For the cheesecake layer, add the gelatin and cold water to a small bowl and swirl it around; let it sit until the gelatin absorbs the water, about 2 minutes. Add the boiling water and stir until the gelatin is completely dissolved. Cool to room temperature.Whip the cream to soft peaks and set aside.Whip together the goat cheese, milk, powdered sugar, and vanilla in a large bowl. Once the gelatin mixture is cooled, whip it into the goat cheese mixture. Fold in the whipped cream  at a time. Cover and refrigerate until slightly chilled and starting to set, about 30 minutes, whisking it every 10 minutes. Once chilled, use a handheld electric mixer to beat until the mixture is very thick and you can see the trail of beaters as it whips.For the blueberry layer, add the gelatin and cold water to a small bowl and swirl it around; let it sit until the gelatin absorbs the water, about 2 minutes. Add the boiling water and stir until the gelatin is completely dissolved.Add the blueberries, 2 tablespoons water, powdered sugar, and salt to a small/medium saucepan. Cover the saucepan and bring to a boil over medium heat, then add the gelatin mixture and continue boiling (uncovered) for 2 minutes. Remove from the heat and cool to room temperature.Layer the cheesecake, blueberry sauce, and strawberries into 6 (5 fluid ounce) juice glasses. (I add a layer of cheesecake on the bottom, then a layer of blueberry sauce, and then a layer of strawberries and repeat this one time.)Serve chilled.', u'spoonacularSourceUrl': u'https://spoonacular.com/patriotic-cheesecake-parfaits-809984', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}