{u'recipes': [{u'sourceName': u'I Adore Food', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/546807-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 546807, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salsa Mexicana', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 32.8, u'creditText': u'I Adore Food', u'extendedIngredients': [{u'originalString': u'1 can (28 oz) of diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'2 Tablespoon fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Tablespoon'}, {u'originalString': u'2 cloves of garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 Teaspoon of garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'Teaspoon'}, {u'originalString': u'2 small jalapeno peppers (seeded and chopped)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'small', u'seeded', u'chopped', u'( and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'3 Tablespoon of olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoon'}, {u'originalString': u'3/4 of a red onion (chopped)', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.75, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2 Teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'Teaspoon'}, {u'originalString': u'1 can (5 1/2oz) tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.5, u'consistency': u'solid', u'id': 11887, u'unit': u'oz'}, {u'originalString': u'4 fresh tomatoes, peeled and diced', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'fresh', u'diced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://iadorefood.com/recipes/salsa-mexicana/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To easily peel tomatoes, cut an X into the top or bottom of the tomato and place in boiling water for a few minutes remove, let cool slightly and remove skin.Dice tomatoes, place in food processor add tomato paste, chopped peppers, minced garlic, cilantro, salt, onions and oil. Process until mixed.This mixture usually fills my food processor, so I empty this into a bowl; add the can of diced tomatoes and process to chop the tomatoes a little finer. I then put this into first mixture and mix.At this point the salsa is ready to serve, but if left to sit in refrigerator for a few hours the salsa will thicken and the flavours will intensify.This method produces a fine textured salsa. I you like a chunkier salsa, I sometimes place onions, seeded peppers, cilantro, garlic in the processor whole and process until chopped. I then take the tomatoes and pulse them until I have the texture I like.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Salsa. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Bernardus Rosella's Vineyard Pinot Noir. It has 4.7 out of 5 stars and a bottle costs about 48 dollars.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The Santa Lucia Highlands are known as one of the premier Pinot Noir appellations of the world. One reason for this lofty reputation is Rosella's Vineyard. Gary Franscioni planted his home ranch, named for his lovely wife, in the heart of the Highlands. Gary's home vineyard is planted with a selection of the best available Pinot Noir clones and farmed with unparalleled passion and attention to detail. We at Bernardus are fortunate to have access to three small blocks: 2 planted with clone 777, and the third with the celebrated Pisoni clone.Each block is individually monitored for ripeness in order to hand-pick each clone at its perfect ripeness level. The grapes are sorted at the winery and fermented in small individual fermenters using specially selected yeasts. Once fermentation and pressing are complete, each lot is aged separately for 10 months in the finest French oak barrels. Each barrel is evaluated individually and the final selection is made through a lengthy series of tasting trials.The robe of our 2011 Rosella's is a deep crimson. On the nose we find aromas of candied red cherry fruits along with notes of oak and spice. The palate is very full and complex, exuding flavors of red cherry and berries, accented by notes of cinnamon and nutmeg. This is a beautifully intense wine that will age wonderfully for many years to come. View More", u'title': u"Bernardus Rosella's Vineyard Pinot Noir", u'price': u'$47.99', u'id': 465202, u'link': u'https://www.wine.com/product/bernardus-rosellas-vineyard-pinot-noir-2011/131978', u'imageUrl': u'https://spoonacular.com/productImages/465202-312x231.jpg'}]}, u'aggregateLikes': 39, u'instructions': u'To easily peel tomatoes, cut an X into the top or bottom of the tomato and place in boiling water for a few minutes remove, let cool slightly and remove skin.Dice tomatoes, place in food processor add tomato paste, chopped peppers, minced garlic, cilantro, salt, onions and oil. Process until mixed.This mixture usually fills my food processor, so I empty this into a bowl; add the can of diced tomatoes and process to chop the tomatoes a little finer. I then put this into first mixture and mix.At this point the salsa is ready to serve, but if left to sit in refrigerator for a few hours the salsa will thicken and the flavours will intensify.This method produces a fine textured salsa. I you like a chunkier salsa, I sometimes place onions, seeded peppers, cilantro, garlic in the processor whole and process until chopped. I then take the tomatoes and pulse them until I have the texture I like.', u'spoonacularSourceUrl': u'https://spoonacular.com/salsa-mexicana-546807', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 15, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}