{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/414684-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 414684, u'veryPopular': False, u'lowFodmap': False, u'title': u'Buttermilk Salad Dressing', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 77.93, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 cups buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cups'}, {u'originalString': u'2 cups fat-free mayonnaise', u'aisle': u'Condiments', u'name': u'fat-free mayonnaise', u'metaInformation': [u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 42193, u'unit': u'cups'}, {u'originalString': u'1/2 cup minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon garlic powder or salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon onion powder or salt', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon coarsely ground or cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'Salad greens', u'aisle': u'Produce', u'name': u'salad greens', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 32.0, u'consistency': u'solid', u'id': 21052, u'unit': u'servings'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/buttermilk-salad-dressing-2', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, combine the first six ingredients; whisk until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cover and chill until serving.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve over salad greens. Store in the refrigerator.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 69, u'instructions': u'Directions                                                                                In a bowl, combine the first six ingredients; whisk until smooth.                                                                                        Cover and chill until serving. Serve over salad greens. Store in the refrigerator.                                        Yield: 4 cups.                                                                                                                         Originally published as Buttermilk Salad Dressing in  Quick CookingJuly/August 1998, p44                                                                                                                                                                                                        Nutritional Facts                                                                             One 2-tablespoon serving of dressing (prepared with garlic and onion powder) equals 19 calories, 125 mg sodium, 1 mg cholesterol, 3 gm carbohydrate, 1 gm protein, trace fat. Diabetic Exchanges: Free.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/buttermilk-salad-dressing-414684', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}