{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/580668-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 580668, u'veryPopular': False, u'lowFodmap': False, u'title': u'Toasted Oatmeal with Strawberry Chia Jam and Coconut Whipped Cream', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 236.63, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'2 to 3 tablespoons honey, maple syrup or agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon chia seeds', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12006, u'unit': u'tablespoon'}, {u'originalString': u'1 to 2 tablespoons coconut oil or butter', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'Optional mix-ins: flax seeds, shredded coconut, toasted nuts, etc.', u'aisle': u'Health Foods;Baking', u'name': u'flax seeds', u'metaInformation': [u'shredded', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10012220, u'unit': u'servings'}, {u'originalString': u'\xbd cup milk (I used light coconut milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'light', u'(I used coconut milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 cups rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'Generous pinch kosher or sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'1 bag (12 ounces) frozen organic strawberries or other berries*', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'frozen', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 9316, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd cups + 2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://cookieandkate.com/2014/toasted-oatmeal-strawberry-chia-jam-coconut-whipped-cream/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"The strawberry chia jam takes the longest to make, so let's start with the jam: In a medium saucepan, combine the berries (no need to defrost if they are frozen) and sweetener. Cover and bring to a simmer over medium heat, stirring frequently. Once the berries are warmed throughout and saucy (5 minutes or more), lightly mash the berries with a potato masher or fork.Reduce the heat to medium low. Stir in the chia seeds and cook, stirring frequently, until the jam is reduced and looking, for lack of better term, jammy (15 to 20 minutes). Note that the jam will further thicken up as it cools.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'id': 12006, u'name': u'chia seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Remove the pan from heat and add more sweetener if you'd like.Make the oatmeal: Melt the coconut oil/butter in a large skillet over medium heat.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the oats and toast over medium heat, stirring occasionally, until they start smelling fragrant and toasty, around 6 to 8 minutes.In a large, heavy bottomed pot, combine the milk, water, salt, cinnamon and ginger. Bring the mixture to a slow boil over medium heat.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the toasted oats and gently stir once or twice to incorporate the oats into the liquid. Cover the pot and turn off the heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/can-opener.jpg', u'id': 404761, u'name': u'can opener'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Let the oats sit on the burner, untouched, for 7 minutes. After 7 minutes, uncover and check the oats. Mine were perfectly done at this point, but if yours are wetter than you'd like, let them continue to absorb water in a covered pot for a few more minutes.Make the coconut whipped cream: Pull out the chilled can of coconut milk and mixing bowl. The coconut cream should have separated from the liquid by now. Flip the can over and open it from the bottom with a can opener.", u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Pour out the coconut water (reserve for smoothies if you'd like).Scoop the solid coconut cream into the chilled bowl. Using an electric hand mixer, beat the cream until fluffy and smooth.", u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sweetener and vanilla extract and gently blend again to combine. Use the coconut cream immediately or cover and store in the fridge for later (it will be soft at room temperature and firm when cold).', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 175, u'instructions': u"The strawberry chia jam takes the longest to make, so let's start with the jam: In a medium saucepan, combine the berries (no need to defrost if they are frozen) and sweetener. Cover and bring to a simmer over medium heat, stirring frequently. Once the berries are warmed throughout and saucy (5 minutes or more), lightly mash the berries with a potato masher or fork.Reduce the heat to medium low. Stir in the chia seeds and cook, stirring frequently, until the jam is reduced and looking, for lack of better term, jammy (15 to 20 minutes). Note that the jam will further thicken up as it cools. Remove the pan from heat and add more sweetener if you'd like.Make the oatmeal: Melt the coconut oil/butter in a large skillet over medium heat. Add the oats and toast over medium heat, stirring occasionally, until they start smelling fragrant and toasty, around 6 to 8 minutes.In a large, heavy bottomed pot, combine the milk, water, salt, cinnamon and ginger. Bring the mixture to a slow boil over medium heat. Add the toasted oats and gently stir once or twice to incorporate the oats into the liquid. Cover the pot and turn off the heat. Let the oats sit on the burner, untouched, for 7 minutes. After 7 minutes, uncover and check the oats. Mine were perfectly done at this point, but if yours are wetter than you'd like, let them continue to absorb water in a covered pot for a few more minutes.Make the coconut whipped cream: Pull out the chilled can of coconut milk and mixing bowl. The coconut cream should have separated from the liquid by now. Flip the can over and open it from the bottom with a can opener. Pour out the coconut water (reserve for smoothies if you'd like).Scoop the solid coconut cream into the chilled bowl. Using an electric hand mixer, beat the cream until fluffy and smooth. Add the sweetener and vanilla extract and gently blend again to combine. Use the coconut cream immediately or cover and store in the fridge for later (it will be soft at room temperature and firm when cold).", u'spoonacularSourceUrl': u'https://spoonacular.com/toasted-oatmeal-with-strawberry-chia-jam-and-coconut-whipped-cream-580668', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}