{u'recipes': [{u'sourceName': u'The Roasted Root', u'cuisines': [u'south american', u'latin american'], u'image': u'https://spoonacular.com/recipeImages/671196-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 671196, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Chimichurri Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 355.28, u'creditText': u'The Roasted Root', u'extendedIngredients': [{u'originalString': u'1 to 1.5 pounds bone-in chicken thighs', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 5091, u'unit': u''}, {u'originalString': u'1 to 1.5 pounds bone-in drumsticks', u'aisle': u'Meat', u'name': u'drumsticks', u'metaInformation': [u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 5066, u'unit': u''}, {u'originalString': u'4 cups fresh flat-leaf parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat leaf parsley leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'cups'}, {u'originalString': u'2 cups fresh cilantro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cups'}, {u'originalString': u'4 cloves garlic, roughly chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbc cup lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'\xbd cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup chimichurri sauce (recipe below), plus more for serving', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'plus more for serving', u'(recipe below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'\xbc cup white onion, finely chopped', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10611282, u'unit': u'cup'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.theroastedroot.net/grilled-chimichurri-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Prepare the chimichurri sauce by adding all of the ingredients to a blender or food processor and blending until desired texture is reached - you can leave the sauce chunky, or blend it until creamy.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the chicken pieces in a large zip lock bag along with 1/2 cup of the chimichurri sauce. Seal the bag and move the chicken around until everything is coated in sauce. Refrigerate at least 15 minutes, up to 12 hours.Preheat your grill to medium-high.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 165.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place chicken pieces on the hot grill, skin-side down and sprinkle with sea salt. Cook until dark grill marks appear, about 5 to 8 minutes. Using tongs, flip the chicken, sprinkle with sea salt, and continue cooking until dark grill marks appear on the other side, about another 5 to 8 minutes. Flip again and continue cooking and flipping until drumsticks reach an internal temperature of 165 degrees F, and thighs reach between 165 and 175 degrees F.If baking instead of grilling, preheat the oven to 375 degrees F.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'id': 5066, u'name': u'chicken drumsticks'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 175.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place marinated chicken in a large casserole dish and bake on the center rack for 45 to 60 minutes, until internal temperature of the chicken reaches 165 to 175 degrees F. To make the skin crispy, place oven on the high broil setting and move the chicken to the second to the top rack. Broil for 1 to 2 minutes until skin crisps up.', u'length': {u'number': 46, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with remaining chimichurri sauce.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place chicken on a serving plate and serve with remaining chimichurri sauce alongside your favorite side dishes.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 361, u'instructions': u'Prepare the chimichurri sauce by adding all of the ingredients to a blender or food processor and blending until desired texture is reached - you can leave the sauce chunky, or blend it until creamy.Place the chicken pieces in a large zip lock bag along with 1/2 cup of the chimichurri sauce. Seal the bag and move the chicken around until everything is coated in sauce. Refrigerate at least 15 minutes, up to 12 hours.Preheat your grill to medium-high. Place chicken pieces on the hot grill, skin-side down and sprinkle with sea salt. Cook until dark grill marks appear, about 5 to 8 minutes. Using tongs, flip the chicken, sprinkle with sea salt, and continue cooking until dark grill marks appear on the other side, about another 5 to 8 minutes. Flip again and continue cooking and flipping until drumsticks reach an internal temperature of 165 degrees F, and thighs reach between 165 and 175 degrees F.If baking instead of grilling, preheat the oven to 375 degrees F. Place marinated chicken in a large casserole dish and bake on the center rack for 45 to 60 minutes, until internal temperature of the chicken reaches 165 to 175 degrees F. To make the skin crispy, place oven on the high broil setting and move the chicken to the second to the top rack. Broil for 1 to 2 minutes until skin crisps up. Serve with remaining chimichurri sauce.Place chicken on a serving plate and serve with remaining chimichurri sauce alongside your favorite side dishes.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-chimichurri-chicken-671196', u'dishTypes': [], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}