{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/225225-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 225225, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lamb & feta burgers with minty yogurt', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 73.26, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tsp cumin seeds', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2014, u'unit': u'tsp'}, {u'originalString': u'1 egg, lightly beaten with a fork', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'with a fork', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'100g feta cheese, cut into 16 cubes', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'cut into 16 cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1019, u'unit': u'g'}, {u'originalString': u'handful parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'2 tsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'500g lamb mince', u'aisle': u'Meat', u'name': u'lamb mince', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'liquid', u'id': 17224, u'unit': u'g'}, {u'originalString': u'small bunch mint, leaves chopped', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'bunch'}, {u'originalString': u'200ml natural yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'natural yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'ml'}, {u'originalString': u'1 red chilli, deseeded and finely chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'deseeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 rosemary sprigs, leaves stripped and chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2036, u'unit': u''}, {u'originalString': u'1 tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}, {u'originalString': u'good 1 tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/8858/lamb-and-feta-burgers-with-minty-yogurt', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'First make the dip by mixing together theyogurt and mint with a little seasoning, thenchill until ready to serve.Tip the lamb mince into a big bowl with thespices, chilli, herbs, Worcestershire sauce andegg. Season, then get your hands in and mixwell. Divide the mixture into 16. Shape intoburgers, pushing a cube of cheese into thecentre of each and sealing in. Chill until justbefore your guests arrive.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 17224, u'name': u'ground lamb'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/fan 180C/gas 6 andheat the oil in a frying pan. Fry the burgersfor 1-2 mins until brown on each side, thentransfer to a baking tray. Put in the oven for5-10 mins until cooked through and pipinghot. Pile onto a big plate and serve with thedip on the side.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Finca La Malena Malbec. Reviewers quite like it with a 5 out of 5 star rating and a price of about 14 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'100% Malbec from eastern Mendoza. Limestone and clay soils, cool winters and warm summers provide great fruit concentration, and smooth tannins. Dark ruby in color reflecting light in an array of orange/purple hues. Pleasant nose filled with hints of red forest fruits and herbs. Young round tannins give it a silky sensuous texture that leads to a rich mouthfeel. Mouthwatering layers of red berries, plum, vanilla and spice open as it warms up, delivering a rich varietal character. A delicate finish that bridges the gap between drinks and lingers well after the last sip.', u'title': u'Finca La Malena Malbec', u'price': u'$13.99', u'id': 431374, u'link': u'https://www.amazon.com/2015-Finca-Malena-Malbec-750mL/dp/B01N9QTXGO', u'imageUrl': u'https://spoonacular.com/productImages/431374-312x231.jpg'}]}, u'aggregateLikes': 95, u'instructions': u'First make the dip by mixing together theyogurt and mint with a little seasoning, thenchill until ready to serve.Tip the lamb mince into a big bowl with thespices, chilli, herbs, Worcestershire sauce andegg. Season, then get your hands in and mixwell. Divide the mixture into 16. Shape intoburgers, pushing a cube of cheese into thecentre of each and sealing in. Chill until justbefore your guests arrive.Heat oven to 200C/fan 180C/gas 6 andheat the oil in a frying pan. Fry the burgersfor 1-2 mins until brown on each side, thentransfer to a baking tray. Put in the oven for5-10 mins until cooked through and pipinghot. Pile onto a big plate and serve with thedip on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/lamb-feta-burgers-with-minty-yogurt-225225', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}