{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/737154-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 737154, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cherry Crumble Bars for Two', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 114.86, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 tablespoon skin-on sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'tablespoon'}, {u'originalString': u'Pinch baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons cherry preserves', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'cherry preserves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-jam.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10619297, u'unit': u'tablespoons'}, {u'originalString': u"2 teaspoons confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons dried cherries, chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cherries', u'metaInformation': [u'dried', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries-dried.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93822, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 tablespoons packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup quick-cooking oats', u'aisle': u'Cereal', u'name': u'quick cooking oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 8402, u'unit': u'cup'}, {u'originalString': u'Pinch fine salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'3 tablespoons unsalted butter, melted, plus some softened for greasing the pan', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted', u'softened', u'for greasing the pan'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/cherry-crumble-bars-for-two.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Special equipment: a mini loaf pan', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Put a small baking sheet on a rack in the lower third of the oven, and preheat to 375 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Cut 1 piece of parchment to fit the bottom of a mini loaf pan so that it climbs halfway up the long ends; butter the paper lightly on the bottom and more heavily on the sides (including the exposed pan).', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the preserves and the cherries in a small bowl.', u'number': 4, u'ingredients': [{u'image': None, u'id': 19297, u'name': u'preserves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Toss the flour, oats, brown sugar, confectioners' sugar, baking soda and salt in a medium bowl.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Drizzle in the melted butter, and mix with a fork until the flour mixture is moistened and starting to clump. Press a loosely packed 1/2 cup of the flour mixture into the bottom of the prepared loaf pan.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Spread the cherry mixture on top.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add the almonds to the remaining flour mixture, and squeeze it to make some larger chunks; sprinkle the almond-flour mixture over the cherry mixture, and press it in lightly.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake the bar on the hot baking sheet until the cherry mixture bubbles and the streusel on top is nicely browned, 24 to 26 minutes.', u'length': {u'number': 24, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the bar cool on a cooling rack until lukewarm, then use the parchment to lift the bar out of the pan. Carefully peel off the parchment, and let the bar cool completely on the rack.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the bar in half on a long diagonal, and serve.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 82, u'instructions': u"Special equipment: a mini loaf pan              Put a small baking sheet on a rack in the lower third of the oven, and preheat to 375 degrees F. Cut 1 piece of parchment to fit the bottom of a mini loaf pan so that it climbs halfway up the long ends; butter the paper lightly on the bottom and more heavily on the sides (including the exposed pan). Combine the preserves and the cherries in a small bowl.                          Toss the flour, oats, brown sugar, confectioners' sugar, baking soda and salt in a medium bowl. Drizzle in the melted butter, and mix with a fork until the flour mixture is moistened and starting to clump. Press a loosely packed 1/2 cup of the flour mixture into the bottom of the prepared loaf pan. Spread the cherry mixture on top. Add the almonds to the remaining flour mixture, and squeeze it to make some larger chunks; sprinkle the almond-flour mixture over the cherry mixture, and press it in lightly.                          Bake the bar on the hot baking sheet until the cherry mixture bubbles and the streusel on top is nicely browned, 24 to 26 minutes. Let the bar cool on a cooling rack until lukewarm, then use the parchment to lift the bar out of the pan. Carefully peel off the parchment, and let the bar cool completely on the rack. Cut the bar in half on a long diagonal, and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-crumble-bars-for-two-737154', u'dishTypes': [u'dessert'], u'occasions': [u"valentine's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}