{u'recipes': [{u'sourceName': u'Gluten Free Recipe Box', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/609972-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 609972, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gluten Free Oreo Cheesecake', u'diets': [], u'pricePerServing': 95.69, u'creditText': u'Gluten Free Recipe Box', u'extendedIngredients': [{u'originalString': u'36 Oreo-style gluten-free cookies recipe or Glutino Chocolate Vanilla Cr\xe8me Cookies, divided', u'aisle': u'Sweet Snacks', u'name': u'chocolate cookies', u'metaInformation': [u'gluten-free', u'oreo-style', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-wafer-cookies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 36.0, u'consistency': u'solid', u'id': 18157, u'unit': u''}, {u'originalString': u'3 packages 8 oz. gluten free cream cheese (Philadelphia), at room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'gluten free', u'at room temperature', u'(Philadelphia)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'packages', u'unitShort': u'packages', u'amount': 3.0, u'consistency': u'solid', u'id': 1017, u'unit': u'packages'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup gluten free sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'gluten free', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'6 Tablespoons unsalted butter or gluten-free margarine, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'gluten-free', u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoons'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://glutenfreerecipebox.com/gluten-free-oreo-cheesecake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat\xa0oven to 350\xb0F.Set aside 10 cookies for later use.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the remaining\xa0cookies to the bowl of your food processor and pulse them into crumbs.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add butter and pulse a few times until a dough forms. Alternatively, you can add the cookies to a gallon ziplock bag and using a rolling pin, crush them. Then add them to a bowl and stir in the butter.Press dough into the bottom and slightly up the sides of a 9-inch springform pan.In the bowl of your mixer, cream together the sugar and cream cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add sour cream and vanilla and beat on medium speed until well combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Add eggs, one at a time, beating on low speed after each addition just until combined.Chop the 10 cookies you have set aside.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add them to the batter and fold in.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake\xa0for\xa045 minutes on center rack of oven. The center should be set (not giggle).\xa0Cover with foil if the top begins to brown. Check on color after about 40 minutes of baking.Loosen the edges with a knife or frosting spatula and allow to cool to room temperature.', u'length': {u'number': 85, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer to a wire rack and run knife around rim of pan and allow to cool.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Remove ring and refrigerate overnight or at least 6 hours.While cheesecake is chilling, make the chocolate ganache as instructed in the link above. Cool until still runny. If you refrigerate it for too long it will set. In that case, just microwave in intervals on low heat until it melts some and stir until it fully melts.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle on each serving plate and on top of each slice, as desired. If you have a squeeze bottle such as a ketchup dispenser, add ganache to it and squeeze out.', u'number': 10, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 86, u'instructions': u'Preheat\xa0oven to 350\xb0F.Set aside 10 cookies for later use. Add the remaining\xa0cookies to the bowl of your food processor and pulse them into crumbs. Add butter and pulse a few times until a dough forms. Alternatively, you can add the cookies to a gallon ziplock bag and using a rolling pin, crush them. Then add them to a bowl and stir in the butter.Press dough into the bottom and slightly up the sides of a 9-inch springform pan.In the bowl of your mixer, cream together the sugar and cream cheese.Add sour cream and vanilla and beat on medium speed until well combined.Add eggs, one at a time, beating on low speed after each addition just until combined.Chop the 10 cookies you have set aside. Add them to the batter and fold in.Bake\xa0for\xa045 minutes on center rack of oven. The center should be set (not giggle).\xa0Cover with foil if the top begins to brown. Check on color after about 40 minutes of baking.Loosen the edges with a knife or frosting spatula and allow to cool to room temperature.Transfer to a wire rack and run knife around rim of pan and allow to cool.Remove ring and refrigerate overnight or at least 6 hours.While cheesecake is chilling, make the chocolate ganache as instructed in the link above. Cool until still runny. If you refrigerate it for too long it will set. In that case, just microwave in intervals on low heat until it melts some and stir until it fully melts. Drizzle on each serving plate and on top of each slice, as desired. If you have a squeeze bottle such as a ketchup dispenser, add ganache to it and squeeze out.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-oreo-cheesecake-609972', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}