{u'recipes': [{u'sourceName': u'Crazy for Crust', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/802994-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 802994, u'veryPopular': False, u'lowFodmap': False, u'title': u'No Bake Peanut Butter Cup Pie', u'diets': [], u'pricePerServing': 86.34, u'creditText': u'Crazy for Crust', u'extendedIngredients': [{u'originalString': u'8 ounces cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1/3 cup creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'Hot fudge ice cream topping, optional', u'aisle': u'Frozen;Condiments', u'name': u'fudge ice cream topping', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 19348, u'unit': u'servings'}, {u'originalString': u'1 Nutter Butter Crust, Oreo Crust, or Graham Cracker Crust', u'aisle': u'Baking', u'name': u'graham cracker crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust-graham-cracker.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18942, u'unit': u''}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 cups peanut butter cups chopped, divided', u'aisle': u'Sweet Snacks', u'name': u'peanut butter cups', u'metaInformation': [u'divided', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 19150, u'unit': u'cups'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces whipped topping (or 3 cups freshly whipped cream)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'(or 3 cups freshly whipped cream)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounces'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.crazyforcrust.com/2016/09/no-bake-peanut-butter-cup-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Beat cream cheese until smooth using a hand mixer.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Mix in granulated sugar and peanut butter, then mix in vanilla, beating until smooth and no lumps remain. Fold in the whipped topping, then stir in 1 1/2 cups of the chopped peanut butter cups.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'id': 19150, u'name': u'peanut butter cups'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Place filling in prepared pie crust. Sprinkle with remaining chopped peanut butter cups and drizzle with hot fudge ice cream topping. Chill at least 4 hours before cutting and serving.Pie lasts up to 3 days in the refrigerator or you can freeze it for up to one month.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'id': 19348, u'name': u'fudge ice cream topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'id': 19150, u'name': u'peanut butter cups'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie can be paired with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Chateau Chantal Late Harvest Riesling. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 21 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': None, u'title': u'Chateau Chantal Late Harvest Riesling', u'price': u'$21.0', u'id': 430249, u'link': u'https://www.amazon.com/Chateau-Chantal-Late-Harvest-Riesling/dp/B00IJI3V3I', u'imageUrl': u'https://spoonacular.com/productImages/430249-312x231.jpg'}]}, u'aggregateLikes': 198, u'instructions': u'Beat cream cheese until smooth using a hand mixer. Mix in granulated sugar and peanut butter, then mix in vanilla, beating until smooth and no lumps remain. Fold in the whipped topping, then stir in 1 1/2 cups of the chopped peanut butter cups.Place filling in prepared pie crust. Sprinkle with remaining chopped peanut butter cups and drizzle with hot fudge ice cream topping. Chill at least 4 hours before cutting and serving.Pie lasts up to 3 days in the refrigerator or you can freeze it for up to one month.', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-peanut-butter-cup-pie-802994', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}