{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/683943-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 683943, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon Spinach Wild Mushroom Risotto', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 163.56, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'1/2 cup arborio, white or basmati rice', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10020444, u'unit': u'cup'}, {u'originalString': u'2 - 4 Tablespoons finely chopped bell pepper', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10211821, u'unit': u'Tablespoons'}, {u'originalString': u'1/2 Tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoon'}, {u'originalString': u'2 - 4 strips lean bacon or Canadian bacon', u'aisle': u'Meat', u'name': u'canadian bacon', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canadian-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 2.0, u'consistency': u'solid', u'id': 10130, u'unit': u'strips'}, {u'originalString': u'1 cup freshly shredded fontina or other flavorful cheese such as Asiago or Dubliner', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1020, u'unit': u'cup'}, {u'originalString': u'2 - 4 cloves garlic, peeled & finely chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 cups sauteed wild mushrooms, chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'wild', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'2 - 4 Tablespoons finely chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'Tablespoons'}, {u'originalString': u'1 1/2 cups fresh chopped spinach leaves', u'aisle': u'Produce', u'name': u'spinach leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'1 1/2 - 2 cups chicken or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1/4 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/bacon-spinach-wild-mushroom-risotto/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Fry the bacon in a saucepan over medium heat, then remove and crumble or chop.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain any excess fat from the pan.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the butter and rice to the pan and cook, stirring constantly, until the rice is lightly brown and smells fragrant and toasted.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Add the bell pepper, onion and garlic.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute, stirring frequently, until the onion is soft and translucent. Stir in the wine and stir and cook until the wine is fully absorbed, then add the broth, 1/2 cup at a time, stirring and cooking each time until the liquid is fully absorbed into the rice before adding more. Continue this until the rice is nearly done, then stir in the mushrooms (with juices) and stir and cook until the mushroom juice is gone, the rice is done and the mixture is nice and creamy. Stir in the spinach and cheese and cook just briefly to melt the cheese and wilt the spinach.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [], u'step': u'Serve hot with extra shredded cheese and snipped chives for garnish.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Risotto. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Santa Margherita Chianti Classico Riserva. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The aromas of this complex red wine range from cherries and plums to gladiolus flowers and earthy flint. The tannic, oak-aged flavors are bright and round, with a dry, warm, earthy finish. Recommended for barbecued meat, like sliced Chianina steak, or with game, such as pheasant stuffed with truffles. It is also excellent with mature cheese.', u'title': u'Santa Margherita Chianti Classico Riserva', u'price': u'$26.99', u'id': 436659, u'link': u'https://www.wine.com/product/santa-margherita-chianti-classico-riserva-2013/167314', u'imageUrl': u'https://spoonacular.com/productImages/436659-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'Fry the bacon in a saucepan over medium heat, then remove and crumble or chop. Drain any excess fat from the pan. Add the butter and rice to the pan and cook, stirring constantly, until the rice is lightly brown and smells fragrant and toasted. Add the bell pepper, onion and garlic. Saute, stirring frequently, until the onion is soft and translucent. Stir in the wine and stir and cook until the wine is fully absorbed, then add the broth, 1/2 cup at a time, stirring and cooking each time until the liquid is fully absorbed into the rice before adding more. Continue this until the rice is nearly done, then stir in the mushrooms (with juices) and stir and cook until the mushroom juice is gone, the rice is done and the mixture is nice and creamy. Stir in the spinach and cheese and cook just briefly to melt the cheese and wilt the spinach.Serve hot with extra shredded cheese and snipped chives for garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-spinach-wild-mushroom-risotto-683943', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}