{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'middl eastern'], u'image': u'https://spoonacular.com/recipeImages/596921-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 596921, u'veryPopular': True, u'lowFodmap': False, u'title': u'Hummus', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 203.87, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 3/4 teaspoons baking soda (if using dried chickpeas)', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [u'dried', u'(if using chickpeas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.75, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'Pinch freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1 1/2 cups dried chickpeas or three 14 1/2-ounce cans chickpeas', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'dried', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 21.0, u'consistency': u'solid', u'id': 16057, u'unit': u'cups'}, {u'originalString': u'1 large garlic clove, finely chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon sweet Hungarian paprika, for garnish', u'aisle': u'Spices and Seasonings', u'name': u'hungarian paprika', u'metaInformation': [u'sweet', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002028, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'Generous 1 1/2 to 2 tablespoons freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons mild-flavored olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons tahini (I prefer the White Dove brand)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini', u'metaInformation': [u'white', u'(I prefer the Dove brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 12698, u'unit': u'tablespoons'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://leitesculinaria.com/94669/recipes-hummus.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 45, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'If using dried chickpeas, dump them in a large bowl and add 3/4 teaspoon baking soda.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}]}, {u'equipment': [], u'step': u'Add enough cold water to cover and let soak overnight at room temperature.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain the chickpeas and transfer them to a large pot with enough water to cover.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [], u'step': u'Add 1 teaspoon baking soda and bring to a boil. Continue to boil until the chickpeas are tender, 45 to 50 minutes. Skim off any floating shells.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [], u'step': u'Drain the chickpeas, reserving 1 cup cooking liquid, and let the chickpeas cool completely. If using canned chickpeas, drain and rinse the chickpeas and commence with step 2.2.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the chickpeas, garlic, reserved liquid if using dried chickpeas or 1 cup  cold water if using canned chickpeas, tahini, lemon juice, 1 1/2 tablespoons olive oil, salt, cumin, and pepper in a food processor and pur\xe9e until smooth and creamy. Plop the hummus on a plate or in a shallow bowl. If desired, cover and refrigerate the hummus for an hour or so. (Just don’t stash the fresh hummus in the fridge for more than a day or so.)3. When ready to serve, drizzle with the remaining 1/2 tablespoon olive oil and sprinkle with the paprika.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'id': 12698, u'name': u'tahini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Hummus. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 578, u'instructions': u'1. If using dried chickpeas, dump them in a large bowl and add 3/4 teaspoon baking soda. Add enough cold water to cover and let soak overnight at room temperature. Drain the chickpeas and transfer them to a large pot with enough water to cover. Add 1 teaspoon baking soda and bring to a boil. Continue to boil until the chickpeas are tender, 45 to 50 minutes. Skim off any floating shells. Drain the chickpeas, reserving 1 cup cooking liquid, and let the chickpeas cool completely. If using canned chickpeas, drain and rinse the chickpeas and commence with step 2.2. Combine the chickpeas, garlic, reserved liquid if using dried chickpeas or 1 cup  cold water if using canned chickpeas, tahini, lemon juice, 1 1/2 tablespoons olive oil, salt, cumin, and pepper in a food processor and pur\xe9e until smooth and creamy. Plop the hummus on a plate or in a shallow bowl. If desired, cover and refrigerate the hummus for an hour or so. (Just don’t stash the fresh hummus in the fridge for more than a day or so.)3. When ready to serve, drizzle with the remaining 1/2 tablespoon olive oil and sprinkle with the paprika.', u'spoonacularSourceUrl': u'https://spoonacular.com/hummus-596921', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}