{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/247458-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 247458, u'veryPopular': True, u'lowFodmap': False, u'title': u'Asparagus Pesto with Pasta', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 394.97, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1 bunch asparagus spears (about 1 lb), trimmed of tough ends and halved crosswise', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'trimmed', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'lb'}, {u'originalString': u'3 handfuls baby spinach leaves', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'handfuls', u'unitShort': u'handfuls', u'amount': 3.0, u'consistency': u'solid', u'id': 11457, u'unit': u'handfuls'}, {u'originalString': u'2 cloves garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Juice of 1/2 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/4 cup extra-virgin olive oil, plus more for topping', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 cup freshly grated Parmesan cheese, plus more for topping', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated', u'plus more for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'8 ounces of dried pasta or 12 ounces fresh -linguini, fettuccini, spaghettiMix spinach pasta with regular wheat pasta for a medley of colors.', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20420, u'unit': u'ounces'}, {u'originalString': u'1 cup pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon fine-grain sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine-grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}], u'healthScore': 84.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/asparagus_pesto_with_pasta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'1 Bring 2 pots of water to a rolling boil, one large for the pasta and one medium sized for the asparagus.2 While the water is heating, put the pine nuts in a single layer in a large skillet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Heat on medium heat, stirring occasionally,  until fragrant and lightly browned.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pine nuts from pan and set aside.  You will use 3/4 cup of the pine nuts for the pesto paste and 1/4 cup to mix in whole. 3 Salt the asparagus water and drop the spears into the pan.  Cook for only 2 or 3 minutes, until the spears are bright green and barely tender.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain under cool water to stop the cooking.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the tips off, and set aside, several of the asparagus (diagonal cut about an inch from the end) to use for garnish. 4', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the asparagus, spinach, garlic, Parmesan, and 3/4 cup of the pine nuts to a food processor.  Pur\xe9e and, with the motor running, drizzle in the 1/4 cup of olive oil until a paste forms.  If too thick, thin it with a bit of the pasta water.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add the lemon juice and salt, taste and adjust seasoning. Here's a trick that Heidi taught me.  When emptying the food processor bowl of its contents, hold the bottom of the bowl with one hand with a finger in the center hole, holding the blade in place and keeping it from falling out. This fresh pasta cooked up in no time at all.5 Salt the pasta water well and cook the pasta until just tender.  Check the directions on the pasta package.  You'll need more time for dried pasta and less for fresh.", u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drain and toss immediately with 1 cup of the asparagus pesto.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Serve sprinkled with the remaining 1/4 cup toasted pine nuts, a dusting of Parmesan, and a light drizzle of olive oil.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1870, u'instructions': u"1 Bring 2 pots of water to a rolling boil, one large for the pasta and one medium sized for the asparagus.2 While the water is heating, put the pine nuts in a single layer in a large skillet.  Heat on medium heat, stirring occasionally,  until fragrant and lightly browned. Remove pine nuts from pan and set aside.  You will use 3/4 cup of the pine nuts for the pesto paste and 1/4 cup to mix in whole. 3 Salt the asparagus water and drop the spears into the pan.  Cook for only 2 or 3 minutes, until the spears are bright green and barely tender.  Drain under cool water to stop the cooking.  Cut the tips off, and set aside, several of the asparagus (diagonal cut about an inch from the end) to use for garnish. 4 Add the asparagus, spinach, garlic, Parmesan, and 3/4 cup of the pine nuts to a food processor.  Pur\xe9e and, with the motor running, drizzle in the 1/4 cup of olive oil until a paste forms.  If too thick, thin it with a bit of the pasta water. Add the lemon juice and salt, taste and adjust seasoning. Here's a trick that Heidi taught me.  When emptying the food processor bowl of its contents, hold the bottom of the bowl with one hand with a finger in the center hole, holding the blade in place and keeping it from falling out. This fresh pasta cooked up in no time at all.5 Salt the pasta water well and cook the pasta until just tender.  Check the directions on the pasta package.  You'll need more time for dried pasta and less for fresh.  Drain and toss immediately with 1 cup of the asparagus pesto.  Serve sprinkled with the remaining 1/4 cup toasted pine nuts, a dusting of Parmesan, and a light drizzle of olive oil.", u'spoonacularSourceUrl': u'https://spoonacular.com/asparagus-pesto-with-pasta-247458', u'dishTypes': [u'condiment', u'dip', u'sauce', u'spread'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}