{u'recipes': [{u'sourceName': u'Fork Knife Swoon', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/572177-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 572177, u'veryPopular': False, u'lowFodmap': False, u'title': u'Summer Vegetable Lasagne', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 186.59, u'creditText': u'Fork Knife Swoon', u'extendedIngredients': [{u'originalString': u'1 baby/small-sized eggplant', u'aisle': u'Produce', u'name': u'baby eggplant', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/japanese-eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011209, u'unit': u''}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tbsp fresh basil, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp fresh thyme, removed from stem and roughly-chopped', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp fresh garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tbsp'}, {u'originalString': u'kosher salt and freshly-ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly-ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'9-12 lasagne noodles (depending on the dimensions of your pan, and to allow for breakage)', u'aisle': u'Pasta and Rice', u'name': u'lasagne noodles', u'metaInformation': [u'for breakage)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'consistency': u'solid', u'id': 10620420, u'unit': u''}, {u'originalString': u'1 tbsp olive oil, plus more for the pasta', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'plus more for the pasta'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 cups skim-milk mozzarella cheese, grated', u'aisle': u'Cheese', u'name': u'skim milk mozzarella cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 42304, u'unit': u'cups'}, {u'originalString': u'15oz skim-milk ricotta cheese', u'aisle': u'Cheese', u'name': u'skim milk ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 93630, u'unit': u'oz'}, {u'originalString': u'4 cups (packed) fresh spinach leaves', u'aisle': u'Produce', u'name': u'spinach leaves', u'metaInformation': [u'fresh', u'packed', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'1 large sweet onion, roughly-chopped', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1 cup Swiss gruyere cheese, grated', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1040, u'unit': u'cup'}, {u'originalString': u'1-1/2 to 2 cups tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11549, u'unit': u'cups'}, {u'originalString': u'1 medium zucchini', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.forkknifeswoon.com/food-drink/main-dishes/2013/09/summer-vegetable-lasagne/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees. Cook the lasagne al dente according to package directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain and toss the noodles with just enough olive oil to lightly coat and avoid sticking. Set aside.Meanwhile, heat the olive oil in a skillet over medium-heat until just shimmering.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the onions and garlic and cook until the onions begin to soften and become translucent, about 3-4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the spinach leaves and cook until the spinach begins to wilt, stirring regularly, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mandoline-slicer.png', u'id': 404687, u'name': u'mandoline'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Remove from the heat.Meanwhile, using a mandoline or a very sharp knife, carefully slice the zucchini and eggplant into rounds, as thin as possible. Set aside.In a mixing bowl, combine the ricotta, half of the Parmesan, the thyme and basil. Season with salt and pepper, to taste.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Add the egg and stir again.Spoon a few tablespoons of the tomato sauce into the bottom of a 9-inch-by-13-inch baking dish, just enough to coat the bottom with a thin layer. Layer a third of the lasagne noodles along the bottom of the pan, and top with a generous layer of sauce. Layer the zucchini and eggplant slices in rows on top of the sauce, overlapping slightly.Divide the ricotta mixture in half, and using your fingers, gently create little clumps in a layer atop the vegetables. Sprinkle a third of the mozzarella and half of the gruyere cheese on top.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add a second layer of lasagne noodles, layer with sauce, and top with the spinach and onions, followed by the remaining ricotta, another third of the mozzarella and the gruyere.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the last layer of lasagne noodles, top with a layer of sauce and the remaining mozzarella and Parmesan. Cover with aluminum foil, and bake for 40-50 minutes until the cheese is fully melted and the lasagne is cooked through. Turn the oven up to 400 degrees, carefully remove the foil, and cook uncovered for an additional 5-10 minutes until the cheese begins to bubble and turn golden brown.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'id': 10620420, u'name': u'lasagne noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and let sit for about 10 minutes before slicing.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm.Can be stored, covered for up to a week in the fridge and also freezes well.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Lasagne on the menu? Try pairing with Montepulciano, Sangiovese, and Chianti. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. The Buccicatino Montepulciano d with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'Dark chocolate and raspberries, harmonious, great palate authority', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 266, u'instructions': u'Preheat the oven to 375 degrees. Cook the lasagne al dente according to package directions. Drain and toss the noodles with just enough olive oil to lightly coat and avoid sticking. Set aside.Meanwhile, heat the olive oil in a skillet over medium-heat until just shimmering. Add the onions and garlic and cook until the onions begin to soften and become translucent, about 3-4 minutes. Add the spinach leaves and cook until the spinach begins to wilt, stirring regularly, about 2 minutes. Remove from the heat.Meanwhile, using a mandoline or a very sharp knife, carefully slice the zucchini and eggplant into rounds, as thin as possible. Set aside.In a mixing bowl, combine the ricotta, half of the Parmesan, the thyme and basil. Season with salt and pepper, to taste. Add the egg and stir again.Spoon a few tablespoons of the tomato sauce into the bottom of a 9-inch-by-13-inch baking dish, just enough to coat the bottom with a thin layer. Layer a third of the lasagne noodles along the bottom of the pan, and top with a generous layer of sauce. Layer the zucchini and eggplant slices in rows on top of the sauce, overlapping slightly.Divide the ricotta mixture in half, and using your fingers, gently create little clumps in a layer atop the vegetables. Sprinkle a third of the mozzarella and half of the gruyere cheese on top.Add a second layer of lasagne noodles, layer with sauce, and top with the spinach and onions, followed by the remaining ricotta, another third of the mozzarella and the gruyere.Add the last layer of lasagne noodles, top with a layer of sauce and the remaining mozzarella and Parmesan. Cover with aluminum foil, and bake for 40-50 minutes until the cheese is fully melted and the lasagne is cooked through. Turn the oven up to 400 degrees, carefully remove the foil, and cook uncovered for an additional 5-10 minutes until the cheese begins to bubble and turn golden brown. Remove from the oven and let sit for about 10 minutes before slicing. Serve warm.Can be stored, covered for up to a week in the fridge and also freezes well.', u'spoonacularSourceUrl': u'https://spoonacular.com/summer-vegetable-lasagne-572177', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}