{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599697-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 599697, u'veryPopular': True, u'lowFodmap': False, u'title': u'TGI Friday’s Nine Layer Dip', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 67.24, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'2 tablespoons sliced black olives', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon finely chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons finely sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup guacamole (frozen or prepared is fine)', u'aisle': u'Refrigerated', u'name': u'guacamole', u'metaInformation': [u'frozen', u'prepared', u'fine', u'( or is )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1009037, u'unit': u'cup'}, {u'originalString': u'2 strips lean bacon', u'aisle': u'Meat', u'name': u'lean bacon', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 2.0, u'consistency': u'solid', u'id': 99006, u'unit': u'strips'}, {u'originalString': u'1 16 ounces can plain refried beans', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'refried beans', u'metaInformation': [u'plain', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16202, u'unit': u'ounces'}, {u'originalString': u'3/4 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon taco seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2073, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup diced tomatoes (about 1 romano tomato)', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'( 1 romano tomato)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.copykat.com/2009/02/02/tgi-fridays-nine-layer-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Fry diced bacon until done; add refried beans and cook slowly, stirring frequently until the bacon and bacon drippings are mixed through (about 15 minutes).', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}]}, {u'equipment': [], u'step': u'Remove from heat and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Mix taco seasoning with sour cream and set aside.To built 9 layer dip, place ingredients in this order:Refried beans, placed on a serving platter and spread out to 1\xf11 1/2 inches thick.shredded cheeseprepared sour cream/taco seasoningguacamolediced tomatoesdiced cilantroblack olivessliced green onion1/4 cup cheese for garnish, if desired', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Serve with crisp corn chips and a very cold beverage of choice. Makes a great snack or light lunch.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are great choices for Dip. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 1890, u'instructions': u'Fry diced bacon until done; add refried beans and cook slowly, stirring frequently until the bacon and bacon drippings are mixed through (about 15 minutes). Remove from heat and set aside. Mix taco seasoning with sour cream and set aside.To built 9 layer dip, place ingredients in this order:Refried beans, placed on a serving platter and spread out to 1\xf11 1/2 inches thick.shredded cheeseprepared sour cream/taco seasoningguacamolediced tomatoesdiced cilantroblack olivessliced green onion1/4 cup cheese for garnish, if desiredServe with crisp corn chips and a very cold beverage of choice. Makes a great snack or light lunch.', u'spoonacularSourceUrl': u'https://spoonacular.com/tgi-fridays-nine-layer-dip-599697', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}