{u'recipes': [{u'sourceName': u'A Cedar Spoon', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/719265-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 6, u'id': 719265, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prosciutto Arugula Pizza', u'diets': [], u'preparationMinutes': 8, u'pricePerServing': 342.16, u'creditText': u'A Cedar Spoon', u'extendedIngredients': [{u'originalString': u'1 cup arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cup'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 lemon, juiced', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 Tablespoons olive oil + 1/2 teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 cup freshly shredded parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups part-skim mozzarella cheese, shredded', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1028, u'unit': u'cups'}, {u'originalString': u'Dash of pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'Dash'}, {u'originalString': u'1 - 12 inch pizza crust', u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 12.0, u'consistency': u'solid', u'id': 93770, u'unit': u'inch'}, {u'originalString': u'1 oz. prosciutto, thinly sliced', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'oz'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.acedarspoon.com/prosciutto-arugula-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 450 degrees.In a small bowl mix together the 1 Tablespoon olive oil and the 2 minced garlic cloves. Using a brush spread the garlic olive oil mixture evenly on top of the pizza crust.Sprinkle the 1 1/2 cup of mozzarella cheese over the pizza crust and bake for 8 to 10 minutes, or until the cheese is bubbly and the crust is just browning.While the pizza cooks mix the arugula, 1/2 teaspoon olive oil, salt, a dash of pepper and lemon juice in a medium mixing bowl. Set aside.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93770, u'name': u'prepared pizza crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the pizza from the oven and sprinkle with a layer of arugula, prosciutto and then the freshly shredded parmesan cheese. Enjoy!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. One wine you could try is Cecchi Sangiovese di Toscana. It has 4.1 out of 5 stars and a bottle costs about 9 dollars.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'The red wine is made according to traditional methods, along with the help of modern technology and with much care. It has a ruby red colour with purple lights, and a delicate fruity bouquet reminiscent of violets and irises. Its good structure, well combined with a moderate acidity, can be distinguished on the palate. Although lacking in sharp tannins, the generous taste of the Sangiovese guarantees a wine that ages well. This wine is pleasant with cold and hot meat dishes and when young should be served at a temperature of 16 \xb0C.', u'title': u'Cecchi Sangiovese di Toscana', u'price': u'$9.49', u'id': 439017, u'link': u'https://www.wine.com/product/cecchi-sangiovese-di-toscana-2000/48873', u'imageUrl': u'https://spoonacular.com/productImages/439017-312x231.jpg'}]}, u'aggregateLikes': 112, u'instructions': u'Preheat the oven to 450 degrees.In a small bowl mix together the 1 Tablespoon olive oil and the 2 minced garlic cloves. Using a brush spread the garlic olive oil mixture evenly on top of the pizza crust.Sprinkle the 1 1/2 cup of mozzarella cheese over the pizza crust and bake for 8 to 10 minutes, or until the cheese is bubbly and the crust is just browning.While the pizza cooks mix the arugula, 1/2 teaspoon olive oil, salt, a dash of pepper and lemon juice in a medium mixing bowl. Set aside.Remove the pizza from the oven and sprinkle with a layer of arugula, prosciutto and then the freshly shredded parmesan cheese. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/prosciutto-arugula-pizza-719265', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 14, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}