{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/463353-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 463353, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Minestrone', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 97.46, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1-1/2 cups shredded cabbage', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11109, u'unit': u'cups'}, {u'originalString': u'1 can (15 ounces) garbanzo beans or chickpeas, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16058, u'unit': u'ounces'}, {u'originalString': u'1 can (16 ounces) kidney beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned kidney beans', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16034, u'unit': u'ounces'}, {u'originalString': u'2 medium carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery ribs, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'2 cups cooked elbow macaroni', u'aisle': u'Pasta and Rice', u'name': u'cooked elbow macaroni', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20400, u'unit': u'cups'}, {u'originalString': u'1-1/4 teaspoons Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoons'}, {u'originalString': u'5 tablespoons shredded Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 medium tomatoes, chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'6 cups reduced-sodium chicken broth or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1 medium zucchini, halved and sliced', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'medium', u'halved', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/easy-minestrone', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'In a 5- or 6-qt. slow cooker, combine the first 11 ingredients. Cook, covered, on low 6-8 hours or until vegetables are tender.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Just before serving, stir in macaroni; heat through.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with cheese.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian on the menu? Try pairing with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Felsina Chianti Colli Senesi with a 4.1 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and  mellow on the palate, with a delightful finish of red fruit and vanilla. View More', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 2116, u'instructions': u'Directions                                                                                In a 5- or 6-qt. slow cooker, combine the first 11 ingredients. Cook, covered, on low 6-8 hours or until vegetables are tender.                                                                                            Just before serving, stir in macaroni; heat through. Serve with cheese.                                        Yield: 10 servings (about 3-1/4 quarts).                                                                                                                         Originally published as Easy Minestrone in  Light & TastyOctober/November 2006, p30                                                                                                                                                                                                        Nutritional Facts                                                                             1-1/3 cups equals 149 calories, 2 g fat (1 g saturated fat), 2 mg cholesterol, 798 mg sodium, 25 g carbohydrate, 6 g fiber, 9 g protein. Diabetic Exchanges: 1 starch, 1 lean meat, 1 vegetable.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-minestrone-463353', u'dishTypes': [u'soup'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 380, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}