{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/687797-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 687797, u'veryPopular': False, u'lowFodmap': False, u'title': u'No Bake Snickers Caramel Apple Pie', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 153.35, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'2 Small Apples, chopped, plus more for garnish', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'small', u'plus more for garnish', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'2 Tablespoons Caramel Sauce, plus more for garnish', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19364, u'unit': u'Tablespoons'}, {u'originalString': u'8 Ounces Cream Cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'Ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'Ounces'}, {u'originalString': u'1 Graham Cracker Pie Crust', u'aisle': u'Baking', u'name': u'graham cracker pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust-graham-cracker.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18942, u'unit': u''}, {u'originalString': u'1\xbd Cup Heavy Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'Cup'}, {u'originalString': u'\xbd Cup Powdered Sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'Cup'}, {u'originalString': u'2 cups Snickers, chopped, plus more for garnish', u'aisle': u'Sweet Snacks', u'name': u'snickers', u'metaInformation': [u'plus more for garnish', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snickers.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19155, u'unit': u'cups'}, {u'originalString': u'Chocolate Sauce for garnish', u'aisle': u'Frozen', u'name': u'chocolate sauce', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10019348, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.ohsweetbasil.com/no-bake-snickers-caramel-apple-pie-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a large mixing bowl, beat the cream until peaks begin to form.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the powdered sugar and beat until peaks are formed. Set aside.In a standing mixer, beat the cream cheese until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add 2-3 Cups of Whipped Cream and mix until smooth.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add in the apples and candy bars and pour into the pie crust. Refrigerate for two hours or up to overnight.Top with candy bar pieces, apples, caramel sauce and chocolate sauce.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'id': 10019348, u'name': u'hot fudge sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Serve!', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 16, u'instructions': u'In a large mixing bowl, beat the cream until peaks begin to form. Add the powdered sugar and beat until peaks are formed. Set aside.In a standing mixer, beat the cream cheese until smooth. Add 2-3 Cups of Whipped Cream and mix until smooth. Add in the apples and candy bars and pour into the pie crust. Refrigerate for two hours or up to overnight.Top with candy bar pieces, apples, caramel sauce and chocolate sauce. Serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-snickers-caramel-apple-pie-687797', u'dishTypes': [], u'occasions': [u'halloween'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}