{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/199350-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199350, u'veryPopular': False, u'lowFodmap': False, u'title': u'Aloo Gobi Kati Roll', u'diets': [u'gluten free'], u'pricePerServing': 93.46, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'Large pinch asafoetida (see note)', u'aisle': u'Spices and Seasonings', u'name': u'asafoetida', u'metaInformation': [u'large', u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032035, u'unit': u'pinch'}, {u'originalString': u'2 teaspoons whole black mustard seed', u'aisle': u'Spices and Seasonings', u'name': u'black mustard seed', u'metaInformation': [u'whole', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2024, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon black pepper, toasted and ground', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons clarified butter or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1 large head of cauliflower, broken into small florets (about 3 cups)', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'small', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11135, u'unit': u'cups'}, {u'originalString': u'2 teaspoons coriander seed, toasted and ground', u'aisle': u'Spices and Seasonings', u'name': u'coriander seed', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2013, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon cumin seed, toasted and ground', u'aisle': u'Spices and Seasonings', u'name': u'cumin seed', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'1 to 2 teaspoons of your favorite ground chile, to taste', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'ground ancho chile', u'metaInformation': [u'to taste', u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022009, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoons'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Mint chutney (or chopped cilantro) to serve', u'aisle': u'Condiments', u'name': u'mint chutney', u'metaInformation': [u'chopped', u'(or cilantro)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint-chutney.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 98991, u'unit': u'servings'}, {u'originalString': u'1 1/2 tablespoons anardana seeds, ground (as well as you can—expect some chunks, see note)', u'aisle': u'Savory Snacks', u'name': u'seeds', u'metaInformation': [u'well', u'(as as you can—expect some chunks, see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 93818, u'unit': u'tablespoons'}, {u'originalString': u'Whole milk yogurt to serve', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk yogurt', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 1118, u'unit': u'servings'}, {u'originalString': u'1 1/2 pounds Yukon Gold potatoes (about 2 large), scrubbed and cut into 1/2-inch dice', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'( 2 large)', u'scrubbed', u'cut into 1/2-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10211362, u'unit': u'pounds'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2010/09/aloo-gobi-kati-roll-indian-street-food-at-home-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Heat butter or oil on medium heat in a 12-inch heavy-bottomed straight-sided stainless steel saut\xe9 until shimmering.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add mustard seed and cook until they begin to pop, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}]}, {u'equipment': [], u'step': u'Add asafoetida, anardana, cumin, coriander, black pepper, chile, and turmeric. Cook, stirring constantly, until fragrant, about 30 seconds.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'id': 1032035, u'name': u'asafoetida'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the potatoes and cauliflower and season generously with salt.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add water to come 1/3 up the sides of the vegetables. Increase heat to high and bring to a boil. Reduce heat to maintain simmer, cover, and cook until potatoes are mostly tender, replenishing water as necessary. Potatoes should still be too tough to eat at this stage.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Remove lid, and increase heat to bring liquid to a rapid simmer and liquid begins to reduce. Scrape bottom of pan with spatula as the potatoes begin to stick, and mash them up against the sides of the pan. Meanwhile, warm the parathas in a dry skillet on medium-low heat, 1-2 minutes per side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'When the potatoes are fully tender, add salt to taste, then set aside to cool slightly.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place 2 to 3 heaping tablespoons in center of warmed paratha, top with yogurt and mint chutney. Wrap in foil and serve, two kati per diner.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint-chutney.png', u'id': 98991, u'name': u'mint chutney'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 8, u'instructions': u'Procedures                                                                              1                                                                            Heat butter or oil on medium heat in a 12-inch heavy-bottomed straight-sided stainless steel saut\xe9 until shimmering. Add mustard seed and cook until they begin to pop, about 2 minutes. Add asafoetida, anardana, cumin, coriander, black pepper, chile, and turmeric. Cook, stirring constantly, until fragrant, about 30 seconds.                                                                                                                            2                                                                            Add the potatoes and cauliflower and season generously with salt. Add water to come 1/3 up the sides of the vegetables. Increase heat to high and bring to a boil. Reduce heat to maintain simmer, cover, and cook until potatoes are mostly tender, replenishing water as necessary. Potatoes should still be too tough to eat at this stage.                                                                                                                            3                                                                            Remove lid, and increase heat to bring liquid to a rapid simmer and liquid begins to reduce. Scrape bottom of pan with spatula as the potatoes begin to stick, and mash them up against the sides of the pan. Meanwhile, warm the parathas in a dry skillet on medium-low heat, 1-2 minutes per side.                                                                                                                             4                                                                            When the potatoes are fully tender, add salt to taste, then set aside to cool slightly. Place 2 to 3 heaping tablespoons in center of warmed paratha, top with yogurt and mint chutney. Wrap in foil and serve, two kati per diner.', u'spoonacularSourceUrl': u'https://spoonacular.com/aloo-gobi-kati-roll-199350', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}