{u'recipes': [{u'sourceName': u'Food52', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/9170-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 9170, u'veryPopular': False, u'lowFodmap': False, u'title': u'And The Beet Goes On', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 271.03, u'creditText': u'Food52', u'extendedIngredients': [{u'originalString': u'3 beets, peeled, halved and sliced to 1/4inch thick', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'thick', u'peeled', u'halved', u'sliced to 1/4inch '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11080, u'unit': u''}, {u'originalString': u'1 cup brussels sprouts, quartered', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11098, u'unit': u'cup'}, {u'originalString': u'3 Tbsps butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsps'}, {u'originalString': u'1 Tbsp chopped chervil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'chervil', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chervil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2008, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp chopped chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11156, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp fresh rosemary, chopped', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'Tbsp'}, {u'originalString': u'1 garlic clove, finely minced or forced through garlic press', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'5 ozs plain goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ozs'}, {u'originalString': u'2 leek2, roughly chopped', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'1 Tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tbsp'}, {u'originalString': u'olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'10 sheets phyllo dough', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 10.0, u'consistency': u'solid', u'id': 18338, u'unit': u'sheets'}, {u'originalString': u'salt & pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.food52.com/recipes/10332_and_the_beet_goes_on', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place beets, leeks and brussels sprout on sheet pan and sprinkle with 2-3 tablespoons of olive oil and rosemary. Season with salt and pepper then, using hands, toss vegetables to coat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Bake for 20-25 minutes or until vegetables are fork-tender.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'While vegetables are roasting, make cheese spread: mix goat cheese, chives, chervil and garlic in a small bowl.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chervil.jpg', u'id': 2008, u'name': u'chervil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add up to 1 tablespoon of milk - this is to make the mixture spreadable. Season with salt and pepper plus a dash of olive oil. Set aside.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Prepare the phyllo crust: place one sheet of dough on greased sheet (or pizza) pan and brush sheet completely with melted butter.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Place next sheet of dough on top, brush with butter and repeat with next 7 sheets of dough (you will have one remaining.)', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Place final sheet of dough on top and brush only outer edges with butter (make about a 3-inch border.)', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Spread the cheese mixture in the middle, being sure the cheese touches the butter border. When vegetables have finished roasting arrange on top of cheese, being sure they are an even layer, then fold edges of dough over filling (to partially enclose the vegetables and cheese.) You can make this fold fancy or keep it in a square shape - your choice.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Brush dough with additional butter and bake for 25 minutes or until pastry is golden brown.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7, u'instructions': u'Preheat oven to 400F. Place beets, leeks and brussels sprout on sheet pan and sprinkle with 2-3 tablespoons of olive oil and rosemary. Season with salt and pepper then, using hands, toss vegetables to coat. Bake for 20-25 minutes or until vegetables are fork-tender.                                   While vegetables are roasting, make cheese spread: mix goat cheese, chives, chervil and garlic in a small bowl. Add up to 1 tablespoon of milk - this is to make the mixture spreadable. Season with salt and pepper plus a dash of olive oil. Set aside.                                  Prepare the phyllo crust: place one sheet of dough on greased sheet (or pizza) pan and brush sheet completely with melted butter. Place next sheet of dough on top, brush with butter and repeat with next 7 sheets of dough (you will have one remaining.)                                   Place final sheet of dough on top and brush only outer edges with butter (make about a 3-inch border.) Spread the cheese mixture in the middle, being sure the cheese touches the butter border. When vegetables have finished roasting arrange on top of cheese, being sure they are an even layer, then fold edges of dough over filling (to partially enclose the vegetables and cheese.) You can make this fold fancy or keep it in a square shape - your choice. Brush dough with additional butter and bake for 25 minutes or until pastry is golden brown. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/and-the-beet-goes-on-9170', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}