{u'recipes': [{u'sourceName': u'A Spicy Perspective', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551846-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 551846, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fruit Cake Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 20.15, u'creditText': u'A Spicy Perspective', u'extendedIngredients': [{u'originalString': u'2 1/2 cups all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 3/4 cup mixed dried fruit, cut into small 1/4 inch pieces', u'aisle': u'Produce;Baking', u'name': u'dried fruit', u'metaInformation': [u'mixed', u'dried', u'small', u'cut into  1/4 inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-orange.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 9426, u'unit': u'cup'}, {u'originalString': u'1 egg + 1 yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 tsp. McCormick ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. McCormick ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/4 tsp. McCormick ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'3-4 Tb. heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 3.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'Tb'}, {u'originalString': u'1 1/4 cups chopped nuts/seeds (I used pecans and pumpkin seeds.)', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'chopped', u'(I used pecans and pumpkin seeds.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 12135, u'unit': u'cups'}, {u'originalString': u'Zest of 1 orange', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 Tb. spiced rum', u'aisle': u'Alcoholic Beverages', u'name': u'spiced rum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10914037, u'unit': u'Tb'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 sticks (1 cup) unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 Tb. McCormick vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'Tb'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 7.0, u'sourceUrl': u'http://www.aspicyperspective.com/2012/12/holiday-cookie-recipes-fruit-cake-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F. Line cookies sheets with parchment paper.Using an electric mixer, cream the butter and sugar until light and fluffy--3-5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u"Add the vanilla, spices, orange zest and egg + extra yolk, beat together. Slowly add the flour until just combined. Don't over mix.Dump the dough onto plastic wrap and wrap the dough well. Refrigerate for at least an hour before rolling out. Once the dough had chilled, flour a clean work surface, and break off a quarter of the dough, leaving the rest in the fridge.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Roll the dough out evenly until 1/4 inch thick.Using a 2 - 2 1/2 inch round cookie cutter cut out the cookies . Use a small 1/2 - 3/4 inch cutter, or small bottle cap to cut out the centers. Collect the leftover dough re-roll and cut.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on prepared cookie sheets, and repeat with the rest of the dough.', u'number': 4, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the powdered sugar, rum and cream together until smooth. Dip the tops of the cookies in glaze (or spread with a small spatula) and place back on the cooling rack.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [], u'step': u'Mix the dried fruit and nuts together and press a small amount of the top of each cookie.Allow the glaze to dry thoroughly before moving.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-fruit-mixed.jpg', u'id': 9426, u'name': u'dried fruit'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'id': 12135, u'name': u'nuts'}]}], u'name': u'Bake the cookies for 6-8 minutes, then allow them to cool on the cookies sheets another 2-3 minutes before moving to a cooling rack. Cool completely before glazing.For the Rum Glaze'}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 403, u'instructions': u"Preheat the oven to 375 degrees F. Line cookies sheets with parchment paper.Using an electric mixer, cream the butter and sugar until light and fluffy--3-5 minutes. Add the vanilla, spices, orange zest and egg + extra yolk, beat together. Slowly add the flour until just combined. Don't over mix.Dump the dough onto plastic wrap and wrap the dough well. Refrigerate for at least an hour before rolling out. Once the dough had chilled, flour a clean work surface, and break off a quarter of the dough, leaving the rest in the fridge. Roll the dough out evenly until 1/4 inch thick.Using a 2 - 2 1/2 inch round cookie cutter cut out the cookies . Use a small 1/2 - 3/4 inch cutter, or small bottle cap to cut out the centers. Collect the leftover dough re-roll and cut. Place on prepared cookie sheets, and repeat with the rest of the dough.Bake the cookies for 6-8 minutes, then allow them to cool on the cookies sheets another 2-3 minutes before moving to a cooling rack. Cool completely before glazing.For the Rum Glaze: Whisk the powdered sugar, rum and cream together until smooth. Dip the tops of the cookies in glaze (or spread with a small spatula) and place back on the cooling rack.Mix the dried fruit and nuts together and press a small amount of the top of each cookie.Allow the glaze to dry thoroughly before moving.", u'spoonacularSourceUrl': u'https://spoonacular.com/fruit-cake-cookies-551846', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 68, u'servings': 60, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}