{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/696539-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 85, u'id': 696539, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Sausage, Fennel & Fontina Pizza', u'diets': [], u'preparationMinutes': 35, u'pricePerServing': 78.38, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 package active dry yeast (2 1/4 teaspoons)', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.25, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'1 cup bread flour or all-purpose flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fine cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 35137, u'unit': u'tablespoons'}, {u'originalString': u'1/2 fennel bulb, cored and very thinly sliced', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'cored', u'very thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'2 links hot Italian turkey sausage (casing removed), cooked and crumbled', u'aisle': u'Meat', u'name': u'italian turkey sausage', u'metaInformation': [u'italian', u'hot', u'crumbled', u'cooked', u'(casing removed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'links', u'unitShort': u'links', u'amount': 2.0, u'consistency': u'solid', u'id': 7927, u'unit': u'links'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 cup shredded fontina cheese or part-skim mozzarella cheese', u'aisle': u'Cheese', u'name': u'part-skim mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1028, u'unit': u'cup'}, {u'originalString': u'1/2 cup prepared tomato sauce or pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup plus 1 tablespoon lukewarm water (105-115\xb0F)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'lukewarm', u'(105-115\xb0F)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 cup whole-wheat pastry flour (see Tips)', u'aisle': u'Baking', u'name': u'whole-wheat pastry flour', u'metaInformation': [u'whole-wheat', u'(see Tips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'cup'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/sausage_fennel_pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To prepare dough: Stir water, yeast and sugar in a large bowl; let stand until the yeast has dissolved, about 5 minutes. Stir in whole-wheat flour, bread flour (or all-purpose flour) and salt until the dough begins to come together.Turn the dough out onto a lightly floured work surface. Knead until smooth and elastic, about 10 minutes. (Alternatively, mix the dough in a food processor or in a stand mixer with a dough hook. Process or mix until it forms a ball. Continue to process until the dough is smooth and elastic, about 1 minute more in a food processor or 4 to 5 minutes more on low speed in a stand mixer.)', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20080, u'name': u'whole wheat flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place the dough in an oiled bowl and turn to coat.Cover with a clean kitchen towel; set aside in a warm, draft-free place until doubled in size, about 1 hour.Position rack in lower third of oven; preheat to 450F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Brush oil over a large baking sheet. Sprinkle the baking sheet with cornmeal to coat evenly.Sprinkle flour over work surface.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll out the dough to the size of the baking sheet (see Tips) and transfer to the baking sheet. Cover the dough with sauce. Scatter with sausage and fennel and sprinkle with cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}]}, {u'equipment': [], u'step': u'Bake until the crust is crispy and the cheese is melted and starting to brown, 15 to 20 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 93, u'instructions': u'To prepare dough: Stir water, yeast and sugar in a large bowl; let stand until the yeast has dissolved, about 5 minutes. Stir in whole-wheat flour, bread flour (or all-purpose flour) and salt until the dough begins to come together.Turn the dough out onto a lightly floured work surface. Knead until smooth and elastic, about 10 minutes. (Alternatively, mix the dough in a food processor or in a stand mixer with a dough hook. Process or mix until it forms a ball. Continue to process until the dough is smooth and elastic, about 1 minute more in a food processor or 4 to 5 minutes more on low speed in a stand mixer.) Place the dough in an oiled bowl and turn to coat.Cover with a clean kitchen towel; set aside in a warm, draft-free place until doubled in size, about 1 hour.Position rack in lower third of oven; preheat to 450F. Brush oil over a large baking sheet. Sprinkle the baking sheet with cornmeal to coat evenly.Sprinkle flour over work surface. Roll out the dough to the size of the baking sheet (see Tips) and transfer to the baking sheet. Cover the dough with sauce. Scatter with sausage and fennel and sprinkle with cheese. Bake until the crust is crispy and the cheese is melted and starting to brown, 15 to 20 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-sausage-fennel-fontina-pizza-696539', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}