{u'recipes': [{u'sourceName': u'Kirbie Cravings', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/228513-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 228513, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cookies and Cream Mug Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 220.51, u'creditText': u'Kirbie Cravings', u'extendedIngredients': [{u'originalString': u'1/8 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'5 1/2 tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.5, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'1 cup of heavy whipped cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'3 tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'3 oreos, crushed into fine pieces (I ran mine through a food processor. the cookie must be crushed enough so that it fits through the piping tip)', u'aisle': u'Sweet Snacks', u'name': u'oreos', u'metaInformation': [u'crushed', u'fine', u'(I ran mine through a food processor. the cookie must be enough so that it fits through the piping tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'2 1/2 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://kirbiecravings.com/2012/03/cookies-and-cream-mug-cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 73, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u"Mix all ingredients for the cake in an oversized mug except the oreos. After batter is smooth, add in the oreos and crush oreos into batter with a metal spoon. Cook for approximately 1 1/2 minutes in microwave. Check on middle of cake. If not done, cook for about 20 more seconds. Careful not to overcook or cake becomes rubbery. Mine was done at 1 1/2 minutes.2. While cake is cooling, making the frosting. Whip the heavy cream and sugar on high speed. Crush oreos separately in a food processor. Oreo crumbs must be fine enough that they fit through piping tip if you are piping the frosting. After the heavy cream becomes thick and forms peaks, gently fold in the crushed oreos before placing frosting into piping bag. The recipe makes more frosting than needed for one serving but it's hard to make a one serving frosting.", u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1307, u'instructions': u"1. Mix all ingredients for the cake in an oversized mug except the oreos. After batter is smooth, add in the oreos and crush oreos into batter with a metal spoon. Cook for approximately 1 1/2 minutes in microwave. Check on middle of cake. If not done, cook for about 20 more seconds. Careful not to overcook or cake becomes rubbery. Mine was done at 1 1/2 minutes.2. While cake is cooling, making the frosting. Whip the heavy cream and sugar on high speed. Crush oreos separately in a food processor. Oreo crumbs must be fine enough that they fit through piping tip if you are piping the frosting. After the heavy cream becomes thick and forms peaks, gently fold in the crushed oreos before placing frosting into piping bag. The recipe makes more frosting than needed for one serving but it's hard to make a one serving frosting.", u'spoonacularSourceUrl': u'https://spoonacular.com/cookies-and-cream-mug-cake-228513', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}