{u'recipes': [{u'sourceName': u'Amuse Your Bouche', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/578346-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 578346, u'veryPopular': True, u'lowFodmap': False, u'title': u'Broccoli and feta fritters', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 156.17, u'creditText': u'Amuse Your Bouche', u'extendedIngredients': [{u'originalString': u'Black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'110g broccoli', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 110.0, u'consistency': u'solid', u'id': 11090, u'unit': u'g'}, {u'originalString': u'2 medium eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'70g feta, crumbled', u'aisle': u'Cheese', u'name': u'feta', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 70.0, u'consistency': u'solid', u'id': 1019, u'unit': u'g'}, {u'originalString': u'2tbsp fresh parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Fresh lemon, to serve', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'4tbsp oil for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'70g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 70.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.amuse-your-bouche.com/broccoli-feta-fritters/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the broccoli up a little, and steam for 5-10 minutes until fairly tender.Meanwhile, beat the eggs in a large bowl and mix in the flour, crumbled feta, minced garlic and chopped parsley, and season well.When the broccoli is cooked, chop it pretty finely and add it to the rest of the fritter batter.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [], u'step': u'Mix well.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Heat the oil in a frying pan until it's at the point that it sizzles when you add a small drop of batter. Spoon the batter into four fritter shapes, pressing the mixture down a little so they don't end up too thick. Cook for a few minutes until the underside is golden brown (you shouldn't need to poke them around too much, just once or twice to check they're not sticking). Flip them over and cook the other side in the same way, until golden brown.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Place the fritters on a few sheets of kitchen paper to drain any excess oil before serving with a small squeeze of lemon juice, if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1507, u'instructions': u"Cut the broccoli up a little, and steam for 5-10 minutes until fairly tender.Meanwhile, beat the eggs in a large bowl and mix in the flour, crumbled feta, minced garlic and chopped parsley, and season well.When the broccoli is cooked, chop it pretty finely and add it to the rest of the fritter batter. Mix well.Heat the oil in a frying pan until it's at the point that it sizzles when you add a small drop of batter. Spoon the batter into four fritter shapes, pressing the mixture down a little so they don't end up too thick. Cook for a few minutes until the underside is golden brown (you shouldn't need to poke them around too much, just once or twice to check they're not sticking). Flip them over and cook the other side in the same way, until golden brown.Place the fritters on a few sheets of kitchen paper to drain any excess oil before serving with a small squeeze of lemon juice, if desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/broccoli-and-feta-fritters-578346', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}