{u'recipes': [{u'sourceName': u'My Whole Food Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/496179-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 496179, u'veryPopular': False, u'lowFodmap': True, u'title': u'Nut Free Truffles', u'diets': [u'caveman', u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 20, u'pricePerServing': 73.33, u'creditText': u'My Whole Food Life', u'extendedIngredients': [{u'originalString': u'1/4 cup mini chocolate chips (Enjoy Life chips are nut, dairy and soy free)', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'mini', u'(Enjoy Life chips are nut, dairy and soy free)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'1 cup chocolate chips (Enjoy Life are nut, dairy and soy free)', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'(Enjoy Life are nut, dairy and soy free)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u"2 T coconut flour (or another flour if you can't have coconut)", u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [u"(or another flour if you can't have coconut)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93747, u'unit': u'T'}, {u'originalString': u'2 T maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'T'}, {u'originalString': u'1/4 cup flax milk', u'aisle': u'Health Foods;Baking', u'name': u'flax', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10012220, u'unit': u'cup'}, {u'originalString': u'1/4 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'1 cup sunflower butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'sunflower butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98928, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://mywholefoodlife.com/2014/05/05/nut-free-truffles/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'In a food processor, combine the sunflower butter, maple syrup, coconut flour and sea salt. Blend together for a minute, then add in the chocolate chips and pulse a few more times to mix them in well. Form truffles into balls and place onto a lined baking sheet.  I used a cookie scoop for mine. Stick the baking sheet in the freezer for an hour.  Using a double boiler method, (see notes) melt the chocolate and the milk until everything is smooth and blended together.Using two forks, roll the truffles into the chocolate and coat each one completely.  Then place them back on the baking sheet. Stick in the freezer for another hour or so.  Once the chocolate has firmed back up, you can store these in the fridge.  They should last several weeks in the fridge and longer in the freezer.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 98928, u'name': u'sunflower seed butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'id': 93747, u'name': u'coconut flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 329, u'instructions': u'In a food processor, combine the sunflower butter, maple syrup, coconut flour and sea salt. Blend together for a minute, then add in the chocolate chips and pulse a few more times to mix them in well. Form truffles into balls and place onto a lined baking sheet.  I used a cookie scoop for mine. Stick the baking sheet in the freezer for an hour.  Using a double boiler method, (see notes) melt the chocolate and the milk until everything is smooth and blended together.Using two forks, roll the truffles into the chocolate and coat each one completely.  Then place them back on the baking sheet. Stick in the freezer for another hour or so.  Once the chocolate has firmed back up, you can store these in the fridge.  They should last several weeks in the fridge and longer in the freezer.', u'spoonacularSourceUrl': u'https://spoonacular.com/nut-free-truffles-496179', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}