{u'recipes': [{u'sourceName': u'Mels Kitchen Caf\xe9', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/569723-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 569723, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chewy Granola Bars', u'diets': [], u'pricePerServing': 30.84, u'creditText': u'Mels Kitchen Caf\xe9', u'extendedIngredients': [{u'originalString': u'4 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup mini chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'1/4 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1/4 cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 cups quick cooking oats', u'aisle': u'Cereal', u'name': u'quick cooking oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 8402, u'unit': u'cups'}, {u'originalString': u'1 cup rice krispies cereal', u'aisle': u'Cereal', u'name': u'rice krispies cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8065, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.melskitchencafe.com/chewy-granola-bars/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Lightly coat a 9X11-inch pan with cooking spray and set aside. If you don't have a pan that size, use a similar sized pan, like a 8X12-inch. This recipe is a bit small for a 9X13-inch pan but if that's all you have, just pack the granola bar mixture into a smaller portion of the pan - the mixture doesn't spread so that should work fine.In a large bowl, stir together the oats and rice krispies. Set aside. In a small saucepan, combine the butter, honey and brown sugar. Cook over medium heat until the butter melts and the mixture comes together, stirring frequently. Cook at a simmer (so the mixture is lightly bubbling) for 2 minutes.", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Remove from the heat and stir in the vanilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Pour the wet mixture over the oats/rice krispies and mix with a wooden spoon until evenly moistened. Press the mixture into the prepared pan, pressing down very firmly. If the mixture isn't pressed down well enough, the bars will be crumbly once they cool. Sprinkle the mini chocolate chips on top. Press lightly if you want them to stick to the bars. Mine tended to fall off, which was just fine since there were a lot of little fingers ready to eagerly pick them up and eat them anyway.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'mini chocolate chips'}]}, {u'equipment': [], u'step': u'Let the bars cool for at least 2 hours at room temperature.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into rectangles. Store well covered at room temperature for 2-3 days.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 164, u'instructions': u"Lightly coat a 9X11-inch pan with cooking spray and set aside. If you don't have a pan that size, use a similar sized pan, like a 8X12-inch. This recipe is a bit small for a 9X13-inch pan but if that's all you have, just pack the granola bar mixture into a smaller portion of the pan - the mixture doesn't spread so that should work fine.In a large bowl, stir together the oats and rice krispies. Set aside. In a small saucepan, combine the butter, honey and brown sugar. Cook over medium heat until the butter melts and the mixture comes together, stirring frequently. Cook at a simmer (so the mixture is lightly bubbling) for 2 minutes. Remove from the heat and stir in the vanilla.Pour the wet mixture over the oats/rice krispies and mix with a wooden spoon until evenly moistened. Press the mixture into the prepared pan, pressing down very firmly. If the mixture isn't pressed down well enough, the bars will be crumbly once they cool. Sprinkle the mini chocolate chips on top. Press lightly if you want them to stick to the bars. Mine tended to fall off, which was just fine since there were a lot of little fingers ready to eagerly pick them up and eat them anyway. Let the bars cool for at least 2 hours at room temperature. Cut into rectangles. Store well covered at room temperature for 2-3 days.", u'spoonacularSourceUrl': u'https://spoonacular.com/chewy-granola-bars-569723', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}