{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507535-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 507535, u'veryPopular': True, u'lowFodmap': False, u'title': u'Snowball Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 18.5, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 cups finely chopped pecans, divided', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'divided', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'\xbe teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup (8 ounces) unsalted butter, softened but still cool', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}, {u'originalString': u'1\xbd teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.browneyedbaker.com/2012/12/13/snowball-cookies-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees F and adjust the oven racks to the upper- and lower-middle positions. Line two baking sheets with parchment paper or silicone baking mats. 2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the flour, 1 cup of the chopped pecans, and the salt in a medium bowl; set aside.3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 10012142, u'name': u'pecan pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the remaining chopped nuts in a food processor and process until they are the texture of coarse cornmeal, 10 to 15 seconds; stir into the flour mixture and set aside.4. Cream the butter and sugar together on medium speed until light and fluffy, about 2 minutes. Beat in the vanilla, then scrape the sides of the bowl.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the flour mixture and beat on low speed until the dough just begins to come together but still looks scrappy, about 15 seconds. Scrape the sides of the bowl again and continue beating at low speed until the dough is cohesive, about 10 more seconds. 5.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll a heaping tablespoon of dough between the palms of your hands and place on the prepared baking sheets. The cookies will only spread a little bit, so you can place them fairly close together.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake until the tops are pale golden and the bottoms are just beginning to brown, 17 to 19 minutes, rotating the baking sheets front to back and top to bottom halfway through the baking time. 6. Cool the cookies on the baking sheets for 2 minutes, then transfer them to a wire cooling rack and allow to cool to room temperature, about 30 minutes. 7.', u'length': {u'number': 49, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Place the powdered sugar in a large zip-top bag. Working with 3 or 4 cookies at a time, place them in the bag of sugar and gently toss to coat them thoroughly. Gently shake off any excess. Allow the cookies to sit for at least an hour, or up to overnight, and then repeat the process. Cookies can be stored in an airtight container at room temperature for up to 5 days.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 4480, u'instructions': u'1. Preheat oven to 325 degrees F and adjust the oven racks to the upper- and lower-middle positions. Line two baking sheets with parchment paper or silicone baking mats. 2. Mix the flour, 1 cup of the chopped pecans, and the salt in a medium bowl; set aside.3. Place the remaining chopped nuts in a food processor and process until they are the texture of coarse cornmeal, 10 to 15 seconds; stir into the flour mixture and set aside.4. Cream the butter and sugar together on medium speed until light and fluffy, about 2 minutes. Beat in the vanilla, then scrape the sides of the bowl. Add the flour mixture and beat on low speed until the dough just begins to come together but still looks scrappy, about 15 seconds. Scrape the sides of the bowl again and continue beating at low speed until the dough is cohesive, about 10 more seconds. 5. Roll a heaping tablespoon of dough between the palms of your hands and place on the prepared baking sheets. The cookies will only spread a little bit, so you can place them fairly close together. Bake until the tops are pale golden and the bottoms are just beginning to brown, 17 to 19 minutes, rotating the baking sheets front to back and top to bottom halfway through the baking time. 6. Cool the cookies on the baking sheets for 2 minutes, then transfer them to a wire cooling rack and allow to cool to room temperature, about 30 minutes. 7. Place the powdered sugar in a large zip-top bag. Working with 3 or 4 cookies at a time, place them in the bag of sugar and gently toss to coat them thoroughly. Gently shake off any excess. Allow the cookies to sit for at least an hour, or up to overnight, and then repeat the process. Cookies can be stored in an airtight container at room temperature for up to 5 days.', u'spoonacularSourceUrl': u'https://spoonacular.com/snowball-cookies-507535', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}