{u'recipes': [{u'sourceName': u'Peanut Butter and Peepers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511139-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 511139, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Tri Tip with Roasted Peppers and Onions Sandwich', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 251.78, u'creditText': u'Peanut Butter and Peepers', u'extendedIngredients': [{u'originalString': u'1 french baguette roll, hollow out the middle', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'1 oz banana peppers', u'aisle': u'Canned and Jarred', u'name': u'banana peppers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 11976, u'unit': u'oz'}, {u'originalString': u'1 tbsp. BBQ Sauce (your favorite)', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'your favorite', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'tbsp'}, {u'originalString': u'1 medium green bell pepper, seeded, cut into chunks', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium', u'seeded', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1/2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 medium onion, peeled, cut into chunks', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'peeled', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 cup peppers and onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 large red bell pepper, seeded cut into chunks', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'large', u'seeded', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'Salt & pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 7.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 oz tri tip steak, cooked', u'aisle': u'Meat', u'name': u'tri tip steak', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 10013954, u'unit': u'oz'}, {u'originalString': u'1.81 lbs. Boneless Beef Tri Tip Roast', u'aisle': u'Meat', u'name': u'tri-tip roast', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.81, u'consistency': u'solid', u'id': 13958, u'unit': u'lbs'}, {u'originalString': u'1 large yellow bell pepper, seeded, cut into chunks', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'large', u'seeded', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}, {u'originalString': u'1 oz jalapeno cheese, fat free', u'aisle': u'?', u'name': u'jalapeno cheese', u'metaInformation': [u'fat free'], u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'unit': u'oz'}, {u'originalString': u'1 1/2 tbsp Miners Mix Original Steak Seasonings and Rub', u'aisle': u'?', u'name': u'miners mix original steak seasonings and rub', u'metaInformation': [], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'unit': u'tbsp'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.peanutbutterandpeppers.com/2013/05/29/grilled-tri-tip-with-roasted-peppers-and-onions-sandwich/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'The night before roasting rub your beef with your seasoning rub.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place in plastic wrap or a large baggie and place back in the refrigerator.The next day, about 30 minutes before your ready to grill your beef, take it out of the refrigerator and let it rest at room temperature. In the mean time, rub some olive oil on your grill grates and set the heat to medium.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place tri tip on grill, and cook over medium heat. After 5 minutes. flip the steak. Cook for 15 minutes, flip steak. Cook until internal temperature reaches 155 for medium or 160 for well done.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place steak on a plate and let it rest for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/skewer-metal.jpg', u'id': 404712, u'name': u'metal skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Cut steak thin against the grain.To prepare the onions and peppers, skewer them on a a metal skewer or if you use a wooden one, soak the skewers in water for 20 minutes. Skewer the vegetables rotating between the colors.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Brush with olive oil and salt and pepper, if desired.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place vegetables over low heat on the grill, and rotate every 5 minutes until lightly charred.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve a long side of the steak.To make sandwich, place peppers, onions and banana peppers on the bottom roll, top with steak and cheese.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'id': 11976, u'name': u'banana pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Place in the broil and cook just until bread starts to turn lightly golden and cheese has softened, about 2 minutes. Top with barbecue sauce.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}], u'name': u''}], u'aggregateLikes': 170, u'instructions': u'The night before roasting rub your beef with your seasoning rub. Place in plastic wrap or a large baggie and place back in the refrigerator.The next day, about 30 minutes before your ready to grill your beef, take it out of the refrigerator and let it rest at room temperature. In the mean time, rub some olive oil on your grill grates and set the heat to medium.Place tri tip on grill, and cook over medium heat. After 5 minutes. flip the steak. Cook for 15 minutes, flip steak. Cook until internal temperature reaches 155 for medium or 160 for well done.Place steak on a plate and let it rest for 5 minutes. Cut steak thin against the grain.To prepare the onions and peppers, skewer them on a a metal skewer or if you use a wooden one, soak the skewers in water for 20 minutes. Skewer the vegetables rotating between the colors. Brush with olive oil and salt and pepper, if desired. Place vegetables over low heat on the grill, and rotate every 5 minutes until lightly charred. Serve a long side of the steak.To make sandwich, place peppers, onions and banana peppers on the bottom roll, top with steak and cheese. Place in the broil and cook just until bread starts to turn lightly golden and cheese has softened, about 2 minutes. Top with barbecue sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-tri-tip-with-roasted-peppers-and-onions-sandwich-511139', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 7, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}