{u'recipes': [{u'sourceName': u"Swasthi's Recipes", u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/665986-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 665986, u'veryPopular': False, u'lowFodmap': True, u'title': u'biryani masala powder', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30', u'vegan'], u'pricePerServing': 49.37, u'creditText': u"Swasthi's Recipes", u'extendedIngredients': [{u'originalString': u'1 Mace flower or strands from 1 flower', u'aisle': u'Gourmet', u'name': u'banana flower', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/banana-blossoms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 98987, u'unit': u''}, {u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 Black cardamom', u'aisle': u'Spices and Seasonings', u'name': u'cardamom', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2006, u'unit': u''}, {u'originalString': u'6 Green cardamom', u'aisle': u'Spices and Seasonings', u'name': u'cardamom', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 2006, u'unit': u''}, {u'originalString': u'5 two inch cinnamon sticks', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon sticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'4 tbsps Coriander seeds', u'aisle': u'Spices and Seasonings', u'name': u'coriander seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2013, u'unit': u'tbsps'}, {u'originalString': u'3 medium sized stone flowers/ kalpaasi / dagad phool', u'aisle': u'Produce', u'name': u'squash flowers', u'metaInformation': [u'medium sized'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/squash-blossoms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11416, u'unit': u''}, {u'originalString': u'1 \xbd tsp saunf / fennel seeds / sompu/ sombhu', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2018, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp grated Nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1 tsp. Peppercorn', u'aisle': u'Spices and Seasonings', u'name': u'peppercorn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'tsp'}, {u'originalString': u'2 star anise', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}, {u'originalString': u'2 tbsps Shahi jeera', u'aisle': u'?', u'name': u'shahi jeera', u'metaInformation': [], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'unit': u'tbsps'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://indianhealthyrecipes.com/homemade-biryani-masala-powder/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Clean up the spices one after the other to pick and discard stones and debris', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'On a low flame, dry roast the spices each separately and cool them or Sun dry for a day or two till they turn crisp', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Blend them or mill them to a fine powder. Sieve and store in an airtight glass jar', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Use as needed while making vegetable biryani or chicken biryani. 1 tsp per cup of rice makes a good aromatic biryani', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Biryani can be paired with Gruener Veltliner, Riesling, and Sparkling ros\xe9. The best wine for Indian food will depending on the dish, of course, but these picks can be served chilled and have some sweetness to complement the spiciness and complex flavors of a wide variety of traditional dishes. The Laurenz V Singing Gruner Veltliner with a 4.4 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'gruener veltliner', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'A very attractive fruit bouquet yields apple, peach and citrus aromas along with a typical Veltliner spiciness and a touch of white pepper. The soft and juicy palate is supported by fine acidity. It sings on the palate!', u'title': u'Laurenz V Singing Gruner Veltliner', u'price': u'$16.49', u'id': 434576, u'link': u'https://www.wine.com/product/laurenz-v-singing-gruner-veltliner-2007/99150', u'imageUrl': u'https://spoonacular.com/productImages/434576-312x231.jpg'}]}, u'aggregateLikes': 73, u'instructions': u'<p>Clean up the spices one after the other to pick and discard stones and debris</p><p>On a low flame, dry roast the spices each separately and cool them or Sun dry for a day or two till they turn crisp</p><p>Blend them or mill them to a fine powder. Sieve and store in an airtight glass jar</p><p>Use as needed while making vegetable biryani or chicken biryani. 1 tsp per cup of rice makes a good aromatic biryani</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/biryani-masala-powder-665986', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}