{u'recipes': [{u'sourceName': u'So Very Blessed', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598542-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 598542, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rodeo Cheeseburgers', u'diets': [], u'pricePerServing': 280.56, u'creditText': u'So Very Blessed', u'extendedIngredients': [{u'originalString': u'barbecue sauce', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}, {u'originalString': u'3 Tbs breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 3.0, u'consistency': u'solid', u'id': 18079, u'unit': u'Tbs'}, {u'originalString': u'4 slices cheddar cheese', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1009, u'unit': u'slices'}, {u'originalString': u'1 tsp minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'1 lb ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'4 hamburger buns', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'16 frozen onion rings, baked', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/8 tsp each of salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1102047, u'unit': u'tsp'}, {u'originalString': u'2 Tbs steak sauce', u'aisle': u'Condiments', u'name': u'steak sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 27048, u'unit': u'Tbs'}, {u'originalString': u'1 tsp Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tsp'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.soveryblessed.com/2013/05/28/rodeo-cheeseburgers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Mix together the meat, breadcrumbs, steak sauce, Worcestershire, garlic, and salt & pepper.Divide mixture into 4 even pieces and shape each piece into a patty.Grill, covered, over high heat for 5-8 minutes per side, or until meat temperature reaches 160 degrees.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 27048, u'name': u'steak sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place one slice of cheese on each burger, close the cover on the grill, and let the cheese melt for about a minute.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove patties from grill.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place each patty on a bun, top with 4 onion rings, and drizzle with barbecue sauce.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Tikal Amorio Malbec. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 28 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Aromas of smoky oak and cherry. Mouthwatering, penetrating flavors of ripe red and black cherries, red berries. Quite rich and velvety on the palate, and finishes with just enough grip to make it a real winner with food. This is some seriously sexy Malbec. Pairs well with grilled or smoked meats such as beef, pork, and lamb. Also complements dishes prepared with cheese or cream sauces.', u'title': u'Tikal Amorio Malbec', u'price': u'$27.99', u'id': 444771, u'link': u'https://www.wine.com/product/tikal-amorio-malbec-2008/104742', u'imageUrl': u'https://spoonacular.com/productImages/444771-312x231.jpg'}]}, u'aggregateLikes': 431, u'instructions': u'Mix together the meat, breadcrumbs, steak sauce, Worcestershire, garlic, and salt & pepper.Divide mixture into 4 even pieces and shape each piece into a patty.Grill, covered, over high heat for 5-8 minutes per side, or until meat temperature reaches 160 degrees.Place one slice of cheese on each burger, close the cover on the grill, and let the cheese melt for about a minute.Remove patties from grill.Place each patty on a bun, top with 4 onion rings, and drizzle with barbecue sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/rodeo-cheeseburgers-598542', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}