{u'recipes': [{u'sourceName': u'My Baking Heart', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508508-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 508508, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ms. Pam’s ‘Tomato Pie’', u'diets': [], u'pricePerServing': 160.75, u'creditText': u'My Baking Heart', u'extendedIngredients': [{u'originalString': u'4 oz yellow cheddar', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1009, u'unit': u'oz'}, {u'originalString': u'1 deep dish pie shell', u'aisle': u'Refrigerated;Frozen', u'name': u'deep dish pie shell', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18945, u'unit': u''}, {u'originalString': u'2 tbsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tbsp'}, {u'originalString': u'1 c light mayonnaise', u'aisle': u'Condiments', u'name': u'light mayonnaise', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4641, u'unit': u'c'}, {u'originalString': u'3/4 c Parmesan, shredded', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1033, u'unit': u'c'}, {u'originalString': u'Salt & pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 md homegrown tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'4 oz white cheddar', u'aisle': u'Cheese', u'name': u'white cheddar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-block.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1011009, u'unit': u'oz'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://mybakingheart.com/2012/07/11/ms-pams-tomato-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a medium pot of water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u"Remove stems and score tomatoes. Blanch them in the boiling water for a minute or two, watching carefully, making sure they don't begin to cook.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Remove the tomatoes from the boiling water and shock them in an ice bath.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove the skins and discard. Slice tomatoes and drain the excess liquid. Sprinkle with salt and pepper, to taste.Preheat oven to 350 degrees F.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Brush the bottom and sides of your pie shell with the Dijon mustard. Layer tomatoes in the shell and sprinkle with both the white and yellow cheddars.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Mix together the mayonnaise and shredded Parmesan, then spread the mixture on top of the tomatoes and cheese.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Bake the pie for 30 minutes, or until the topping is brown and bubbly.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Chateau Chantal Late Harvest Riesling with a 4.5 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': None, u'title': u'Chateau Chantal Late Harvest Riesling', u'price': u'$21.0', u'id': 430249, u'link': u'https://www.amazon.com/Chateau-Chantal-Late-Harvest-Riesling/dp/B00IJI3V3I', u'imageUrl': u'https://spoonacular.com/productImages/430249-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u"Bring a medium pot of water to a boil. Remove stems and score tomatoes. Blanch them in the boiling water for a minute or two, watching carefully, making sure they don't begin to cook. Remove the tomatoes from the boiling water and shock them in an ice bath. Remove the skins and discard. Slice tomatoes and drain the excess liquid. Sprinkle with salt and pepper, to taste.Preheat oven to 350 degrees F. Brush the bottom and sides of your pie shell with the Dijon mustard. Layer tomatoes in the shell and sprinkle with both the white and yellow cheddars. Mix together the mayonnaise and shredded Parmesan, then spread the mixture on top of the tomatoes and cheese. Bake the pie for 30 minutes, or until the topping is brown and bubbly.", u'spoonacularSourceUrl': u'https://spoonacular.com/ms-pams-tomato-pie-508508', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}