{u'recipes': [{u'sourceName': u'My Gourmet Connection', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/499549-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 499549, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Salsa Verde', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 27.83, u'creditText': u'My Gourmet Connection', u'extendedIngredients': [{u'originalString': u'2 tablespoons fresh cilantro, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 jalape\xf1o pepper, stemmed, seeded and chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'stemmed', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'Juice of 1/2 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 poblano pepper', u'aisle': u'Produce', u'name': u'poblano pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 scallions, roughly chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'8 medium tomatillos, husked and quartered', u'aisle': u'Produce', u'name': u'tomatillos', u'metaInformation': [u'medium', u'husked', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11954, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.mygourmetconnection.com/recipes/appetizers/roasted-salsa-verde.php', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and place the pepper in a clean paper bag, fold the top closed and set aside to cool for about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Salsa Verde. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Bernardus Rosella's Vineyard Pinot Noir with a 4.7 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The Santa Lucia Highlands are known as one of the premier Pinot Noir appellations of the world. One reason for this lofty reputation is Rosella's Vineyard. Gary Franscioni planted his home ranch, named for his lovely wife, in the heart of the Highlands. Gary's home vineyard is planted with a selection of the best available Pinot Noir clones and farmed with unparalleled passion and attention to detail. We at Bernardus are fortunate to have access to three small blocks: 2 planted with clone 777, and the third with the celebrated Pisoni clone.Each block is individually monitored for ripeness in order to hand-pick each clone at its perfect ripeness level. The grapes are sorted at the winery and fermented in small individual fermenters using specially selected yeasts. Once fermentation and pressing are complete, each lot is aged separately for 10 months in the finest French oak barrels. Each barrel is evaluated individually and the final selection is made through a lengthy series of tasting trials.The robe of our 2011 Rosella's is a deep crimson. On the nose we find aromas of candied red cherry fruits along with notes of oak and spice. The palate is very full and complex, exuding flavors of red cherry and berries, accented by notes of cinnamon and nutmeg. This is a beautifully intense wine that will age wonderfully for many years to come. View More", u'title': u"Bernardus Rosella's Vineyard Pinot Noir", u'price': u'$47.99', u'id': 465202, u'link': u'https://www.wine.com/product/bernardus-rosellas-vineyard-pinot-noir-2011/131978', u'imageUrl': u'https://spoonacular.com/productImages/465202-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u'Preparation:Preheat the broiler. Wash and dry the poblano pepper and place it on a rack about 6 inches below the heat. Broil until the skin chars and blisters, turning several times. Watch carefully as times will vary. Remove from the oven and place the pepper in a clean paper bag, fold the top closed and set aside to cool for about 10 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-salsa-verde-499549', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}