{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/290137-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 290137, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Ultimate Beef Stew', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 656.39, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 to 3 pounds beef chuck shoulder roast, cut into 2-inch pieces (this cut is also called chuck shoulder pot roast and chuck roast boneless)', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'boneless', u'cut into 2-inch pieces (this cut is also called chuck shoulder pot roast and chuck roast )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 13786, u'unit': u'pounds'}, {u'originalString': u'2 1/2 cups beef stock', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 6170, u'unit': u'cups'}, {u'originalString': u'1 loaf peasant bread, sliced into 1/2-inch pieces', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'sliced into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18064, u'unit': u'loaf'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/2 pound carrots, peeled and sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'pound'}, {u'originalString': u'Chives, finely chopped, as garnish', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11156, u'unit': u'servings'}, {u'originalString': u'1 bottle good quality dry red wine (recommended: Burgundy)', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red', u'(recommended: Burgundy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'liquid', u'id': 14097, u'unit': u'bottle'}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'Fresh flat-leaf parsley, chopped, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'leaf'}, {u'originalString': u'4 garlic cloves, halved', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'6 garlic cloves, smashed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon prepared horseradish', u'aisle': u'Produce', u'name': u'horseradish', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002055, u'unit': u'tablespoon'}, {u'originalString': u'9 small new potatoes, scrubbed clean and cut in 1/2', u'aisle': u'Produce', u'name': u'new potatoes', u'metaInformation': [u'small', u'scrubbed', u'cut in 1/2'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'consistency': u'solid', u'id': 11352, u'unit': u''}, {u'originalString': u'1/4 cup extra-virgin olive oil, for frying, plus more to drizzle', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for frying', u'extra-virgin', u'plus more to drizzle'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 orange, zest removed in three 1-inch strips', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'Chopped parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley leaves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'leaves'}, {u'originalString': u'2 cups frozen pearl onions, a large handful', u'aisle': u'Produce', u'name': u'pearl onions', u'metaInformation': [u'frozen', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10111282, u'unit': u'cups'}, {u'originalString': u'1/2 pound garden peas frozen or fresh', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11304, u'unit': u'pound'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'Sea salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'8 fresh thyme sprigs', u'aisle': u'Produce', u'name': u'thyme sprigs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'1 pound white mushrooms, cut in 1/2', u'aisle': u'Produce', u'name': u'white mushrooms', u'metaInformation': [u'white', u'cut in 1/2'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'pound'}], u'healthScore': 67.0, u'imageType': u'jpeg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/tyler-florence/the-ultimate-beef-stew-recipe2.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 42, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Preheat a large heavy-bottomed saucepan or Dutch oven over medium-high heat with the oil and butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'While the pan is heating, arrange the flour on a large dish. Season the cubed beef with some salt and freshly ground black pepper and then toss in the flour to coat. Shake off the excess flour and add the beef chunks in a single layer to the hot pan, being careful not to over crowd the pan, you might have to work in batches. Thoroughly brown all of the cubes on all sides. Once all the meat has been browned remove it to a plate and reserve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the wine to the pan and bring up to a simmer while you scrape the bottom of the pan with a wooden spoon being sure to loosen up all those tasty bits. Once the wine has gotten hot add the browned meat, thyme, smashed garlic, orange zest strip, ground cloves, freshly ground black pepper and salt, to taste, bay leaves and beef stock. Bring the mixture up to a boil and then reduce the heat to a simmer and cook uncovered until the liquids start to thicken, about 15 to 20 minutes. Cover and cook on low heat for 2 1/2 hours.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 2011, u'name': u'ground clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6170, u'name': u'beef stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'After 2 hours add halved potatoes, sliced carrots, pearl onions and mushrooms, along with a pinch of sugar to balance out the acid from the red wine. Turn the heat up slightly and simmer, uncovered, for 30 minutes more, until the vegetables and meat are tender.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'id': 10111282, u'name': u'pearl onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Add the frozen peas during the last minute of cooking. Season with salt and pepper and remove the thyme sprigs.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To serve, place the stew in a soup bowl, garnish with parsley, drizzle with olive oil and add a dollop of Horseradish Sour Cream. Right before serving add a slice of Toasted Peasant Bread, half way submerged in the stew.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'id': 1002055, u'name': u'horseradish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine sour cream, prepared horseradish and a drizzle of olive oil in a small bowl and mix until thoroughly combined. Season with salt and pepper.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish-sauce.jpg', u'id': 2055, u'name': u'horseradish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add a dollop of the mixture on top of the stew and garnish with chopped chives.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 500.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 500 degrees F.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put a sheet pan in the oven so that it gets good and hot.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the bread slices on the hot sheet pan.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Drizzle the bread with the extra-virgin olive oil bake for 5 minutes, until the bread is nicely toasted. Rub the bread slices with the garlic cloves, and discard garlic. Sprinkle with parsley and serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Beef Stew can be paired with Cabernet Sauvignon, Malbec, and Shiraz. These full-bodied red wines are the perfect accompaniment for hearty beef stew. The Ringbolt Cabernet Sauvignon with a 4.1 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'malbec', u'shiraz'], u'productMatches': [{u'description': u'Ringbolt Cabernet Sauvignon 2009 is deep crimson red in color. The nose is complex with ripe blackcurrant cassis and red cherry fruit anchored by attractive base notes of oak, earthiness and a wisp of woodsmoke. The wine attacks with bright fleshy cherry fruit built upon by layers of leaf and leather. The finish is mouthfilling and lingering and the tannins giving persistent flesh and presence. View More', u'title': u'Ringbolt Cabernet Sauvignon', u'price': u'$17.99', u'id': 437917, u'link': u'https://www.wine.com/product/ringbolt-cabernet-sauvignon-2009/112598', u'imageUrl': u'https://spoonacular.com/productImages/437917-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u'Watch how to make this recipe.                    Preheat a large heavy-bottomed saucepan or Dutch oven over medium-high heat with the oil and butter.                          While the pan is heating, arrange the flour on a large dish. Season the cubed beef with some salt and freshly ground black pepper and then toss in the flour to coat. Shake off the excess flour and add the beef chunks in a single layer to the hot pan, being careful not to over crowd the pan, you might have to work in batches. Thoroughly brown all of the cubes on all sides. Once all the meat has been browned remove it to a plate and reserve.                          Add the wine to the pan and bring up to a simmer while you scrape the bottom of the pan with a wooden spoon being sure to loosen up all those tasty bits. Once the wine has gotten hot add the browned meat, thyme, smashed garlic, orange zest strip, ground cloves, freshly ground black pepper and salt, to taste, bay leaves and beef stock. Bring the mixture up to a boil and then reduce the heat to a simmer and cook uncovered until the liquids start to thicken, about 15 to 20 minutes. Cover and cook on low heat for 2 1/2 hours.                          After 2 hours add halved potatoes, sliced carrots, pearl onions and mushrooms, along with a pinch of sugar to balance out the acid from the red wine. Turn the heat up slightly and simmer, uncovered, for 30 minutes more, until the vegetables and meat are tender. Add the frozen peas during the last minute of cooking. Season with salt and pepper and remove the thyme sprigs.                          To serve, place the stew in a soup bowl, garnish with parsley, drizzle with olive oil and add a dollop of Horseradish Sour Cream. Right before serving add a slice of Toasted Peasant Bread, half way submerged in the stew.                          Combine sour cream, prepared horseradish and a drizzle of olive oil in a small bowl and mix until thoroughly combined. Season with salt and pepper. Add a dollop of the mixture on top of the stew and garnish with chopped chives.                          Preheat the oven to 500 degrees F.                          Put a sheet pan in the oven so that it gets good and hot.                          Place the bread slices on the hot sheet pan. Drizzle the bread with the extra-virgin olive oil bake for 5 minutes, until the bread is nicely toasted. Rub the bread slices with the garlic cloves, and discard garlic. Sprinkle with parsley and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-ultimate-beef-stew-290137', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 210, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}