{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/595298-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 595298, u'veryPopular': False, u'lowFodmap': True, u'title': u'Spiced Pecans', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 318.94, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'Canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 \xbd teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'4 cups pecans (approximately 1 pound)', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'(approximately 1 pound)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'\xbc cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'6 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.afamilyfeast.com/spiced-pecans/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, add salt, cinnamon, cayenne and cumin and mix to combine.  Set aside.In a large saucepan over high heat, heat 6 cups of water to boiling.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add pecans and bring back to a boil.  Cook for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Drain and rinse under running hot water.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain completely.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Pour drained nuts into a large bowl.  Sprinkle with sugar and toss to coat the nuts completely with the sugar.Meanwhile, in a deep-sided skillet or saucepan, heat about 1 inch of canola oil to 350 degrees.  (It’s recommended that you use a candy thermometer to make sure that you have the oil at the correct temperature – too hot will burn the nuts, too cool will not cook the nuts quickly enough and you won’t get the crisp texture.)Once the oil is at 350 degrees, with a slotted spoon (a 'spider strainer' like this works really well for this task), carefully add about half of the pecans to the oil (be careful as the wet nuts being added to the oil will splatter up!).  Fry about 3 minutes – stirring often.   Note that the pecans will continue to cook after they are taken out of the oil so it’s important to not let them get too browned, otherwise they will end up burned.With a slotted spoon, remove pecans from the oil and place into a coarse sieve or colander over a bowl to drain.  Sprinkle with the salt-spice mixture and keep tossing the pecans so that they don’t stick together as they cool.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Transfer the pecans to waxed paper to cool completely.  Fry the remaining pecans.  Store cooled nuts in a tightly covered container.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Mumm Napa Cuvee M. It has 4.1 out of 5 stars and a bottle costs about 20 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"The naturally ripened fruit selected from more than 50 separate vineyards, reveals layers of crisp and creamy textures that are rich and lingering. Individually selected lots were kept separate during initial fermentation in order to highlight their vineyard differences and extract the quintessence of their specific strengths. The resulting blend is a soft and elegant wine that highlights the delicious and powerful ripe fruit flavors that characterize the world-class grapes of the Napa Valley.Cuv\xe9e M exhibits a graceful stream of very fine bubbles gently rising to a persistent mousse cordon with a light peach rose color. The aromas are elegant, rich and complex, showing fresh white and yellow stone fruits with subtle hints of wild strawberry. A light touch of fresh brioche, with hints of vanilla and honey add to the wine's complex bouquet. On the palate, full flavors of peach and pear combine with a creamy caramel character, which lingers into a long satisfying finish.Mumm Napa's Cuv\xe9e M is the perfect sparkling wine for champagne cocktails or as an ap\xe9ritif to pair with hors d'oeuvres. It is also a perfect match with creamy desserts and spicy foods. View More", u'title': u'Mumm Napa Cuvee M', u'price': u'$19.99', u'id': 451872, u'link': u'https://www.wine.com/product/mumm-napa-cuvee-m/80229', u'imageUrl': u'https://spoonacular.com/productImages/451872-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u"In a small bowl, add salt, cinnamon, cayenne and cumin and mix to combine.  Set aside.In a large saucepan over high heat, heat 6 cups of water to boiling.  Add pecans and bring back to a boil.  Cook for 1 minute.  Drain and rinse under running hot water.  Drain completely.Pour drained nuts into a large bowl.  Sprinkle with sugar and toss to coat the nuts completely with the sugar.Meanwhile, in a deep-sided skillet or saucepan, heat about 1 inch of canola oil to 350 degrees.  (It’s recommended that you use a candy thermometer to make sure that you have the oil at the correct temperature – too hot will burn the nuts, too cool will not cook the nuts quickly enough and you won’t get the crisp texture.)Once the oil is at 350 degrees, with a slotted spoon (a 'spider strainer' like this works really well for this task), carefully add about half of the pecans to the oil (be careful as the wet nuts being added to the oil will splatter up!).  Fry about 3 minutes – stirring often.   Note that the pecans will continue to cook after they are taken out of the oil so it’s important to not let them get too browned, otherwise they will end up burned.With a slotted spoon, remove pecans from the oil and place into a coarse sieve or colander over a bowl to drain.  Sprinkle with the salt-spice mixture and keep tossing the pecans so that they don’t stick together as they cool. Transfer the pecans to waxed paper to cool completely.  Fry the remaining pecans.  Store cooled nuts in a tightly covered container.", u'spoonacularSourceUrl': u'https://spoonacular.com/spiced-pecans-595298', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}