{u'recipes': [{u'sourceName': u'Simple Nourished Living', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/525648-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 525648, u'veryPopular': False, u'lowFodmap': False, u'title': u'Healthy Collard Greens s with Weight Watchers PointsPlus Values', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 80.86, u'creditText': u'Simple Nourished Living', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'4 bunches collard greens, washed with long stems and tough ribs removed', u'aisle': u'Produce', u'name': u'collard greens', u'metaInformation': [u'with long stems and tough ribs removed', u'washed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/collard-greens.jpg', u'unitLong': u'bunches', u'unitShort': u'bunches', u'amount': 4.0, u'consistency': u'solid', u'id': 11161, u'unit': u'bunches'}, {u'originalString': u'2 garlic cloves, thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Pepper sauce', u'aisle': u'Condiments', u'name': u'pepper sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 39.0, u'imageType': u'jpeg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://simple-nourished-living.com/2012/01/healthy-collard-greens-recipes-with-weight-watchers-pointsplus-values/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of water to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add a tablespoon of salt. Plunge the greens into the pot and cook them for 10 minutes. Reserve \xbd cup of the cooking water and remove the greens to a bowl.In a wide skillet set over medium heat, cook the butter, olive oil, onion, garlic and pepper flakes, stirring occasionally until the onion is soft and garlic lightly golden.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the greens, the reserved cooking water and 1 teaspoon salt. Cook for 20 to 30 minutes, stirring occasionally.Taste and add more salt if necessary.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with the pepper sauce on the side.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}]}], u'name': u''}], u'aggregateLikes': 36, u'instructions': u'Bring a large pot of water to a boil. Add a tablespoon of salt. Plunge the greens into the pot and cook them for 10 minutes. Reserve \xbd cup of the cooking water and remove the greens to a bowl.In a wide skillet set over medium heat, cook the butter, olive oil, onion, garlic and pepper flakes, stirring occasionally until the onion is soft and garlic lightly golden.Add the greens, the reserved cooking water and 1 teaspoon salt. Cook for 20 to 30 minutes, stirring occasionally.Taste and add more salt if necessary.Serve with the pepper sauce on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-collard-greens-s-with-weight-watchers-pointsplus-values-525648', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}