{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/411784-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 411784, u'veryPopular': False, u'lowFodmap': True, u'title': u'Jazzy Gelatin', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'whole 30'], u'preparationMinutes': 10, u'pricePerServing': 44.85, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (15 ounces) mandarin oranges, drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'canned mandarin oranges', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 9218, u'unit': u'ounces'}, {u'originalString': u'1 cup ice cubes', u'aisle': u'Frozen', u'name': u'ice cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'cup'}, {u'originalString': u'Green grapes and fresh mint, optional', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'fresh', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 2064, u'unit': u'servings'}, {u'originalString': u'1 package (6 ounces) orange gelatin', u'aisle': u'Baking', u'name': u'orange gelatin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-jello.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10119172, u'unit': u'ounces'}, {u'originalString': u'1 can (6 ounces) frozen orange juice concentrate, thawed', u'aisle': u'Frozen', u'name': u'orange juice concentrate', u'metaInformation': [u'frozen', u'thawed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 9214, u'unit': u'ounces'}, {u'originalString': u'1 can (8 ounces) unsweetened crushed pineapple, undrained', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'unsweetened', u'crushed', u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 9266, u'unit': u'ounces'}, {u'originalString': u'2 cups boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/jazzy-gelatin', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, dissolve gelatin in boiling water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add ice cubes, oranges, pineapple and orange juice concentrate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9214, u'name': u'orange juice concentrate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Pour into a 6-cup ring mold coated with cooking spray. Refrigerate overnight or until firm.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Just before serving, unmold onto a serving plate. Fill center with grapes and garnish with mint if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 79, u'instructions': u'Directions                                                                                In a large bowl, dissolve gelatin in boiling water. Add ice cubes, oranges, pineapple and orange juice concentrate. Pour into a 6-cup ring mold coated with cooking spray. Refrigerate overnight or until firm.                                                                                            Just before serving, unmold onto a serving plate. Fill center with grapes and garnish with mint if desired.                                        Yield: 12 servings.                                                                                                                         Originally published as Jazzy Gelatin in  Quick CookingSeptember/October 2000, p53                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 piece) equals 107 calories, trace fat (trace saturated fat), 0 cholesterol, 35 mg sodium, 26 g carbohydrate, 1 g fiber, 2 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/jazzy-gelatin-411784', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}