{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508176-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 210, u'id': 508176, u'veryPopular': True, u'lowFodmap': False, u'title': u'No-Bake Creamy Peanut Butter Pie', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 104.71, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'8 ounces cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 cup creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'\xbd cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces Oreo cookies, crushed into fine crumbs', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'crushed', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u'ounces'}, {u'originalString': u'\xbc cup chopped peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16091, u'unit': u'cup'}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1/3 cup semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'14-oz can sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'4 tablespoons unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'teaspoon'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.browneyedbaker.com/2011/08/12/no-bake-creamy-peanut-butter-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl, combine the Oreo crumbs, pinch of salt and melted butter, tossing with a fork until the crumbs are all evenly moistened. Press into the bottom and about 1-inch up the sides of a 9-inch springform pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in the freezer for 10 minutes.2. While crust is in the freezer, place the 4 ounces of chocolate chips into a small bowl. In a small saucepan set over medium-high heat, bring the \xbd cup of heavy cream to a full boil.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour over the chocolate chips, let it sit a minute, and then stir gently with a rubber spatula until completely smooth and glossy.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour over the bottom of the crust, tilting the pan or using an offset spatula to ensure it covers the entire bottom. Sprinkle with the chopped peanuts.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place pan in the refrigerator while you prepare the filling.3. Using an electric mixer with a whisk attachment, whip the 1 cup of heavy cream on medium-high speed until stiff peaks form.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the whipped cream to a medium bowl and place in the refrigerator until ready to use.4. Again using an electric mixer, this time with a paddle attachment (or regular beaters if using a hand mixer), cream together the peanut butter and cream cheese on medium speed until light and fluffy. Reduce the speed to low and gradually add the powdered sugar. Once it is all added, scrape the sides of the bowl and beat on medium speed for about 30 seconds to completely incorporate.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the sweetened condensed milk, vanilla extract and lemon juice and beat at medium speed until everything is completely combined and smooth.5. Using a rubber spatula, stir in about 1/3 of the whipped cream to lighten the mixture. Very gently, fold in the remaining whipped cream until no streaks of whipped cream remain.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Pour the filling into the prepared crust.6. In a microwave on 50% power, melt the 1/3 cup of chocolate chips with the shortening in 30 second bursts, stirring after each one, until the chocolate is completely melted and smooth. Using a spoon or pastry bag, drizzle the melted chocolate over the top of the pie filling.7. Refrigerate for at least 3 hours (or overnight) before serving. Store leftovers in the refrigerator.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Peanut Butter Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try McFadden Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 1477, u'instructions': u'1. In a medium bowl, combine the Oreo crumbs, pinch of salt and melted butter, tossing with a fork until the crumbs are all evenly moistened. Press into the bottom and about 1-inch up the sides of a 9-inch springform pan. Place in the freezer for 10 minutes.2. While crust is in the freezer, place the 4 ounces of chocolate chips into a small bowl. In a small saucepan set over medium-high heat, bring the \xbd cup of heavy cream to a full boil. Pour over the chocolate chips, let it sit a minute, and then stir gently with a rubber spatula until completely smooth and glossy. Pour over the bottom of the crust, tilting the pan or using an offset spatula to ensure it covers the entire bottom. Sprinkle with the chopped peanuts. Place pan in the refrigerator while you prepare the filling.3. Using an electric mixer with a whisk attachment, whip the 1 cup of heavy cream on medium-high speed until stiff peaks form. Transfer the whipped cream to a medium bowl and place in the refrigerator until ready to use.4. Again using an electric mixer, this time with a paddle attachment (or regular beaters if using a hand mixer), cream together the peanut butter and cream cheese on medium speed until light and fluffy. Reduce the speed to low and gradually add the powdered sugar. Once it is all added, scrape the sides of the bowl and beat on medium speed for about 30 seconds to completely incorporate. Add the sweetened condensed milk, vanilla extract and lemon juice and beat at medium speed until everything is completely combined and smooth.5. Using a rubber spatula, stir in about 1/3 of the whipped cream to lighten the mixture. Very gently, fold in the remaining whipped cream until no streaks of whipped cream remain. Pour the filling into the prepared crust.6. In a microwave on 50% power, melt the 1/3 cup of chocolate chips with the shortening in 30 second bursts, stirring after each one, until the chocolate is completely melted and smooth. Using a spoon or pastry bag, drizzle the melted chocolate over the top of the pie filling.7. Refrigerate for at least 3 hours (or overnight) before serving. Store leftovers in the refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/no-bake-creamy-peanut-butter-pie-508176', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}