{u'recipes': [{u'sourceName': u'Lifes Ambrosia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611791-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 611791, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Gingersnap Icebox Cake', u'diets': [], u'preparationMinutes': 480, u'pricePerServing': 129.25, u'creditText': u'Lifes Ambrosia', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon cinnamon, plus more for garnish', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 (8 ounce) package cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'About 45 gingersnaps', u'aisle': u'Sweet Snacks', u'name': u'gingersnaps', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gingersnaps.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 45.0, u'consistency': u'solid', u'id': 18172, u'unit': u''}, {u'originalString': u'1/4 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'2 1/2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'3/4 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 cup pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.lifesambrosia.com/2014/09/pumpkin-gingersnap-icebox-cake-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Beat cream cheese and sugar together.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Add in vanilla. Slowly pour in heavy cream and whip until stiff peaks form. Gently fold in pumpkin, cinnamon, ginger and cloves. Reserve about 1 cup of whipped cream, cover and refrigerate. This is for touch ups to the finished cake. Line a 8 x 8 dish with aluminum foil. Allow excess to hang off the side so you can lift the cake out. Lay 3 rows of 3 cookies in the bottom of the prepared dish. Spoon a layer or pumpkin whipped cream over the top. Repeat until there are 5 layers of cookies and cream, ending with a layer of cream. Cover with plastic wrap and refrigerate overnight. The next day, place a plate on top of the cake and turn the cake over. Gently remove aluminum foil. Use reserved whipped cream to touch up any spots and smooth the top of the cake. Slice into wedges, sprinkle with cinnamon and serve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 172, u'instructions': u'Beat cream cheese and sugar together. Add in vanilla. Slowly pour in heavy cream and whip until stiff peaks form. Gently fold in pumpkin, cinnamon, ginger and cloves. Reserve about 1 cup of whipped cream, cover and refrigerate. This is for touch ups to the finished cake. Line a 8 x 8 dish with aluminum foil. Allow excess to hang off the side so you can lift the cake out. Lay 3 rows of 3 cookies in the bottom of the prepared dish. Spoon a layer or pumpkin whipped cream over the top. Repeat until there are 5 layers of cookies and cream, ending with a layer of cream. Cover with plastic wrap and refrigerate overnight. The next day, place a plate on top of the cake and turn the cake over. Gently remove aluminum foil. Use reserved whipped cream to touch up any spots and smooth the top of the cake. Slice into wedges, sprinkle with cinnamon and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-gingersnap-icebox-cake-611791', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 480, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}