{u'recipes': [{u'sourceName': u'My Colombian Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/227501-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 227501, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chuzos de Pollo con Tocineta (Chicken and Bacon Skewers)', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 321.67, u'creditText': u'My Colombian Recipes', u'extendedIngredients': [{u'originalString': u'6 slices of bacon, cut into pieces', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 Tbs. minced fresh cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Tbs'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup onion,finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 scallion, finely chopped', u'aisle': u'Produce', u'name': u'scallion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 lb. boneless, skinless chicken breasts, cut into pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.mycolombianrecipes.com/chuzos-de-pollo-con-tocineta-chicken-and-bacon-skewers', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the oil, garlic, cilantro, onion, scallion, cumin, salt and pepper. Stir in the chicken. Cover and marinate in the refrigerator for about 3 hours or overnight.Meanwhile, preheat a gas grill.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 405601, u'name': u'wooden skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the entire wooden skewers in water and let stand for at least 30 minutes.When the grill is hot, drain the skewers. Wrap the chicken chunks with bacon and thread onto skewers so that the bacon is secured.Adjust the grille so that the permimeter burners remain on and the burners at the center of the grille are turned off, or a similar configuration (follow directions as closely as possible if not using a gas grille).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the skewers on the perimeter of the grill rack directly over the flame. Grill, turning the skewers once or twice, until the chicken is browned, about 5 minutes total.Move the skewers to the center of the grill rack so they are not directly over the flame. Cover the grill and cook, turning the skewers occasionally, until the chicken is opaque throughout and the juices run clear, 10 to 15 minutes more.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Transfer the skewers to a platter or individual plates and serve with lime wedges and your favorite vegetables.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 136, u'instructions': u'In a large bowl, combine the oil, garlic, cilantro, onion, scallion, cumin, salt and pepper. Stir in the chicken. Cover and marinate in the refrigerator for about 3 hours or overnight.Meanwhile, preheat a gas grill. Place the entire wooden skewers in water and let stand for at least 30 minutes.When the grill is hot, drain the skewers. Wrap the chicken chunks with bacon and thread onto skewers so that the bacon is secured.Adjust the grille so that the permimeter burners remain on and the burners at the center of the grille are turned off, or a similar configuration (follow directions as closely as possible if not using a gas grille).Place the skewers on the perimeter of the grill rack directly over the flame. Grill, turning the skewers once or twice, until the chicken is browned, about 5 minutes total.Move the skewers to the center of the grill rack so they are not directly over the flame. Cover the grill and cook, turning the skewers occasionally, until the chicken is opaque throughout and the juices run clear, 10 to 15 minutes more.Transfer the skewers to a platter or individual plates and serve with lime wedges and your favorite vegetables.', u'spoonacularSourceUrl': u'https://spoonacular.com/chuzos-de-pollo-con-tocineta-chicken-and-bacon-skewers-227501', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}