{u'recipes': [{u'sourceName': u'Foodista', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/664273-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 664273, u'veryPopular': False, u'lowFodmap': False, u'title': u"Valentine's Day Potted Plant Ice-Cream Desserts", u'diets': [], u'pricePerServing': 86.47, u'creditText': u'Foodista.com – The Cooking Encyclopedia Everyone Can Edit', u'extendedIngredients': [{u'originalString': u'2 oz BlueBerries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 9050, u'unit': u'oz'}, {u'originalString': u'fresh mint', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 2064, u'unit': u'servings'}, {u'originalString': u'2 tbsp Organic Mixed Nuts', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'mixed', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12135, u'unit': u'tbsp'}, {u'originalString': u'100g Oreo Cookies', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u'g'}, {u'originalString': u'0.75 liter Vanilla Ice-cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'liters', u'unitShort': u'l', u'amount': 0.75, u'consistency': u'liquid', u'id': 19095, u'unit': u'liter'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.foodista.com/recipe/2GZ5DQ3F/valentine-s-day-potted-plant-ice-cream-desserts', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'dishTypes': [u'side dish'], u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Remove cream from cookies and pound the cookies into crumbs. Set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix ice-cream with the rest of the ingredients and put them into serving cups. Freeze them well.Top the ice-cream cups with Oreo crumbs and insert a sprig of mint just before serving your Potted Plant Ice-Cream Desserts!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6, u'instructions': u'<ol><li>Remove cream from cookies and pound the cookies into crumbs. Set aside.</li><li>Mix ice-cream with the rest of the ingredients and put them into serving cups. Freeze them well.</li><li>Top the ice-cream cups with Oreo crumbs and insert a sprig of mint just before serving your Potted Plant Ice-Cream Desserts!</li></ol>', u'spoonacularSourceUrl': u'https://spoonacular.com/valentines-day-potted-plant-ice-cream-desserts-664273', u'license': u'CC BY 3.0', u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}