{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/296189-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 296189, u'veryPopular': False, u'lowFodmap': False, u'title': u"Mama's Divinity", u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 105.27, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup white corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'3 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 cups chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'4 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 teaspoon pure vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/paula-deen/mamas-divinity-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a heavy saucepan over medium heat, stir together the sugar, corn syrup, and water. Stir only until sugar has dissolved. Do not stir after this point. Cook syrup mixture until it reaches 250 degrees F on a candy thermometer, bringing it to a hard ball stage.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'While the syrup is cooking, beat the egg whites until stiff peaks form. Once the sugar mixture reaches 250 degrees F, carefully pour a slow steady stream of syrup into the stiffly beaten egg whites, beating constantly at high speed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the vanilla and continue to beat until mixture holds its shape, approximately 5 minutes. Stir in pecans.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u"Using 2 spoons, drop the divinity onto waxed paper, using 1 spoon to push the candy off the other. This may take a little practice because the technique is to twirl the pushing spoon, making the candy look like the top of a soft serve ice cream. If the candy becomes too stiff, add a few drops of hot water. You will need to work fast when making this type of candy. After you spoon the cooked sugar and nuts onto the waxed paper, you're done. Cool the candies on racks completely. You can store them in an airtight container for up to 2 weeks.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 45, u'instructions': u"In a heavy saucepan over medium heat, stir together the sugar, corn syrup, and water. Stir only until sugar has dissolved. Do not stir after this point. Cook syrup mixture until it reaches 250 degrees F on a candy thermometer, bringing it to a hard ball stage.                          While the syrup is cooking, beat the egg whites until stiff peaks form. Once the sugar mixture reaches 250 degrees F, carefully pour a slow steady stream of syrup into the stiffly beaten egg whites, beating constantly at high speed. Add the vanilla and continue to beat until mixture holds its shape, approximately 5 minutes. Stir in pecans.                          Using 2 spoons, drop the divinity onto waxed paper, using 1 spoon to push the candy off the other. This may take a little practice because the technique is to twirl the pushing spoon, making the candy look like the top of a soft serve ice cream. If the candy becomes too stiff, add a few drops of hot water. You will need to work fast when making this type of candy. After you spoon the cooked sugar and nuts onto the waxed paper, you're done. Cool the candies on racks completely. You can store them in an airtight container for up to 2 weeks.", u'spoonacularSourceUrl': u'https://spoonacular.com/mamas-divinity-296189', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}