{u'recipes': [{u'sourceName': u'Bunky Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575373-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 575373, u'veryPopular': False, u'lowFodmap': False, u'title': u'Osso Bucco', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 949.22, u'creditText': u'Bunky Cooks', u'extendedIngredients': [{u'originalString': u"1 quart chicken stock, homemade of store-bought organic chicken broth (I used Swanson's)", u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'organic', u'homemade', u'store-bought', u"(I used Swanson's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'quart'}, {u'originalString': u'1 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'\xbe cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'4 tablespoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'Zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'4 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup loosely packed Italian parsley, chopped fine', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'italian', u'loosely packed', u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'Cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 pounds veal shanks. Rinsed and dried', u'aisle': u'Meat', u'name': u'veal shanks', u'metaInformation': [u'dried', u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal-shank.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 17276, u'unit': u'pounds'}], u'healthScore': 56.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bunkycooks.com/2011/04/osso-bucco-and-a-big-bowl-of-love-cookbook-giveaway/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Salt and pepper the veal shanks lightly on both sides.  Dredge in flour and set aside.For 3 minutes, heat a skillet large enough to hold all 4 pieces of beef (veal).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal-shank.jpg', u'id': 17276, u'name': u'veal shank'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the oil and swirl it around the pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the beef (veal) and saute it for 4 to 5 minutes on each side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the wine and cook until the wine is reduced by half.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the lemon juice and the chicken stock.  Cover, and bring to just under a boil.  Reduce heat to a low simmer.  Simmer the meat for 2 hours, turning it after 1 hour.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Remove the lid, raise the heat to medium, and cook until the liquid is reduced to about 1 1/2 cups.  The meat is cooked when you can insert a fork easily right through the meat; it should literally be falling off the bone.Sprinkle on chopped parsley and lemon zest before serving.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 53, u'instructions': u'Salt and pepper the veal shanks lightly on both sides.  Dredge in flour and set aside.For 3 minutes, heat a skillet large enough to hold all 4 pieces of beef (veal).  Add the oil and swirl it around the pan.  Add the beef (veal) and saute it for 4 to 5 minutes on each side.  Add the wine and cook until the wine is reduced by half.  Add the lemon juice and the chicken stock.  Cover, and bring to just under a boil.  Reduce heat to a low simmer.  Simmer the meat for 2 hours, turning it after 1 hour.  Remove the lid, raise the heat to medium, and cook until the liquid is reduced to about 1 1/2 cups.  The meat is cooked when you can insert a fork easily right through the meat; it should literally be falling off the bone.Sprinkle on chopped parsley and lemon zest before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/osso-bucco-575373', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}