{u'recipes': [{u'sourceName': u'Healthy Green Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/552325-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 552325, u'veryPopular': False, u'lowFodmap': False, u'title': u'for Thai-Inspired Cashew Brittle', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 122.32, u'creditText': u'Healthy Green Kitchen', u'extendedIngredients': [{u'originalString': u'*3/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'*1 teaspoon coarse salt, plus another 1/2 teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'*\xbd cup corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'*1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'*1/2 teaspoon crushed Kaffir lime leaves (if unavailable, try lime zest or omit)', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [u'crushed', u'(if unavailable, try lime zest or omit)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1009159, u'unit': u'teaspoon'}, {u'originalString': u'*1/2 teaspoon crushed dried red Thai chile (if unavailable, use red chile flakes or ground cayenne pepper)', u'aisle': u'Produce;Ethnic Foods', u'name': u'thai chile', u'metaInformation': [u'dried', u'red', u'crushed', u'(if unavailable, use chile flakes or ground cayenne pepper)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11670, u'unit': u'teaspoon'}, {u'originalString': u'*3 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'*1 1/4 cups roasted cashews (or peanuts); I roasted my own in the oven...if purchasing roasted cashews or peanuts, make sure to look for unsalted ones)', u'aisle': u'Nuts;Savory Snacks', u'name': u'unsalted peanuts', u'metaInformation': [u'unsalted', u'for  ones)', u'(or peanuts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 16390, u'unit': u'cups'}, {u'originalString': u'*3/4 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'*1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.healthygreenkitchen.com/thai-inspired-cashew-brittle.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 41, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Line a rimmed baking sheet with parchment paper and set aside.2. In a medium saucepan, combine water, sugar, and corn syrup.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Mix until all of the sugar is wet. 3. Bring to a boil over medium-high, stirring with a heat-proof spatula until all of the sugar is dissolved. Then boil to 250 degrees F. without stirring. 4.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the butter, and stir constantly (but gently) until the mixture reaches 320 degrees F. 5.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat and stir in the cashews, 1 teaspoon of the salt, the vanilla extract, the baking soda, and the crushed lime leaves and chiles. Stir thoroughly to incorporated all of the ingredients.6.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Pour the mixture onto the parchment paper, and, working quickly, spread evenly with an offset spatula. Sprinkle with the other 1/2 teaspoon of the salt.7.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let cool completely, about 30 minutes. Break into pieces, and store in an airtight container. If making for gifts, keep in mind that the brittle will last for 2-3 weeks.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 171, u'instructions': u'1. Line a rimmed baking sheet with parchment paper and set aside.2. In a medium saucepan, combine water, sugar, and corn syrup. Mix until all of the sugar is wet. 3. Bring to a boil over medium-high, stirring with a heat-proof spatula until all of the sugar is dissolved. Then boil to 250 degrees F. without stirring. 4. Add the butter, and stir constantly (but gently) until the mixture reaches 320 degrees F. 5. Remove from heat and stir in the cashews, 1 teaspoon of the salt, the vanilla extract, the baking soda, and the crushed lime leaves and chiles. Stir thoroughly to incorporated all of the ingredients.6. Pour the mixture onto the parchment paper, and, working quickly, spread evenly with an offset spatula. Sprinkle with the other 1/2 teaspoon of the salt.7.  Let cool completely, about 30 minutes. Break into pieces, and store in an airtight container. If making for gifts, keep in mind that the brittle will last for 2-3 weeks.', u'spoonacularSourceUrl': u'https://spoonacular.com/for-thai-inspired-cashew-brittle-552325', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}