{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'jewish'], u'image': u'https://spoonacular.com/recipeImages/735646-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 735646, u'veryPopular': False, u'lowFodmap': False, u'title': u'BBQ Elk Brisket', u'diets': [], u'preparationMinutes': 80, u'pricePerServing': 777.79, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'3 cups apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'cups'}, {u'originalString': u'3 tablespoons freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tablespoons'}, {u'originalString': u'1 cup bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cups'}, {u'originalString': u'1 pound butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'pound'}, {u'originalString': u'1 cup sweet chile sauce', u'aisle': u'Ethnic Foods', u'name': u'chile garlic sauce', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93749, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 10-pound elk brisket', u'aisle': u'Meat', u'name': u'elk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 10.0, u'consistency': u'solid', u'id': 17166, u'unit': u'pound'}, {u'originalString': u'1 1/2 tablespoons pureed garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'pureed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons prepared horseradish', u'aisle': u'Produce', u'name': u'horseradish', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002055, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19304, u'unit': u'cups'}, {u'originalString': u'5 cups olive oil and canola oil blend', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'cups'}, {u'originalString': u'Serving suggestions: smoked paprika smashed potatoes and onion rings', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'smoked', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 11282, u'unit': u'servings'}, {u'originalString': u'1/4 cup salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'cup'}, {u'originalString': u'2 tablespoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'tablespoons'}, {u'originalString': u'1 cup Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpeg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/bbq-elk-brisket.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 225.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the brisket: Preheat a convection oven to 225 degrees F. Rub the brisket with salt, pepper and paprika.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the brisket to a deep pan and add the melted butter and oil so the meat is just submerged.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cover the pan tightly with foil and cook for 8 hours.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Set aside the brisket to cool to room temperature in the fat. Store the brisket in the refrigerator.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'For the sauce: While the brisket cooks, add the vinegar, molasses, sugar, bourbon, chile sauce, Worcestershire sauce, horseradish, salt, garlic, ginger and cinnamon to a 4-quart saucepan set over medium heat. Stir continuously until the liquid reduces by half and is the consistency of syrup, about 1 hour.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'id': 1002055, u'name': u'horseradish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'When ready to serve, slice the brisket into 8-ounce portions and reheat in the reserved fat.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the brisket over smoked paprika smashed potatoes, and top with the BBQ brisket sauce and onion rings.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1012028, u'name': u'smoked paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Shiraz, Tempranillo, and Zinfandel are my top picks for Brisket. All these red wines can handle the meaty, smokey flavor of brisket. If you're talking traditional Jewish brisket, you'll want to look for a kosher red wine. You could try Penfolds Bin 8 Cabernet-Shiraz. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 20 dollars per bottle.", u'pairedWines': [u'shiraz', u'tempranillo', u'zinfandel'], u'productMatches': [{u'description': u"The Penfolds Bin 8 Cabernet-Shiraz is a crimson color. A graphite and blackcurrant assertion immediately confirms Cabernet's role in the blend. A lift of tomato-leaf and sour-cherry couples with other red fruits to further entice. Background cedary oak just discernible. Medium-bodied. A summer-pudding swirl of fruits laced with red-currant conserve, praline. Green Sicilian olive, plummy fruits and spice with fine tannins and well-concealed oak.", u'title': u'Penfolds Bin 8 Cabernet-Shiraz', u'price': u'$19.99', u'id': 450057, u'link': u'https://www.wine.com/product/penfolds-bin-8-cabernet-shiraz-2014/163541', u'imageUrl': u'https://spoonacular.com/productImages/450057-312x231.jpg'}]}, u'aggregateLikes': 57, u'instructions': u'For the brisket: Preheat a convection oven to 225 degrees F. Rub the brisket with salt, pepper and paprika. Add the brisket to a deep pan and add the melted butter and oil so the meat is just submerged.                          Cover the pan tightly with foil and cook for 8 hours.                          Set aside the brisket to cool to room temperature in the fat. Store the brisket in the refrigerator.                          For the sauce: While the brisket cooks, add the vinegar, molasses, sugar, bourbon, chile sauce, Worcestershire sauce, horseradish, salt, garlic, ginger and cinnamon to a 4-quart saucepan set over medium heat. Stir continuously until the liquid reduces by half and is the consistency of syrup, about 1 hour.                          When ready to serve, slice the brisket into 8-ounce portions and reheat in the reserved fat.                          Serve the brisket over smoked paprika smashed potatoes, and top with the BBQ brisket sauce and onion rings.', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-elk-brisket-735646', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'hanukkah'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 560, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}