{u'recipes': [{u'sourceName': u'Musings of a House Wife', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/593193-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 593193, u'veryPopular': False, u'lowFodmap': False, u'title': u'Red Wine Marinated Flank Steak #grassfedmoms', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal'], u'preparationMinutes': 480, u'pricePerServing': 327.33, u'creditText': u'Musings of a House Wife', u'extendedIngredients': [{u'originalString': u'2 tsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp dried minced rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried rosemary', u'metaInformation': [u'dried', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2036, u'unit': u'tsp'}, {u'originalString': u'1 cup dry red wine (always cook with the quality you want to drink)', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red', u'with the quality you want to drink)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14097, u'unit': u'cup'}, {u'originalString': u'2-3 lb flank steak (this also works with London Broil, sirloin or flat iron steaks)', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [u'with london broil, sirloin or flat iron steaks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'lb'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbc tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp dried thyme leaves', u'aisle': u'Produce', u'name': u'thyme leaves', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}], u'healthScore': 24.0, u'imageType': u'png', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.musingsofahousewife.com/2013/07/red-wine-marinated-flank-steak.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place steak in a baking dish, salt and pepper both sides to taste.In a small bowl, whisk together remaining ingredients.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Pour marinade over steak and turn steak so it's coated well on both sides; refrigerate 8 hours or overnight.Bring the steaks to room temp while you prepare the grill. (Putting cold meat on a hot grill will cause it seize up, making it tough.)", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the steaks on a hot grill (reserve the marinade) and cook 4 minutes per side; turning only once. Do not move the steaks while cooking or you will not get that delicious brown crust.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Remove to a serving platter, cover loosely with aluminum foil and allow it to set for 10 minutes. This is very important!! Do not skip this step. Allowing the meat to rest helps the juices redistribute through the meat, rather than ending up on your cutting board.While the steak rests, heat the reserved marinade in a small saucepan over medium heat until it is reduced by half; add a tablespoon of butter at the end.Slice the flank steak against the grain in thin slices, and serve with the reduction sauce.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23657, u'name': u'flank steak'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Flank Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. Beef and red wine are a classic combination. Generally, leaner cuts of beef go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier cuts can handle a bold red, such as cabernet sauvingnon. The NV The Big Kahuna Merlot with a 4.5 out of 5 star rating seems like a good match. It costs about 7 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'A ripe and rounded Merlot with notes of plum, blackberry, and hint of spice .', u'title': u'NV The Big Kahuna Merlot', u'price': u'$6.99', u'id': 430475, u'link': u'https://www.amazon.com/Big-Kahuna-Merlot-Red-Wine/dp/B01F5XPTUW', u'imageUrl': u'https://spoonacular.com/productImages/430475-312x231.jpg'}]}, u'aggregateLikes': 313, u'instructions': u"Place steak in a baking dish, salt and pepper both sides to taste.In a small bowl, whisk together remaining ingredients.Pour marinade over steak and turn steak so it's coated well on both sides; refrigerate 8 hours or overnight.Bring the steaks to room temp while you prepare the grill. (Putting cold meat on a hot grill will cause it seize up, making it tough.)Place the steaks on a hot grill (reserve the marinade) and cook 4 minutes per side; turning only once. Do not move the steaks while cooking or you will not get that delicious brown crust.Remove to a serving platter, cover loosely with aluminum foil and allow it to set for 10 minutes. This is very important!! Do not skip this step. Allowing the meat to rest helps the juices redistribute through the meat, rather than ending up on your cutting board.While the steak rests, heat the reserved marinade in a small saucepan over medium heat until it is reduced by half; add a tablespoon of butter at the end.Slice the flank steak against the grain in thin slices, and serve with the reduction sauce.", u'spoonacularSourceUrl': u'https://spoonacular.com/red-wine-marinated-flank-steak-grassfedmoms-593193', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 495, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}