{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/514649-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 514649, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fork Tender Steaks with Green Beans and Gravy: A frugal skillet dinner', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 105.73, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'14 oz. can beef broth', u'aisle': u'Canned and Jarred', u'name': u'canned beef broth', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'oz'}, {u'originalString': u'4 boneless chuck steaks, 5-6 oz. each', u'aisle': u'Meat', u'name': u'chuck steaks', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 23145, u'unit': u''}, {u'originalString': u'2 tbsp. cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'12 oz. green beans, cleaned and trimmed', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'cleaned', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11052, u'unit': u'oz'}, {u'originalString': u'kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbd c. sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'c'}, {u'originalString': u'1 sweet onion, cut in half and sliced thin', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'sliced', u'cut in half and  thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'2 tsp. worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://wearychef.com/2013/09/12/fork-tender-steaks/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Pour worcestershire sauce evenly over the steaks, and lightly sprinkle all sides with salt and pepper.Stir beef broth, sour cream, and garlic powder together with a fork, and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a 12" skillet over medium-high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add olive oil, and heat until shimmery.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add onion, and cook until starting to brown, 3-5 minutes.Push onion to one side of the pan, and place steaks in. Cook steaks about 2 minutes per side, just until browned. Reduce heat to medium. Shift steaks to center of pan, and arrange onions over the top.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread green beans over the meat, and pour beef broth mixture over the top. Bring to a simmer. Cover, and reduce heat to medium-low. Simmer for about 2 hours, until steaks are fork tender. (Check on the pan occasionally to make sure it stays at a low simmer.)About 10 minutes before serving, stir cornstarch into \xbc c. cold water until dissolved.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour cornstarch slurry into skillet and gently stir. This step will thicken the gravy a bit.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is Black River Winery Merlot. It has 4.3 out of 5 stars and a bottle costs about 10 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': None, u'title': u'Black River Winery Merlot', u'price': u'$10.0', u'id': 430352, u'link': u'https://www.amazon.com/2009-Black-River-Winery-Merlot/dp/B00ED59310', u'imageUrl': u'https://spoonacular.com/productImages/430352-312x231.jpg'}]}, u'aggregateLikes': 30, u'instructions': u'Pour worcestershire sauce evenly over the steaks, and lightly sprinkle all sides with salt and pepper.Stir beef broth, sour cream, and garlic powder together with a fork, and set aside.Heat a 12" skillet over medium-high heat. Add olive oil, and heat until shimmery. Add onion, and cook until starting to brown, 3-5 minutes.Push onion to one side of the pan, and place steaks in. Cook steaks about 2 minutes per side, just until browned. Reduce heat to medium. Shift steaks to center of pan, and arrange onions over the top.Spread green beans over the meat, and pour beef broth mixture over the top. Bring to a simmer. Cover, and reduce heat to medium-low. Simmer for about 2 hours, until steaks are fork tender. (Check on the pan occasionally to make sure it stays at a low simmer.)About 10 minutes before serving, stir cornstarch into \xbc c. cold water until dissolved. Pour cornstarch slurry into skillet and gently stir. This step will thicken the gravy a bit.', u'spoonacularSourceUrl': u'https://spoonacular.com/fork-tender-steaks-with-green-beans-and-gravy-a-frugal-skillet-dinner-514649', u'dishTypes': [], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}