{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/504386-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 504386, u'veryPopular': False, u'lowFodmap': True, u'title': u'Gooseberry, elderflower & Sauvignon sorbet', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 15, u'pricePerServing': 170.77, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 egg white (see tip, below)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [u'(see tip, below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'5 tbsp undiluted elderflower cordial', u'aisle': u'Health Foods;Gourmet', u'name': u'elderflower', u'metaInformation': [u'undiluted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elderflower.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 11211111, u'unit': u'tbsp'}, {u'originalString': u'900g gooseberries, topped and tailed', u'aisle': u'Produce', u'name': u'gooseberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gooseberries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 900.0, u'consistency': u'solid', u'id': 9107, u'unit': u'g'}, {u'originalString': u'300ml good Sauvignon Blanc (sparkling is good if you can find it, but not essential)', u'aisle': u'Alcoholic Beverages', u'name': u'sauvignon blanc', u'metaInformation': [u'good', u'canned', u'(sparkling is if you can find it, but not essential)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 14134, u'unit': u'ml'}, {u'originalString': u'200g white caster sugar (white sugar helps to keep the colour bright)', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'white', u'( sugar helps to keep the colour bright)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/gooseberry-elderflower-sauvignon-sorbet', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the wine and sugar in a large pan and gently heat until the sugar has dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the gooseberries and elderflower cordial, cover and bring to a simmer for 5 mins or until the berries are squishy. Cool a little.In two batches, blitz to a pur\xe9e in a food processor.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gooseberries.jpg', u'id': 9107, u'name': u'gooseberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elderflower.jpg', u'id': 11211111, u'name': u'elderflower'}]}, {u'equipment': [], u'step': u'Transfer to a freezerproof container (about 2 litres should do it), cool at room temperature, stirring now and again, then cover and freeze overnight until solid.The next day, leave at room temp for 15 mins or until just softened. Chop into rough chunks, then process with the egg white until thick, pale and smooth. Spoon the sorbet back into the container and refreeze. Will keep for up to 1 month.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [], u'step': u'Let it soften for a few mins out of the freezer before you scoop.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert on the menu? Try pairing with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 24, u'instructions': u'Put the wine and sugar in a large pan and gently heat until the sugar has dissolved. Add the gooseberries and elderflower cordial, cover and bring to a simmer for 5 mins or until the berries are squishy. Cool a little.In two batches, blitz to a pur\xe9e in a food processor. Transfer to a freezerproof container (about 2 litres should do it), cool at room temperature, stirring now and again, then cover and freeze overnight until solid.The next day, leave at room temp for 15 mins or until just softened. Chop into rough chunks, then process with the egg white until thick, pale and smooth. Spoon the sorbet back into the container and refreeze. Will keep for up to 1 month. Let it soften for a few mins out of the freezer before you scoop.', u'spoonacularSourceUrl': u'https://spoonacular.com/gooseberry-elderflower-sauvignon-sorbet-504386', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}