{u'recipes': [{u'sourceName': u'Pies and Plots', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/625776-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 625776, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Best Homemade Cinnamon Rolls #SundaySupper', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 79.47, u'creditText': u'Pies and Plots', u'extendedIngredients': [{u'originalString': u'1 packet dry active yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'packet', u'unitShort': u'packet', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'packet'}, {u'originalString': u'1/3 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u"3 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1 tablespoon light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 1/2-5 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbd cup + 1 tablespoon granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 \xbd tablespoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'\xbe cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 \xbc cups packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cups'}, {u'originalString': u'\xbc cup milk (I used almond, use what you love)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(I used almond, use what you love)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 stick unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'stick'}, {u'originalString': u'2 teaspoons vanilla bean paste', u'aisle': u'Gourmet', u'name': u'vanilla bean paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93813, u'unit': u'teaspoons'}, {u'originalString': u'\xbe cup warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://piesandplots.net/the-best-homemade-cinnamon-rolls-sundaysupper/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Make the dough.  In a large bowl, pour in water, yeast, and 1 tablespoon of sugar.  Stir and let proof 5 minutes.  When the mixture is bubbly, add remaining  cup sugar and salt.  Stir to incorporate.  In a small bowl, stir together milk, oil, and egg.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add to the yeast mixture and stir to incorporate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Add 2 cups of flour and mix to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add additional flour in  cup increments until the dough comes together and is sticky, but not sticky enough to stick to hands.  Knead the dough by hand for about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the dough in an oiled bowl (the same one is fine), cover with plastic wrap, and allow to rise in a warm place for about 2 hours until at least doubled in size.Prepare the pan.  Line a 9 by 13 inch pan with parchment.  Butter with the 2 tablespoons of butter.  Sprinkle with brown sugar and cinnamon.Make the filling.  In a medium sized bowl, stir together brown sugar, cinnamon, and cornstarch.  Flour a large, clean surface to roll out the dough.  Lightly flour the dough, the rolling pin, and your hands.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Roll out dough to a large rectangle, perhaps about 12 by 20 inches, until it is -1/2 inch thick.  Just do the best you can  it doesnt have to be perfect.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the butter over the dough and sprinkle the brown sugar mixture over it.  Use all of it.  Lightly press it into the dough.Starting from one of the long sides of dough, roll into a tight spiral.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [], u'step': u'Cut off the uneven ends.  Then cut the roll in half, in half again, and then cut each half into thirds, leaving you with 12 rolls.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the rolls into the prepared pan, cover with plastic wrap, and place in a warm place to rise for about 2 hours.  They should be giant and touching.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake for 20-25 minutes until golden brown and cooked through.  I highly recommend peeking inside one of the center ones with a fork or knife to be sure its cooked (I made the mistake of not doing that with a different recipe.  My frosted cinnamon rolls were raw.  No bueno!)While the rolls bake, make the frosting.  In a large bowl, beat together cream cheese and butter using a hand or stand mixer.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add vanilla bean paste, corn syrup, and lemon juice and beat to combine.  Slowly add confectioners sugar while beating on low.  Once all the sugar has been added, beat until frosting is light and fluffy.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 93813, u'name': u'vanilla paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the rolls from the oven and frost immediately with half of the frosting.  Allow them to cool a couple minutes and then add more frosting.  You can also serve with a dollop of frosting on the side.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Rolls are best served hot out of the oven, but they may be stored in an airtight container in the refrigerator for up to 3 days.  Warm them in the microwave for 30 seconds.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Rolls may also be frozen, wrapped in parchment and foil and placed in a zipper bag for up to 3 months.  Thaw in the refrigerator for a couple hours or in the microwave for about 1 minute, until warm.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 23, u'instructions': u'Make the dough.  In a large bowl, pour in water, yeast, and 1 tablespoon of sugar.  Stir and let proof 5 minutes.  When the mixture is bubbly, add remaining  cup sugar and salt.  Stir to incorporate.  In a small bowl, stir together milk, oil, and egg.  Add to the yeast mixture and stir to incorporate.  Add 2 cups of flour and mix to combine.  Add additional flour in  cup increments until the dough comes together and is sticky, but not sticky enough to stick to hands.  Knead the dough by hand for about 5 minutes.  Place the dough in an oiled bowl (the same one is fine), cover with plastic wrap, and allow to rise in a warm place for about 2 hours until at least doubled in size.Prepare the pan.  Line a 9 by 13 inch pan with parchment.  Butter with the 2 tablespoons of butter.  Sprinkle with brown sugar and cinnamon.Make the filling.  In a medium sized bowl, stir together brown sugar, cinnamon, and cornstarch.  Flour a large, clean surface to roll out the dough.  Lightly flour the dough, the rolling pin, and your hands.  Roll out dough to a large rectangle, perhaps about 12 by 20 inches, until it is -1/2 inch thick.  Just do the best you can  it doesnt have to be perfect.  Spread the butter over the dough and sprinkle the brown sugar mixture over it.  Use all of it.  Lightly press it into the dough.Starting from one of the long sides of dough, roll into a tight spiral.  Cut off the uneven ends.  Then cut the roll in half, in half again, and then cut each half into thirds, leaving you with 12 rolls.  Place the rolls into the prepared pan, cover with plastic wrap, and place in a warm place to rise for about 2 hours.  They should be giant and touching.Bake for 20-25 minutes until golden brown and cooked through.  I highly recommend peeking inside one of the center ones with a fork or knife to be sure its cooked (I made the mistake of not doing that with a different recipe.  My frosted cinnamon rolls were raw.  No bueno!)While the rolls bake, make the frosting.  In a large bowl, beat together cream cheese and butter using a hand or stand mixer.  Add vanilla bean paste, corn syrup, and lemon juice and beat to combine.  Slowly add confectioners sugar while beating on low.  Once all the sugar has been added, beat until frosting is light and fluffy.Remove the rolls from the oven and frost immediately with half of the frosting.  Allow them to cool a couple minutes and then add more frosting.  You can also serve with a dollop of frosting on the side.Rolls are best served hot out of the oven, but they may be stored in an airtight container in the refrigerator for up to 3 days.  Warm them in the microwave for 30 seconds.  Rolls may also be frozen, wrapped in parchment and foil and placed in a zipper bag for up to 3 months.  Thaw in the refrigerator for a couple hours or in the microwave for about 1 minute, until warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-best-homemade-cinnamon-rolls-sundaysupper-625776', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}