{u'recipes': [{u'sourceName': u'Crumb', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/539346-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 539346, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fava and Ricotta Crostini', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 58.75, u'creditText': u'Crumb', u'extendedIngredients': [{u'originalString': u'8 slices of crusty baguette, cut \xbe” thick on the diagonal', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18033, u'unit': u'slices'}, {u'originalString': u'1\xbd cup shelled fava beans ( - 1.5 lbs in the pod)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'fava beans', u'metaInformation': [u'shelled', u'( - 1.5 lbs in the pod)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broad-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 16053, u'unit': u'cup'}, {u'originalString': u'2 tbsp roughly chopped fresh mint', u'aisle': u'Produce', u'name': u'fresh mint', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2064, u'unit': u'tbsp'}, {u'originalString': u'2 cloves garlic, cut in half', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tbsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u'tsp'}, {u'originalString': u'1 cup full-fat ricotta cheese', u'aisle': u'Cheese', u'name': u'low fat ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1037, u'unit': u'cup'}, {u'originalString': u'2 tbsp olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbc cup finely chopped red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'Salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.crumbblog.com/2012/05/fava-and-ricotta-crostini.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Rub slices of baguette with garlic cloves and brush lightly with olive oil on both sides. Lightly toast under a hot broiler (or on a hot grill, if you’re thusly inclined). Set aside.Meanwhile, in a large pot of boiling unsalted water, cook shelled fava beans until tender, about 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broad-beans.jpg', u'id': 16053, u'name': u'fava beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}, {u'equipment': [], u'step': u'Drain and let cool, then carefully peel off the tough outer skin from each bean.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tbsp olive oil in a medium saute pan set over medium-high heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Saute onions for 5-7 minutes, or until soft and just starting to colour. Stir in favas and cook for another 3-4 minutes or until warmed through.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the cooked favas to a medium bowl. Toss the warm favas with remaining tbsp olive oil, lemon juice, lemon zest and mint until combined, then mash slightly with the back of a fork to create a chunky spread of sorts. Season to taste with salt and pepper.Arrange the prepared toasts on a serving platter.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Spread each slice with 2-3 tbsp ricotta, then spoon favas on top, dividing evenly among the crostini.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-baguette-or-crostini.jpg', u'id': 10018033, u'name': u'crostini'}]}, {u'equipment': [], u'step': u'Drizzle with a bit more olive oil, and serve immediately.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'aggregateLikes': 116, u'instructions': u'Rub slices of baguette with garlic cloves and brush lightly with olive oil on both sides. Lightly toast under a hot broiler (or on a hot grill, if you’re thusly inclined). Set aside.Meanwhile, in a large pot of boiling unsalted water, cook shelled fava beans until tender, about 6 to 8 minutes. Drain and let cool, then carefully peel off the tough outer skin from each bean.Heat 1 tbsp olive oil in a medium saute pan set over medium-high heat. Saute onions for 5-7 minutes, or until soft and just starting to colour. Stir in favas and cook for another 3-4 minutes or until warmed through.Transfer the cooked favas to a medium bowl. Toss the warm favas with remaining tbsp olive oil, lemon juice, lemon zest and mint until combined, then mash slightly with the back of a fork to create a chunky spread of sorts. Season to taste with salt and pepper.Arrange the prepared toasts on a serving platter. Spread each slice with 2-3 tbsp ricotta, then spoon favas on top, dividing evenly among the crostini. Drizzle with a bit more olive oil, and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/fava-and-ricotta-crostini-539346', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}