{u'recipes': [{u'sourceName': u'Cravings of a Lunatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608544-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 608544, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bourbon Bacon Jam #BaconMonth', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 629.79, u'creditText': u'Cravings of a Lunatic', u'extendedIngredients': [{u'originalString': u'1 1/2 pounds of bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 10123, u'unit': u'pounds'}, {u'originalString': u'1/4 cup balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'1/2 cup bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10014037, u'unit': u'cup'}, {u'originalString': u'1/2 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'4 garlic cloves, finely chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'2 cups of shallots, finely chopped', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}, {u'originalString': u'1 cup vidalia onion, or any sweet onion, finely chopped', u'aisle': u'Produce', u'name': u'vidalia onion', u'metaInformation': [u'sweet', u'or any  onion, finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.cravingsofalunatic.com/2014/08/bourbon-bacon-jam.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 55, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook the bacon in two frying pans to allow for room for it to crisp up properly. Cook over medium heat until it browns perfectly. You want the bacon a little crisper with as little visible fat as possible.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer to paper towels to drain excess fat off. Pulse your shallots and onions in the food processor or cut them by hand. Leave about 1 to 2 tablespoons of the fat in one of the pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add shallot and onion to the pan, cook over medium heat until they start to caramelize.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the garlic and cook for about one more minute.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chili powder and smoked paprika, stir to combine.Increase heat to high and add the bourbon (carefully) and maple syrup. Bring to a boil, stir and scrape the pan so all the little bacon bits comes loose Continue boiling for about 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1012028, u'name': u'smoked paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add vinegar and brown sugar, continue to boil for about 3 minutes. Using a sharp knife cut the bacon into small pieces. You can also tear it by hand so it looks more rustic, not too perfect. Personal choice.Toss the bacon into the pan, reduce heat to low and simmer for about 10 minutes, the mixture will thicken and look jam like in the process.Turn off the stove top.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u"Drain any excess fat off the bacon jam by pouring it through a sieve or use cheesecloth to drain it through. Now you have two options, you can pop the mixture into a food processor and pulse until it breaks down more. Or you can leave it chunkier (I like the more rustic, chunkier look) and don't bother pulsing it. Your choice.", u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Transfer to jars and store in the fridge. You can heat it up in the microwave whenever you want to top something with the jam. I used it over smoked sausages cooked on the grill. Divine.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with a big old bacon loving smile!', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2138, u'instructions': u"Cook the bacon in two frying pans to allow for room for it to crisp up properly. Cook over medium heat until it browns perfectly. You want the bacon a little crisper with as little visible fat as possible. Transfer to paper towels to drain excess fat off. Pulse your shallots and onions in the food processor or cut them by hand. Leave about 1 to 2 tablespoons of the fat in one of the pan. Add shallot and onion to the pan, cook over medium heat until they start to caramelize. Add the garlic and cook for about one more minute. Add the chili powder and smoked paprika, stir to combine.Increase heat to high and add the bourbon (carefully) and maple syrup. Bring to a boil, stir and scrape the pan so all the little bacon bits comes loose Continue boiling for about 2 to 3 minutes. Add vinegar and brown sugar, continue to boil for about 3 minutes. Using a sharp knife cut the bacon into small pieces. You can also tear it by hand so it looks more rustic, not too perfect. Personal choice.Toss the bacon into the pan, reduce heat to low and simmer for about 10 minutes, the mixture will thicken and look jam like in the process.Turn off the stove top. Drain any excess fat off the bacon jam by pouring it through a sieve or use cheesecloth to drain it through. Now you have two options, you can pop the mixture into a food processor and pulse until it breaks down more. Or you can leave it chunkier (I like the more rustic, chunkier look) and don't bother pulsing it. Your choice. Transfer to jars and store in the fridge. You can heat it up in the microwave whenever you want to top something with the jam. I used it over smoked sausages cooked on the grill. Divine. Serve with a big old bacon loving smile!", u'spoonacularSourceUrl': u'https://spoonacular.com/bourbon-bacon-jam-baconmonth-608544', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}