{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/3701-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 3701, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spring Shellfish Stew', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 4273.88, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'1 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 28 ounce can peeled whole tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'whole', u'peeled', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'3 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 8 ounce bottle clam juice', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'clam juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clam-juice.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 14187, u'unit': u'ounce'}, {u'originalString': u'2 cups dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cups'}, {u'originalString': u'1/4 cup fresh flat-leaf parsley, finely chopped', u'aisle': u'Produce', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, finely chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 pound halibut filet, peeled and cut into 1-inch cubes (5 cups)', u'aisle': u'Seafood', u'name': u'halibut', u'metaInformation': [u'peeled', u'cut into 1-inch cubes (5 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halibut-fillet.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15036, u'unit': u'pound'}, {u'originalString': u'1/2 pound kale, stemmed and sliced into 1/4-inch thick ribbons', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'stemmed', u'sliced into 1/ ribbons'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11233, u'unit': u'pound'}, {u'originalString': u'3/4 pound manila clams, scrubbed clean', u'aisle': u'Seafood', u'name': u'manila clams', u'metaInformation': [u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/littleneck-clams.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 10015157, u'unit': u'pound'}, {u'originalString': u"3/4 pound mussels, scrubbed clean and debearded if necessary (discard any that are broken or won't close)", u'aisle': u'Seafood', u'name': u'mussels', u'metaInformation': [u'scrubbed', u"(discard any that are broken or won't close)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 15164, u'unit': u'pound'}, {u'originalString': u'1/4 pound pancetta, cut into 1/4-inch cubes', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [u'cut into 1/4-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 10410123, u'unit': u'pound'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 pound (about 12) extra large shrimp, deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'extra large', u'deveined', u'( 12)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1 yellow onion, halved and thinly sliced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'halved', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.foodrepublic.com/2012/04/27/spring-shellfish-stew-recipe-0', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 55, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a large, deep soup pot over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the pancetta, cover, and cook until browned, stirring frequently, about 10 minutes. Using a slotted spoon, transfer the pancetta to a paper towel-lined plate, leaving the fat in the pot.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the onion to the pot and cook until soft, about 10 minutes, stirring occasionally.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the garlic, red pepper, and kale, season to taste with salt and pepper, and cook for another 10 minutes, stirring and turning as the kale on the bottom cooks down. Increase the heat to high, add the wine, and simmer for 2 minutes. Use your hands to break the tomatoes into small pieces and add them, along with their juices, and the clam juice, stock, and pancetta to the pot. Lower the heat to medium and simmer the stew, partially covered, until the kale is soft and the tomatoes begin to break down, about 30 minutes. (You can add a little water, if too much evaporates.) Season to taste with salt and pepper.', u'length': {u'number': 42, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clam-juice.png', u'id': 14187, u'name': u'clam juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the clams and mussels to the pot and cook, tightly covered, for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [], u'step': u'Add the fish and shrimp, if using, stirring them into the broth, and simmer, covered, until the fish is cooked and all the shellfish have opened, another 5 minutes or so.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve piping hot in bowls, sprinkled with the parsley. (Discard any clams or mussels that wont open.)', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u'Heat a large, deep soup pot over medium heat. Add the pancetta, cover, and cook until browned, stirring frequently, about 10 minutes. Using a slotted spoon, transfer the pancetta to a paper towel-lined plate, leaving the fat in the pot. Add the onion to the pot and cook until soft, about 10 minutes, stirring occasionally. Add the garlic, red pepper, and kale, season to taste with salt and pepper, and cook for another 10 minutes, stirring and turning as the kale on the bottom cooks down. Increase the heat to high, add the wine, and simmer for 2 minutes. Use your hands to break the tomatoes into small pieces and add them, along with their juices, and the clam juice, stock, and pancetta to the pot. Lower the heat to medium and simmer the stew, partially covered, until the kale is soft and the tomatoes begin to break down, about 30 minutes. (You can add a little water, if too much evaporates.) Season to taste with salt and pepper. Add the clams and mussels to the pot and cook, tightly covered, for 5 minutes. Add the fish and shrimp, if using, stirring them into the broth, and simmer, covered, until the fish is cooked and all the shellfish have opened, another 5 minutes or so. Serve piping hot in bowls, sprinkled with the parsley. (Discard any clams or mussels that wont open.)', u'spoonacularSourceUrl': u'https://spoonacular.com/spring-shellfish-stew-3701', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'spring', u'fall', u'winter', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}