{u'recipes': [{u'sourceName': u'Closet Cooking', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/248426-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 248426, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow Cooker Bacon Wrapped Apple BBQ Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 255.29, u'creditText': u'Closet Cooking', u'extendedIngredients': [{u'originalString': u'2 large apples, peeled and cur into small pieces', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'small', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'4 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1/2 cup BBQ sauce (homemade or store bought)', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'homemade', u'store bought', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'2 tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'2 small boneless skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.closetcooking.com/2012/10/slow-cooker-bacon-wrapped-apple-bbq.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Wrap each chicken breast in 2 slices of bacon and place in a slow cooker.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Mix the BBQ sauce, apples and lemon juice and pour it over the chicken.Cook on low for 8 hours.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Barbecue Chicken works really well with Zinfandel and Sparkling ros\xe9. Fruity, low tannin zinfandel is great for any sticky, saucy barbecue chicken dish. If you're not feeling red wine, a sparkling ros\xe9 will work too. You could try Bella Grace Vineyards Old Vine Zinfandel. Reviewers quite like it with a 5 out of 5 star rating and a price of about 29 dollars per bottle.", u'pairedWines': [u'zinfandel', u'sparkling rose'], u'productMatches': [{u'description': u'The 2012 Old Vine Zinfandel, a crimson red wine, opens with dark cherry, tobacco and mild tannins. Mid-palate flavors of holiday spice and nutmeg develop along with ripe raspberries. The finish is pleasant and slightly smoky with light notes of black pepper. Pair with red meats, hearty stews and chocolates, or with a loved one in front of the fire.', u'title': u'Bella Grace Vineyards Old Vine Zinfandel', u'price': u'$29.0', u'id': 430961, u'link': u'https://www.amazon.com/Bella-Vineyards-Amador-County-Zinfandel/dp/B016WNI6IQ', u'imageUrl': u'https://spoonacular.com/productImages/430961-312x231.jpg'}]}, u'aggregateLikes': 17360, u'instructions': u'Wrap each chicken breast in 2 slices of bacon and place in a slow cooker.Mix the BBQ sauce, apples and lemon juice and pour it over the chicken.Cook on low for 8 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-bacon-wrapped-apple-bbq-chicken-248426', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 490, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}