{u'recipes': [{u'sourceName': u'Gourmande in the Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/603028-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 110, u'id': 603028, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chilled Tomato Peach Soup with Pistachio Basil Pistou', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 432.03, u'creditText': u'Gourmande in the Kitchen', u'extendedIngredients': [{u'originalString': u'1 \xbd Tablespoon/22ml pistachio oil or avocado or extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tablespoon'}, {u'originalString': u'Fleur de sel (divided use)', u'aisle': u'Spices and Seasonings', u'name': u'fleur de sel', u'metaInformation': [u'divided', u'( use)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1022047, u'unit': u'servings'}, {u'originalString': u'8-10 fresh basil leaves (divided use)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'divided', u'( use)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'2 large yellow heirloom tomatoes', u'aisle': u'Produce', u'name': u'heirloom tomatoes', u'metaInformation': [u'yellow', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'The juice of 1 large or two small limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'small', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'The zest of \xbd a lime', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'4 medium ripe yellow peaches', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'yellow', u'ripe', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'\xbc cup/28g pistachios , shelled', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'shelled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://gourmandeinthekitchen.com/2014/chilled-tomato-peach-soup-with-pistachio-basil-pistou/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Peel the peaches and tomatoes using a sharp paring knife  (the skins should come off fairly easily if ripe) or by briefly blanching in boiling water.  To blanch peaches and tomatoes make a small slit with a paring knife at the base of each. Gently lower into a large pot of boiling water for 30 seconds. Using a slotted spoon remove the peaches and tomatoes from the hot water, and plunge into an ice water bath to cool. The skins should slip off.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Combine the peeled peaches and tomatoes with a pinch of salt and four or five large basil leaves in a blender  along with the lime juice and lime zest. Blend on high until smooth and finely pureed. Taste and season with additional salt if needed. Refrigerate until well chilled (at least 2 hours).Meanwhile make the pistachio basil pistou by pulsing together the shelled pistachios and four or five basil leaves with a pinch of salt in a small food processor  or finely chop by hand with a sharp chef’s knife .', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the pistachio oil and pulse until just combined or stir into the finely hand chopped basil and pistachios.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve soup in chilled bowls or glasses topped with the pistachio basil pistou.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 278, u'instructions': u'Peel the peaches and tomatoes using a sharp paring knife  (the skins should come off fairly easily if ripe) or by briefly blanching in boiling water.  To blanch peaches and tomatoes make a small slit with a paring knife at the base of each. Gently lower into a large pot of boiling water for 30 seconds. Using a slotted spoon remove the peaches and tomatoes from the hot water, and plunge into an ice water bath to cool. The skins should slip off.Combine the peeled peaches and tomatoes with a pinch of salt and four or five large basil leaves in a blender  along with the lime juice and lime zest. Blend on high until smooth and finely pureed. Taste and season with additional salt if needed. Refrigerate until well chilled (at least 2 hours).Meanwhile make the pistachio basil pistou by pulsing together the shelled pistachios and four or five basil leaves with a pinch of salt in a small food processor  or finely chop by hand with a sharp chef’s knife . Add the pistachio oil and pulse until just combined or stir into the finely hand chopped basil and pistachios.Serve soup in chilled bowls or glasses topped with the pistachio basil pistou.', u'spoonacularSourceUrl': u'https://spoonacular.com/chilled-tomato-peach-soup-with-pistachio-basil-pistou-603028', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}