{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217919-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 217919, u'veryPopular': False, u'lowFodmap': False, u'title': u'Rabbit with mustard & bacon', u'diets': [u'gluten free'], u'preparationMinutes': 40, u'pricePerServing': 865.43, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'3 tbsp cr\xe8me fra\xeeche', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'creme fraiche', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001056, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tbsp'}, {u'originalString': u'1 small garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'small', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'servings'}, {u'originalString': u'grated zest \xbd lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'steamed, peeled new potatoes, to serve', u'aisle': u'Produce', u'name': u'new potatoes', u'metaInformation': [u'steamed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11352, u'unit': u'servings'}, {u'originalString': u'10 slices pancetta from a pack', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 10.0, u'consistency': u'solid', u'id': 10410123, u'unit': u'slices'}, {u'originalString': u'small handful parsley and tarragon leaves, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley leaves', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'2 rabbit legs (see tips below)', u'aisle': u'Meat', u'name': u'rabbit', u'metaInformation': [u'(see tips below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rabbit.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 17180, u'unit': u''}, {u'originalString': u'1 tbsp grain mustard', u'aisle': u'Condiments', u'name': u'whole-grain mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012046, u'unit': u'tbsp'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1272643/rabbit-with-mustard-and-bacon', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Mash the butter with the herbs, garlicand lemon zest, then chill. This can bedone up to a day in advance. Use a smallsturdy knife to scrape the meat awayfrom the thigh bone part of the rabbit leg. Try and create a pocket around thebone rather than cutting into the actualmeat. When you get to the joint, cut orsnap the bone away.Halve the butter, roll into two logs, thenstuff into the cavity of each rabbit leg.Wrap the slices of pancetta around eachleg so that they join underneath.The rabbit can be prepared up to a dayahead and kept in the fridge.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rabbit.jpg', u'id': 17180, u'name': u'rabbit'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 220C/200C fan/gas 7.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place the rabbit on a shallow roastingtray and roast for 20-30 mins (see tip below),then leave to rest for 5 mins. While therabbit is cooking, make the sauce.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rabbit.jpg', u'id': 17180, u'name': u'rabbit'}]}, {u'equipment': [], u'step': u'Heatthe cr\xe8me fra\xeeche with both mustardsand simmer for 2-3 mins until thickenedslightly. Season to taste, then add asqueeze of lemon juice and set aside.To serve, spoon some sauce onto eachplate and carve the rabbit into thickslices. Arrange the rabbit on top of thesauce with some steamed new potatoeson the side.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1001056, u'name': u'creme fraiche'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rabbit.jpg', u'id': 17180, u'name': u'rabbit'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 17, u'instructions': u'Mash the butter with the herbs, garlicand lemon zest, then chill. This can bedone up to a day in advance. Use a smallsturdy knife to scrape the meat awayfrom the thigh bone part of the rabbit leg. Try and create a pocket around thebone rather than cutting into the actualmeat. When you get to the joint, cut orsnap the bone away.Halve the butter, roll into two logs, thenstuff into the cavity of each rabbit leg.Wrap the slices of pancetta around eachleg so that they join underneath.The rabbit can be prepared up to a dayahead and kept in the fridge.Heat oven to 220C/200C fan/gas 7.Place the rabbit on a shallow roastingtray and roast for 20-30 mins (see tip below),then leave to rest for 5 mins. While therabbit is cooking, make the sauce. Heatthe cr\xe8me fra\xeeche with both mustardsand simmer for 2-3 mins until thickenedslightly. Season to taste, then add asqueeze of lemon juice and set aside.To serve, spoon some sauce onto eachplate and carve the rabbit into thickslices. Arrange the rabbit on top of thesauce with some steamed new potatoeson the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/rabbit-with-mustard-bacon-217919', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}