{u'recipes': [{u'sourceName': u'Domestic Fits', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/572595-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 572595, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sausage and Spinach Breakfast Casserole with Poached Eggs', u'diets': [], u'preparationMinutes': 6, u'pricePerServing': 196.61, u'creditText': u'Domestic Fits', u'extendedIngredients': [{u'originalString': u'8 ounces raw chicken sausage, removed from casing, crumbled', u'aisle': u'Meat', u'name': u'chicken sausage', u'metaInformation': [u'raw', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93668, u'unit': u'ounces'}, {u'originalString': u'1 lbs crusty bread, cut into cubes', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10018029, u'unit': u'lbs'}, {u'originalString': u'8 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 tsp onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'3 ounces shaved or shredded parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'shredded', u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'ounces'}, {u'originalString': u'6 eggs poached (or substitute a large Tbsp of sour cream on each serving)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'poached eggs', u'metaInformation': [u'sour', u'large', u'(or substitute a Tbsp of cream on each serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poached-egg.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1131, u'unit': u''}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 cup chopped fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}, {u'originalString': u'1 \xbd cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://domesticfits.com/2013/05/30/sausage-and-spinach-breakfast-casserole-with-poached-eggs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Arrange bread cubes, spinach and sausage crumbles in a 9x13 baking dish that has been sprayed with cooking spray. In a large bowl mix the eggs, milk, onion powder, garlic powder and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour mixture over bread cubes evenly, toss gently to coat. Sprinkle with parmesan. Cover and refrigerate overnight. Preheat oven to 350', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Bake at 350 for 50-60 minutes or until eggs have set.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Cut into squares, top with poached eggs or sour cream.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poached-egg.png', u'id': 1131, u'name': u'poached egg'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 167, u'instructions': u'Arrange bread cubes, spinach and sausage crumbles in a 9x13 baking dish that has been sprayed with cooking spray. In a large bowl mix the eggs, milk, onion powder, garlic powder and salt. Pour mixture over bread cubes evenly, toss gently to coat. Sprinkle with parmesan. Cover and refrigerate overnight. Preheat oven to 350Bake at 350 for 50-60 minutes or until eggs have set. Cut into squares, top with poached eggs or sour cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/sausage-and-spinach-breakfast-casserole-with-poached-eggs-572595', u'dishTypes': [u'side dish', u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [u'fall', u'winter', u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 56, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}