{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597781-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 597781, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple Spice Cake with Caramel Sauce', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 218.15, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 1/4 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'3 cups cake flour', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10020129, u'unit': u'cups'}, {u'originalString': u'1 14-ounce bag caramels', u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 19074, u'unit': u'ounce'}, {u'originalString': u"3 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'6 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon grated ginger (optional)', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 cups peeled and shredded Granny Smith apples (about 4)', u'aisle': u'Produce', u'name': u'granny smith apples', u'metaInformation': [u'shredded', u'peeled', u'( 4)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1029003, u'unit': u'cups'}, {u'originalString': u'3 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'2 teaspoons ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup (8 ounces) mascarpone (Italian cream cheese, available at most grocery stores)', u'aisle': u'Cheese', u'name': u'mascarpone', u'metaInformation': [u'italian', u'( cream cheese, available at most grocery stores)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93820, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons light molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19304, u'unit': u'tablespoons'}, {u'originalString': u'2 cups pecan pieces, toasted (optional)', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'pecan pieces', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10012142, u'unit': u'cups'}, {u'originalString': u'1 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cups'}, {u'originalString': u'2 tablespoons plus 1 1/2 cups unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://leitesculinaria.com/2303/recipes-apple-spice-cake-caramel-sauce.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 51, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the cake1.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place one oven rack in the bottom third of the oven and a second rack in the top third of the oven. Preheat the oven to 350F (175C). Grease three 9-inch cake pans with butter or cooking spray, then line each with a parchment paper round and grease the rounds.2. Using an electric mixer fitted with the paddle attachment, cream the butter and sugar on medium-high speed until light and fluffy, about 3 minutes. Scrape down the sides of the bowl with a rubber spatula. Beat in the molasses.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the eggs, one at a time, beating between each addition. In a medium bowl, stir together the flour, baking soda, salt, and ground spices to blend.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the flour mixture and sour cream alternately to the batter. (Start and end with the flour mixture, adding the flour mixture in 3 increments and the sour cream in 2 increments.) After each addition, mix on low speed just to combine the ingredients. Stir in the shredded apples, vanilla, and the ginger, if using.3. Spoon the batter (it will be thick) evenly into the prepared pans.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place two cake pans side by side on one rack and the third on the other. Stagger the cake layers on the oven racks so that no layer is directly over another.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 35 to 40 minutes, until firm to the touch. Monitor the layers carefully for doneness; each one may be done at a different time.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and let cool in the pans for 10 minutes. Run a knife around the edges of the pans and unmold the cakes onto wire racks to cool completely, 15 to 30 minutes, before frosting.4. The cakes can be kept frozen, tightly wrapped in plastic wrap, for up to 3 weeks. Defrost them at room temperature before unwrapping. Frost immediately.Make the icing5. In a medium stainless-steel bowl, combine the unwrapped caramels, 2 tablespoons of the cream, and the 2 tablespoons butter.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel candy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the bowl over a saucepan filled with 2 inches of simmering water. Stir the caramel mixture until smooth.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowl from the heat.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Let cool, stirring the mixture every few minutes until cool to the touch, about 20 minutes. (If the mixture is too warm, it will melt the buttercream frosting when it is stirred in later.)6. While the caramel is cooling, make the buttercream: Using an electric mixer fitted with the paddle attachment, beat the 1 1/2 cups butter on medium-high speed for about 1 minute, until pale in color.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the remaining 2 tablespoons cream, and the vanilla and powdered sugar, and beat for 3 minutes, until light and fluffy.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the mascarpone and beat on medium-low speed until incorporated. Do not overbeat the mascarpone or it may separate. Reserve 1/4 cup of the cooled caramel mixture to drizzle over the cake once it is frosted. Stir the remainder of the caramel into the frosting, using large strokes to create caramel swirls throughout. Dont stir it too much or the ribbons of caramel will disappear.7.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}, {u'equipment': [], u'step': u'Place one cake layer on a serving plate and spread a thick blanket of frosting on top.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Add the second layer and spread thickly with frosting.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Add the third layer and cover the top and sides of the cake with an even layer of frosting. Use a small spoon to drizzle the reserved 1/4 cup of caramel over the top of the cake. Pat on the toasted pecan pieces, if using, to cover the sides of the cake.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 10012142, u'name': u'pecan pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Spice Cake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 50, u'instructions': u'Make the cake1. Place one oven rack in the bottom third of the oven and a second rack in the top third of the oven. Preheat the oven to 350F (175C). Grease three 9-inch cake pans with butter or cooking spray, then line each with a parchment paper round and grease the rounds.2. Using an electric mixer fitted with the paddle attachment, cream the butter and sugar on medium-high speed until light and fluffy, about 3 minutes. Scrape down the sides of the bowl with a rubber spatula. Beat in the molasses. Add the eggs, one at a time, beating between each addition. In a medium bowl, stir together the flour, baking soda, salt, and ground spices to blend. Add the flour mixture and sour cream alternately to the batter. (Start and end with the flour mixture, adding the flour mixture in 3 increments and the sour cream in 2 increments.) After each addition, mix on low speed just to combine the ingredients. Stir in the shredded apples, vanilla, and the ginger, if using.3. Spoon the batter (it will be thick) evenly into the prepared pans. Place two cake pans side by side on one rack and the third on the other. Stagger the cake layers on the oven racks so that no layer is directly over another. Bake for 35 to 40 minutes, until firm to the touch. Monitor the layers carefully for doneness; each one may be done at a different time. Remove from the oven and let cool in the pans for 10 minutes. Run a knife around the edges of the pans and unmold the cakes onto wire racks to cool completely, 15 to 30 minutes, before frosting.4. The cakes can be kept frozen, tightly wrapped in plastic wrap, for up to 3 weeks. Defrost them at room temperature before unwrapping. Frost immediately.Make the icing5. In a medium stainless-steel bowl, combine the unwrapped caramels, 2 tablespoons of the cream, and the 2 tablespoons butter. Place the bowl over a saucepan filled with 2 inches of simmering water. Stir the caramel mixture until smooth. Remove the bowl from the heat. Let cool, stirring the mixture every few minutes until cool to the touch, about 20 minutes. (If the mixture is too warm, it will melt the buttercream frosting when it is stirred in later.)6. While the caramel is cooling, make the buttercream: Using an electric mixer fitted with the paddle attachment, beat the 1 1/2 cups butter on medium-high speed for about 1 minute, until pale in color. Add the remaining 2 tablespoons cream, and the vanilla and powdered sugar, and beat for 3 minutes, until light and fluffy. Add the mascarpone and beat on medium-low speed until incorporated. Do not overbeat the mascarpone or it may separate. Reserve 1/4 cup of the cooled caramel mixture to drizzle over the cake once it is frosted. Stir the remainder of the caramel into the frosting, using large strokes to create caramel swirls throughout. Dont stir it too much or the ribbons of caramel will disappear.7. Place one cake layer on a serving plate and spread a thick blanket of frosting on top. Add the second layer and spread thickly with frosting. Add the third layer and cover the top and sides of the cake with an even layer of frosting. Use a small spoon to drizzle the reserved 1/4 cup of caramel over the top of the cake. Pat on the toasted pecan pieces, if using, to cover the sides of the cake.', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-spice-cake-with-caramel-sauce-597781', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}