{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/1224-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 1224, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Fish With Orange-fennel Salsa', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 341.89, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'1 medium fennel bulb, trimmed, cut into matchstick-size strips', u'aisle': u'Produce', u'name': u'fennel bulb', u'metaInformation': [u'medium', u'trimmed', u'cut into matchstick-size strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'2 Tbsps chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Tbsps'}, {u'originalString': u'2 tsps minced peeled fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tsps'}, {u'originalString': u'1 garlic clove, thinly sliced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'5 Tbsps olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsps'}, {u'originalString': u'3 oranges', u'aisle': u'Produce', u'name': u'oranges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'1/2 medium-size red onion, thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium-size', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'4 6- to 8-oz rockfish or sea bass fillets', u'aisle': u'Seafood', u'name': u'sea bass fillets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sea-bass.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 10015004, u'unit': u'oz'}, {u'originalString': u'2 tsps plus 1 Tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tsps'}, {u'originalString': u'2 tsps sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tsps'}, {u'originalString': u'3 Tbsps white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'Tbsps'}], u'healthScore': 51.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Grilled-Fish-with-Orange-Fennel-Salsa-103883', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk 2 tablespoons oil, vinegar, cilantro, 2 teaspoons soy sauce, ginger and sugar in medium bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut peel and white pith from oranges; discard. Holding oranges over bowl to catch juices, cut between membranes to release segments into bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}]}, {u'equipment': [], u'step': u'Add fennel and onion; toss gently. Season with salt and pepper. (Salsa can be made 3 hours ahead. Cover; chill.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Prepare barbecue (medium-high heat).', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Mix 3 tablespoons oil, 1 tablespoon soy sauce and garlic in glass pie dish. Turn fish in oil mixture to coat. Sprinkle fish with salt and pepper. Grill until just opaque in center, about 3 minutes per side.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Transfer to plates. Spoon salsa over.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Proverb Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pear , Apple , Lime', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 24, u'instructions': u'Preparation                                        Whisk 2 tablespoons oil, vinegar, cilantro, 2 teaspoons soy sauce, ginger and sugar in medium bowl. Cut peel and white pith from oranges; discard. Holding oranges over bowl to catch juices, cut between membranes to release segments into bowl. Add fennel and onion; toss gently. Season with salt and pepper. (Salsa can be made 3 hours ahead. Cover; chill.)                                                                            Prepare barbecue (medium-high heat). Mix 3 tablespoons oil, 1 tablespoon soy sauce and garlic in glass pie dish. Turn fish in oil mixture to coat. Sprinkle fish with salt and pepper. Grill until just opaque in center, about 3 minutes per side. Transfer to plates. Spoon salsa over.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-fish-with-orange-fennel-salsa-1224', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 187, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}