{u'recipes': [{u'sourceName': u'Sugar Dish Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/518363-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 518363, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bourbon Spiked Hot Chocolate', u'diets': [], u'pricePerServing': 162.22, u'creditText': u'Sugar Dish Me', u'extendedIngredients': [{u'originalString': u'8 tablespoons bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 tablespoons half and half (optional)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1049, u'unit': u'tablespoons'}, {u'originalString': u'1 cup mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u'cup'}, {u'originalString': u'3\xbd cups reduced fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'reduced fat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 1174, u'unit': u'cups'}, {u'originalString': u'a dash of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'dash'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.sugardishme.com/2013/01/17/bourbon-spiked-hot-chocolate/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"In a medium saucepan stir together the cocoa powder, sugar, and salt.Stir in the boiling water until the sugar has dissolved and the cocoa isn't lumpy. Turn the burner to medium heat.Stir in the milk.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Let the milk heat up, stirring occasionally. Watch it carefully so it doesn't scorch!! Remember you aren't cooking the milk. Just warming it.When the hot chocolate has reached your desired drinking temperature, remove it from the heat and stir in the vanilla, half and half, and bourbon.Divide the hot chocolate between 4 mugs, top each with marshmallows, and serve immediately.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u''}], u'aggregateLikes': 677, u'instructions': u"In a medium saucepan stir together the cocoa powder, sugar, and salt.Stir in the boiling water until the sugar has dissolved and the cocoa isn't lumpy. Turn the burner to medium heat.Stir in the milk. Let the milk heat up, stirring occasionally. Watch it carefully so it doesn't scorch!! Remember you aren't cooking the milk. Just warming it.When the hot chocolate has reached your desired drinking temperature, remove it from the heat and stir in the vanilla, half and half, and bourbon.Divide the hot chocolate between 4 mugs, top each with marshmallows, and serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/bourbon-spiked-hot-chocolate-518363', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}