{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/382964-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 382964, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Chow Mein', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 57.42, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 envelopes brown gravy mix', u'aisle': u'Canned and Jarred', u'name': u'brown gravy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'unitLong': u'envelopes', u'unitShort': u'envelopes', u'amount': 2.0, u'consistency': u'solid', u'id': 6998, u'unit': u'envelopes'}, {u'originalString': u'1 bunch celery, sliced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'bunch'}, {u'originalString': u'Hot cooked rice', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'hot', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'servings'}, {u'originalString': u'2 cans (14 ounces each) Chinese vegetables, drained', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'chinese', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 11583, u'unit': u'ounces'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/easy-chow-mein', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, cook beef and onion over medium heat until meat is no longer pink; drain.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer to a 3-qt. slow cooker. Stir in the celery, Chinese vegetables, gravy mixes and soy sauce. Cover and cook on low for 4-6 hours or until celery is tender, stirring occasionally.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'Serve over rice.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chow Mein works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Ken Forrester Old Vine Reserve Chenin Blanc with a 4.9 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This full-bodied Chenin harmoniously balances ripe fruit with delicate oak nuances. It flaunts a rich, luscious mouthfeel, with flavors of melon and tropical fruit enhanced by complex mineral notes and hints of spice. Extended lees contact imparts an alluring honeycomb character.', u'title': u'Ken Forrester Old Vine Reserve Chenin Blanc', u'price': u'$15.99', u'id': 442201, u'link': u'https://www.wine.com/product/ken-forrester-old-vine-reserve-chenin-blanc-2010/112605', u'imageUrl': u'https://spoonacular.com/productImages/442201-312x231.jpg'}]}, u'aggregateLikes': 97, u'instructions': u'Directions                                                                                In a large skillet, cook beef and onion over medium heat until meat is no longer pink; drain. Transfer to a 3-qt. slow cooker. Stir in the celery, Chinese vegetables, gravy mixes and soy sauce. Cover and cook on low for 4-6 hours or until celery is tender, stirring occasionally. Serve over rice.                                        Yield: 8 servings.                                                                                                     Purchase celery with crisp, firm and unblemished ribs and fresh green leaves. Refrigerate celery in a plastic bag for up to 2 weeks. Wash and trim the base and leaves just before serving.                                                                                                Originally published as Easy Chow Mein in  Taste of Home Ground Beef Cookbook1999, p58                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 361 calories, 6 g fat (2 g saturated fat), 28 mg cholesterol, 897 mg sodium, 56 g carbohydrate, 4 g fiber, 18 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-chow-mein-382964', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 255, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}