{u'recipes': [{u'sourceName': u'Rants from my Crazy Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608303-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 608303, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon Cream Cheese Stuffed Cherry Tomatoes', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 20, u'pricePerServing': 49.96, u'creditText': u'Rants from my Crazy Kitchen', u'extendedIngredients': [{u'originalString': u'12 ounces hardwood smoked bacon, cooked and crumbled, reserve some for topping', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'smoked', u'crumbled', u'cooked', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon chopped basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoon'}, {u'originalString': u'20 cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'1 tablespoon chopped fine chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoon'}, {u'originalString': u'about two-thirds of an 8-ounce package cream cheese ( or 6 ounces whipped cream cheese)', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'( or 6 ounces whipped cream cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 1062047, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://rantsfrommycrazykitchen.com/2014/08/15/bacon-cream-cheese-stuffed-cherry-tomatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bring cream cheese to room temperature. Using a sharp pointed knife, cut just the tops off the cherry tomatoes, carefully scoop out the seeds, being careful not to go all the way through the tomatoes. Invert the cut and seeded tomatoes onto paper towel and let stand for at least 10 minutes.In a small bowl, combine cream cheese, chives, basil, fresh ground black pepper, and a sprinkle of garlic salt.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Mix well, then stir in bacon.Lightly sprinkle the cherry tomatoes with garlic salt, then stuff the tomatoes with the bacon/cream cheese mixture using a small spoon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Garnish with reserved bacon and parsley (if desired) Chill until serving.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 246, u'instructions': u'Bring cream cheese to room temperature. Using a sharp pointed knife, cut just the tops off the cherry tomatoes, carefully scoop out the seeds, being careful not to go all the way through the tomatoes. Invert the cut and seeded tomatoes onto paper towel and let stand for at least 10 minutes.In a small bowl, combine cream cheese, chives, basil, fresh ground black pepper, and a sprinkle of garlic salt. Mix well, then stir in bacon.Lightly sprinkle the cherry tomatoes with garlic salt, then stuff the tomatoes with the bacon/cream cheese mixture using a small spoon. Garnish with reserved bacon and parsley (if desired) Chill until serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-cream-cheese-stuffed-cherry-tomatoes-608303', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 28, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}