{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/176070-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 176070, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mini Corn Cakes', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 15.77, u'extendedIngredients': [{u'originalString': u'1 cup soft white bread crumbs (about 1 1/2 slices bread)', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'white', u'soft', u'( 1 1/2 slices bread)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 tablespoon butter or margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1/3 cup chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1/2 cup chive-and-onion sour cream', u'aisle': u'Cheese', u'name': u'chive & onion cream cheese spread', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-onion-cream-cheese-dip.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93748, u'unit': u'cup'}, {u'originalString': u'2 eggs, slightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'slightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/3 cup chopped green onions (about 5 medium)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'( 5 medium)', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon ground red pepper (cayenne)', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'red', u'(cayenne)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup chopped red bell pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'1 can (11 oz) whole kernel corn, drained', u'aisle': u'Produce', u'name': u'whole kernel corn', u'metaInformation': [u'whole', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 11172, u'unit': u'oz'}, {u'originalString': u'1/2 cup Original mix', u'aisle': u'?', u'name': u'original mix', u'metaInformation': [], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.BettyCrocker.com/recipes/mini-corn-cakes/315c0230-62f0-4eb6-af73-c04632762c8d', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In 12-inch nonstick skillet, melt butter over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add onions, celery and bell pepper; cook 3 minutes, stirring occasionally.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In medium bowl, stir vegetable mixture and remaining ingredients except oil and sour cream until well blended.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In same skillet, heat 2 teaspoons of the oil over medium heat. Cooking 8 corn cakes at a time, drop corn mixture into oil by tablespoonfuls, spreading each into 1 1/2-inch round. Cook 1 minute to 1 minute 30 seconds on each side, carefully turning once, until golden brown. Cook remaining corn cakes, using 2 teaspoons oil for each batch of 8 corn cakes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with sour cream.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 894, u'instructions': u'1                               In 12-inch nonstick skillet, melt butter over medium heat. Add onions, celery and bell pepper; cook 3 minutes, stirring occasionally.                                                          2                               In medium bowl, stir vegetable mixture and remaining ingredients except oil and sour cream until well blended.                                                          3                               In same skillet, heat 2 teaspoons of the oil over medium heat. Cooking 8 corn cakes at a time, drop corn mixture into oil by tablespoonfuls, spreading each into 1 1/2-inch round. Cook 1 minute to 1 minute 30 seconds on each side, carefully turning once, until golden brown. Cook remaining corn cakes, using 2 teaspoons oil for each batch of 8 corn cakes. Serve with sour cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-corn-cakes-176070', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}