{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/493495-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 493495, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Chicken Under a Brick', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 167.34, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'2 teaspoon rosemary, fresh, finely chopped', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'4 (6- inch piece) rosemary, sprigs', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'(6- inch piece)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2036, u'unit': u'sprigs'}, {u'originalString': u'1 (3 to 4 pound) chicken, whole', u'aisle': u'Meat', u'name': u'whole chicken', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 5006, u'unit': u'pound'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.foodrepublic.com/2011/04/07/grilled-chicken-under-brick-recipe', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'With kitchen shears, cut out the backbone of the chicken and discard. Crack the breast so the bird lays flat. Liberally apply oil to all sides of the bird. Rub in garlic powder, rosemary, lemon zest, and salt and pepper.On an extremely hot, clean grill, place bird skin side down. If using a gas grill, turn the burners under the chicken to low, but leave remaining burners on high. If using briquettes, maintain a cooler spot under the chicken.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Place rosemary sprigs in the chest cavity of the bird.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place skillet or griddle on chicken, then place aluminum foil wrapped brick on top. Close lid, but remain on guard with spray bottle for flare-ups.Cook chicken for about 10 to 15 minutes or until the skin turns a deep, deep brown. Some charred areas are to be expected.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Remove brick and griddle. Slide a large metal spatula under the bird, being careful not to tear the skin. Using a pair of tongs to support the top opposite side of the bird, turn the bird over, making sure the rosemary remains in the chest cavity.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place bird over the hot area of the grill. Lower the flame under the bird and turn up the rest of the burners. Replace the skillet and the brick and close lid. Cook for approximately 15 to 20 minutes, or until an instant-read thermometer reads 165 degrees F. when placed in the thickest part of the thigh.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place on a platter and cover with aluminum foil and let rest for a minimum of 10 minutes.Note: The bird may be prepared with the spices the night prior to cooking, but omit the salt. Rub in the salt just prior to cooking.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Directions:\xa0                                    With kitchen shears, cut out the backbone of the chicken and discard. Crack the breast so the bird lays flat. Liberally apply oil to all sides of the bird. Rub in garlic powder, rosemary, lemon zest, and salt and pepper.On an extremely hot, clean grill, place bird skin side down. If using a gas grill, turn the burners under the chicken to low, but leave remaining burners on high. If using briquettes, maintain a cooler spot under the chicken.Place rosemary sprigs in the chest cavity of the bird. Place skillet or griddle on chicken, then place aluminum foil wrapped brick on top. Close lid, but remain on guard with spray bottle for flare-ups.Cook chicken for about 10 to 15 minutes or until the skin turns a deep, deep brown. Some charred areas are to be expected.Remove brick and griddle. Slide a large metal spatula under the bird, being careful not to tear the skin. Using a pair of tongs to support the top opposite side of the bird, turn the bird over, making sure the rosemary remains in the chest cavity.Place bird over the hot area of the grill. Lower the flame under the bird and turn up the rest of the burners. Replace the skillet and the brick and close lid. Cook for approximately 15 to 20 minutes, or until an instant-read thermometer reads 165 degrees F. when placed in the thickest part of the thigh.Place on a platter and cover with aluminum foil and let rest for a minimum of 10 minutes.Note: The bird may be prepared with the spices the night prior to cooking, but omit the salt. Rub in the salt just prior to cooking.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-chicken-under-a-brick-493495', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}