{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/536994-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 536994, u'veryPopular': False, u'lowFodmap': False, u'title': u'Southwestern Calzone Almost Fail', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 230.34, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'5 cups (22.5 ounces) bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 22.5, u'consistency': u'solid', u'id': 10120129, u'unit': u'ounces'}, {u'originalString': u'2 ears sweet corn', u'aisle': u'Produce', u'name': u'ears corn', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'1 egg, beaten with a tablespoon of water for egg wash', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'with a tablespoon of water for egg wash', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 Tablespoons honey or sugar', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tablespoons'}, {u'originalString': u'1 1/2 Teaspoons instant yeast', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 10118375, u'unit': u'Teaspoons'}, {u'originalString': u'1 jalapeno, seeded and diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'3 Teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'Teaspoons'}, {u'originalString': u'2 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'3 Tablespoons olive oil (plus more for the dough later)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'plus more for the dough later)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'6-8 ounces pepper jack cheese, grated', u'aisle': u'Cheese', u'name': u'pepper jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1025, u'unit': u'ounces'}, {u'originalString': u'1 anaheim or poblano pepper, diced', u'aisle': u'Produce', u'name': u'poblano pepper', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'1/4 cup salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'Pinch of salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'pinch'}, {u'originalString': u'1 3/4 cups room temperature water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.macheesmo.com/2011/08/southwestern-calzone-almost-fail/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'For dough...1)', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add all the ingredients except flour to a large bowl and let sit until yeast starts to bubble.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add in flour and stir together with a large spoon until the dough comes together.2) Dip one hand in a bowl of warm water and vigorously knead the dough in the bowl, constantly turning the bowl, until the dough comes together and starts to firm up, about 4 minutes.3)', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let the dough rest for 5 minutes.4) Continue to work it for another 2-3 minutes until the dough is soft and smooth and very elastic.5)', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Cut the dough into 4 pieces, roll each quarter into a ball, and add each ball to a plastic bag coated lightly with olive oil.6)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Let dough sit at room temp for 15 minutes and then store in the fridge overnight.7)', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove the dough from the fridge 2 hours before making pizza.To Make Calzones:1) Char corn by placing it directly on a gas burner or on a grill. Turn every 30 seconds or so until the kernels are lightly charred.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Remove and cut corn off the cob.2)', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add oil to a large skillet and heat over medium-high heat.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Add chicken and cook until cooked through, about 8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Add peppers and cook for another few minutes until peppers start to soften.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}, {u'equipment': [], u'step': u'Add corn and salsa and stir until warm. Season with salt and pepper.3)', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Roll a calzone dough out into a 6-8 inch round.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Add grated cheese to bottom half of calzone and top with about a cup of filling.4) Fold calzone over, being careful to press out as much air as possible. Crimp edges of calzone so it is sealed well. Slice a few slits in the top of the calzone so steam can escape.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Brush calzones with egg wash.5)', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake calzones on a greased/oiled baking sheet for 25-30 minutes at 375 degrees until they are golden brown and the filling is bubbling.6)', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool for a few minutes before serving.', u'number': 17, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6, u'instructions': u'DirectionsFor dough...1) Add all the ingredients except flour to a large bowl and let sit until yeast starts to bubble. Add in flour and stir together with a large spoon until the dough comes together.2) Dip one hand in a bowl of warm water and vigorously knead the dough in the bowl, constantly turning the bowl, until the dough comes together and starts to firm up, about 4 minutes.3) Let the dough rest for 5 minutes.4) Continue to work it for another 2-3 minutes until the dough is soft and smooth and very elastic.5) Cut the dough into 4 pieces, roll each quarter into a ball, and add each ball to a plastic bag coated lightly with olive oil.6) Let dough sit at room temp for 15 minutes and then store in the fridge overnight.7) Remove the dough from the fridge 2 hours before making pizza.To Make Calzones:1) Char corn by placing it directly on a gas burner or on a grill. Turn every 30 seconds or so until the kernels are lightly charred. Remove and cut corn off the cob.2) Add oil to a large skillet and heat over medium-high heat. Add chicken and cook until cooked through, about 8 minutes. Add peppers and cook for another few minutes until peppers start to soften. Add corn and salsa and stir until warm. Season with salt and pepper.3) Roll a calzone dough out into a 6-8 inch round. Add grated cheese to bottom half of calzone and top with about a cup of filling.4) Fold calzone over, being careful to press out as much air as possible. Crimp edges of calzone so it is sealed well. Slice a few slits in the top of the calzone so steam can escape. Brush calzones with egg wash.5) Bake calzones on a greased/oiled baking sheet for 25-30 minutes at 375 degrees until they are golden brown and the filling is bubbling.6) Let cool for a few minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/southwestern-calzone-almost-fail-536994', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}