{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/527702-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 527702, u'veryPopular': False, u'lowFodmap': False, u'title': u'Black Forest Trifles', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 185.89, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'bing cherries (with stems)', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'with stems)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 9070, u'unit': u'servings'}, {u'originalString': u'chocolate curls or shavings', u'aisle': u'Baking', u'name': u'chocolate curls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 10119903, u'unit': u'servings'}, {u'originalString': u'2 cups chilled heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'1 Tbsp. Kirsch (optional)', u'aisle': u'Alcoholic Beverages', u'name': u'kirsch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10614037, u'unit': u'Tbsp'}, {u'originalString': u'1 pan of chocolate cake or brownies, torn or cut into small pieces', u'aisle': u'Baking', u'name': u'mix of brownies', u'metaInformation': [u'small', u'cut into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18632, u'unit': u''}, {u'originalString': u'6 Tbsp. powdered sugar, sifted', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19336, u'unit': u'Tbsp'}, {u'originalString': u'6 Tbsp. Kirsch or spiced rum (you can substitute cherry juice or water to make without alcohol)', u'aisle': u'Alcoholic Beverages', u'name': u'spiced rum', u'metaInformation': [u'canned', u'(you can substitute cherry juice or water to make without alcohol)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 10914037, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup unsweetened cocoa powder, sifted', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened', u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://www.gimmesomeoven.com/black-forest-trifles/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To Make Cherries:In a small saucepan or medium skillet, stir together pitted cherries and sugar over medium heat. Cook until sugar is dissolved and cherries release their juice, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from heat, carefully stir in Kirsch, and transfer back to heat. Continue to cook over medium-heat until liquid is slightly thickened, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'id': 10614037, u'name': u'kirsch'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place a layer of chocolate cake or brownies in a trifle bowl. Then spoon or pipe on a layer of chocolate whipped cream. Then add a layer of cherries. Repeat as many times as desired, and top with a layer of whipped cream garnished with chocolate curls and a cherry.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'id': 10119903, u'name': u'chocolate curls'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}], u'name': u'Remove from heat and let cool.To Make Whipped CreamIn an electric mixer bowl (that has preferably been chilled for at least 5-10 minutes beforehand), beat the cream, powdered sugar, cocoa (and Kirsch, if desired) together until peaks form.To Assemble Trifles'}], u'aggregateLikes': 50, u'instructions': u'To Make Cherries:In a small saucepan or medium skillet, stir together pitted cherries and sugar over medium heat. Cook until sugar is dissolved and cherries release their juice, about 5 minutes. Remove pan from heat, carefully stir in Kirsch, and transfer back to heat. Continue to cook over medium-heat until liquid is slightly thickened, about 2 minutes. Remove from heat and let cool.To Make Whipped Cream:In an electric mixer bowl (that has preferably been chilled for at least 5-10 minutes beforehand), beat the cream, powdered sugar, cocoa (and Kirsch, if desired) together until peaks form.To Assemble Trifles:Place a layer of chocolate cake or brownies in a trifle bowl. Then spoon or pipe on a layer of chocolate whipped cream. Then add a layer of cherries. Repeat as many times as desired, and top with a layer of whipped cream garnished with chocolate curls and a cherry.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-forest-trifles-527702', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}