{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/833168-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 833168, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coq Au Vin', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 287.14, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'3/4 pound baby bella mushrooms, halved', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 11266, u'unit': u'pound'}, {u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'3 pounds chicken pieces, skin-on and bone-in (I used 4 thighs and 4 legs)', u'aisle': u'Meat', u'name': u'chicken pieces', u'metaInformation': [u'bone-in', u'(I used 4 thighs and 4 legs)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 1005006, u'unit': u'pounds'}, {u'originalString': u'1 cup beef or chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'1/4 cup Cognac or brandy', u'aisle': u'Alcoholic Beverages', u'name': u'cognac', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cognac.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10414037, u'unit': u'cup'}, {u'originalString': u'optional: mashed potatoes or cooked egg noodles, for serving', u'aisle': u'Pasta and Rice', u'name': u'cooked egg noodles', u'metaInformation': [u'cooked', u'mashed', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 20410, u'unit': u'servings'}, {u'originalString': u'chopped curly-leaf parsley, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'curly leaf parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'leaf'}, {u'originalString': u'2.5 cups dry red wine (see suggestions below)', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red', u'(see suggestions below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'liquid', u'id': 14097, u'unit': u'cups'}, {u'originalString': u'1/3 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'6 garlic cloves, peeled and minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Kosher salt and freshly-cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 cup frozen pearl onions, thawed', u'aisle': u'Produce', u'name': u'pearl onions', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pearl-onions.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111282, u'unit': u'cup'}, {u'originalString': u'1 large shallot, peeled and finely-diced (or 1/2 cup finely-diced white onion)', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'white', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'8 ounces thick-cut bacon, diced', u'aisle': u'Meat', u'name': u'thick-cut bacon', u'metaInformation': [u'diced', u'thick-cut'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10310123, u'unit': u'ounces'}, {u'originalString': u'4 fresh thyme sprigs', u'aisle': u'Produce', u'name': u'thyme sprigs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'1 tablespoon tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoon'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.gimmesomeoven.com/coq-au-vin-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place chicken in a large bowl or ziplock bag.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add wine and beef (or chicken) stock, and gently toss to combine. Cover/seal and refrigerate for anywhere from1 to 8 hours.When you're ready to cook the coq au vin, fry the bacon over medium-high heat in a large Dutch oven (or any heavy-bottomed stock pot or deep saute pan) until crispy.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Transfer the bacon with a slotted spoon to a separate plate, and set aside. There should be about 3 tablespoons of bacon grease remaining. (If not, add in some extra olive oil to make up the difference.)While the bacon is cooking, remove the chicken from the wine and pat dry, being sure to reservethe wine. (We'll use it later!) Season the chicken on both sides with salt and pepper. Then, once the bacon has been removed from the pan, add half of the chicken to the remaining bacon grease, and saute the chicken for 2-3 minutes per side until browned.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Transfer the cooked chicken to a separate plate, and repeat with the secondhalf of the uncooked chicken. Once the second batch has been cooked, transfer it to a separate plate, and set aside.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the shallot to the remaining bacon grease, and saute for 3 minutes until mostly cooked through, stirring occasionally.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add in thepearl onions, mushrooms, and garlic, and saute for 4-5 more minutes, stirring occasionally, until the mushrooms are browned.Stir in the flour and tomato paste until completely combined, and cook for 1 minute, stirring occasionally. Slowly add in the Cognac (or brandy), and stir for 1 minute.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cognac.jpg', u'id': 10414037, u'name': u'cognac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add in the reserved red wine, thyme sprigs and bay leaves, and stir to combine.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the cooked bacon and chicken back to the pot. Continue cooking until the mixture reaches a simmer. Then reduce heat to low, cover, and cook for 60-80 minutes, until the chicken is tender and cooked through.', u'length': {u'number': 80, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Remove and discard the bay leaves and thyme sprigs. Season with salt and pepper, to taste.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [], u'step': u'Serve immediately over mashed potatoes or noodles, garnished with chopped parsley if desired.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Coq Au Vin works really well with Beaujolais, Pinot Noir, and Red Burgundy. The red Burgundy is most traditional, but Beaujolais is grown nearby and usually less expensive. Really any dry French red will do! One wine you could try is Louis Jadot Beaujolais Villages. It has 4.3 out of 5 stars and a bottle costs about 14 dollars.', u'pairedWines': [u'beaujolais', u'pinot noir', u'red burgundy'], u'productMatches': [{u'description': u'This crisp, fruit-forward, juicy wine has expressive aromas and flavors of ripe red berries, with nice weight and typically high acidity in the mouth and mineral and spice notes underlying the fruit. View More', u'title': u'Louis Jadot Beaujolais Villages', u'price': u'$13.99', u'id': 435360, u'link': u'https://www.wine.com/product/louis-jadot-beaujolais-villages-2011/119527', u'imageUrl': u'https://spoonacular.com/productImages/435360-312x231.jpg'}]}, u'aggregateLikes': 285, u'instructions': u"Place chicken in a large bowl or ziplock bag. Add wine and beef (or chicken) stock, and gently toss to combine. Cover/seal and refrigerate for anywhere from1 to 8 hours.When you're ready to cook the coq au vin, fry the bacon over medium-high heat in a large Dutch oven (or any heavy-bottomed stock pot or deep saute pan) until crispy. Transfer the bacon with a slotted spoon to a separate plate, and set aside. There should be about 3 tablespoons of bacon grease remaining. (If not, add in some extra olive oil to make up the difference.)While the bacon is cooking, remove the chicken from the wine and pat dry, being sure to reservethe wine. (We'll use it later!) Season the chicken on both sides with salt and pepper. Then, once the bacon has been removed from the pan, add half of the chicken to the remaining bacon grease, and saute the chicken for 2-3 minutes per side until browned. Transfer the cooked chicken to a separate plate, and repeat with the secondhalf of the uncooked chicken. Once the second batch has been cooked, transfer it to a separate plate, and set aside.Add the shallot to the remaining bacon grease, and saute for 3 minutes until mostly cooked through, stirring occasionally. Add in thepearl onions, mushrooms, and garlic, and saute for 4-5 more minutes, stirring occasionally, until the mushrooms are browned.Stir in the flour and tomato paste until completely combined, and cook for 1 minute, stirring occasionally. Slowly add in the Cognac (or brandy), and stir for 1 minute. Add in the reserved red wine, thyme sprigs and bay leaves, and stir to combine.Add the cooked bacon and chicken back to the pot. Continue cooking until the mixture reaches a simmer. Then reduce heat to low, cover, and cook for 60-80 minutes, until the chicken is tender and cooked through.Remove and discard the bay leaves and thyme sprigs. Season with salt and pepper, to taste.Serve immediately over mashed potatoes or noodles, garnished with chopped parsley if desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/coq-au-vin-833168', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}