{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/406597-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 420, u'id': 406597, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creole Chicken Thighs', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 124.37, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3 tablespoons Cajun seasoning, divided', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'cajun seasoning', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1032028, u'unit': u'tablespoons'}, {u'originalString': u'1 can (16 ounces) red beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned red beans', u'metaInformation': [u'red', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10016034, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'3-1/2 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'2 tablespoons minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 medium green pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1-1/2 cups uncooked converted rice', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20444, u'unit': u'cups'}, {u'originalString': u'8 bone-in chicken thighs (about 3 pounds), skinless', u'aisle': u'Meat', u'name': u'skinless bone-in chicken thighs', u'metaInformation': [u'bone-in', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'liquid', u'id': 1005096, u'unit': u'pounds'}, {u'originalString': u'2 medium tomatoes, finely chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/creole-chicken-thighs', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Sprinkle chicken with 1 tablespoon Cajun seasoning. In a large skillet, brown chicken in oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1032028, u'name': u'cajun seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'In a 5-qt. slow cooker, combine the broth, beans, rice, tomatoes, green pepper, parsley and remaining Cajun seasoning. Top with chicken. Cover and cook on low for 7-8 hours or until chicken is tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1032028, u'name': u'cajun seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Thighs on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 30, u'instructions': u'Directions                                                                                Sprinkle chicken with 1 tablespoon Cajun seasoning. In a large skillet, brown chicken in oil.                                                                                           In a 5-qt. slow cooker, combine the broth, beans, rice, tomatoes, green pepper, parsley and remaining Cajun seasoning. Top with chicken. Cover and cook on low for 7-8 hours or until chicken is tender.                                        Yield: 8 servings.                                                                                                                         Originally published as Creole Chicken Thighs in  Taste of Home Everyday Slow Cooker & One Dish RecipesAnnual 2010, p43                                                                                                                                                                                                        Nutritional Facts                                                                             1 chicken thigh with 1 cup rice mixture equals 395 calories, 12 g fat (3 g saturated fat), 89 mg cholesterol, 1,314 mg sodium, 39 g carbohydrate, 4 g fiber, 30 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/creole-chicken-thighs-406597', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 450, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}