{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/447036-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 447036, u'veryPopular': False, u'lowFodmap': True, u'title': u'Purple Hooter', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 177.67, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 1/2 teaspoons black raspberry liqueur', u'aisle': u'Alcoholic Beverages', u'name': u'raspberry liqueur', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Chambord-or-raspberry-liqueur.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 10114534, u'unit': u'teaspoons'}, {u'originalString': u'1/2 fluid ounce triple sec', u'aisle': u'Alcoholic Beverages', u'name': u'triple sec', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'unitLong': u'fluid ounces', u'unitShort': u'fluid ounce', u'amount': 0.5, u'consistency': u'solid', u'id': 14534, u'unit': u'fluid ounce'}, {u'originalString': u'1 (1.5 fluid ounce) jigger vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'fluid ounces', u'unitShort': u'fluid ounce', u'amount': 1.5, u'consistency': u'liquid', u'id': 14051, u'unit': u'fluid ounce'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Purple-Hooter/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Pour the vodka, triple sec, and raspberry liqueur into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a chilled martini glass to serve.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Chambord-or-raspberry-liqueur.jpg', u'id': 10114534, u'name': u'raspberry liqueur'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'id': 14534, u'name': u'triple sec'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'id': 14051, u'name': u'vodka'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 15, u'instructions': u'Pour the vodka, triple sec, and raspberry liqueur into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a chilled martini glass to serve.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/purple-hooter-447036', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}