{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599709-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 599709, u'veryPopular': False, u'lowFodmap': False, u'title': u'Macaroni Grill Baked Creamy Seafood', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 342.42, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 1/2 cup Asiago cheese', u'aisle': u'Cheese', u'name': u'asiago cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001033, u'unit': u'cup'}, {u'originalString': u'4 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'6 ounces can chopped clams, well drained', u'aisle': u'Seafood', u'name': u'clams', u'metaInformation': [u'drained', u'chopped', u'well', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 15157, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 cups half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'Oil for deep frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for deep frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1 to 2 tablespoons grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'1 cup baby scallops, rinsed and drained ( about 8 ounces)', u'aisle': u'Seafood', u'name': u'scallops', u'metaInformation': [u'rinsed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10015172, u'unit': u'ounces'}, {u'originalString': u'2 cups medium, peeled, shelled and deveined cooked shrimp', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'shelled', u'medium', u'deveined', u'cooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'cups'}, {u'originalString': u'1/2 of a 12 ounce package Won ton skins', u'aisle': u'Ethnic Foods', u'name': u'won ton wraps', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10018368, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.copykat.com/2009/02/02/macaroni-grill-baked-creamy-seafood/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, melt 1 tablespoon butter.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add scallops and stir fry over high heat until just cooked through; set aside in bowl. In same skillet, melt remaining 3 tablespoons butter over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in flour until smooth and bubbly. Cook and stir 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in half-and-half and continue whisking until mixture comes to a boil. Boil 1 minute, whisking, until bubbly. Turn off the heat.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add Asiago cheese, stirring until melted. Stir in the scallops, shrimp and clams. Spoon into a 9 inch glass pie plate. Sprinkle with the Parmesan cheese.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1001033, u'name': u'asiago cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/scallops.jpg', u'id': 10015172, u'name': u'scallops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/deep-fryer.jpg', u'id': 404759, u'name': u'deep fryer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Bake in a preheated 350 degree oven for about 15 minutes, until the top is golden brown. Meanwhile, heat plenty of oil in a wok or deep fryer to 375 degrees. Fry 3 or 4 won ton skins at a time, a few seconds on each side, until just golden.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u"Drain on paper towels. Use wantons as chips for dipping into baked sea-food appetizer. NOTE: If you don't feel inclined to fry the wanton skins to make chips, the seafood appetizer is also delicious served with tortilla or pita chips or crackers of your choice.", u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 28, u'instructions': u"In a large skillet, melt 1 tablespoon butter. Add scallops and stir fry over high heat until just cooked through; set aside in bowl. In same skillet, melt remaining 3 tablespoons butter over medium heat. Whisk in flour until smooth and bubbly. Cook and stir 1 minute. Whisk in half-and-half and continue whisking until mixture comes to a boil. Boil 1 minute, whisking, until bubbly. Turn off the heat. Add Asiago cheese, stirring until melted. Stir in the scallops, shrimp and clams. Spoon into a 9 inch glass pie plate. Sprinkle with the Parmesan cheese. Bake in a preheated 350 degree oven for about 15 minutes, until the top is golden brown. Meanwhile, heat plenty of oil in a wok or deep fryer to 375 degrees. Fry 3 or 4 won ton skins at a time, a few seconds on each side, until just golden. Drain on paper towels. Use wantons as chips for dipping into baked sea-food appetizer. NOTE: If you don't feel inclined to fry the wanton skins to make chips, the seafood appetizer is also delicious served with tortilla or pita chips or crackers of your choice.", u'spoonacularSourceUrl': u'https://spoonacular.com/macaroni-grill-baked-creamy-seafood-599709', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}