{u'recipes': [{u'sourceName': u'From Away', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/506772-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 506772, u'veryPopular': True, u'lowFodmap': False, u'title': u'Welsh Rarebit Burgers', u'diets': [], u'pricePerServing': 375.28, u'creditText': u'From Away', u'extendedIngredients': [{u'originalString': u'6 strips of bacon, sliced in half and cooked', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cooked', u'sliced in half and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'3/4 cup Guinness beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14006, u'unit': u'cup'}, {u'originalString': u'2 tablespoons butter (1/4 stick)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'(1/4 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces good cheddar, grated or chopped', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'good', u'grated', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1009, u'unit': u'ounces'}, {u'originalString': u'Thickly sliced scallions or chives, to garnish', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 11156, u'unit': u'servings'}, {u'originalString': u'2 teaspoons dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 pound 80/20 ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'1 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 Portuguese rolls, sliced in half', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'2 vine-ripened tomatoes, sliced', u'aisle': u'Produce', u'name': u'vine ripened tomatoes', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.fromaway.com/cooking/welsh-rarebit-burgers', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 38, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt butter in a medium saucepan. Slowly add flour, stirring constantly, and cook over medium heat until toasted, about three minutes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add cheese, beer, Worcestershire, mustard, paprika, and pepper and cook, stirring constantly, until cheese is melted and smooth, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Place a cooked hamburger patty on one of the Portuguese roll halves. Top with 4 of the halved strips of bacon, sliced tomato, and cheese sauce.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Garnish with sliced scallions or chopped chives.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u'Remove from heat.Divide ground beef into thirds, and shape into hamburger patties slightly larger than your Portuguese rolls. Cook over medium-high heat, flipping as needed, to desired doneness and until brown on both sides. To assemble each burger'}], u'aggregateLikes': 565, u'instructions': u'Melt butter in a medium saucepan. Slowly add flour, stirring constantly, and cook over medium heat until toasted, about three minutes. Add cheese, beer, Worcestershire, mustard, paprika, and pepper and cook, stirring constantly, until cheese is melted and smooth, about 3 minutes. Remove from heat.Divide ground beef into thirds, and shape into hamburger patties slightly larger than your Portuguese rolls. Cook over medium-high heat, flipping as needed, to desired doneness and until brown on both sides. To assemble each burger: Place a cooked hamburger patty on one of the Portuguese roll halves. Top with 4 of the halved strips of bacon, sliced tomato, and cheese sauce. Garnish with sliced scallions or chopped chives.', u'spoonacularSourceUrl': u'https://spoonacular.com/welsh-rarebit-burgers-506772', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}