{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549234-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 549234, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pasta With Asparagus', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 167.53, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'1 Pound Asparagus, tough ends snapped off', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'Pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'Pound'}, {u'originalString': u'3/4 cup Balsamic Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'5 Tablespoons Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tablespoons'}, {u'originalString': u'1 cup chopped, fresh basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'1/2 Teaspoon Ground Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'Teaspoon'}, {u'originalString': u'1 Tablespoon juice from 1 lemon', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tablespoon'}, {u'originalString': u'1 pound Campanelli Pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 20420, u'unit': u'pound'}, {u'originalString': u'2 Oz Pecorino Romano Cheese, shaved with veggie peeler', u'aisle': u'Cheese', u'name': u'pecorino romano cheese', u'metaInformation': [u'shaved with veggie peeler'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Ozs', u'unitShort': u'Oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1038, u'unit': u'Oz'}, {u'originalString': u'1 Medium Red Onion, halved and sliced thin (I may have forgotten this... woops!)', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'halved', u'sliced', u'thin', u'(I may have forgotten this... woops!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1/4 Teaspoon Red Pepper Flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'Teaspoon'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2010/06/pasta-with-asparagus.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring 4 quarts of water to a boil in a large pot.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add 1 tablespoon salt and the pasta to the boiling water and stir to separate noodles. Cook until al dente, drain and return to pot.Meanwhile, bring the balsamic to a boil in an 8-inch skillet over med-high heat; reduce heat to medium and simmer slowly until it is syrupy and has reduced to 3/4 cup, 15 to 20 min *ours only took 10-15 min.While the vinegar is reducing, heat 2 tablespoons of the oil in a nonstick skillet over high heat until it starts to smoke.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add asparagus, onion, pepper, red pepper flakes and 1/2 ts salt. Stir to combine. Cook without stirring until the asparagus is tender-crisp, about 4 min longer.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the asparagus mixture, basil, lemon juice, 1/2 cup of the cheese and remaining 3 tablespoons oil to the pasta. Toss to combine.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve immediately, drizzling 1-2 teaspoons of the balsamic glaze over each serving, passing additional cheese around.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7, u'instructions': u'Bring 4 quarts of water to a boil in a large pot. Add 1 tablespoon salt and the pasta to the boiling water and stir to separate noodles. Cook until al dente, drain and return to pot.Meanwhile, bring the balsamic to a boil in an 8-inch skillet over med-high heat; reduce heat to medium and simmer slowly until it is syrupy and has reduced to 3/4 cup, 15 to 20 min *ours only took 10-15 min.While the vinegar is reducing, heat 2 tablespoons of the oil in a nonstick skillet over high heat until it starts to smoke. Add asparagus, onion, pepper, red pepper flakes and 1/2 ts salt. Stir to combine. Cook without stirring until the asparagus is tender-crisp, about 4 min longer.Add the asparagus mixture, basil, lemon juice, 1/2 cup of the cheese and remaining 3 tablespoons oil to the pasta. Toss to combine. Serve immediately, drizzling 1-2 teaspoons of the balsamic glaze over each serving, passing additional cheese around.', u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-with-asparagus-549234', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}