{u'recipes': [{u'sourceName': u'Crock Pot Ladies', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/483904-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 483904, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crock-Pot Southwest Spinach Chicken', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 372.47, u'creditText': u'Crock Pot Ladies', u'extendedIngredients': [{u'originalString': u'1 (14.5 Oz.) Can Of Black Beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'Ozs', u'unitShort': u'Oz', u'amount': 14.5, u'consistency': u'solid', u'id': 16015, u'unit': u'Oz'}, {u'originalString': u'1 Teaspoon Of Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'Teaspoon'}, {u'originalString': u'1 Teaspoon Of Brown Sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Teaspoon'}, {u'originalString': u'4 Chicken Breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1 cup Chicken Broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1 (14.5 Oz.) Can Of Corn', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'Ozs', u'unitShort': u'Oz', u'amount': 14.5, u'consistency': u'solid', u'id': 11168, u'unit': u'Oz'}, {u'originalString': u'4 Oz. Of Cream Cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'Ozs', u'unitShort': u'Oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'Oz'}, {u'originalString': u'1 Teaspoon Of Garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'Teaspoon'}, {u'originalString': u'2 cups Of Finely Shredded Mexican Cheese (For Topping)', u'aisle': u'Cheese', u'name': u'mexican cheese', u'metaInformation': [u'shredded', u'finely', u'(For Topping)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1251, u'unit': u'cups'}, {u'originalString': u'1 cup Of Salsa (For Topping)', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'(For Topping)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'1 Bag Of Fresh Spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'Bag', u'unitShort': u'Bag', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'Bag'}, {u'originalString': u'1 (14.5 Oz.) Can Of Diced Tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'Ozs', u'unitShort': u'Oz', u'amount': 14.5, u'consistency': u'solid', u'id': 11529, u'unit': u'Oz'}], u'healthScore': 63.0, u'imageType': u'png', u'spoonacularScore': 89.0, u'sourceUrl': u'http://crockpotladies.com/crockpot-southwest-spinach-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Rinse chicken breasts and put into crock pot, season with the garlic, black pepper and brown sugar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Pour chicken broth over chicken', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [], u'step': u'Drain corn and beans and mix with the can of tomatoes and pour over chicken.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11168, u'name': u'corn'}]}, {u'equipment': [], u'step': u'Pour bag of spinach over remaining ingredients.Cook on low heat for 5-6 hours.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Put the cream cheese into crock pot 1 hour before serving.Top with salsa and cheese. May serve over pasta or rice.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Rinse chicken breasts and put into crock pot, season with the garlic, black pepper and brown sugar.Pour chicken broth over chickenDrain corn and beans and mix with the can of tomatoes and pour over chicken.Pour bag of spinach over remaining ingredients.Cook on low heat for 5-6 hours. Put the cream cheese into crock pot 1 hour before serving.Top with salsa and cheese. May serve over pasta or rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-southwest-spinach-chicken-483904', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 390, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}