{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/216271-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 216271, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prawn & avocado escab\xe8che', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 227.27, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 ripe avocados', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'3 tbsp chopped coriander', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tbsp'}, {u'originalString': u'1 green chilli, seeded and finely chopped', u'aisle': u'Produce', u'name': u'green chilli', u'metaInformation': [u'green', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'iceberg lettuce leaves and ready-cooked poppadums, to serve', u'aisle': u'Produce', u'name': u'iceberg lettuce leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 10011252, u'unit': u'leaves'}, {u'originalString': u'juice of 3 limes', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'large pinch dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'pinch'}, {u'originalString': u'400g bag large frozen cooked, peeled prawns', u'aisle': u'Seafood', u'name': u'prawns', u'metaInformation': [u'frozen', u'large', u'cooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'g'}, {u'originalString': u'5 spring onions, thinly sliced', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tbsp tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tbsp'}, {u'originalString': u'300g ripe tomatoes, cherry or plum, finely chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'ripe', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 11529, u'unit': u'g'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2146/prawn-and-avocado-escabche', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a non-metallic bowl, mix thelime juice, spring onions, tomatopaste, oregano, tomatoes andchilli.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [], u'step': u'Mix well, season with salt andpepper, then cover with cling film.(This mixture can now be kept inthe fridge for up to 3 days.)Defrost the prawns and patdry with kitchen paper. Just beforeserving, peel and cube theavocados.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Add to the sauce withthe prawns and coriander and mixwell. (This can be done up to 3hours ahead.)Carefully separate the lettuceleaves and arrange them overa serving platter. Spoon the prawnsand juice into the cup-shapedleaves and serve with crisp ready-cookedpoppadums.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Fetzer Vineyards Valley Oaks Pinot Grigio with a 5 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This Pinot Grigio is clean with a fruit forward character and a crisp acid backbone . There are aromas of mango, pear, orange spice, lemongrass and pineapple. In the mouth, there are flavors of tropical fruit, apples, pears and a nice orange citrus note, balanced with minerality and a wonderful, round finish.', u'title': u'Fetzer Vineyards Valley Oaks Pinot Grigio', u'price': u'$10.99', u'id': 428373, u'link': u'https://www.amazon.com/Fetzer-Vineyards-Valley-Pinot-Grigio/dp/B0725QB94C', u'imageUrl': u'https://spoonacular.com/productImages/428373-312x231.jpg'}]}, u'aggregateLikes': 70, u'instructions': u'In a non-metallic bowl, mix thelime juice, spring onions, tomatopaste, oregano, tomatoes andchilli. Mix well, season with salt andpepper, then cover with cling film.(This mixture can now be kept inthe fridge for up to 3 days.)Defrost the prawns and patdry with kitchen paper. Just beforeserving, peel and cube theavocados. Add to the sauce withthe prawns and coriander and mixwell. (This can be done up to 3hours ahead.)Carefully separate the lettuceleaves and arrange them overa serving platter. Spoon the prawnsand juice into the cup-shapedleaves and serve with crisp ready-cookedpoppadums.', u'spoonacularSourceUrl': u'https://spoonacular.com/prawn-avocado-escabche-216271', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}