{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/752433-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 85, u'id': 752433, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Chateaubriand with Red Wine-Mushroom Reduction and Pommes Puree', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 1242.6, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 cups veal or beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cups'}, {u'originalString': u'Coarse sea salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 1/2 cups quartered mushrooms such as cremini, shiitake or chanterelle', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11266, u'unit': u'cups'}, {u'originalString': u'1/2 cup dry red wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry red wine', u'metaInformation': [u'dry red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14097, u'unit': u'cup'}, {u'originalString': u"1 1/2 pounds chateaubriand roast (the center-cut serving of the beef tenderloin), trimmed of fat and silver skin and tied at 1/2-inch intervals with butcher's twine", u'aisle': u'Meat', u'name': u'rib roast', u'metaInformation': [u"with butcher's twine", u'trimmed of fat', u'(the center-cut serving of the beef tenderloin)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prime-rib.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 13833, u'unit': u'pounds'}, {u'originalString': u'3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'4 garlic cloves, peeled and smashed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 cups cold heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Extra-virgin olive oil, for seasoning', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons minced shallot', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u'tablespoons'}, {u'originalString': u'4 sprigs fresh thyme plus extra fresh thyme leaves, for garnishing', u'aisle': u'Produce', u'name': u'thyme leaves', u'metaInformation': [u'fresh', u'for garnishing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'4 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 stick (8 tablespoons) unsalted butter, cut into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 pounds Yukon Gold potatoes, peeled and cut into 2- to 3-inch pieces', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'peeled', u'cut into 2- to 3-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'pounds'}], u'healthScore': 81.0, u'imageType': u'jpeg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/tyler-florence/roasted-chateaubriand-with-red-wine-mushroom-reduction-and-pomme-puree.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 131, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the potatoes to a medium pot with the cream, garlic, butter and some kosher salt. Bring to a boil over medium-high heat, then reduce the heat to medium-low and gently simmer until the potatoes are easily pierced with a fork, about 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Cook the chateaubriand: Preheat the oven to 350 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let the beef rest at room temperature for 15 minutes, then season with salt and pepper.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a large, oven-safe skillet over high heat until it shimmers, about 2 minutes. Set the meat in the pan and sear it on all sides until browned, about 8 minutes total. Reduce the heat to low and add 2 tablespoons of the butter, the mushrooms, garlic and the thyme.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 130.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Transfer the skillet to the oven and cook the roast until an instant-read thermometer inserted into the thickest part reads 125 to 130 degrees F., 6 to 8 minutes for medium-rare.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the skillet from the oven, transfer the roast to a cutting board, loosely tent with foil and let it rest for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u'Boil the potatoes'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the mushrooms to a bowl and pour off all but 1 tablespoon of the fat from the pan (discard the garlic and thyme). Set the skillet over medium-high heat, add the shallot and red wine, and cook, stirring to scrape up any browned bits from the bottom of the pan, until the pan is almost dry, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the broth and cream, bring to a boil, and simmer until the sauce thickens, 3 to 5 minutes. Return the mushrooms to the pan, adjust the seasoning with salt and pepper, if needed.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}], u'name': u'Make the red wine reduction'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place a colander over a large bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-ricer.jpg', u'id': 404790, u'name': u'potato ricer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the hot potatoes into the colander. Shake the potatoes to drain off the excess liquid. Press the potatoes through a ricer (or mash them with a fork for a chunkier texture) and into a medium bowl, occasionally clearing the sides of the ricer with a spoon.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 250.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pour the reserved and still-hot cream over the potatoes in small increments, folding in to combine, until you get your desired consistency. Season with olive oil and a sprinkle of sea salt and serve immediately, or keep warm in a covered oven-safe casserole dish in a 250 degree F. oven.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}], u'step': u'To serve, remove the twine from the roast and slice the roast crosswise into 2 equal portions. Sprinkle with salt and pepper. Spoon the potato puree onto 2 warm plates.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Place a slice of chateaubriand on each plate and spoon the red wine-mushroom reduction over the top.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with fresh thyme leaves and serve.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}]}], u'name': u'Make the pomme puree'}], u'winePairing': {}, u'aggregateLikes': 288, u'instructions': u'Boil the potatoes: Add the potatoes to a medium pot with the cream, garlic, butter and some kosher salt. Bring to a boil over medium-high heat, then reduce the heat to medium-low and gently simmer until the potatoes are easily pierced with a fork, about 25 minutes.                          Cook the chateaubriand: Preheat the oven to 350 degrees F. Let the beef rest at room temperature for 15 minutes, then season with salt and pepper. Heat the olive oil in a large, oven-safe skillet over high heat until it shimmers, about 2 minutes. Set the meat in the pan and sear it on all sides until browned, about 8 minutes total. Reduce the heat to low and add 2 tablespoons of the butter, the mushrooms, garlic and the thyme. Transfer the skillet to the oven and cook the roast until an instant-read thermometer inserted into the thickest part reads 125 to 130 degrees F., 6 to 8 minutes for medium-rare. Remove the skillet from the oven, transfer the roast to a cutting board, loosely tent with foil and let it rest for 10 minutes.                          Make the red wine reduction: Transfer the mushrooms to a bowl and pour off all but 1 tablespoon of the fat from the pan (discard the garlic and thyme). Set the skillet over medium-high heat, add the shallot and red wine, and cook, stirring to scrape up any browned bits from the bottom of the pan, until the pan is almost dry, about 2 minutes. Add the broth and cream, bring to a boil, and simmer until the sauce thickens, 3 to 5 minutes. Return the mushrooms to the pan, adjust the seasoning with salt and pepper, if needed.                          Make the pomme puree: Place a colander over a large bowl. Pour the hot potatoes into the colander. Shake the potatoes to drain off the excess liquid. Press the potatoes through a ricer (or mash them with a fork for a chunkier texture) and into a medium bowl, occasionally clearing the sides of the ricer with a spoon. Pour the reserved and still-hot cream over the potatoes in small increments, folding in to combine, until you get your desired consistency. Season with olive oil and a sprinkle of sea salt and serve immediately, or keep warm in a covered oven-safe casserole dish in a 250 degree F. oven.                          To serve, remove the twine from the roast and slice the roast crosswise into 2 equal portions. Sprinkle with salt and pepper. Spoon the potato puree onto 2 warm plates. Place a slice of chateaubriand on each plate and spoon the red wine-mushroom reduction over the top. Garnish with fresh thyme leaves and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-chateaubriand-with-red-wine-mushroom-reduction-and-pommes-puree-752433', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 100, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}