{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/465548-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 465548, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hot Spiced Punch', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 81.28, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'12 cinnamon sticks, broken (3 inches)', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon sticks', u'metaInformation': [u'(3 inches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'Additional cinnamon sticks, optional', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon sticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'stick', u'unitShort': u'sticks', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u'sticks'}, {u'originalString': u'Peel of 1 lemon, cut into 1-inch strips', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'cut into 1-inch strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'3/4 cup thawed lemonade concentrate', u'aisle': u'Frozen', u'name': u'lemonade concentrate', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonade.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 14292, u'unit': u'cup'}, {u'originalString': u'1 can (46 ounces) unsweetened pineapple juice', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [u'unsweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 46.0, u'consistency': u'solid', u'id': 9273, u'unit': u'ounces'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'9 cups white grape juice', u'aisle': u'Beverages', u'name': u'white grape juice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 9.0, u'consistency': u'liquid', u'id': 9135, u'unit': u'cups'}, {u'originalString': u'2 teaspoons whole allspice', u'aisle': u'Spices and Seasonings', u'name': u'whole allspice', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-berries.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002001, u'unit': u'teaspoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/hot-spiced-punch', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}], u'step': u'Place the cinnamon sticks, cloves, allspice and lemon peel in a double thickness of cheesecloth; bring up corners of cloth and tie with kitchen string to form a bag.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}]}, {u'equipment': [], u'step': u'In a large kettle, combine the grape juice, pineapple juice, lemonade concentrate and sugar; add the spice bag. Bring to a boil. Reduce heat; simmer, uncovered, for 1 hour or until punch reaches desired temperature. Discard spice bag.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonade.jpg', u'id': 14292, u'name': u'lemonade concentrate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'id': 9273, u'name': u'pineapple juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-juice.jpg', u'id': 9135, u'name': u'grape juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Serve hot with additional cinnamon sticks if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}]}], u'name': u''}], u'aggregateLikes': 9, u'instructions': u'Directions                                                                                Place the cinnamon sticks, cloves, allspice and lemon peel in a double thickness of cheesecloth; bring up corners of cloth and tie with kitchen string to form a bag.                                                                                           In a large kettle, combine the grape juice, pineapple juice, lemonade concentrate and sugar; add the spice bag. Bring to a boil. Reduce heat; simmer, uncovered, for 1 hour or until punch reaches desired temperature. Discard spice bag. Serve hot with additional cinnamon sticks if desired.                                        Yield: 4 quarts.                                                                                                                         Originally published as Hot Spiced Punch in  CountryDecember/January 2002, p51                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 182 calories, trace fat (trace saturated fat), 0 cholesterol, 10 mg sodium, 45 g carbohydrate, trace fiber, 1 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/hot-spiced-punch-465548', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}