{u'recipes': [{u'sourceName': u'Amuse Your Bouche', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/811956-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 811956, u'veryPopular': False, u'lowFodmap': False, u'title': u'Banana cake with cinnamon cream cheese icing', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 19.76, u'creditText': u'Amuse Your Bouche', u'extendedIngredients': [{u'originalString': u'1/2tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'200g banana, mashed (approx. 2 bananas)', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'mashed', u'(approx. 2 bananas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 9040, u'unit': u'g'}, {u'originalString': u'1/2tsp bicarbinate of soda', u'aisle': u'Beverages', u'name': u'diet soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 14146, u'unit': u'tsp'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'150g granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'170g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 170.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1/4tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'4tbsp sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'tbsp'}, {u'originalString': u'80ml sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 80.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'ml'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.amuse-your-bouche.com/banana-cake-cinnamon-cream-cheese-icing/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Bake for 25 minutes, or until a knife or toothpick inserted into the middle comes out clean. Set aside to cool.Meanwhile, mix the icing ingredients together, and spread over the cake once it is fully cooled.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into bars.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Banana Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Bake for 25 minutes, or until a knife or toothpick inserted into the middle comes out clean. Set aside to cool.Meanwhile, mix the icing ingredients together, and spread over the cake once it is fully cooled. Cut into bars.', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-cake-with-cinnamon-cream-cheese-icing-811956', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}