{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/225377-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 225377, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peach Melba cheesecake', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 195.29, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u"200g crunchy biscuits (we used Fox's butter biscuits)", u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [u"(we used Fox's butter biscuits)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 18009, u'unit': u'g'}, {u'originalString': u'100g butter, melted, plus a little extra for the tin', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'for the tin', u'plus a little extra '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'600g soft cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 600.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'g'}, {u'originalString': u'300ml pot double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'100g icing sugar, plus extra to taste', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'3 really ripe peaches, peeled if you like, or 6 canned peach halves (juice saved), diced into raspberry-sized chunks', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'diced', u'canned', u'ripe', u'peeled', u'(juice saved)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'450g raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 450.0, u'consistency': u'solid', u'id': 9302, u'unit': u'g'}, {u'originalString': u'2 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2320639/peach-melba-cheesecake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Line the base and sides of a 20cmloose-bottomed or springform tinwith baking parchment – use smudgesof butter to help the paper stay in placearound the sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Put the biscuits in aplastic food bag and crush to crumbsusing a rolling pin, then mix thoroughlywith the melted butter. Tip into theprepared tin and press down firmlyto create an even base. Chill whileyou prepare the filling.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the soft cheese, icing sugar andvanilla in a bowl, then beat with anelectric mixer until smooth. Tip inthe cream and continue beating untilmixture is combined. Scatter over100g of the raspberries and half ofthe peach chunks. Using a spatula,fold in with just a few folds – as youassemble the cheesecake they’llripple through more.Spoon the cream mixture onto thebiscuit base, working from the edgesinwards. Smooth the top of the cheesecakedown with the back of a dessertspoon orspatula. Leave to set in the fridge overnight.In a food processor, blitz 250g of theremaining raspberries, sieve, stir backin 1 tsp of the seeds, if you like, andsweeten to taste with icing sugar.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [], u'step': u'Addenough water or canned peach juice tomake it saucy and chill until serving.Bring the cheesecake to roomtemperature about 30 mins beforeserving. If using a loose-bottomed tin,unmould by placing on top of a can,then gradually pull down the sides of thetin. Slip the cheesecake onto a servingplate, removing the lining paper andbase. Scatter the remaining raspberriesand peach chunks over the cheesecake,dribble over some of the sauce andserve the rest alongside.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}], u'name': u''}], u'aggregateLikes': 229, u'instructions': u'Line the base and sides of a 20cmloose-bottomed or springform tinwith baking parchment – use smudgesof butter to help the paper stay in placearound the sides. Put the biscuits in aplastic food bag and crush to crumbsusing a rolling pin, then mix thoroughlywith the melted butter. Tip into theprepared tin and press down firmlyto create an even base. Chill whileyou prepare the filling.Put the soft cheese, icing sugar andvanilla in a bowl, then beat with anelectric mixer until smooth. Tip inthe cream and continue beating untilmixture is combined. Scatter over100g of the raspberries and half ofthe peach chunks. Using a spatula,fold in with just a few folds – as youassemble the cheesecake they’llripple through more.Spoon the cream mixture onto thebiscuit base, working from the edgesinwards. Smooth the top of the cheesecakedown with the back of a dessertspoon orspatula. Leave to set in the fridge overnight.In a food processor, blitz 250g of theremaining raspberries, sieve, stir backin 1 tsp of the seeds, if you like, andsweeten to taste with icing sugar. Addenough water or canned peach juice tomake it saucy and chill until serving.Bring the cheesecake to roomtemperature about 30 mins beforeserving. If using a loose-bottomed tin,unmould by placing on top of a can,then gradually pull down the sides of thetin. Slip the cheesecake onto a servingplate, removing the lining paper andbase. Scatter the remaining raspberriesand peach chunks over the cheesecake,dribble over some of the sauce andserve the rest alongside.', u'spoonacularSourceUrl': u'https://spoonacular.com/peach-melba-cheesecake-225377', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}