{u'recipes': [{u'sourceName': u'Steamy Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/602615-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 602615, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Scallops and Peppers', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 160.69, u'creditText': u'Steamy Kitchen', u'extendedIngredients': [{u'originalString': u'EITHER: One 10oz package of Philadelphia Cooking Creme OR [6oz light cream cheese, softened+1/2 cup vegetable broth+salt/pepper to taste]', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 pound dry-packed sea scallops', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pound'}, {u'originalString': u'1/4 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 tablespoon minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.steamykitchen.com/15113-creamy-scallops-and-peppers.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Pat the scallops very dry.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large saute pan or skillet over high heat. When hot, swirl in just 1 tablespoon of the olive oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add the scallops to the hot pan, try to keep them from touching each other. Give 'em room to sear! Sear 1 1/2 minutes on each side.", u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove scallops to plate.2. In same, now empty skillet, add in the remaining 1 tablespoon of olive oil and turn the heat to medium-high.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the pepper and onions and saute for 2 minutes until softened.3.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Pour in the wine and let simmer for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Mix in the cooking creme (or substitution of the cream cheese+vegetable+salt/pepper). Bring to simmer, stir until sauce is evenly mixed.4.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the scallops back into the sauce. Cook for 1 minute. Turn off heat, stir in the parsley.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Proverb Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Luminous pear and apple notes animated with aromas of lime and lemon.', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 31, u'instructions': u"1. Pat the scallops very dry. Heat a large saute pan or skillet over high heat. When hot, swirl in just 1 tablespoon of the olive oil. Add the scallops to the hot pan, try to keep them from touching each other. Give 'em room to sear! Sear 1 1/2 minutes on each side. Remove scallops to plate.2. In same, now empty skillet, add in the remaining 1 tablespoon of olive oil and turn the heat to medium-high. Add the pepper and onions and saute for 2 minutes until softened.3. Pour in the wine and let simmer for 1 minute. Mix in the cooking creme (or substitution of the cream cheese+vegetable+salt/pepper). Bring to simmer, stir until sauce is evenly mixed.4. Add the scallops back into the sauce. Cook for 1 minute. Turn off heat, stir in the parsley. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-scallops-and-peppers-602615', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}