{u'recipes': [{u'sourceName': u'Foodess', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549092-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 549092, u'veryPopular': True, u'lowFodmap': False, u'title': u'Almond-Cardamom Cream Cheese Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 18.91, u'creditText': u'Foodess', u'extendedIngredients': [{u'originalString': u'1\xbe cups (8 oz/225 grams) all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [u'(8 oz/225 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'\xbd tsp almond extract', u'aisle': u'Baking', u'name': u'almond extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002050, u'unit': u'tsp'}, {u'originalString': u'1 cup sliced, blanched almonds', u'aisle': u'Nuts;Savory Snacks', u'name': u'blanched almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blanched-almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12062, u'unit': u'cup'}, {u'originalString': u'1 cup (8 oz/225 grams) butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened', u'(8 oz/225 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'\xbd cup (4 oz/115 grams or \xbd block) cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'(4 oz/115 grams or \xbd block)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1017, u'unit': u'cup'}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'\xbe cup (5\xbd oz/150 grams) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'(5\xbd oz/150 grams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tsp ground cardamom', u'aisle': u'Spices and Seasonings', u'name': u'ground cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2006, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://foodess.com/2014/01/almond-cardamom-cream-cheese-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl, whisk together flour, salt and cardamom; set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Combine cream cheese, butter and sugar in a standing mixer; beat on medium speed until light and fluffy, about 2 minutes. Beat in egg yolk, vanilla and almond extracts.Reduce mixer speed to low and gradually add flour mixture until fully combined.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Transfer bowl to refrigerator and chill dough for one hour (or up to 24 hours).Preheat oven to 350 degrees F.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Spread almonds out on a large plate. Form dough into balls between your palms, 1 tablespoon per cookie.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Roll each dough ball in the almonds, pressing to adhere.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Bake cookies two inches apart on an ungreased (ideally parchment-lined) baking sheet for about 12 minutes, until almonds are golden and cookies are firm, rotating once during baking.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to wire racks to cool.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 626, u'instructions': u'In a medium bowl, whisk together flour, salt and cardamom; set aside.Combine cream cheese, butter and sugar in a standing mixer; beat on medium speed until light and fluffy, about 2 minutes. Beat in egg yolk, vanilla and almond extracts.Reduce mixer speed to low and gradually add flour mixture until fully combined. Transfer bowl to refrigerator and chill dough for one hour (or up to 24 hours).Preheat oven to 350 degrees F. Spread almonds out on a large plate. Form dough into balls between your palms, 1 tablespoon per cookie. Roll each dough ball in the almonds, pressing to adhere. Bake cookies two inches apart on an ungreased (ideally parchment-lined) baking sheet for about 12 minutes, until almonds are golden and cookies are firm, rotating once during baking. Transfer to wire racks to cool.', u'spoonacularSourceUrl': u'https://spoonacular.com/almond-cardamom-cream-cheese-cookies-549092', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 32, u'servings': 42, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}