{u'recipes': [{u'sourceName': u'Jamie Oliver', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/718878-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 718878, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy corn & chickpea burgers', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 267.15, u'creditText': u'Jamie Oliver', u'extendedIngredients': [{u'originalString': u'4 wholemeal burger buns', u'aisle': u'Bakery/Bread', u'name': u'burger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'1 x 400 g tin of chickpeas', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 16057, u'unit': u''}, {u'originalString': u'1 x 340 g tin of sweetcorn', u'aisle': u'Produce', u'name': u'ear sweetcorn', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'\xbd a bunch of fresh coriander', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u''}, {u'originalString': u'extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 small round lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11252, u'unit': u''}, {u'originalString': u'olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'2 teaspoons smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoons'}, {u'originalString': u'800 g sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 800.0, u'consistency': u'solid', u'id': 11507, u'unit': u'g'}, {u'originalString': u'tomato ketchup', u'aisle': u'Condiments', u'name': u'tomato ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'servings'}, {u'originalString': u'2 large ripe tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'ripe', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 55.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.jamieoliver.com/recipes/vegetables-recipes/spicy-corn-chickpea-burgers/', u'glutenFree': False, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Packed with spices, herbs and a hit of lemon zest, these vegan burgers ensure you get all the joy of tucking into a burger  all those beautiful contrasting textures. Making these veg-packed beauties gives us two of our 5-a-day, and because theyre only full of the good stuff, theyre super-healthy, but seriously satisfying, too. This recipe makes four burgers, so get your patties made at step 6 and freeze any remaining depending on how many mouths youre feeding. If youve got any salady bits and bobs hanging around, serve them up alongside your burger.Preheat the oven to 200C/400F/gas 6.Scrub the sweet potatoes clean, then halve and cut into wedges. Sprinkle over a pinch of sea salt and black pepper and 1 teaspoons of paprika (save the rest for the burgers).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}]}, {u'equipment': [], u'step': u'Drizzle with  tablespoon of olive oil, toss to coat and spread in one layer onto two baking trays.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the hot oven for 35 to 40 minutes, or until golden and cooked through.While your wedges are cooking, drain the chickpeas and sweetcorn and place in a food processor. Pick the coriander leaves, then add half to the processor along with all of the stalks. If you dont have a food processor, place in a bowl and mash with a potato masher or fork.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the spices, flour and a pinch of sea salt, grate in the lemon zest, then pulse until combined, but not smooth  you want to retain a bit of texture. If you dont have a food processor, combine with a fork, then scrunch with clean hands.On a flour-dusted surface, divide and shape the mixture into four equally sized patties (roughly 2cm thick). Pop onto a tray and place in the fridge for around 30 minutes to firm up.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a splash of olive oil in a large frying pan over a medium heat. Once hot, add the patties and cook for around 10 minutes, or until golden and cooked through, turning halfway.Click off 4 nice lettuce leaves, then finely slice the tomatoes horizontally.Halve the burger buns, then squeeze a large dollop of ketchup onto the base of each one (toast them if you like), then top with the burgers.Layer over a couple of slices of tomato, a lettuce leaf, a few coriander leaves and finally the burger tops.Chop the remaining lettuce with any leftover tomato, drizzle with a little extra virgin olive oil, add a squeeze of lemon juice, season, toss to coat and serve up with the burgers and sweet potato wedges.Tip', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'id': 18350, u'name': u'hamburger bun'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Belasco de Baquedano Swinto Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 23 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Swinto shows an attractive deep purple color. Complex and powerful in the nose, this exuberant wine boasts an intense aromatic range of ripe black fruits and jams perfectly assembled sith spicy notes provided by the oak ageing. Flavorful, dense and generous, Swinto deliveres an outstanding balance between structure and fruitiness that adds character, power, elegance and a great length to this terrific wine.', u'title': u'Belasco de Baquedano Swinto Malbec', u'price': u'$22.99', u'id': 448016, u'link': u'https://www.wine.com/product/belasco-de-baquedano-swinto-malbec-2008/108093', u'imageUrl': u'https://spoonacular.com/productImages/448016-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'MethodPacked with spices, herbs and a hit of lemon zest, these vegan burgers ensure you get all the joy of tucking into a burger  all those beautiful contrasting textures. Making these veg-packed beauties gives us two of our 5-a-day, and because theyre only full of the good stuff, theyre super-healthy, but seriously satisfying, too. This recipe makes four burgers, so get your patties made at step 6 and freeze any remaining depending on how many mouths youre feeding. If youve got any salady bits and bobs hanging around, serve them up alongside your burger.Preheat the oven to 200C/400F/gas 6.Scrub the sweet potatoes clean, then halve and cut into wedges. Sprinkle over a pinch of sea salt and black pepper and 1 teaspoons of paprika (save the rest for the burgers). Drizzle with  tablespoon of olive oil, toss to coat and spread in one layer onto two baking trays.Bake in the hot oven for 35 to 40 minutes, or until golden and cooked through.While your wedges are cooking, drain the chickpeas and sweetcorn and place in a food processor. Pick the coriander leaves, then add half to the processor along with all of the stalks. If you dont have a food processor, place in a bowl and mash with a potato masher or fork.Add the spices, flour and a pinch of sea salt, grate in the lemon zest, then pulse until combined, but not smooth  you want to retain a bit of texture. If you dont have a food processor, combine with a fork, then scrunch with clean hands.On a flour-dusted surface, divide and shape the mixture into four equally sized patties (roughly 2cm thick). Pop onto a tray and place in the fridge for around 30 minutes to firm up.Heat a splash of olive oil in a large frying pan over a medium heat. Once hot, add the patties and cook for around 10 minutes, or until golden and cooked through, turning halfway.Click off 4 nice lettuce leaves, then finely slice the tomatoes horizontally.Halve the burger buns, then squeeze a large dollop of ketchup onto the base of each one (toast them if you like), then top with the burgers.Layer over a couple of slices of tomato, a lettuce leaf, a few coriander leaves and finally the burger tops.Chop the remaining lettuce with any leftover tomato, drizzle with a little extra virgin olive oil, add a squeeze of lemon juice, season, toss to coat and serve up with the burgers and sweet potato wedges.Tip', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-corn-chickpea-burgers-718878', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}