{u'recipes': [{u'sourceName': u'The Baking Pan', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/533905-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 533905, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Chip Cake', u'diets': [], u'preparationMinutes': 240, u'pricePerServing': 229.67, u'creditText': u'The Baking Pan', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup firmly packed light brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbe cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'\xbe cup Dutch-processed cocoa powder', u'aisle': u'Baking', u'name': u'dutch processed cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dutch-process-cocoa-powder.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019165, u'unit': u'cup'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'4 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'11/3 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.6666666666666665, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 tablespoon instant espresso coffee (espresso powder)', u'aisle': u'Tea and Coffee', u'name': u'instant coffee', u'metaInformation': [u'(espresso powder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14214, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon instant espresso coffee (espresso powder)', u'aisle': u'Tea and Coffee', u'name': u'instant coffee', u'metaInformation': [u'(espresso powder)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14214, u'unit': u'teaspoon'}, {u'originalString': u'2 ounces milk chocolate', u'aisle': u'Sweet Snacks', u'name': u'milk chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19081, u'unit': u'ounces'}, {u'originalString': u'Clear acetate plastic strip or parchment paper', u'aisle': u'Ethnic Foods', u'name': u'rice paper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'strip', u'unitShort': u'strip', u'amount': 1.0, u'consistency': u'solid', u'id': 10118368, u'unit': u'strip'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'About \xbc cup mini semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'8 ounces (1\xbc cups) mini semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 10019903, u'unit': u'cups'}, {u'originalString': u'1\xbd cups (3 sticks) unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature', u'(3 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cups'}, {u'originalString': u'11/3 cups unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.6666666666666665, u'consistency': u'solid', u'id': 1145, u'unit': u'cups'}, {u'originalString': u'1 tablespoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'\xbe cup hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'2 ounces white chocolate', u'aisle': u'Baking', u'name': u'white chocolate', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19087, u'unit': u'ounces'}, {u'originalString': u'11/3 cups milk (preferably whole milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'(preferably milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.6666666666666665, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'6 ounces dark or, bittersweet chocolate', u'aisle': u'?', u'name': u'or', u'metaInformation': [u'dark'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'unit': u'ounces'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://thebakingpan.com/recipes/cakes/chocolate-chip-cake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 88, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a small mixing bowl, combine the cocoa powder, instant espresso coffee, and hot water. Stir until smooth, and then blend in the buttermilk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10014214, u'name': u'instant espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add vanilla; stir until thoroughly blended and smooth. Set aside.In a medium bowl, combine flour, baking powder, baking soda, and salt; sift or whisk together to mix. Set aside.In a large bowl of an electric mixer, cream the butter, granulated sugar, and brown sugar until light and fluffy. Tip: To cream, start by placing the butter in the bowl, with an electric mixer on medium speed begin by beating the butter about 1 minute until it is smooth and light in color. With the mixer still on medium speed, slowly add the granulated sugar to the butter, either one tablespoon at a time, or in a very slow steady stream, taking from 4 to 5 minutes to add all of the sugar, then add the brown sugar, taking an additional 3 to 4 minutes, beating until the butter and sugars are fully incorporated and the mixture is a light color with a fluffy texture. While adding the sugars, stop the mixer occasionally to scrape the mixture off the paddle and scrape down the sides and bottom of the bowl with a rubber spatula so the mixture blends evenly.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add eggs one at a time, beating until thoroughly mixed. Tip: For each egg, crack the egg into a small bowl and whisk with a fork to thoroughly break up the egg before adding to the creamed mixture. Start with the mixer on low speed so the liquid from the egg doesnt splatter, once the egg is partially mixed increase the speed to medium. Each egg should be fully incorporated into the mixture before adding the next egg, taking about one minute to blend in each egg.With the mixer on low speed, add about one third of the flour mixture, mix just until the flour is almost completely blended. Scrape the bowl down, and add about one half of the cocoa mixture, blending just until mixed. Scrape the bowl down again and continue alternating with the flour mixture and cocoa mixture, ending with the last portion of the flour, and stirring just until blended.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the bowl from the mixer. Using a balloon type whisk or large rubber spatula, fold in the mini chocolate chips.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Bake: Spoon the batter into the prepared pans and smooth the surface with a small offset spatula or the back of a large spoon.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Bake 40 to 45 minutes or until a long toothpick, wooden skewer, or cake tester inserted in the center comes out clean.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and place pans on a wire cooling rack to cool for 10 to 15 minutes then remove cake from the pans and place the cake on the wire cooling rack to finish cooling.In a medium heavy saucepan, add the flour and instant espresso coffee, and using a wire whisk, slowly whisk in the milk, whisking until the sauce is smooth and free of lumps.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10014214, u'name': u'instant espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the pan over medium heat and cook, whisking constantly, until the sauce comes to a boil and thickens, 5 to 10 minutes. Boil and whisk for 1 minute.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from the heat, and set aside to cool to room temperature, or a tepid temperature. While cooling, whisk frequently to keep the sauce smooth. Tip: If the sauce is too warm when added to the creamed butter mixture it will melt the butter. If the sauce is too cold it will not blend smoothly.Meanwhile, prepare the butter and sugar when the sauce is almost cooled to the right temperature, in a large bowl of an electric mixer, cream the butter and sugar until light and fluffy.Gradually add the cooled sauce, adding 2 to 3 tablespoons at a time, beating about 20 seconds between each addition.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the vanilla and continue to beat for another 1 to 2 minutes to thoroughly blend and the frosting is somewhat fluffy. The frosting should be used immediately, or refrigerate until needed.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Place one of the cake layers on a cake plate. Using an offset spatula spread frosting about  inch thick over the layer.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Place the 2nd cake layer on top. Cover the sides and top of the cake with the remaining frosting. Refrigerate frosted cake to set the frosting while preparing the Chocolate Collar.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut the acetate the same height as the finished cake, or a little higher if desired, and long enough to wrap around the outside of the cake with about  inch extra for overlap. Lay the strip on a large piece of parchment or waxed paper to make cleanup easy. Tip: parchment paper may be used in place of acetate strips; acetate strips are a little easier to work with as they are flexible and form easily around the cake sides.Melt white and milk chocolates separately in top of a double boiler over hot water. Or, place the chocolate in a microwave-safe bowl, use 50% power and stir frequently just until the chocolate is melted; do not overheat as chocolate will burn easily. Twist Tip: Create a double boiler by filling a saucepan with 2 inches of water and bringing it to a simmer. Turn the heat off and place a stainless steel, ceramic, or glass bowl on top of the hot water, the upper pan should not touch the water.Spoon melted white and milk chocolates into separate small plastic freezer bags. Twist the top of the bag to create some pressure to make easier to squeeze out.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Cut a tiny corner off the tip of the bag. Pipe dots of the white and milk chocolates randomly over the acetate. Flatten the dots a bit with your finger or small spatula.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Let the dots set. Tip: Dont worry if the dots arent completely flat, the tops will be hidden once wrapped around the cake. The flatter the dots are, the easier to spread the dark chocolate over them.Melt the dark or bittersweet chocolate. Working quickly before the dark chocolate starts setting up, use a rubber spatula or offset spatula to spread evenly over the entire strip of plastic to cover the dots. Make sure and cover all the edges of the plastic, spreading a bit onto the parchment or wax paper underneath. Tip: dont worry if some of the dark chocolate is thicker in some areas than others, its more important to fill in all the empty spaces. Be careful not to press too hard or the dots may lift off the surface or move around.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'id': 19903, u'name': u'bittersweet chocolate'}]}, {u'equipment': [], u'step': u'Let the chocolate strip set until the chocolate loses some of its gloss, about 1 minute; it is now ready to wrap around the cake. Carefully lift up the acetate strip from the parchment or waxed paper you placed underneath and quickly wrap the strip around the cake with the chocolate on the inside and overlapping the edge. Use a small piece of tape to secure the edge.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Let the chocolate completely set and harden either at room temperature or in the refrigerator in warm weather.When ready to serve, un-tape the edge and gently peel away the plastic. Sprinkle mini chocolate chips over the top of the cake.When cutting the cake the chocolate collar may tend to break apart, especially if the chocolate has been refrigerated. If you use a sharp kitchen knife and use a gentle sawing motion against the chocolate you can get a fairly clean cut edge.', u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}, {u'equipment': [], u'step': u'Serve cake either at room temperature or chilled. When serving chilled the cake is dense and fudgy.', u'number': 18, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 31, u'instructions': u'In a small mixing bowl, combine the cocoa powder, instant espresso coffee, and hot water. Stir until smooth, and then blend in the buttermilk. Add vanilla; stir until thoroughly blended and smooth. Set aside.In a medium bowl, combine flour, baking powder, baking soda, and salt; sift or whisk together to mix. Set aside.In a large bowl of an electric mixer, cream the butter, granulated sugar, and brown sugar until light and fluffy. Tip: To cream, start by placing the butter in the bowl, with an electric mixer on medium speed begin by beating the butter about 1 minute until it is smooth and light in color. With the mixer still on medium speed, slowly add the granulated sugar to the butter, either one tablespoon at a time, or in a very slow steady stream, taking from 4 to 5 minutes to add all of the sugar, then add the brown sugar, taking an additional 3 to 4 minutes, beating until the butter and sugars are fully incorporated and the mixture is a light color with a fluffy texture. While adding the sugars, stop the mixer occasionally to scrape the mixture off the paddle and scrape down the sides and bottom of the bowl with a rubber spatula so the mixture blends evenly.Add eggs one at a time, beating until thoroughly mixed. Tip: For each egg, crack the egg into a small bowl and whisk with a fork to thoroughly break up the egg before adding to the creamed mixture. Start with the mixer on low speed so the liquid from the egg doesnt splatter, once the egg is partially mixed increase the speed to medium. Each egg should be fully incorporated into the mixture before adding the next egg, taking about one minute to blend in each egg.With the mixer on low speed, add about one third of the flour mixture, mix just until the flour is almost completely blended. Scrape the bowl down, and add about one half of the cocoa mixture, blending just until mixed. Scrape the bowl down again and continue alternating with the flour mixture and cocoa mixture, ending with the last portion of the flour, and stirring just until blended.Remove the bowl from the mixer. Using a balloon type whisk or large rubber spatula, fold in the mini chocolate chips.Bake: Spoon the batter into the prepared pans and smooth the surface with a small offset spatula or the back of a large spoon. Bake 40 to 45 minutes or until a long toothpick, wooden skewer, or cake tester inserted in the center comes out clean. Remove from oven and place pans on a wire cooling rack to cool for 10 to 15 minutes then remove cake from the pans and place the cake on the wire cooling rack to finish cooling.In a medium heavy saucepan, add the flour and instant espresso coffee, and using a wire whisk, slowly whisk in the milk, whisking until the sauce is smooth and free of lumps. Place the pan over medium heat and cook, whisking constantly, until the sauce comes to a boil and thickens, 5 to 10 minutes. Boil and whisk for 1 minute. Remove from the heat, and set aside to cool to room temperature, or a tepid temperature. While cooling, whisk frequently to keep the sauce smooth. Tip: If the sauce is too warm when added to the creamed butter mixture it will melt the butter. If the sauce is too cold it will not blend smoothly.Meanwhile, prepare the butter and sugar when the sauce is almost cooled to the right temperature, in a large bowl of an electric mixer, cream the butter and sugar until light and fluffy.Gradually add the cooled sauce, adding 2 to 3 tablespoons at a time, beating about 20 seconds between each addition. Add the vanilla and continue to beat for another 1 to 2 minutes to thoroughly blend and the frosting is somewhat fluffy. The frosting should be used immediately, or refrigerate until needed.Place one of the cake layers on a cake plate. Using an offset spatula spread frosting about  inch thick over the layer. Place the 2nd cake layer on top. Cover the sides and top of the cake with the remaining frosting. Refrigerate frosted cake to set the frosting while preparing the Chocolate Collar.Cut the acetate the same height as the finished cake, or a little higher if desired, and long enough to wrap around the outside of the cake with about  inch extra for overlap. Lay the strip on a large piece of parchment or waxed paper to make cleanup easy. Tip: parchment paper may be used in place of acetate strips; acetate strips are a little easier to work with as they are flexible and form easily around the cake sides.Melt white and milk chocolates separately in top of a double boiler over hot water. Or, place the chocolate in a microwave-safe bowl, use 50% power and stir frequently just until the chocolate is melted; do not overheat as chocolate will burn easily. Twist Tip: Create a double boiler by filling a saucepan with 2 inches of water and bringing it to a simmer. Turn the heat off and place a stainless steel, ceramic, or glass bowl on top of the hot water, the upper pan should not touch the water.Spoon melted white and milk chocolates into separate small plastic freezer bags. Twist the top of the bag to create some pressure to make easier to squeeze out. Cut a tiny corner off the tip of the bag. Pipe dots of the white and milk chocolates randomly over the acetate. Flatten the dots a bit with your finger or small spatula. Let the dots set. Tip: Dont worry if the dots arent completely flat, the tops will be hidden once wrapped around the cake. The flatter the dots are, the easier to spread the dark chocolate over them.Melt the dark or bittersweet chocolate. Working quickly before the dark chocolate starts setting up, use a rubber spatula or offset spatula to spread evenly over the entire strip of plastic to cover the dots. Make sure and cover all the edges of the plastic, spreading a bit onto the parchment or wax paper underneath. Tip: dont worry if some of the dark chocolate is thicker in some areas than others, its more important to fill in all the empty spaces. Be careful not to press too hard or the dots may lift off the surface or move around.Let the chocolate strip set until the chocolate loses some of its gloss, about 1 minute; it is now ready to wrap around the cake. Carefully lift up the acetate strip from the parchment or waxed paper you placed underneath and quickly wrap the strip around the cake with the chocolate on the inside and overlapping the edge. Use a small piece of tape to secure the edge. Let the chocolate completely set and harden either at room temperature or in the refrigerator in warm weather.When ready to serve, un-tape the edge and gently peel away the plastic. Sprinkle mini chocolate chips over the top of the cake.When cutting the cake the chocolate collar may tend to break apart, especially if the chocolate has been refrigerated. If you use a sharp kitchen knife and use a gentle sawing motion against the chocolate you can get a fairly clean cut edge.Serve cake either at room temperature or chilled. When serving chilled the cake is dense and fudgy.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-chip-cake-533905', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 285, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}