{u'recipes': [{u'sourceName': u'Peanut Butter and Peepers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511207-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 511207, u'veryPopular': False, u'lowFodmap': False, u'title': u'Super Chocolaty Hot Cocoa', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 1, u'pricePerServing': 44.28, u'creditText': u'Peanut Butter and Peepers', u'extendedIngredients': [{u'originalString': u'1/2 tsp. corn starch', u'aisle': u'Baking', u'name': u'corn starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 20027, u'unit': u'tsp'}, {u'originalString': u'1 pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1/2 tsp. stevia or 2 tbsp. sugar', u'aisle': u'Baking', u'name': u'stevia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93628, u'unit': u'tsp'}, {u'originalString': u'2 tbsp. unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'1 cup coconut milk, unsweetened from carton (regular milk will work too)', u'aisle': u'Canned and Jarred', u'name': u'unsweetened coconut milk', u'metaInformation': [u'unsweetened', u'(regular milk will work too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'cup'}, {u'originalString': u'1/4 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.peanutbutterandpeppers.com/2012/12/24/super-chocolaty-hot-cocoa/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a sauce pan add all your ingredients and set over low heat; whisk until thicken and bubbly.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into a mug, serve with whip cream.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 316, u'instructions': u'In a sauce pan add all your ingredients and set over low heat; whisk until thicken and bubbly. Pour into a mug, serve with whip cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/super-chocolaty-hot-cocoa-511207', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 6, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}