{u'recipes': [{u'sourceName': u'Christines Recipes ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626292-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 626292, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spaghetti with Clams', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 221.02, u'creditText': u'Christines Recipes ', u'extendedIngredients': [{u'originalString': u'1 Tbsp basil, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 kg clams', u'aisle': u'Seafood', u'name': u'clams', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 15157, u'unit': u'kg'}, {u'originalString': u'1 tsp minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'2 sprigs continental parsley, roughly chopped + plus more for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'plus more for garnish', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'sprigs'}, {u'originalString': u'1 red chilli, roughly chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'200 gm spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'gms', u'unitShort': u'gm', u'amount': 200.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'gm'}, {u'originalString': u'1 Tbsp spring onion, chopped', u'aisle': u'Produce', u'name': u'spring onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tbsp'}, {u'originalString': u'100 ml white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'ml'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://en.christinesrecipes.com/2015/01/spaghetti-with-clams.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Soak the clams in salted water for 3 hours and let them release sands inside. Rinse and blanch in boiling water until they are slightly open. You dont need to cook through them at this stage.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'Drain them in a colander. Set aside.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 16, u'instructions': u'Soak the clams in salted water for 3 hours and let them release sands inside. Rinse and blanch in boiling water until they are slightly open. You dont need to cook through them at this stage. Drain them in a colander. Set aside.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-with-clams-626292', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}