{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/414946-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 414946, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tasty Seasoned Oyster Crackers', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 155.08, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'3/4 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon dried dill weed', u'aisle': u'Spices and Seasonings', u'name': u'dried dill weed', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2017, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon granulated garlic', u'aisle': u'Spices and Seasonings', u'name': u'granulated garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002020, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground white pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon lemon pepper', u'aisle': u'Spices and Seasonings', u'name': u'lemon pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'2 (16 ounce) packages oyster crackers', u'aisle': u'Savory Snacks', u'name': u'oyster crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oyster-crackers.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 10018228, u'unit': u'ounce'}, {u'originalString': u'1 (1 ounce) package ranch dressing mix', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 93733, u'unit': u'ounce'}, {u'originalString': u'1/2 teaspoon seasoned salt', u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1042047, u'unit': u'teaspoon'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Tasty-Seasoned-Oyster-Crackers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 275.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 275 degrees F (135 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, mix the canola oil, ranch dressing mix, dill, lemon pepper, granulated garlic, onion powder, seasoned salt, and white pepper until thoroughly combined. Gently mix the crackers with the seasonings, tossing to coat the crackers with the seasoned oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'id': 93733, u'name': u'dry ranch dressing mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1002020, u'name': u'granulated garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1042047, u'name': u'seasoned salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'id': 1012030, u'name': u'lemon pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread the crackers out onto a jelly roll pan in a single layer.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the preheated oven until the crackers are very lightly browned at the edges, 15 to 20 minutes, stirring to bake other sides halfway through cooking. Allow to cool completely before storing in airtight canister or resealable plastic bag.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 222, u'instructions': u'Preheat oven to 275 degrees F (135 degrees C).                            In a large bowl, mix the canola oil, ranch dressing mix, dill, lemon pepper, granulated garlic, onion powder, seasoned salt, and white pepper until thoroughly combined. Gently mix the crackers with the seasonings, tossing to coat the crackers with the seasoned oil. Spread the crackers out onto a jelly roll pan in a single layer.                            Bake in the preheated oven until the crackers are very lightly browned at the edges, 15 to 20 minutes, stirring to bake other sides halfway through cooking. Allow to cool completely before storing in airtight canister or resealable plastic bag.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/tasty-seasoned-oyster-crackers-414946', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}