{u'recipes': [{u'sourceName': u'Cookin Canuck', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/584496-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 584496, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Mushroom & Sun-Dried Tomato Omelet', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30'], u'pricePerServing': 160.94, u'creditText': u'Cookin Canuck', u'extendedIngredients': [{u'originalString': u'1 cup sliced crimini (Baby Bella) mushrooms', u'aisle': u'Produce', u'name': u'crimini mushrooms', u'metaInformation': [u'sliced', u'(Baby Bella)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 pinches ground pepper, divided', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinches', u'unitShort': u'pinches', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinches'}, {u'originalString': u'2 pinches kosher salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinches', u'unitShort': u'pinches', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'pinches'}, {u'originalString': u'1 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'1 tbsp chopped Italian parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'italian', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'4 sun-dried tomatoes (not oil-packed), thinly sliced', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun-dried tomatoes', u'metaInformation': [u'thinly sliced', u'(not oil-packed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11955, u'unit': u''}, {u'originalString': u'1 1/2 tbsp water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.cookincanuck.com/2012/12/easy-mushroom-sun-dried-tomato-omelet-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a small nonstick skillet set over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the mushrooms and cook, stirring occasionally, until the mushrooms are tender and just starting to brown, 4 to 5 minutes.  Stir in the sun-dried tomatoes, parsley, one pinch of salt and one pinch of pepper, and heat briefly.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'id': 11955, u'name': u'sun dried tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the mixture to a bowl and set aside.In a medium bowl, whisk together the egg, egg white and water.Use the same small skillet, coat it with cooking spray and set it over medium-hight heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add egg mixture to skillet and, with a heat-resistant spatula, immediately start to push the egg from the bottom of the pan, tipping the pan to move uncooked egg into empty spots so that all of the egg gets cooked (See How to: Make an Omelet.When the egg is mostly cooked, but still slightly liquid on top, add the mushroom filling to one side of the omelet.Fold the egg over the fillings. Slide the omelet onto a plate and serve immediately.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Omelet works really well with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. The Bellafina Prosecco with a 4.6 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u"Intensely aromatic and crisp on the palate, with aromas and flavorsof yellow apple, white peach, pear and notes of white flowers.Excellent as an aperitif, it is a perfect accompaniment to hors-d'oeuvres and delicate first courses. Also wonderful with fish and shellfish.", u'title': u'Bellafina Prosecco', u'price': u'$11.99', u'id': 461572, u'link': u'https://www.wine.com/product/bellafina-prosecco/136821', u'imageUrl': u'https://spoonacular.com/productImages/461572-312x231.jpg'}]}, u'aggregateLikes': 379, u'instructions': u'Heat the olive oil in a small nonstick skillet set over medium-high heat.Add the mushrooms and cook, stirring occasionally, until the mushrooms are tender and just starting to brown, 4 to 5 minutes.  Stir in the sun-dried tomatoes, parsley, one pinch of salt and one pinch of pepper, and heat briefly.  Transfer the mixture to a bowl and set aside.In a medium bowl, whisk together the egg, egg white and water.Use the same small skillet, coat it with cooking spray and set it over medium-hight heat.Add egg mixture to skillet and, with a heat-resistant spatula, immediately start to push the egg from the bottom of the pan, tipping the pan to move uncooked egg into empty spots so that all of the egg gets cooked (See How to: Make an Omelet.When the egg is mostly cooked, but still slightly liquid on top, add the mushroom filling to one side of the omelet.Fold the egg over the fillings. Slide the omelet onto a plate and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-mushroom-sun-dried-tomato-omelet-584496', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}