{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/449417-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 449417, u'veryPopular': False, u'lowFodmap': False, u'title': u'Time-Saving Tacos', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 166.58, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 cups Big-Batch Beef Sauce', u'aisle': u'Frozen;Meat', u'name': u'beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 23572, u'unit': u'cups'}, {u'originalString': u'6 to 8 taco shells or flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'Shredded lettuce, chopped tomatoes, sliced ripe olives, shredded cheddar cheese, chopped onions, sour cream, and salsa', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'shredded', u'sour', u'ripe', u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'1 envelope taco seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'envelope', u'unitShort': u'envelope', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'envelope'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/time-saving-tacos', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, combine the beef sauce, taco seasoning and water. Bring to a boil; reduce heat. Simmer, uncovered, until heated through. Spoon about 1/4 cup meat mixture into each taco shell or tortilla.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Serve with toppings of your choice.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Tacos. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Argyle Reserve Pinot Noir with a 4.3 out of 5 star rating seems like a good match. It costs about 30 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The Willamette Valley is best known for their rich Pinot Noir and this is one of the biggest and richest ever from Argyle! Take the color and scent of a Guinee rose, add fruit aromas of black cherry and marion berry with spice aromas of turned earth and dark cocoa and you just begin to approach the complexity of this wine. "Ripe and generous, with distinctive violet and rose petal overtones to the cherry and spice flavors, lingering with fine texture. Needs time to settle in. Twenty percent of the wine will be bottled under screw cap. The wine bottled under screw cap scored 92 points. Best from 2007 through 2012."-Wine Spectator', u'title': u'Argyle Reserve Pinot Noir', u'price': u'$29.99', u'id': 433920, u'link': u'https://www.wine.com/product/argyle-reserve-pinot-noir-2002/61792', u'imageUrl': u'https://spoonacular.com/productImages/433920-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Directions                                                                                In a large saucepan, combine the beef sauce, taco seasoning and water. Bring to a boil; reduce heat. Simmer, uncovered, until heated through. Spoon about 1/4 cup meat mixture into each taco shell or tortilla. Serve with toppings of your choice.                                        Yield: 3-4 servings.                                                                                                                         Originally published as Time-Saving Tacos in  Quick CookingMay/June 2000, p14                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/time-saving-tacos-449417', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}