{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/383636-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 383636, u'veryPopular': True, u'lowFodmap': True, u'title': u'Bacon-Wrapped Shrimp', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'fodmap friendly'], u'preparationMinutes': 20, u'pricePerServing': 47.0, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'15 bacon strips, cut in half', u'aisle': u'Meat', u'name': u'bacon strips', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'1/2 cup creamy Caesar salad dressing, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'caesar salad dressing', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 43015, u'unit': u'cup'}, {u'originalString': u'2 jalapeno peppers, seeded and thinly sliced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'seeded', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 pound uncooked medium shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'deveined', u'uncooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/bacon-wrapped-shrimp', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Pour 6 tablespoons dressing into a large resealable plastic bag; add shrimp. Seal bag and turn to coat; refrigerate for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Meanwhile, in a skillet or microwave, cook bacon until cooked but not crisp.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Drain and discard marinade; place a jalapeno slice on each shrimp. Wrap bacon around shrimp; secure ends with toothpicks.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/broiler-pan.jpg', u'id': 404698, u'name': u'broiler pan'}], u'step': u'Place shrimp on a broiler pan coated with cooking spray.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Broil 4 in. from the heat for 2-3 minutes on each side or until shrimp turn pink, basting frequently with remaining dressing.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Remove toothpicks.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Maso Canali Pinot Grigio. Reviewers quite like it with a 4.6 out of 5 star rating and a price of about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal. View More', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 847, u'instructions': u"Directions                                                                                Pour 6 tablespoons dressing into a large resealable plastic bag; add shrimp. Seal bag and turn to coat; refrigerate for 15 minutes.                                                                                           Meanwhile, in a skillet or microwave, cook bacon until cooked but not crisp. Drain on paper towels.                                                                                           Drain and discard marinade; place a jalapeno slice on each shrimp. Wrap bacon around shrimp; secure ends with toothpicks. Place shrimp on a broiler pan coated with cooking spray.                                                                                           Broil 4 in. from the heat for 2-3 minutes on each side or until shrimp turn pink, basting frequently with remaining dressing. Remove toothpicks.                                        Yield: 2-1/2 dozen.                                                                                                     Editor's Note: Wear disposable gloves when cutting hot peppers; the oils can burn skin. Avoid touching your face.                                                                                                Originally published as Bacon-Wrapped Shrimp in  Simple & DeliciousNovember/December 2009, p42                                                                                                                                                                                                        Nutritional Facts                                                                             1 appetizer equals 34 calories, 2 g fat (1 g saturated fat), 26 mg cholesterol, 113 mg sodium, trace carbohydrate, trace fiber, 4 g protein. Diabetic Exchange: 1 lean meat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-wrapped-shrimp-383636', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 30, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}