{u'recipes': [{u'sourceName': u'Kirbie Cravings', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/228555-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 228555, u'veryPopular': False, u'lowFodmap': False, u'title': u'7 Layer Salad in a Jar', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 321.19, u'creditText': u'Kirbie Cravings', u'extendedIngredients': [{u'originalString': u'1 large avocado, diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 cooked corn on the cob, with corn stripped off cob', u'aisle': u'Produce', u'name': u'corn on the cob', u'metaInformation': [u'with corn stripped off cob', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'2 tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'1 cup fat free Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat free greek yogurt', u'metaInformation': [u'fat free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}, {u'originalString': u'10-12 fresh basil leaves, chopped finely', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'chopped', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'juice of 2 lemons', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'12 leaves of green lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 12.0, u'consistency': u'solid', u'id': 11252, u'unit': u'leaves'}, {u'originalString': u'pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'seeds from one small pomegranate', u'aisle': u'Produce', u'name': u'pomegranate seeds', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 9286, u'unit': u'servings'}, {u'originalString': u'3 tbsp of slivered almonds', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10012061, u'unit': u'tbsp'}, {u'originalString': u'1 large tomato, diced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 can of white albacore tuna (or firm tofu, cubed to make vegetarian)', u'aisle': u'Canned and Jarred', u'name': u'tuna', u'metaInformation': [u'white', u'firm', u'cubed', u'(or tofu, to make vegetarian)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 15119, u'unit': u'can'}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://kirbiecravings.com/2013/10/7-layer-salad-in-a-jar.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the salad dressing ingredients. If you have a salad shaker, whisk directly in salad shaker and then hand shake to finish mixing.2. Slice lettuce leaves into bite sized pieces and place evenly into three mason jars.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour dressing on top.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add tuna/tofu on top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'id': 15119, u'name': u'tuna'}]}, {u'equipment': [], u'step': u'Add a layer of diced tomatoes.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add corn on top of tomatoes.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Add avocado pieces on top of corn. Layer pomegranate seeds on top. Finally, add some almond slivers. Seal and store in fridge until ready to eat. Shake salads with lid on before eating.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'id': 9286, u'name': u'pomegranate seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 268, u'instructions': u'<p>1. Whisk together the salad dressing ingredients. If you have a salad shaker, whisk directly in salad shaker and then hand shake to finish mixing.2. Slice lettuce leaves into bite sized pieces and place evenly into three mason jars. Pour dressing on top. Add tuna/tofu on top. Add a layer of diced tomatoes. Add corn on top of tomatoes. Add avocado pieces on top of corn. Layer pomegranate seeds on top. Finally, add some almond slivers. Seal and store in fridge until ready to eat. Shake salads with lid on before eating.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/7-layer-salad-in-a-jar-228555', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}