{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/274458-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 274458, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pasta e Fagioli', u'diets': [], u'preparationMinutes': 35, u'pricePerServing': 158.0, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'1 pkg. (6 oz.) baby spinach leaves', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11457, u'unit': u'oz'}, {u'originalString': u'1 can (15 oz.) cannellini beans, rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned cannellini beans', u'metaInformation': [u'rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10016051, u'unit': u'oz'}, {u'originalString': u'1/2 cup (1/2 of 8-oz. tub) PHILADELPHIA Cream Cheese Spread', u'aisle': u'Cheese', u'name': u'chive & onion cream cheese spread', u'metaInformation': [u'(1/2 of 8-oz. tub)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-onion-cream-cheese-dip.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93748, u'unit': u'cup'}, {u'originalString': u'3 Tbsp. chopped fresh basil', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2044, u'unit': u'Tbsp'}, {u'originalString': u'4 large cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 cup KRAFT Shredded Italian* Five Cheese with a TOUCH OF PHILADELPHIA', u'aisle': u'Cheese', u'name': u'italian cheese', u'metaInformation': [u'shredded', u'with a touch of philadelphia', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93651, u'unit': u'cup'}, {u'originalString': u'3 Tbsp. KRAFT Grated Parmesan Cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'Tbsp'}, {u'originalString': u'1 jar (24 oz.) CLASSICO FAMILY FAVORITES Traditional Pasta Sauce', u'aisle': u'Pasta and Rice', u'name': u'pasta sauce', u'metaInformation': [u'traditional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 10011549, u'unit': u'oz'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'4 cups wide egg noodles, uncooked', u'aisle': u'Pasta and Rice', u'name': u'wide egg noodles', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20409, u'unit': u'cups'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/pasta-e-fagioli-pasta-115310.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bring pasta sauce, water and garlic to boil in large skillet.  Stir in noodles; cover.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10011549, u'name': u'pasta sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Cook on medium-low heat 10 to 12 min. or until noodles are tender, stirring occasionally.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add cream cheese spread; cook 3 to 5 min. or until melted, stirring frequently.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Stir in spinach, beans and basil; cover.  Cook 5 min. or until heated through, stirring occasionally.  Top with remaining cheeses; cook, covered, 3 to 5 min. or until melted, stirring occasionally.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u'Bring pasta sauce, water and garlic to boil in large skillet.  Stir in noodles; cover.                                            Cook on medium-low heat 10 to 12 min. or until noodles are tender, stirring occasionally.  Add cream cheese spread; cook 3 to 5 min. or until melted, stirring frequently.                                             Stir in spinach, beans and basil; cover.  Cook 5 min. or until heated through, stirring occasionally.  Top with remaining cheeses; cook, covered, 3 to 5 min. or until melted, stirring occasionally.', u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-e-fagioli-274458', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}