{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/196539-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 196539, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Mexican Chorizo with Spicy Tomato Caper Sauce', u'diets': [u'gluten free', u'dairy free', u'whole 30', u'ketogenic'], u'pricePerServing': 417.73, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/4 chopped green or black olives', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'green', u'black', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 1059195, u'unit': u''}, {u'originalString': u'1 (28-ounce) can whole peeled tomatoes, drained, broken up by hand into rough chunks', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'whole', u'peeled', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1/4 cup capers, drained and roughly chopped', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'drained', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2054, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoon'}, {u'originalString': u'2 pounds fresh raw Mexican chorizo sausages', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [u'raw', u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 7019, u'unit': u'pounds'}, {u'originalString': u'1/4 cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 teaspoons cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoons'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 large onion, finely sliced (about 1 1/2 cups)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}], u'healthScore': 47.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/05/grilled-mexican-chorizo-with-spicy-tomato-caper-sauce-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat oil in a large saucepan over medium-high heat until shimmering.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion and cook, stirring frequently, until softened, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add cumin and chili powder and cook, stirring constantly, until fragrant, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add tomatoes, capers, olives, and cilantro. Season to taste with salt and pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Remove from heat and set aside.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer tomato mixture to 10-inch square disposable aluminum pan. Alternatively, construct a tray out of a double layer of heavy duty aluminum foil, 10 inches square, with sides about 2 inches high. Nestle sausages into mixture.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place tray on hot side of grill and cook until simmering, about 4 minutes. Slide to cooler side of grill. Cover grill with vents over the sausages. Cook with all vents open until sausages register 140\xb0 to 145\xb0F on an instant read thermometer, about 20 minutes, turning once in the middle.', u'length': {u'number': 24, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Remove lid. Using tongs, remove sausages from sauce and place directly on cooking grates over hot side of grill. Cook, turning occasionally, until well browned and crisp, about 3 minutes total. Return to sauce.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately, garnishing with extra cilantro, lime wedges, and tortillas is desired.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try J Vineyards & Winery Pinot Noir. Reviewers quite like it with a 5 out of 5 star rating and a price of about 48 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'red berries , licorice , spice', u'title': u'J Vineyards & Winery Pinot Noir', u'price': u'$47.99', u'id': 428384, u'link': u'https://www.amazon.com/Vineyards-Winery-Russian-River-Valley/dp/B01A6A3A1O', u'imageUrl': u'https://spoonacular.com/productImages/428384-312x231.jpg'}]}, u'aggregateLikes': 47, u'instructions': u'Procedures                                                                              1                                                                            Heat oil in a large saucepan over medium-high heat until shimmering. Add onion and cook, stirring frequently, until softened, about 4 minutes. Add cumin and chili powder and cook, stirring constantly, until fragrant, about 1 minute. Add tomatoes, capers, olives, and cilantro. Season to taste with salt and pepper. Remove from heat and set aside.                                                                                                                            2                                                                            Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the highest heat setting, cover, and preheat for 10 minutes. Clean and oil the grilling grate.                                                                                                                            3                                                                            Transfer tomato mixture to 10-inch square disposable aluminum pan. Alternatively, construct a tray out of a double layer of heavy duty aluminum foil, 10 inches square, with sides about 2 inches high. Nestle sausages into mixture.                                                                                                                            4                                                                            Place tray on hot side of grill and cook until simmering, about 4 minutes. Slide to cooler side of grill. Cover grill with vents over the sausages. Cook with all vents open until sausages register 140\xb0 to 145\xb0F on an instant read thermometer, about 20 minutes, turning once in the middle.                                                                                                                            5                                                                            Remove lid. Using tongs, remove sausages from sauce and place directly on cooking grates over hot side of grill. Cook, turning occasionally, until well browned and crisp, about 3 minutes total. Return to sauce. Serve immediately, garnishing with extra cilantro, lime wedges, and tortillas is desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-mexican-chorizo-with-spicy-tomato-caper-sauce-196539', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}