{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/615860-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 615860, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy Sausage and Pumpkin Mac & Cheese', u'diets': [], u'pricePerServing': 222.87, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'8 oz cheddar cheese, grated (use Gruyere or Fontina too)', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'grated', u'(use Gruyere or Fontina too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1009, u'unit': u'oz'}, {u'originalString': u'3 Tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp finely chopped fresh sage (the dried will not do!)', u'aisle': u'Produce', u'name': u'fresh sage', u'metaInformation': [u'dried', u'fresh', u'finely chopped', u'(the will not do!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2038, u'unit': u'Tbsp'}, {u'originalString': u'2 heaping cups dry cellentani pasta (or elbows,)', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'dry', u'(or elbows,)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20420, u'unit': u'cups'}, {u'originalString': u'1 cup pumpkin puree (not pie filling)', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [u'(not pie filling)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'salt and fresh cracked black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'fresh', u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 lb spicy Italian sausage (either in bulk or in casings)', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'italian', u'(either in bulk or in casings)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1017063, u'unit': u'lb'}, {u'originalString': u'3 Tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}, {u'originalString': u'2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2014/10/spicy-sausage-pumpkin-mac-cheese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"set the oven to 350FCook the pasta in lots of well salted water until just shy of al dente.  The pasta will continue to cook in the oven, so you don';t want it too soft.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain and set aside.Brown the sausage in a pan over medium heat until all the pink is gone.  If your sausage is in links, remove it from the casing first. Break up the meat as you cook it so that it forms small crumbles.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain off any excess fat and set aside.Melt the butter in a large saucepan and whisk in the flour,  Stir to combine and cook for a minute, but do not brown.  Slowly add the milk to the pan while stirring, making sure to get all the flour off the bottom and edges of the pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Heat the milk until it thickens, stirring constantly.  Do not let the milk boil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat and stir in the pumpkin and the cheese, stirring until the cheese is completely melted.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the sausage and the cooked pasta to the pan, along with the sage, and blend well.  Taste and add salt and pepper.  Turn the pasta into individual baking dishes or one casserole.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [], u'step': u'Bake for about 20 minutes until hot and bubbly.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot with fresh sage as a garnish.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'fresh sage'}]}], u'name': u''}], u'aggregateLikes': 44, u'instructions': u"set the oven to 350FCook the pasta in lots of well salted water until just shy of al dente.  The pasta will continue to cook in the oven, so you don';t want it too soft.  Drain and set aside.Brown the sausage in a pan over medium heat until all the pink is gone.  If your sausage is in links, remove it from the casing first. Break up the meat as you cook it so that it forms small crumbles.  Drain off any excess fat and set aside.Melt the butter in a large saucepan and whisk in the flour,  Stir to combine and cook for a minute, but do not brown.  Slowly add the milk to the pan while stirring, making sure to get all the flour off the bottom and edges of the pan.  Heat the milk until it thickens, stirring constantly.  Do not let the milk boil.   Remove the pan from the heat and stir in the pumpkin and the cheese, stirring until the cheese is completely melted.Add the sausage and the cooked pasta to the pan, along with the sage, and blend well.  Taste and add salt and pepper.  Turn the pasta into individual baking dishes or one casserole.  Bake for about 20 minutes until hot and bubbly.Serve hot with fresh sage as a garnish.", u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-sausage-and-pumpkin-mac-cheese-615860', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}