{u'recipes': [{u'sourceName': u'Jans Sushi Bar', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/476840-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 476840, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet and Savory Frittata', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'whole 30'], u'pricePerServing': 81.79, u'creditText': u'Jans Sushi Bar', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 large carrot, peeled and shredded', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'shredded', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 tablespoons ghee or clarified butter, divided', u'aisle': u'Ethnic Foods', u'name': u'clarified butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoons'}, {u'originalString': u'6 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 small onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 teaspoon red pepper flakes, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 cup peach salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'1 teaspoon kosher sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 large Japanese sweet potato, peeled and shredded', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'shredded', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'1 large zucchini, shredded', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'shredded', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.janssushibar.com/sweet-savory-frittata/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 F. Beat the eggs in a large mixing bowl with the salt, pepper, red pepper flakes and thyme and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the ghee in a heavy, 10" oven-proof skillet over medium heat. Cook the onion until soft and beginning to turn translucent, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}]}, {u'equipment': [], u'step': u'Add the minced garlic and cook for another minute more before adding the shredded sweet potato and carrot. Continue to cook, stirring frequently, for about 5 minutes or until the vegetables are tender-crisp, then stir in the zucchini and remove from the heat.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour the beaten eggs evenly over the vegetable mixture and bake for 30 minutes or until a knife inserted in the center comes out clean. Allow to rest for 5 minutes before cutting into wedges and serving with the salsa.Nutrition (per serving): 156 calories, 8.9g total fat, 196.2mg cholesterol, 669mg sodium, 474.1mg potassium, 11.7g carbohydrates, 2.5g fiber, 4.8g sugar, 8.3g protein', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 28, u'instructions': u'Preheat oven to 350 F. Beat the eggs in a large mixing bowl with the salt, pepper, red pepper flakes and thyme and set aside.Heat the ghee in a heavy, 10" oven-proof skillet over medium heat. Cook the onion until soft and beginning to turn translucent, about 5 minutes. Add the minced garlic and cook for another minute more before adding the shredded sweet potato and carrot. Continue to cook, stirring frequently, for about 5 minutes or until the vegetables are tender-crisp, then stir in the zucchini and remove from the heat.Pour the beaten eggs evenly over the vegetable mixture and bake for 30 minutes or until a knife inserted in the center comes out clean. Allow to rest for 5 minutes before cutting into wedges and serving with the salsa.Nutrition (per serving): 156 calories, 8.9g total fat, 196.2mg cholesterol, 669mg sodium, 474.1mg potassium, 11.7g carbohydrates, 2.5g fiber, 4.8g sugar, 8.3g protein', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-and-savory-frittata-476840', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': True}]}