{u'recipes': [{u'sourceName': u'In Sock Monkey Slippers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/612912-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 612912, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beans on Toast', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 226.5, u'creditText': u'In Sock Monkey Slippers', u'extendedIngredients': [{u'originalString': u'1 1/2 cups (1 15-ounce can/jar) diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'(1 15-ounce can/jar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'cups'}, {u'originalString': u'3 cups (2 15-ounce cans/jars) cooked cannellini beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'cannellini beans', u'metaInformation': [u'cooked', u'(2 15-ounce cans/jars)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 10716050, u'unit': u'cups'}, {u'originalString': u'1/4 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1/2 tablespoon fresh rosemary, chopped', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'1 clove garlic, peeled, and minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'2 mild Italian sausage links (5 to 6 ounces), casings removed', u'aisle': u'Frozen', u'name': u'veggie sausage links', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 98971, u'unit': u'ounces'}, {u'originalString': u'Thick sliced whole wheat bread*', u'aisle': u'Bakery/Bread', u'name': u'whole wheat bread', u'metaInformation': [u'whole wheat', u'thick', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18075, u'unit': u'servings'}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.insockmonkeyslippers.com/beans-on-toast', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a saut pan over medium-high heat, heat oil and brown sausage until cooked through.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add garlic and saut for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add beans, tomatoes, rosemary, and wine, reduce heat to medium-low. Simmer until the wine has reduced and the mixture has thickened, about 8 minutes. Season with salt and pepper.Toast bread, one slice per serving, until golden.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve toast topped with beans and shaved or grated parmesan.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 24, u'instructions': u'In a saut pan over medium-high heat, heat oil and brown sausage until cooked through. Add garlic and saut for 1 minute. Add beans, tomatoes, rosemary, and wine, reduce heat to medium-low. Simmer until the wine has reduced and the mixture has thickened, about 8 minutes. Season with salt and pepper.Toast bread, one slice per serving, until golden.Serve toast topped with beans and shaved or grated parmesan.', u'spoonacularSourceUrl': u'https://spoonacular.com/beans-on-toast-612912', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}