{u'recipes': [{u'sourceName': u'Whats Cooking Love', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/668212-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 668212, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salted Caramel Pina Colada Bread Pudding', u'diets': [], u'pricePerServing': 73.82, u'creditText': u'Whats Cooking Love', u'extendedIngredients': [{u'originalString': u'1/2 cup caramel ice cream sauce', u'aisle': u'Frozen;Condiments', u'name': u'chocolate ice cream sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19348, u'unit': u'cup'}, {u'originalString': u'2 cups coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cups'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 loaf Hawaiian Bread, cubed, about 6 cups cubed bread', u'aisle': u'Bakery/Bread', u'name': u'Hawaiian bread', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 98947, u'unit': u'loaf'}, {u'originalString': u'1 can (8 ounces) crushed pineapples', u'aisle': u'Produce', u'name': u'pineapples', u'metaInformation': [u'crushed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 9266, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'png', u'spoonacularScore': 36.0, u'sourceUrl': u'http://whatscookinglove.com/2014/06/salted-caramel-pina-colada-bread-pudding/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees.In a medium sized bowl whisk together the coconut milk, eggs, sugar, and vanilla until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add in the crushed pineapples (including the juice).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the bread crumbs in a large bowl and pour the coconut milk and pineapple mixture on top of the bread. Fold the ingredients together making sure to moisten all of the bread. Allow the bread mixture to stand for 10 minutes. Meanwhile, mix the caramel ice cream sauce and sea salt together until combined.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour half of the bread mixture into a greased 8x8 baking dish. Press the bread to form an even layer.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Spread half of the salted caramel sauce on top of the bread layer. Then pour the other half of the bread mixture on top of the salted caramel sauce and press into an even layer.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the remaining salted caramel sauce on top.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 45-50 minutes or until the bread pudding is set.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Let the pudding cool for at least 20 minutes before serving. If it will not be served right away, refrigerate until ready to serve. It can then be served cold or heated up. If desired, serve with additional salted caramel sauce on top.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 15726, u'instructions': u'<p>Preheat the oven to 350 degrees.</p><p>In a medium sized bowl whisk together the coconut milk, eggs, sugar, and vanilla until combined. Add in the crushed pineapples (including the juice). </p><p>Place the bread crumbs in a large bowl and pour the coconut milk and pineapple mixture on top of the bread. Fold the ingredients together making sure to moisten all of the bread. Allow the bread mixture to stand for 10 minutes. </p><p>Meanwhile, mix the caramel ice cream sauce and sea salt together until combined. </p><p>Pour half of the bread mixture into a greased 8x8 baking dish. Press the bread to form an even layer. Spread half of the salted caramel sauce on top of the bread layer. Then pour the other half of the bread mixture on top of the salted caramel sauce and press into an even layer. Spread the remaining salted caramel sauce on top.</p><p>Bake for 45-50 minutes or until the bread pudding is set. Let the pudding cool for at least 20 minutes before serving. If it will not be served right away, refrigerate until ready to serve. It can then be served cold or heated up. If desired, serve with additional salted caramel sauce on top.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/salted-caramel-pina-colada-bread-pudding-668212', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}