{u'recipes': [{u'sourceName': u'Ambitious Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/842006-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 842006, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lightened Up Chicken Pot Pie + video', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 185.28, u'creditText': u'Ambitious Kitchen', u'extendedIngredients': [{u'originalString': u'1 cup unsweetened Almond Breeze AlmondMilk (must use Almond Breeze)', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [u'unsweetened', u'(must use Almond Breeze)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 teaspoons vegan butter; divided (or regular butter)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided', u'(or regular butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoons'}, {u'originalString': u'3 large carrots, sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1-2 tablespoons fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoons'}, {u'originalString': u'2 cups diced gold potatoes (about 3/4 pound)', u'aisle': u'Produce', u'name': u'gold potatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 10211362, u'unit': u'pound'}, {u'originalString': u'3-5 tablespoons ice water', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup low sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'1 1/4 cup low sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'1 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon salt, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound boneless skinless chicken breasts, cut into cubes', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'1/3 cup COLD vegan buttery stick (or regular unsalted butter if you are not dairy free)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'vegan buttery stick', u'metaInformation': [u'unsalted', u'cold', u'(or regular butter if you are not dairy free)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 4628, u'unit': u'cup'}, {u'originalString': u'1/2 white onion, chopped', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}, {u'originalString': u'1/3 cup whole wheat pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 10020080, u'unit': u'cup'}, {u'originalString': u'1 cup whole wheat pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'cup'}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.ambitiouskitchen.com/2017/01/healthy-chicken-pot-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [], u'name': u'For the dough'}, {u'steps': [{u'equipment': [], u'step': u'Add the flour and salt with the regular blade attached, then add the diced cold butter. Pulse just a few times to lightly mix the ingredients until there are pea-sized balls.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the water and process again until the dough is crumbly. Do not let it turn into a big dough ball or you will have overmixed the dough.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour into a floured surface and gather into a disk, wrap in plastic and place in fridge until you are ready to roll out.In a large pot, add 1 teaspoon butter and chicken. Cook chicken until no longer pink, about 5 minutes, then transfer to a bowl and set aside.Next add almond milk and chicken broth to pot and bring to a boil.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add in potatoes and carrots and boil for 3-4 minutes. (This helps to release the potato starch!).', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Drain the mixture over a bowl, reserving the cooking liquid (very important). Set aside the carrots and potatoes for later.Next melt 1 teaspoon butter in the same pot you've been using.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add in onions and cook for 3-4 minutes until translucent. Vigorously whisk in 1/3 cup flour and 1/2 cup chicken broth at the same time until smooth and no lumps remain. Stir in reserved cooking liquid, potatoes, carrots, chicken, frozen peas, thyme, salt and pepper. Simmer over medium low heat for 10-15 minutes or until mixture thickens. Taste and adjust seasonings as necessary.', u'length': {u'number': 19, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove from heat.Preheat oven to 375 degrees F.Coat a deep skillet or large deep dish pie pan with nonstick cooking spray (you can also use a 2 quart sized skillet).', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add pot pie mixture.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u"Roll out the pie dough out on a very well floured surface so that it's large enough to cover the pie pan.", u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Place on top of mixture, pressing the edges and sealing.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Cut a few slits in top of crust or poke holes with a fork to let steam escape. Spray the top of the crust with a little nonstick cooking spray.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375 degrees F for 45-55 minutes or until crust is golden and filling is bubbly. Top crust with sea salt and extra fresh thyme. Enjoy!', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}], u'name': u'Place flour and salt in a bowl and whisk together. Dice butter and place into flour mixture. (It is important for the butter to be COLD so sometimes I dice it up then place in a bowl and stick in the freezer for a few minutes.) Use a pastry knife and cut butter into flour until it is edamame or pea sized.Using a large fork, add 3 tablespoons of the ice water to the mixture and combine. Continue adding water until dough just comes together. You may not need to add all the water; you want the dough to be smooth but neither wet nor dry. I find 4-5 tablespoons to be good.If you want to make the dough in the food processor, here is how'}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is District 7 Estate Chardonnay. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 103, u'instructions': u"For the dough: Place flour and salt in a bowl and whisk together. Dice butter and place into flour mixture. (It is important for the butter to be COLD so sometimes I dice it up then place in a bowl and stick in the freezer for a few minutes.) Use a pastry knife and cut butter into flour until it is edamame or pea sized.Using a large fork, add 3 tablespoons of the ice water to the mixture and combine. Continue adding water until dough just comes together. You may not need to add all the water; you want the dough to be smooth but neither wet nor dry. I find 4-5 tablespoons to be good.If you want to make the dough in the food processor, here is how: Add the flour and salt with the regular blade attached, then add the diced cold butter. Pulse just a few times to lightly mix the ingredients until there are pea-sized balls. Add the water and process again until the dough is crumbly. Do not let it turn into a big dough ball or you will have overmixed the dough. Pour into a floured surface and gather into a disk, wrap in plastic and place in fridge until you are ready to roll out.In a large pot, add 1 teaspoon butter and chicken. Cook chicken until no longer pink, about 5 minutes, then transfer to a bowl and set aside.Next add almond milk and chicken broth to pot and bring to a boil. Add in potatoes and carrots and boil for 3-4 minutes. (This helps to release the potato starch!). Drain the mixture over a bowl, reserving the cooking liquid (very important). Set aside the carrots and potatoes for later.Next melt 1 teaspoon butter in the same pot you've been using. Add in onions and cook for 3-4 minutes until translucent. Vigorously whisk in 1/3 cup flour and 1/2 cup chicken broth at the same time until smooth and no lumps remain. Stir in reserved cooking liquid, potatoes, carrots, chicken, frozen peas, thyme, salt and pepper. Simmer over medium low heat for 10-15 minutes or until mixture thickens. Taste and adjust seasonings as necessary. Remove from heat.Preheat oven to 375 degrees F.Coat a deep skillet or large deep dish pie pan with nonstick cooking spray (you can also use a 2 quart sized skillet). Add pot pie mixture.Roll out the pie dough out on a very well floured surface so that it's large enough to cover the pie pan. Place on top of mixture, pressing the edges and sealing. Cut a few slits in top of crust or poke holes with a fork to let steam escape. Spray the top of the crust with a little nonstick cooking spray.Bake at 375 degrees F for 45-55 minutes or until crust is golden and filling is bubbly. Top crust with sea salt and extra fresh thyme. Enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/lightened-up-chicken-pot-pie-+-video-842006', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}