{u'recipes': [{u'sourceName': u'Mother Rimmy', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/603245-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 603245, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pasta Primavera with Zucchini, Mushrooms and Chard', u'diets': [], u'pricePerServing': 213.0, u'creditText': u'Mother Rimmy', u'extendedIngredients': [{u'originalString': u'2 clove garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'clove', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'2 cups mushrooms, quartered', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 cup onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'8 tablespoons Parmesan cheese, shredded', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'2 cups red chard, chopped', u'aisle': u'Produce', u'name': u'red chard', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11147, u'unit': u'cups'}, {u'originalString': u'2 tablespoons Italian seasoning blend', u'aisle': u'Spices and Seasonings', u'name': u'seasoning blend', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'tablespoons'}, {u'originalString': u'29 ounces low sodium tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 29.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'\xbd cup low sodium vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}, {u'originalString': u'6 ounces penne pasta, cooked according to package directions and drained (reserve 1 cup pasta water) I use quinoa, but whole wheat works well too.', u'aisle': u'Pasta and Rice', u'name': u'whole wheat penne pasta', u'metaInformation': [u'whole wheat', u'cooked', u'drained', u'well', u'(reserve 1 cup pasta water)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-penne.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 99182, u'unit': u'ounces'}, {u'originalString': u'1 medium yellow squash, cubed', u'aisle': u'Produce', u'name': u'yellow squash', u'metaInformation': [u'yellow', u'medium', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11641, u'unit': u''}, {u'originalString': u'1 medium zucchini, cubed', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'medium', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 55.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://motherrimmy.com/recipe-pasta-primavera/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook pasta according to package directions, reserve 1 cup pasta water.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large non-stick pan over medium high heat with olive oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onions and cook for 5 minutes until softened.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add vegetable broth as needed to keep from burning.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}]}, {u'equipment': [], u'step': u'Add remaining vegetable broth with garlic, squashes and mushrooms. Cook another 5 minutes to soften vegetables.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add Italian seasoning and tomato sauce. Reduce heat to medium and simmer for 15 minutes until vegetables are just tender.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}]}, {u'equipment': [], u'step': u'Add chard and cook another 5 minutes to wilt the chard.Toss with penne pasta. If pasta seems to dry, add a bit of pasta broth to moisten.Top with Parmesan cheese.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Pasta Primavera. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Carpineta Fontalpino Chianti Classico with a 4.6 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'The color is typical of the purity of the Sangiovese, a deep red with traces of violet. An interesting nose of plum, cherry, currant, rose, violet, cinnamon and cocoa. On the palate, this wine is elegant and persistent, with a tannic structure and high acidity. It is well-balanced with aromas of flowers and spices evolving on a long and round finish.', u'title': u'Carpineta Fontalpino Chianti Classico', u'price': u'$19.99', u'id': 446740, u'link': u'https://www.wine.com/product/carpineta-fontalpino-chianti-classico-2009/116281', u'imageUrl': u'https://spoonacular.com/productImages/446740-312x231.jpg'}]}, u'aggregateLikes': 91, u'instructions': u'Cook pasta according to package directions, reserve 1 cup pasta water.Heat a large non-stick pan over medium high heat with olive oil. Add onions and cook for 5 minutes until softened. Add vegetable broth as needed to keep from burning.Add remaining vegetable broth with garlic, squashes and mushrooms. Cook another 5 minutes to soften vegetables.Add Italian seasoning and tomato sauce. Reduce heat to medium and simmer for 15 minutes until vegetables are just tender. Add chard and cook another 5 minutes to wilt the chard.Toss with penne pasta. If pasta seems to dry, add a bit of pasta broth to moisten.Top with Parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-primavera-with-zucchini-mushrooms-and-chard-603245', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}