{u'recipes': [{u'sourceName': u'Well Plated', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626115-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 626115, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Caesar Sandwich with Bacon', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 213.63, u'creditText': u'Well Plated', u'extendedIngredients': [{u'originalString': u'4 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'Black pepper, for sprinkling', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 split (1 whole) bone-in, skin-on chicken breasts', u'aisle': u'Meat', u'name': u'bone in skin on chicken breasts', u'metaInformation': [u'whole', u'split', u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1005057, u'unit': u''}, {u'originalString': u'1/2 cup prepared Healthy Homemade Caesar Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'caesar dressing', u'metaInformation': [u'homemade', u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 43015, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon ground black pepper, plus additional for seasoning', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black', u'for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 long loaf multigrain bread (roughly 12 inches long and 4 inches wide)', u'aisle': u'Bakery/Bread', u'name': u'multigrain bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18075, u'unit': u''}, {u'originalString': u'1 to 2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 ounces freshly shaved or granted Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'ounces'}, {u'originalString': u'1/2 cup fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}, {u'originalString': u'12 sun-dried tomatoes, in olive oil', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun-dried tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11955, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.wellplated.com/chicken-caesar-sandwich/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place rack in the center of the oven and preheat the oven to 350 degrees F. Line a large baking sheet with aluminum foil, then place the chicken breasts on the pan, skin side up.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle liberally with olive oil, then sprinkle with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 165.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place in the oven and roast for 35 to 40 minutes, until fully cooked and the center registers 165 degrees F.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove to a plate until cool enough to handle.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove the skin and cut into thick slices. Set aside.Increase the oven temperature to 400 degrees F, then set an oven-proof wire rack on the same baking sheet you used for the chicken (no need to wash it). Lightly coat the wire rack with cooking spray, then arrange the bacon in a single layer on top of the rack.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Bake at 400 degrees for 10 to 12 minutes, until crisp.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove to a plate lined with paper towels and pat dry.While the oven is still hot, slice the bread in half horizontally, and place it, cut sides up, on a clean baking sheet or directly on the rack.', u'number': 7, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Spread the cut sides of both slices of bread liberally with the Caesar dressing. Arrange half of the spinach on the bottom slices of bread, then layer as follows: sun-dried tomatoes, shaved Parmesan, cooked bacon, and sliced chicken. Sprinkle with a little extra black pepper and then top with the remaining spinach. Lay the second slice of toasted bread on top. Slice and serve at room temperature.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'id': 11955, u'name': u'sun dried tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'id': 43015, u'name': u'caesar salad dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u'Place in the oven until lightly toasted, about 5 to 7 minutes.Assemble the sandwiches'}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Raymond Reserve Selection Chardonnay. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish. View More', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 107, u'instructions': u'Place rack in the center of the oven and preheat the oven to 350 degrees F. Line a large baking sheet with aluminum foil, then place the chicken breasts on the pan, skin side up. Drizzle liberally with olive oil, then sprinkle with salt and pepper. Place in the oven and roast for 35 to 40 minutes, until fully cooked and the center registers 165 degrees F. Remove to a plate until cool enough to handle. Remove the skin and cut into thick slices. Set aside.Increase the oven temperature to 400 degrees F, then set an oven-proof wire rack on the same baking sheet you used for the chicken (no need to wash it). Lightly coat the wire rack with cooking spray, then arrange the bacon in a single layer on top of the rack. Bake at 400 degrees for 10 to 12 minutes, until crisp. Remove to a plate lined with paper towels and pat dry.While the oven is still hot, slice the bread in half horizontally, and place it, cut sides up, on a clean baking sheet or directly on the rack. Place in the oven until lightly toasted, about 5 to 7 minutes.Assemble the sandwiches: Spread the cut sides of both slices of bread liberally with the Caesar dressing. Arrange half of the spinach on the bottom slices of bread, then layer as follows: sun-dried tomatoes, shaved Parmesan, cooked bacon, and sliced chicken. Sprinkle with a little extra black pepper and then top with the remaining spinach. Lay the second slice of toasted bread on top. Slice and serve at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-caesar-sandwich-with-bacon-626115', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}