{u'recipes': [{u'sourceName': u'I Wash You Dry', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/802991-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 802991, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesy Taco Bombs Skillet', u'diets': [], u'pricePerServing': 43.99, u'creditText': u'I Wash You Dry', u'extendedIngredients': [{u'originalString': u'2 (7.5oz) tubes Pillsbury Biscuits', u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 18009, u'unit': u'oz'}, {u'originalString': u'2 tbsp melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'5 cheddar cheese sticks, cut into 1 inch pieces (20 total)', u'aisle': u'Cheese', u'name': u'cheese sticks', u'metaInformation': [u'cut into 1 inch pieces (20 total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/string-cheese.png', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 98970, u'unit': u''}, {u'originalString': u'1 tsp dried cilantro', u'aisle': u'Spices and Seasonings', u'name': u'dried cilantro', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 1/2 cups leftover taco meat (cooled)*', u'name': u'meat', u'metaInformation': [u'leftover', u'cooled', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1065062, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.iwashyoudry.com/2016/09/19/cheesy-taco-bombs-skillet/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425 degrees F. Lightly grease a 10" skillet and set aside.Press each biscuit flat, and top with a small portion of the taco meat and piece of cheese. Fold the biscuit over and pinch the seams, creating a small ball.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the ball seam side down in the skillet. Repeat with the remaining balls, leaving a little space between each ball.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the melted butter, garlic powder and cilantro in a small dish then brush the tops of the balls with the butter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake for 10 to 12 minutes, or until tops are golden brown. Sprinkle with extra cilantro if desired and serve with your favorite taco toppings. Enjoy!', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Tacos. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The J Vineyards & Winery Pinot Noir with a 5 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'At J, we are devoted to the concept of terroir in the Russian River Valley, and our 2013 J Vineyards Pinot Noir is a reflection of this vintage, the vineyards and our attention to detail in the winery. Delivering bright berry flavors-red cherry, raspberry and blackberry- this elegant Pinot is enhanced by notes of licorice and red tea, which linger on the finish. Aromas of wild strawberries and spices delight the nose.', u'title': u'J Vineyards & Winery Pinot Noir', u'price': u'$47.99', u'id': 428384, u'link': u'https://www.amazon.com/Vineyards-Winery-Russian-River-Valley/dp/B01A6A3A1O', u'imageUrl': u'https://spoonacular.com/productImages/428384-312x231.jpg'}]}, u'aggregateLikes': 223, u'instructions': u'Preheat oven to 425 degrees F. Lightly grease a 10" skillet and set aside.Press each biscuit flat, and top with a small portion of the taco meat and piece of cheese. Fold the biscuit over and pinch the seams, creating a small ball. Place the ball seam side down in the skillet. Repeat with the remaining balls, leaving a little space between each ball.Combine the melted butter, garlic powder and cilantro in a small dish then brush the tops of the balls with the butter. Bake for 10 to 12 minutes, or until tops are golden brown. Sprinkle with extra cilantro if desired and serve with your favorite taco toppings. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-taco-bombs-skillet-802991', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}