{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/382363-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 382363, u'veryPopular': True, u'lowFodmap': False, u'title': u'Candy Bar Pie', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 113.59, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'4 Butterfinger candy bars (2.1 ounces each)', u'aisle': u'Sweet Snacks', u'name': u'butterfinger candy bar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butterfinger.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.4, u'consistency': u'liquid', u'id': 19069, u'unit': u'ounces'}, {u'originalString': u'1 package (8 ounces) cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 graham cracker crust (9 inches)', u'aisle': u'Baking', u'name': u'graham cracker crust', u'metaInformation': [u'(9 inches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust-graham-cracker.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18942, u'unit': u''}, {u'originalString': u'1 carton (8 ounces) frozen whipped topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/candy-bar-pie-3', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, beat the cream cheese until smooth. Fold in whipped topping. Crush the candy bars; fold 1 cup into cream cheese mixture. Spoon into crust. Sprinkle with remaining candy bar crumbs. Refrigerate for 2-4 hours before slicing.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Red Apple, Honeyed, Sweet', u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 758, u'instructions': u'Directions                                                                                In a small bowl, beat the cream cheese until smooth. Fold in whipped topping. Crush the candy bars; fold 1 cup into cream cheese mixture. Spoon into crust. Sprinkle with remaining candy bar crumbs. Refrigerate for 2-4 hours before slicing.                                        Yield: 6-8 servings.                                                                                                                         Originally published as Candy Bar Pie in  Quick CookingNovember/December 2002, p40                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 slice) equals 318 calories, 21 g fat (13 g saturated fat), 31 mg cholesterol, 220 mg sodium, 26 g carbohydrate, trace fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/candy-bar-pie-382363', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}