{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/742828-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 742828, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fried Avocado Bites', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 142.84, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 tablespoon Asian fish sauce', u'aisle': u'Ethnic Foods', u'name': u'asian fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoon'}, {u'originalString': u'3 8-ounce avocados, halved and pitted', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'pitted', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 9037, u'unit': u'ounce'}, {u'originalString': u'Vegetable or canola oil, for frying (about 8 cups)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon Asian chili garlic paste', u'aisle': u'Ethnic Foods', u'name': u'chili paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 6973, u'unit': u'teaspoon'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 cup loosely packed fresh cilantro leaves, for garnish', u'aisle': u'Produce', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh', u'loosely packed', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'Fine salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 cup seltzer', u'aisle': u'Beverages', u'name': u'seltzer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'cup'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}], u'healthScore': 6.0, u'imageType': u'jpeg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/fried-avocado-bites.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Special equipment: a deep-fry thermometer', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Line a small rimmed baking sheet with parchment. Score the flesh of each avocado half to the skin with 2 lengthwise and 3 crosswise cuts, to make 12 chunks per half. Ease the chunks out of the skins with a large spoon, and spread them in an even layer on the prepared baking sheet. Sprinkle with 1/2 teaspoon salt, and freeze for 1 hour.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the lime juice, sugar, fish sauce and chili garlic paste in a small bowl until the sugar is dissolved; set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Fill a large, heavy-bottomed pot or a Dutch oven with about 1 1/2 inches of oil. Attach a deep-fry thermometer, and bring to 360 degrees F over medium heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the seltzer, flour, egg and 1/4 teaspoon salt in a medium bowl until smooth. Submerge half the avocado chunks in the batter. Scoop them out with a slotted spoon, letting excess batter drip back into the bowl, and add them to the hot oil, being careful not to splash. Fry the avocado chunks, turning frequently, until deeply golden brown, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer them to a paper towel-lined plate, and sprinkle right away with some salt. Bring the oil temperature back up to 360 degrees F. Repeat with the remaining avocado chunks.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Transfer all the chunks to a serving plate, and garnish with cilantro leaves.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}]}, {u'equipment': [], u'step': u'Serve immediately with the dipping sauce.', u'number': 6, u'ingredients': []}], u'name': u'Meanwhile, make the dipping sauce'}], u'aggregateLikes': 2262, u'instructions': u'Special equipment: a deep-fry thermometer                          Line a small rimmed baking sheet with parchment. Score the flesh of each avocado half to the skin with 2 lengthwise and 3 crosswise cuts, to make 12 chunks per half. Ease the chunks out of the skins with a large spoon, and spread them in an even layer on the prepared baking sheet. Sprinkle with 1/2 teaspoon salt, and freeze for 1 hour.                          Meanwhile, make the dipping sauce: Whisk together the lime juice, sugar, fish sauce and chili garlic paste in a small bowl until the sugar is dissolved; set aside.                          Fill a large, heavy-bottomed pot or a Dutch oven with about 1 1/2 inches of oil. Attach a deep-fry thermometer, and bring to 360 degrees F over medium heat.                          Whisk together the seltzer, flour, egg and 1/4 teaspoon salt in a medium bowl until smooth. Submerge half the avocado chunks in the batter. Scoop them out with a slotted spoon, letting excess batter drip back into the bowl, and add them to the hot oil, being careful not to splash. Fry the avocado chunks, turning frequently, until deeply golden brown, about 4 minutes. Transfer them to a paper towel-lined plate, and sprinkle right away with some salt. Bring the oil temperature back up to 360 degrees F. Repeat with the remaining avocado chunks. Transfer all the chunks to a serving plate, and garnish with cilantro leaves. Serve immediately with the dipping sauce.                          Copyright 2015 Television Food Network, G.P. All rights reserved.', u'spoonacularSourceUrl': u'https://spoonacular.com/fried-avocado-bites-742828', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}