{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474173-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 474173, u'veryPopular': False, u'lowFodmap': False, u'title': u'Satay Sliders {Saturdays with Rachael Ray}', u'diets': [u'dairy free'], u'preparationMinutes': 12, u'pricePerServing': 203.79, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'sliced chile peppers, such as fresnos', u'aisle': u'Produce', u'name': u'chile peppers', u'metaInformation': [u' such as fresnos', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11819, u'unit': u'servings'}, {u'originalString': u'1 tablespoon Asian chili sauce, or 1/2 teaspoon sriracha', u'aisle': u'Ethnic Foods', u'name': u'chili sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6972, u'unit': u'tablespoon'}, {u'originalString': u'mint or cilantro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'leaves'}, {u'originalString': u'1 piece (1 1/2 inches) fresh ginger, grated or finely chopped', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated', u'finely chopped', u'(1 1/2 inches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'2 cloves garlic, grated or finely chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 pounds ground chicken or turkey', u'aisle': u'Meat', u'name': u'ground chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 5332, u'unit': u'pounds'}, {u'originalString': u'shredded cabbage or iceberg lettuce', u'aisle': u'Produce', u'name': u'iceberg lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'1/2 cup chunky peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'1/4 cup apple juice, apple cider or pineapple juice', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9273, u'unit': u'cup'}, {u'originalString': u'thinly sliced radishes', u'aisle': u'Produce', u'name': u'radishes', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radishes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11429, u'unit': u'servings'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 scallions, finely chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'8 slider sized soft rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'3 teaspoons tamari', u'aisle': u'Ethnic Foods', u'name': u'tamari', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 10116124, u'unit': u'teaspoons'}, {u'originalString': u'vegetable oil, for coating', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for coating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.tasteandtellblog.com/saturdays-with-rachael-ray-satay-sliders/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat an outdoor grill or a grill pan to medium-high.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Mix the meat with the green onion, garlic and ginger. Season with salt and pepper. Divide the meat and portion into 8 patties. Coat each with a small amount of vegetable oil. Grill, turning once, until cooked through – 6 to 8 minutes.In the meantime, heat the peanut butter in the microwave to soften, or in a small pot over medium heat. Stir in the juice, tamari and Asian garlic sauce or sriacha.When the burgers are cooked through, serve them on the buns with a generous amount of satay sauce and your desired toppings.----------------------Recipe adapted from Every Day with Rachael Ray August 2011', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 10116124, u'name': u'tamari'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Korbel Organic Brut. It has 4.3 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'#73 Wine Spectator Top 100 of 2016Korbel Brut – Made with Organically Grown Grapes is created in the classic Korbel style, crisp, delicate and bright. We always strive to present the pure flavors of the grape in all of our champagnes. The organically grown grapes in this cuvee deliver well-integrated aromas and flavors of apple, pear and white peaches. The finish is medium dry, with a slight savory note at the end.', u'title': u'Korbel Organic Brut', u'price': u'$12.98', u'id': 443895, u'link': u'https://www.wine.com/product/korbel-organic-brut/105310', u'imageUrl': u'https://spoonacular.com/productImages/443895-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'Preheat an outdoor grill or a grill pan to medium-high.Mix the meat with the green onion, garlic and ginger. Season with salt and pepper. Divide the meat and portion into 8 patties. Coat each with a small amount of vegetable oil. Grill, turning once, until cooked through – 6 to 8 minutes.In the meantime, heat the peanut butter in the microwave to soften, or in a small pot over medium heat. Stir in the juice, tamari and Asian garlic sauce or sriacha.When the burgers are cooked through, serve them on the buns with a generous amount of satay sauce and your desired toppings.----------------------Recipe adapted from Every Day with Rachael Ray August 2011', u'spoonacularSourceUrl': u'https://spoonacular.com/satay-sliders-saturdays-with-rachael-ray-474173', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}