{u'recipes': [{u'sourceName': u'Oh My Veggies', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/495386-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 495386, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pi\xf1a Colada Breakfast Shake', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 278.76, u'creditText': u'Oh My Veggies', u'extendedIngredients': [{u'originalString': u'1 c. coconut water', u'aisle': u'Beverages', u'name': u'coconut water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12119, u'unit': u'c'}, {u'originalString': u'1/3 c. old-fashioned oats', u'aisle': u'Cereal', u'name': u'old-fashioned oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 8120, u'unit': u'c'}, {u'originalString': u'3/4 c. frozen pineapple chunks', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1029354, u'unit': u'c'}, {u'originalString': u'1/4 c. unsweetened dried coconut flakes', u'aisle': u'Baking', u'name': u'unsweetened coconut flakes', u'metaInformation': [u'dried', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12108, u'unit': u'c'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://ohmyveggies.com/recipe-pina-colada-breakfast-shake/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Combine the oats, coconut water, and coconut flakes in a small container with a lid. Stir together, cover, and refrigerate overnight (or at least 2 hours if you're not having this for breakfast--this step helps soften up the oats).", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'id': 12108, u'name': u'coconut flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'id': 12119, u'name': u'coconut water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the oat mixture and the frozen pineapple chunks to your blender. (A high speed one like the Vitamix works best! Please do not blame me if your blender does not blend!) Puree until completely smooth and add sweetener to taste if you need it (since the pineapple is so sweet, I skip adding any extra sweetener).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1029354, u'name': u'pineapple chunks'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 1162, u'instructions': u"Combine the oats, coconut water, and coconut flakes in a small container with a lid. Stir together, cover, and refrigerate overnight (or at least 2 hours if you're not having this for breakfast--this step helps soften up the oats). Add the oat mixture and the frozen pineapple chunks to your blender. (A high speed one like the Vitamix works best! Please do not blame me if your blender does not blend!) Puree until completely smooth and add sweetener to taste if you need it (since the pineapple is so sweet, I skip adding any extra sweetener).", u'spoonacularSourceUrl': u'https://spoonacular.com/pia-colada-breakfast-shake-495386', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}