{u'recipes': [{u'sourceName': u'Rants from my Crazy Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512760-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 512760, u'veryPopular': True, u'lowFodmap': True, u'title': u'Bacon Jalapeno Bloody Mary', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 2880, u'pricePerServing': 1507.65, u'creditText': u'Rants from my Crazy Kitchen', u'extendedIngredients': [{u'originalString': u'1 ounce bacon/jalapeno infused vodka', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'ounce'}, {u'originalString': u'4 slices crispy cooked hardwood smoked bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'smoked', u'crispy', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'\xbd teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 dashes celery salt (about 3)', u'aisle': u'Spices and Seasonings', u'name': u'celery salt', u'metaInformation': [u'( 3)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'solid', u'id': 1052047, u'unit': u'dashes'}, {u'originalString': u'1 jalapeno, steam removed, sliced in half length-wise, then sliced into half rings', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'sliced in half length-wise, then sliced into half rings'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'5 ounces tomato juice', u'aisle': u'Beverages', u'name': u'tomato juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'liquid', u'id': 11886, u'unit': u'ounces'}, {u'originalString': u'2 cups good quality vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14051, u'unit': u'cups'}, {u'originalString': u'1 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://rantsfrommycrazykitchen.com/2014/01/19/cocktailday-bacon-jalapeno-bloody-mary/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 52, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"For the bacon/jalapeno infused vodka:In a clean jar with a lid that seals tight combine vodka, cooked bacon, sliced jalapeno with the seeds ( you can leave some or all of the seeds out if you want a milder vodka). Cover and let sit for 24 hours in a cool, dark place (not in the refrigerator). Don't worry, the alcohol in the vodka keeps the bacon safe!After 24 hours, run the vodka mixture through a coffee filter into a clean container. Refrigerate for 24 hours, remove any excess bacon grease from the top of the vodka with a spoon. Now it's ready for your Bloody Mary's! Keep unused infused vodka in the refrigerator and use within 1 week.For the Bacon Jalapeno Bloody Mary's:Put all ingredients except the garnishes in a shaker. Fill a 16 ounce glass with ice almost to the top. Shake the mixture, and pour into glass.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'id': 14051, u'name': u'vodka'}]}, {u'equipment': [], u'step': u'Garnish with desired garnishes.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili can be paired with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. One wine you could try is Freixenet Sparkling Cordon Negro Brut Cava. It has 4.2 out of 5 stars and a bottle costs about 10 dollars.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'A Cava with an exceptional, fresh, fruity style and a lingering aroma. It is the perfect partner for the finest food and excellent at any time.Blend: 35% Macabeo, 25% Xarel\xb7lo, 40% Parellada', u'title': u'Freixenet Sparkling Cordon Negro Brut Cava', u'price': u'$9.99', u'id': 466158, u'link': u'https://www.wine.com/product/freixenet-sparkling-cordon-negro-brut-cava/1615', u'imageUrl': u'https://spoonacular.com/productImages/466158-312x231.jpg'}]}, u'aggregateLikes': 631, u'instructions': u"For the bacon/jalapeno infused vodka:In a clean jar with a lid that seals tight combine vodka, cooked bacon, sliced jalapeno with the seeds ( you can leave some or all of the seeds out if you want a milder vodka). Cover and let sit for 24 hours in a cool, dark place (not in the refrigerator). Don't worry, the alcohol in the vodka keeps the bacon safe!After 24 hours, run the vodka mixture through a coffee filter into a clean container. Refrigerate for 24 hours, remove any excess bacon grease from the top of the vodka with a spoon. Now it's ready for your Bloody Mary's! Keep unused infused vodka in the refrigerator and use within 1 week.For the Bacon Jalapeno Bloody Mary's:Put all ingredients except the garnishes in a shaker. Fill a 16 ounce glass with ice almost to the top. Shake the mixture, and pour into glass. Garnish with desired garnishes.", u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-jalapeno-bloody-mary-512760', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 2880, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}