{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/332086-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 332086, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sugar and Nut Glazed Brie', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 128.18, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'Apple wedges, for serving', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 9003, u'unit': u'servings'}, {u'originalString': u'1 tablespoon brandy', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'tablespoon'}, {u'originalString': u'1 (14-ounce) round brie', u'aisle': u'Cheese', u'name': u'brie', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1006, u'unit': u'ounce'}, {u'originalString': u'1/4 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'Crackers, for serving', u'aisle': u'Savory Snacks', u'name': u'crackers', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 18621, u'unit': u'servings'}, {u'originalString': u'2 to 3 tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup chopped macadamia nuts or pecans', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'macadamia nuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macadamia-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12131, u'unit': u'cup'}, {u'originalString': u'Pear wedges, for serving', u'aisle': u'Produce', u'name': u'pear', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 9252, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpeg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/paula-deen/sugar-and-nut-glazed-brie-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl stir together the sugar, nuts, and brandy. Cover and chill for at least 24 hours or up to 1 week.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 500.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 500 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place the brie on an ovenproof platter or pie plate.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [], u'step': u'Bake for 4 or 5 minutes or until the brie is slightly softened.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [], u'step': u'Spread the sugar mixture in an even layer on top of the warm brie and bake for 2 to 3 minutes longer, or until the sugar melts.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [], u'step': u'Brush the fruit wedges with lemon juice and arrange them around 1 side of the brie.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [], u'step': u'Place crackers around the other side.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6, u'instructions': u'In a small bowl stir together the sugar, nuts, and brandy. Cover and chill for at least 24 hours or up to 1 week.                          Preheat oven to 500 degrees F.                          Place the brie on an ovenproof platter or pie plate. Bake for 4 or 5 minutes or until the brie is slightly softened. Spread the sugar mixture in an even layer on top of the warm brie and bake for 2 to 3 minutes longer, or until the sugar melts. Brush the fruit wedges with lemon juice and arrange them around 1 side of the brie. Place crackers around the other side.', u'spoonacularSourceUrl': u'https://spoonacular.com/sugar-and-nut-glazed-brie-332086', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}