{u'recipes': [{u'sourceName': u'Pumpkin & Peanut Butter', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/917134-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 917134, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Garlic, Thyme, and Roasted Cauliflower Pasta', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 0, u'pricePerServing': 173.07, u'creditText': u'Pumpkin & Peanut Butter', u'extendedIngredients': [{u'originalString': u'1 medium head cauliflower, chopped into florets', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'fresh thyme, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2049, u'unit': u'servings'}, {u'originalString': u'1 teaspoon fresh thyme, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'7 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 7.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'10oz pasta (use gluten free if needed)', u'aisle': u'Pasta and Rice', u'name': u'gluten free pasta', u'metaInformation': [u'gluten free', u'(use if needed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 98875, u'unit': u'oz'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'sprinkle of salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'salt and pepper, as desired', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 - 1 1/2 cup unsweetened almond or soy milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 16235, u'unit': u'cup'}, {u'originalString': u'3 tablespoons flour (I used whole wheat, but use gluten free if needed)', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'gluten free', u'whole wheat', u'(I used , but use if needed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20080, u'unit': u'tablespoons'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://pumpkinandpeanutbutter.com/2016/10/03/creamy-garlic-thyme-roasted-cauliflower-pasta/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F. Chop cauliflower into bite-sized florets, toss then in 1 tbsp of olive oil, salt, and pepper, and spread across a baking sheet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bake for 30 minutes, tossing once or twice throughout.In the meantime, boil water in a large pot.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add in pasta of choice and cook according to directions.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain and set aside. To make your creamy garlic sauce, start by drizzling 1 tbsp of olive oil in a medium sized skillet over medium heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add in minced garlic and saut for 1-2 minutes, until fragrant.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add in 3 tbsp of flour and mix until coated. Slowly pour in the milk a little bit at a time, whisking as you pour. I used a little over 1 cup of milk in my sauce, but use more if you want a thinner consistency.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add in a hefty pinch of salt and pepper, thyme, and simmer for 3-4 minutes, or until sauce has reached the desired consistency.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Drain your pasta, top it with the sauce and cauliflower, and stir to coat. Top with a little more freshly chopped thyme and dig in!', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}], u'name': u''}], u'aggregateLikes': 414, u'instructions': u'Preheat the oven to 400 degrees F. Chop cauliflower into bite-sized florets, toss then in 1 tbsp of olive oil, salt, and pepper, and spread across a baking sheet. Bake for 30 minutes, tossing once or twice throughout.In the meantime, boil water in a large pot. Add in pasta of choice and cook according to directions. Drain and set aside. To make your creamy garlic sauce, start by drizzling 1 tbsp of olive oil in a medium sized skillet over medium heat. Add in minced garlic and saut for 1-2 minutes, until fragrant. Add in 3 tbsp of flour and mix until coated. Slowly pour in the milk a little bit at a time, whisking as you pour. I used a little over 1 cup of milk in my sauce, but use more if you want a thinner consistency. Add in a hefty pinch of salt and pepper, thyme, and simmer for 3-4 minutes, or until sauce has reached the desired consistency.Drain your pasta, top it with the sauce and cauliflower, and stir to coat. Top with a little more freshly chopped thyme and dig in!', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-garlic-thyme-and-roasted-cauliflower-pasta-917134', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}