{u'recipes': [{u'sourceName': u'White Lights On Wednesday', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/593072-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 593072, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dessert for Breakfast Smoothies', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 2, u'pricePerServing': 109.56, u'creditText': u'White Lights On Wednesday', u'extendedIngredients': [{u'originalString': u'1 frozen banana, peeled', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'frozen', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'4 teaspoons Carnation Breakfast Essentials', u'aisle': u'Cereal', u'name': u'breakfast syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 19113, u'unit': u'teaspoons'}, {u'originalString': u'2 scoops honey caramel Greek frozen yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'scoops', u'unitShort': u'scoops', u'amount': 2.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'scoops'}, {u'originalString': u'\xbd cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'\xbc cup rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'5 large strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}, {u'originalString': u'2 scoops chocolate frozen yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'scoops', u'unitShort': u'scoops', u'amount': 2.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'scoops'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.whitelightsonwednesday.com/2014/05/dessert-breakfast-smoothies/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all ingredients in a blender and puree until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into a glass and enjoy.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove leaves from strawberries and then cut in half.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Place in freezer for at least 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place strawberries, frozen yogurt, Carnation Breakfast Essentials, and milk in a blender. Puree until smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour into a glass and enjoy.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 41, u'instructions': u'Place all ingredients in a blender and puree until smooth. Pour into a glass and enjoy.Remove leaves from strawberries and then cut in half. Place in freezer for at least 20 minutes.Place strawberries, frozen yogurt, Carnation Breakfast Essentials, and milk in a blender. Puree until smooth. Pour into a glass and enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/dessert-for-breakfast-smoothies-593072', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 2, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}