{u'recipes': [{u'sourceName': u'Grumpys Honey Bunch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/728909-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 7, u'id': 728909, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp Fra Diavolo #SundaySupper', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 323.63, u'creditText': u'Grumpys Honey Bunch', u'extendedIngredients': [{u'originalString': u'2-14.5 ounce cans fire roasted tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned fire roasted tomatoes', u'metaInformation': [u'fire roasted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 29.0, u'consistency': u'solid', u'id': 98849, u'unit': u'ounce'}, {u'originalString': u'2 cups cooked spaghetti', u'aisle': u'Pasta and Rice', u'name': u'cooked spaghetti', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11420421, u'unit': u'cups'}, {u'originalString': u'\xbe teaspoon crushed red pepper', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'1\xbd tablespoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 pound medium shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.grumpyshoneybunch.com/2016/04/shrimp-fra-diavolo.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat  tablespoon olive oil in a large nonstick skillet over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add 1 teaspoons garlic and shrimp; saut until shrimp are pink (about 3 minutes).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from pan; keep warm.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add remaining  tablespoon oil and onion to pan and saut 5 minutes or until softened. Stir in remaining garlic, pepper, basil, and oregano. Cook 1 minute, stirring constantly. Stir in tomato paste and lemon juice; cook 1 minute. Stir in diced fire roasted tomatoes, and salt. Cook 5 minutes or until thickened. Return shrimp to pan and cook for 2 minutes or until thoroughly heated.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'id': 98849, u'name': u'fire roasted tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve over pasta.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Proverb Pinot Grigio Wine. It has 5 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pear , Apple , Lime', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 85, u'instructions': u'Heat  tablespoon olive oil in a large nonstick skillet over medium-high heat. Add 1 teaspoons garlic and shrimp; saut until shrimp are pink (about 3 minutes). Remove from pan; keep warm.Add remaining  tablespoon oil and onion to pan and saut 5 minutes or until softened. Stir in remaining garlic, pepper, basil, and oregano. Cook 1 minute, stirring constantly. Stir in tomato paste and lemon juice; cook 1 minute. Stir in diced fire roasted tomatoes, and salt. Cook 5 minutes or until thickened. Return shrimp to pan and cook for 2 minutes or until thoroughly heated. Serve over pasta.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-fra-diavolo-sundaysupper-728909', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}