{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/218572-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 218572, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy tuna quinoa salad', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 215.47, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'handful black olives, chopped', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'handful'}, {u'originalString': u'350g cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'g'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'350g peppers, sliced', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 10111333, u'unit': u'g'}, {u'originalString': u'225g pouch ready-to-eat quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 20035, u'unit': u'g'}, {u'originalString': u'1 red chilli, finely chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'225g jar albacore tuna in olive oil, flaked', u'aisle': u'Canned and Jarred', u'name': u'tuna in olive oil', u'metaInformation': [u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 15119, u'unit': u'g'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2364643/spicy-tuna-quinoa-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Fry the onion and peppers in the oiluntil soft.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the chilli and cool slightly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [], u'step': u'Mix the quinoa, onion mixture, cherrytomatoes, olives and tuna together. Dividebetween 4 plates, pour over a little of theoil from the tuna jar, season and serve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'id': 15119, u'name': u'tuna'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Vampire Pinot Grigio Wine with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'fresh , floral , fruity', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 51, u'instructions': u'Fry the onion and peppers in the oiluntil soft. Add the chilli and cool slightly.Mix the quinoa, onion mixture, cherrytomatoes, olives and tuna together. Dividebetween 4 plates, pour over a little of theoil from the tuna jar, season and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-tuna-quinoa-salad-218572', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}