{u'recipes': [{u'sourceName': u'Gal on a Mission', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/527382-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 527382, u'veryPopular': False, u'lowFodmap': False, u'title': u'Funfetti Rice Krispy Treats', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 60.69, u'creditText': u'Gal on a Mission', u'extendedIngredients': [{u'originalString': u'4 cups rice krispy cereal', u'aisle': u'Cereal', u'name': u'crisp rice cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 8066, u'unit': u'cups'}, {u'originalString': u'12 ounce bag of mini marshmallows', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 19116, u'unit': u'ounce'}, {u'originalString': u'1 cup of funfetti sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-chocolate.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93645, u'unit': u'cup'}, {u'originalString': u'4 tablespoons butter, unsalted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://www.galonamission.com/funfetti-rice-krispy-treats/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Lightly grease a 9x13 baking dish. * Set aside', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, combine the butter and marshmallows on medium heat. Keep stiring until the marshmallows are completely melted.In a large mixing bowl, add the rice krispy cereal. When the marsmallows are completely melted, stir that into the cereal. Gently fold in the sprinkles.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Spread the mixture into the baking dish and gently pat down - make sure it is even all around.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 32, u'instructions': u'Lightly grease a 9x13 baking dish. * Set asideIn a large skillet, combine the butter and marshmallows on medium heat. Keep stiring until the marshmallows are completely melted.In a large mixing bowl, add the rice krispy cereal. When the marsmallows are completely melted, stir that into the cereal. Gently fold in the sprinkles.Spread the mixture into the baking dish and gently pat down - make sure it is even all around.', u'spoonacularSourceUrl': u'https://spoonacular.com/funfetti-rice-krispy-treats-527382', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}