{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611570-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 611570, u'veryPopular': True, u'lowFodmap': False, u'title': u'Coconut Margarita', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 402.24, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'coarse rim salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1/2 cup ZICO Pure Coconut Water', u'aisle': u'Beverages', u'name': u'coconut water', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12119, u'unit': u'cup'}, {u'originalString': u'1/2 cup cream of coconut*', u'aisle': u'Alcoholic Beverages;Ethnic Foods;Baking', u'name': u'cream of coconut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93745, u'unit': u'cup'}, {u'originalString': u'coconut ice cubes, see above', u'aisle': u'Frozen', u'name': u'ice cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'servings'}, {u'originalString': u'1/3 cup freshly-squeezed lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly-squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'lime wedges', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'3 tablespoons freshly-squeezed orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'freshly-squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 9206, u'unit': u'tablespoons'}, {u'originalString': u'1-2 tablespoons simple syrup**, if needed', u'aisle': u'Alcoholic Beverages', u'name': u'simple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 90480, u'unit': u'tablespoons'}, {u'originalString': u'sweetened shredded coconut', u'aisle': u'Baking', u'name': u'sweetened shredded coconut', u'metaInformation': [u'shredded', u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12179, u'unit': u'servings'}, {u'originalString': u'1/2 cup tequila', u'aisle': u'Alcoholic Beverages', u'name': u'tequila', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tequila.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10814037, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.gimmesomeoven.com/coconut-margarita-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the coconut water and cream of coconut in a mixing bowl until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-coconut.jpg', u'id': 93745, u'name': u'cream of coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'id': 12119, u'name': u'coconut water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Pour the mixture into ice cube trays, then freeze for at least 12 hours, or until frozen. (Cream of coconut does not always freeze completely, so if yours are not 100% solid, that's ok.) Keep frozen until ready to use.Run a lime wedge around the top of each glass until it the top 1/4-inch or so is moistened. Dip the glass in a bowl that has been filled with either shredded coconut and/or coarse rim salt. Chill the glasses in the freezer for at least 5 minutes before filling with the margarita mixture.If your coconut is not sticking, you may need to pulse it a few times in a food processor until it is the consistency of coarse salt.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-coconut.jpg', u'id': 93745, u'name': u'cream of coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'coarse salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice cubes'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add all ingredients (including the coconut ice cubes) to a blender and pulse until combined. Taste the mixture, and add simple syrup to sweeten if needed. You can also add extra ice cubes (either regular, or more coconut ice cubes) to thicken the consistency, if needed', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 90480, u'name': u'simple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice cubes'}]}, {u'equipment': [], u'step': u'Pour into prepared glasses and serve immediately, garnished with an extra lime wedge on top if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'id': 9159, u'name': u'lime wedge'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 6487, u'instructions': u"Whisk together the coconut water and cream of coconut in a mixing bowl until combined. Pour the mixture into ice cube trays, then freeze for at least 12 hours, or until frozen. (Cream of coconut does not always freeze completely, so if yours are not 100% solid, that's ok.) Keep frozen until ready to use.Run a lime wedge around the top of each glass until it the top 1/4-inch or so is moistened. Dip the glass in a bowl that has been filled with either shredded coconut and/or coarse rim salt. Chill the glasses in the freezer for at least 5 minutes before filling with the margarita mixture.If your coconut is not sticking, you may need to pulse it a few times in a food processor until it is the consistency of coarse salt.Add all ingredients (including the coconut ice cubes) to a blender and pulse until combined. Taste the mixture, and add simple syrup to sweeten if needed. You can also add extra ice cubes (either regular, or more coconut ice cubes) to thicken the consistency, if neededPour into prepared glasses and serve immediately, garnished with an extra lime wedge on top if desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-margarita-611570', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}