{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/795180-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 795180, u'veryPopular': False, u'lowFodmap': False, u'title': u'Broccoli Cheese Stuffed Pork Tenderloins', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 137.76, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'16 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 16.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 1/2 cups finely diced broccoli', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11090, u'unit': u'cups'}, {u'originalString': u'1 bag shredded Sargento 4 State Cheddar Cheese, divided', u'aisle': u'Cheese', u'name': u'cheddar cheese', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'bag', u'unitShort': u'bag', u'amount': 1.0, u'consistency': u'solid', u'id': 1009, u'unit': u'bag'}, {u'originalString': u'1 cup diced cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'4 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'2 diced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/4 cup honey mustard dressing', u'aisle': u'Condiments', u'name': u'honey mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4703, u'unit': u'cup'}, {u'originalString': u'pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/4 cup dry pork rub', u'aisle': u'Spices and Seasonings', u'name': u'pork rub', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1072034, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://insidebrucrewlife.com/2016/07/broccoli-cheese-stuffed-pork-tenderloins/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Prepare your grill by starting the charcoal. Slice the tenderloin into 8 even slices. Butterfly each slice by making an incision on the side and cutting it open.  Make sure you do not cut all the way through. Open each tenderloin and lay it out flat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Place a piece of wax paper on top and pound it with the flat side of a meat mallet.  Sprinkle both sides of the tenderloins with the dry rub.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'id': 1012034, u'name': u'dry seasoning rub'}]}, {u'equipment': [], u'step': u'Combine the cream cheese, broccoli, and 1 cup of the cheddar cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add pepper, to taste  Divide the mixture onto one side of the opened tenderloins.  Close the tenderloins up and wrap each one in 2 slices of bacon. Move the charcoal to one side of the grill to create an indirect heat source so the meat can cook low and slow. The temperature should read around 250 degrees.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the stuffed tenderloins on the other side of the grill, close the lid, and cook for about 1 1/2- 2 hours, or until a meat thermometer inserted into the meat reads 145 degrees.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush each pork bundle with the dressing and top with the remaining cheese.  Close lid for 1-2 minutes or until cheese is melted.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Serve with diced tomatoes and onions.  Makes 8 tenderloins.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Malbec, Pinot Noir, and Sangiovese are my top picks for Pork Tenderloin. Pinot noir's light body is great for lean cuts, medium bodied sangiovese complement meaty sauces, stews, and other multi-ingredient dishes, and full-bodied tannic malbec pairs with fatty cuts and barbecue. You could try Luigi Bosca Malbec. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 23 dollars per bottle.", u'pairedWines': [u'malbec', u'pinot noir', u'sangiovese'], u'productMatches': [{u'description': u'Luigi Bosca Malbec is an intense purple colour wine, with distinct aromas of ripe red fruits, spices and black pepper. The intensity of the entry in the mouth is complemented with the softness and sweetness of tannins, respecting the characteristics of the grape variety in Argentina. A pure, full-bodied, well-structured red wine with character and all the juiciness typical of this variety. A long lingering and elegant finish.', u'title': u'Luigi Bosca Malbec', u'price': u'$22.99', u'id': 438334, u'link': u'https://www.wine.com/product/luigi-bosca-malbec-2011/132493', u'imageUrl': u'https://spoonacular.com/productImages/438334-312x231.jpg'}]}, u'aggregateLikes': 59, u'instructions': u'Prepare your grill by starting the charcoal. Slice the tenderloin into 8 even slices. Butterfly each slice by making an incision on the side and cutting it open.  Make sure you do not cut all the way through. Open each tenderloin and lay it out flat.  Place a piece of wax paper on top and pound it with the flat side of a meat mallet.  Sprinkle both sides of the tenderloins with the dry rub. Combine the cream cheese, broccoli, and 1 cup of the cheddar cheese. Add pepper, to taste  Divide the mixture onto one side of the opened tenderloins.  Close the tenderloins up and wrap each one in 2 slices of bacon. Move the charcoal to one side of the grill to create an indirect heat source so the meat can cook low and slow. The temperature should read around 250 degrees.  Place the stuffed tenderloins on the other side of the grill, close the lid, and cook for about 1 1/2- 2 hours, or until a meat thermometer inserted into the meat reads 145 degrees. Brush each pork bundle with the dressing and top with the remaining cheese.  Close lid for 1-2 minutes or until cheese is melted.  Serve with diced tomatoes and onions.  Makes 8 tenderloins.', u'spoonacularSourceUrl': u'https://spoonacular.com/broccoli-cheese-stuffed-pork-tenderloins-795180', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}