{u'recipes': [{u'sourceName': u'Clean Eating with a Dirty Mind', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/852023-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 852023, u'veryPopular': False, u'lowFodmap': False, u'title': u'Loaded Mashed Cauliflower', u'diets': [u'gluten free', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 368.4, u'creditText': u'Clean Eating with a Dirty Mind', u'extendedIngredients': [{u'originalString': u'5 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 5.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 large head cauliflower', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'\xbc cup (40 g) coconut flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 93747, u'unit': u'g'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'⅛ teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons (2 ounces/56 g) butter or \xbc cup (55 g) ghee', u'aisle': u'Ethnic Foods', u'name': u'ghee', u'metaInformation': [u'(2 ounces/56 g)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 55.0, u'consistency': u'solid', u'id': 93632, u'unit': u'g'}, {u'originalString': u'2 tablespoons chopped fresh chives or green onions, for garnish', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'⅛ teaspoon black ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'⅛ teaspoon fine-grain sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine-grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'4 large yellow onion slices, about 1/4-inch (6-mm) thick', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'thick', u'large', u'(6-mm)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://cleaneatingwithadirtymind.com/2016/01/11/loaded-mashed-cauliflower/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the cauliflower florets off of the head and place them in a microwave-safe bowl. Microwave for 5 to 10 minutes or until tender and translucent. Another method is to steam them by bringing  cup (80 ml) of water to a boil in a large skillet.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10011135, u'name': u'cauliflower florets'}]}, {u'equipment': [], u'step': u'Add the cauliflower florets, cover, and steam until tender and translucent.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10011135, u'name': u'cauliflower florets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the steamed cauliflower florets and butter in a food processor. Puree until a smooth mashed potatolike consistency is reached, scrapping down the sides as needed.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10011135, u'name': u'cauliflower florets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the salt, pepper, and garlic salt, then puree again. Taste to check for seasoning and add more salt, pepper, or garlic salt if desired.Cook the bacon in a large skillet set over medium-high heat. When done remove from the bacon from pan and set aside to let cool. Leave the bacon drippings in the pan and turn the heat down to low.In a small mixing bowl, whisk the egg using a fork; set aside.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'id': 1062047, u'name': u'garlic salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the coconut flour in a separate small bowl. Dip each onion slice into the egg first and then the flour until coated.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'id': 93747, u'name': u'coconut flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place them in the pan with the remaining bacon drippings. Turn the heat up to medium-high and fry each side for about 2 minutes or until golden brown.To assemble, divide the cauliflower mash between two serving bowls.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [], u'step': u'Cut the cooled bacon with kitchen sheers and crumble over the top of each serving. Then sprinkle on the chopped green onions and garnish with onion rings.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 185, u'instructions': u'Cut the cauliflower florets off of the head and place them in a microwave-safe bowl. Microwave for 5 to 10 minutes or until tender and translucent. Another method is to steam them by bringing  cup (80 ml) of water to a boil in a large skillet. Add the cauliflower florets, cover, and steam until tender and translucent.Place the steamed cauliflower florets and butter in a food processor. Puree until a smooth mashed potatolike consistency is reached, scrapping down the sides as needed. Add the salt, pepper, and garlic salt, then puree again. Taste to check for seasoning and add more salt, pepper, or garlic salt if desired.Cook the bacon in a large skillet set over medium-high heat. When done remove from the bacon from pan and set aside to let cool. Leave the bacon drippings in the pan and turn the heat down to low.In a small mixing bowl, whisk the egg using a fork; set aside. Put the coconut flour in a separate small bowl. Dip each onion slice into the egg first and then the flour until coated. Place them in the pan with the remaining bacon drippings. Turn the heat up to medium-high and fry each side for about 2 minutes or until golden brown.To assemble, divide the cauliflower mash between two serving bowls. Cut the cooled bacon with kitchen sheers and crumble over the top of each serving. Then sprinkle on the chopped green onions and garnish with onion rings.', u'spoonacularSourceUrl': u'https://spoonacular.com/loaded-mashed-cauliflower-852023', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': True}]}