{u'recipes': [{u'sourceName': u'Sallys Baking Addiction', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573204-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 573204, u'veryPopular': True, u'lowFodmap': False, u'title': u'Marshmallow PEEPS Cookie Sandwiches', u'diets': [u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 99.73, u'creditText': u'Sallys Baking Addiction', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1 large egg, at room temperature*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups (250g) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1/4 cup (50g) granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'3/4 cup (150g) dark brown sugar (or light brown)', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'dark', u'light', u'(or brown)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'20-24 PEEPS marshmallow candies', u'aisle': u'Sweet Snacks', u'name': u'marshmallow peeps', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peeps.png', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 98850, u'unit': u''}, {u'originalString': u'1 1/4 cups (250g) peanut butter M&Ms (or regular M&Ms, peanut M&Ms, chocolate chips)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [u'(or regular M&Ms, peanut M&Ms, chocolate chips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 16098, u'unit': u'g'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sprinkles', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-chocolate.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93645, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://sallysbakingaddiction.com/2013/10/20/marshmallow-peeps-cookie-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl using a hand-held mixer or stand mixer with paddle attachment, beat the butter for 1 minute on medium speed until completely smooth and creamy.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the brown sugar and granulated sugar and mix on medium speed until fluffy and light in color.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in egg and vanilla. Scrape down the sides and bottom of the bowl as needed. In a separate bowl, combine flour, cornstarch, baking soda and salt. On low speed, slowly mix into the wet ingredients until combined. The cookie dough will be quite thick.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Add the peanut butter M&Ms and sprinkles and mix for about 5 seconds until evenly disbursed. Cover dough tightly with aluminum foil or plastic wrap and chill for at least 1 hour and up to 2 days. Chilling is mandatory for this cookie dough.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove cookie dough from the refrigerator and allow to sit at room temperature for 10 minutes. Preheat oven to 350F.\xa0Line a large baking sheet with parchment paper or a silicone baking mat. Set aside.Once chilled, the dough will be slightly crumbly, but will come together if you work the dough with your hands as you roll into individual balls.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Roll balls of dough, about 1.5 Tablespoons of dough each, into balls.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 8-10 minutes, until barely golden brown around the edges. They will look extremely soft when you remove them from the oven. Allow to cool for 5 minutes on the cookie sheet. If the cookies are too puffy, try gently pressing down on them with the back of a spoon. They will slightly deflate as you let them cool.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Transfer to cooling rack to cool completely at room temperature. Then stick the cookies into the refrigerator for at least 30 minutes. You need cold cookies to make the sandwiches.Arrange two PEEPS onto half of the cold cookies. Microwave, one by one, for 8-12 seconds until the PEEP begins to puff up. Depending on your microwave wattage, do not microwave for any than that or your cookie will fall apart and be too fragile to pick up. \xa0Smoosh another cookie on top creating a sandwich. Cookie sandwiches taste best right after they are made. Cookies (without PEEPS) stay fresh at room temperature for up to 1 week.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peeps.png', u'id': 98850, u'name': u'marshmallow peeps'}]}], u'name': u''}], u'aggregateLikes': 3790, u'instructions': u'In a large bowl using a hand-held mixer or stand mixer with paddle attachment, beat the butter for 1 minute on medium speed until completely smooth and creamy. Add the brown sugar and granulated sugar and mix on medium speed until fluffy and light in color. Mix in egg and vanilla. Scrape down the sides and bottom of the bowl as needed. In a separate bowl, combine flour, cornstarch, baking soda and salt. On low speed, slowly mix into the wet ingredients until combined. The cookie dough will be quite thick. Add the peanut butter M&Ms and sprinkles and mix for about 5 seconds until evenly disbursed. Cover dough tightly with aluminum foil or plastic wrap and chill for at least 1 hour and up to 2 days. Chilling is mandatory for this cookie dough.Remove cookie dough from the refrigerator and allow to sit at room temperature for 10 minutes. Preheat oven to 350F.\xa0Line a large baking sheet with parchment paper or a silicone baking mat. Set aside.Once chilled, the dough will be slightly crumbly, but will come together if you work the dough with your hands as you roll into individual balls. Roll balls of dough, about 1.5 Tablespoons of dough each, into balls. Bake for 8-10 minutes, until barely golden brown around the edges. They will look extremely soft when you remove them from the oven. Allow to cool for 5 minutes on the cookie sheet. If the cookies are too puffy, try gently pressing down on them with the back of a spoon. They will slightly deflate as you let them cool. Transfer to cooling rack to cool completely at room temperature. Then stick the cookies into the refrigerator for at least 30 minutes. You need cold cookies to make the sandwiches.Arrange two PEEPS onto half of the cold cookies. Microwave, one by one, for 8-12 seconds until the PEEP begins to puff up. Depending on your microwave wattage, do not microwave for any than that or your cookie will fall apart and be too fragile to pick up. \xa0Smoosh another cookie on top creating a sandwich. Cookie sandwiches taste best right after they are made. Cookies (without PEEPS) stay fresh at room temperature for up to 1 week.', u'spoonacularSourceUrl': u'https://spoonacular.com/marshmallow-peeps-cookie-sandwiches-573204', u'dishTypes': [u'dessert'], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}