{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/468847-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 468847, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Vegetable Skillet', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 164.83, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 teaspoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup chopped dill pickle', u'aisle': u'Canned and Jarred', u'name': u'dill pickle', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011937, u'unit': u'cup'}, {u'originalString': u'1 teaspoon dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoon'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 pound fresh tomatoes, chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'pound'}, {u'originalString': u'1 pound ground turkey breast', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5662, u'unit': u'pound'}, {u'originalString': u'1/4 pound zucchini, diced', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 11477, u'unit': u'pound'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/turkey-vegetable-skillet', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, cook turkey and onion over medium heat in oil until turkey is no longer pink.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add garlic; cook 1 minute longer.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Drain if necessary.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add remaining ingredients. Reduce heat; simmer, uncovered, for 5-10 minutes or until heated through.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 141, u'instructions': u'Directions                                                                                In a large skillet, cook turkey and onion over medium heat in oil until turkey is no longer pink. Add garlic; cook 1 minute longer. Drain if necessary. Add remaining ingredients. Reduce heat; simmer, uncovered, for 5-10 minutes or until heated through.                                        Yield: 6 servings.                                                                                                                         Originally published as Turkey Vegetable Skillet in  Taste of HomeAugust/September 1994, p44                                                                                                                                                                                                        Nutritional Facts                                                                             One serving equals 135 calories, 3 g fat (0 saturated fat), 47 mg cholesterol, 104 mg sodium, 5 g carbohydrate, 0 fiber, 21 g protein. Diabetic Exchanges: 3 lean meat, 1 vegetable.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-vegetable-skillet-468847', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}