{u'recipes': [{u'sourceName': u'Pineapple and Coconut', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/588653-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 588653, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blender Acorn Squash Soup', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 82.01, u'creditText': u'Pineapple and Coconut', u'extendedIngredients': [{u'originalString': u'1 acorn squash', u'aisle': u'Produce', u'name': u'acorn squash', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11482, u'unit': u''}, {u'originalString': u'3 cups chicken stock (Or Veggie stock to make it vegetarian)', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'(Or Veggie stock to make it vegetarian)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 tsp cinnamon, divided', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'Coconut milk (1 tsp per bowl)', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'per bowl)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'tsp'}, {u'originalString': u'4 Tbsp coconut oil, divided', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'Tbsp'}, {u'originalString': u'1 cup full fat coconut milk (Use can coconut milk, do not use boxed)', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [u'canned', u'(Use can coconut milk, do not use boxed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1 bulb of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tsp ground nutmeg, divided', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'\xbd ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u''}, {u'originalString': u'2 tsp maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tsp'}, {u'originalString': u'Toasted pumpkin seeds', u'aisle': u'Savory Snacks', u'name': u'pumpkin seeds', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 12014, u'unit': u'servings'}, {u'originalString': u'1 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'3 Tbsp shallot, diced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11677, u'unit': u'Tbsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.pineappleandcoconut.com/recipes/blender-acorn-squash-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 Deg. F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Drizzle 2 tbsp of coconut oil on a large baking sheet', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Cut the acorn squash in half and scoop out the seeds. Slice into 1” half rings and place on the cookie sheet. Sprinkle the squash with the cinnamon and nutmeg. Take off the outer layer of peel on the garlic and cut off the top \xbc inch.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/acorn-squash.jpg', u'id': 11482, u'name': u'acorn squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place the garlic bulb on a large square of foil and drizzle the exposed garlic cloves with 1 Tbsp coconut oil. Wrap the foil around the garlic.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the pan of squash and garlic bulb in the preheated oven and roast for 30 minutes, flipping the squash slices once. If the squash is very tender remove from the oven and check the garlic. If the garlic isn’t super soft yet, roast another 10 minutes.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Let everything cool enough to handle', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a saut\xe9 pan add the remaining tablespoon of coconut oil and add the leeks, shallot and diced apple.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Saute until the leeks and shallots are starting to caramelize and the apples are soft.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Remove the peel from the roasted squash and place in the blender.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add in the remaining ingredients. Turn blender on and slowly raise the speed to 10 and then high. Blend for 5 minutes checking for steam by removing the vent cap on the lid. Stop the blender and taste and season with more spices if desired. Blend a few more minutes on high if needed for soup to be hotter.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Serve and garnish with a drizzle of coconut milk and toasted pumpkin seeds', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 249, u'instructions': u'Preheat oven to 350 Deg. F. Drizzle 2 tbsp of coconut oil on a large baking sheetCut the acorn squash in half and scoop out the seeds. Slice into 1” half rings and place on the cookie sheet. Sprinkle the squash with the cinnamon and nutmeg. Take off the outer layer of peel on the garlic and cut off the top \xbc inch. Place the garlic bulb on a large square of foil and drizzle the exposed garlic cloves with 1 Tbsp coconut oil. Wrap the foil around the garlic. Place the pan of squash and garlic bulb in the preheated oven and roast for 30 minutes, flipping the squash slices once. If the squash is very tender remove from the oven and check the garlic. If the garlic isn’t super soft yet, roast another 10 minutes. Let everything cool enough to handleIn a saut\xe9 pan add the remaining tablespoon of coconut oil and add the leeks, shallot and diced apple. Saute until the leeks and shallots are starting to caramelize and the apples are soft.Remove the peel from the roasted squash and place in the blender. Add in the remaining ingredients. Turn blender on and slowly raise the speed to 10 and then high. Blend for 5 minutes checking for steam by removing the vent cap on the lid. Stop the blender and taste and season with more spices if desired. Blend a few more minutes on high if needed for soup to be hotter. Serve and garnish with a drizzle of coconut milk and toasted pumpkin seeds', u'spoonacularSourceUrl': u'https://spoonacular.com/blender-acorn-squash-soup-588653', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}