{u'recipes': [{u'sourceName': u'Healthy Seasonal Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/833898-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 19, u'id': 833898, u'veryPopular': False, u'lowFodmap': False, u'title': u'tamari turkey meatballs with maple tahini glaze', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 75.07, u'creditText': u'Healthy Seasonal Recipes', u'extendedIngredients': [{u'originalString': u'\xbc teaspoon red chili flake', u'aisle': u'Produce', u'name': u'chili', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11819, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon finely grated fresh ginger root preferably grated with a rasp-style grater', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'fresh', u'with a rasp-style grater', u'finely grated', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'20 ounces 99% lean ground turkey', u'aisle': u'Meat', u'name': u'lean ground turkey', u'metaInformation': [u'99%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 5662, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon plus 2 teaspoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoon'}, {u'originalString': u'2 scallions minced plus sliced scallion greens for garnish, divided', u'aisle': u'Produce', u'name': u'scallion greens', u'metaInformation': [u'divided', u'minced', u'sliced', u'for garnish, '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tablespoon plus 1 teaspoon sesame tahini', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'Black and/or white sesame seeds for garnish', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'white', u'black', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 25.0, u'consistency': u'solid', u'id': 12023, u'unit': u'servings'}, {u'originalString': u'2 tablespoons plus 2 teaspoons reduced-sodium San-J Tamari divided', u'aisle': u'Ethnic Foods', u'name': u'tamari', u'metaInformation': [u'divided', u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10116124, u'unit': u'tablespoons'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.healthyseasonalrecipes.com/tamari-turkey-meatballs-with-maple-tahini-glaze/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F. Line a large baking sheet with parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Whisk 2 tablespoons San-J Tamari, sesame oil, ginger and red chili flake in a large bowl. Stir in 2 minced scallions and water chestnuts. Stir in turkey until completely combined.Drop turkey mixture by rounded tablespoons onto the prepared baking sheet, gently re-shaping into ball shapes by rolling between clean palms. Lightly coat the balls with cooking spray and transfer to the oven.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'red chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 10116124, u'name': u'tamari'}]}, {u'equipment': [], u'step': u'Bake until the meat is cooked through, 16 to 19 minutes.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let sit for 3 minutes to firm up.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk maple syrup, tahini and the remaining 2 teaspoons San-J Tamari in a large bowl.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 10116124, u'name': u'tamari'}]}, {u'equipment': [], u'step': u'Add the cooked meatballs and gently stir to coat.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Transfer to a serving platter. Sprinkle the meatballs with the remaining sliced scallions and sesame seeds and serve hot with toothpicks.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 83, u'instructions': u'Preheat oven to 400 degrees F. Line a large baking sheet with parchment paper.Whisk 2 tablespoons San-J Tamari, sesame oil, ginger and red chili flake in a large bowl. Stir in 2 minced scallions and water chestnuts. Stir in turkey until completely combined.Drop turkey mixture by rounded tablespoons onto the prepared baking sheet, gently re-shaping into ball shapes by rolling between clean palms. Lightly coat the balls with cooking spray and transfer to the oven. Bake until the meat is cooked through, 16 to 19 minutes. Let sit for 3 minutes to firm up.Whisk maple syrup, tahini and the remaining 2 teaspoons San-J Tamari in a large bowl. Add the cooked meatballs and gently stir to coat. Transfer to a serving platter. Sprinkle the meatballs with the remaining sliced scallions and sesame seeds and serve hot with toothpicks.', u'spoonacularSourceUrl': u'https://spoonacular.com/tamari-turkey-meatballs-with-maple-tahini-glaze-833898', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 25, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}