{u'recipes': [{u'sourceName': u'Seeded at the Table', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528007-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 528007, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pinterest Party: Chocolate Peppermint Crunch Cookies', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 23.01, u'creditText': u'Seeded at the Table', u'extendedIngredients': [{u'originalString': u'2 1/4 cups all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 (3.4 oz.) package Chocolate Fudge pudding mix', u'aisle': u'Baking', u'name': u'chocolate pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'solid', u'id': 19184, u'unit': u'oz'}, {u'originalString': u'1/4 cup cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'3/4 cup dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup Andes Peppermint Crunch Baking Chips', u'aisle': u'Baking', u'name': u'peppermint baking chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 98858, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://www.seededatthetable.com/2013/12/12/pinterest-party-chocolate-peppermint-crunch-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 350 degrees F.  Line baking sheets with parchment paper or silicone liner.In a medium bowl, combine the flour, cocoa powder, baking soda and salt with a whisk; set aside.  In a large mixing bowl, beat together the butter and sugars until creamy, about 1 minute on high speed.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add the pudding mix and then beat in the eggs one at a time.  Stir in the vanilla extract and continue to mix until fully combined.Gradually add the dry ingredients to the wet ingredients until just combined.  Gently stir in the peppermint crunch baking chips until evenly distributed through the dough.Using a medium cookie scoop or a regular spoon, form into 1 1/2 Tablespoons sized dough balls and place on cookie sheets.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'id': 98858, u'name': u'peppermint crunch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and allow to cool on baking sheets for 5 minutes before removing.  Store airtight for up to 5 days.Recipe Source:  Table for Two', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Preheat your oven to 350 degrees F.  Line baking sheets with parchment paper or silicone liner.In a medium bowl, combine the flour, cocoa powder, baking soda and salt with a whisk; set aside.  In a large mixing bowl, beat together the butter and sugars until creamy, about 1 minute on high speed.  Add the pudding mix and then beat in the eggs one at a time.  Stir in the vanilla extract and continue to mix until fully combined.Gradually add the dry ingredients to the wet ingredients until just combined.  Gently stir in the peppermint crunch baking chips until evenly distributed through the dough.Using a medium cookie scoop or a regular spoon, form into 1 1/2 Tablespoons sized dough balls and place on cookie sheets.  Bake for 10 minutes.Remove from the oven and allow to cool on baking sheets for 5 minutes before removing.  Store airtight for up to 5 days.Recipe Source:  Table for Two', u'spoonacularSourceUrl': u'https://spoonacular.com/pinterest-party-chocolate-peppermint-crunch-cookies-528007', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}