{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/408984-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 408984, u'veryPopular': False, u'lowFodmap': False, u'title': u'Winter Minestrone and Garlic Bruschetta', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 368.94, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'8 to 10 ounces fresh baby spinach leaves', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11457, u'unit': u'ounces'}, {u'originalString': u'1 bay leaf', u'aisle': u'Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 1/2 cups (1/2-inch-diced) peeled butternut squash', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'peeled', u'(1/2-inch-diced)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'1 15-ounce can cannellini beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned cannellini beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cannellini-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10016051, u'unit': u'ounce'}, {u'originalString': u'1 26-ounce can or box diced tomatoes, such as Pomi', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u' such as pomi', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 26.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'2 cups (1/2-inch-diced) carrots (3 carrots)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'(1/2-inch-diced)', u'(3 carrots)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cups'}, {u'originalString': u'2 cups (1/2-inch-diced) celery (3 stalks)', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'(1/2-inch-diced)', u'(3 stalks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cups'}, {u'originalString': u'6 to 8 cups chicken stock, preferably homemade', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'2 cups cooked small pasta, such as tubetti', u'aisle': u'Pasta and Rice', u'name': u'cooked pasta', u'metaInformation': [u' such as tubetti', u'small', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20421, u'unit': u'cups'}, {u'originalString': u'1/2 cup good dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white', u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 French baguette', u'aisle': u'Bakery/Bread', u'name': u'french baguette', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'2 teaspoons chopped fresh thyme leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'1 clove garlic, cut in half lengthwise', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'cut in half lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 1/2 tablespoons minced garlic (4 cloves)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Good olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'4 ounces pancetta, 1/2-inch-diced', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 10410123, u'unit': u'ounces'}, {u'originalString': u'Freshly grated Parmesan cheese, for serving', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'2 tablespoons store-bought pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'store-bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93698, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups chopped yellow onions', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10511282, u'unit': u'cups'}], u'healthScore': 40.0, u'imageType': u'jpeg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ina-garten/winter-minestrone-and-garlic-bruschetta-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat 2 tablespoons of olive oil over medium heat in a large, heavy pot or Dutch oven.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the pancetta and cook over medium-low heat for 6 to 8 minutes, stirring occasionally, until lightly browned.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}]}, {u'equipment': [], u'step': u'Add the onions, carrots, celery, squash, garlic, and thyme and cook over medium heat, stirring occasionally, for 8 to 10 minutes, until the vegetables begin to soften.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the tomatoes, 6 cups of the chicken stock, the bay leaf, 1 tablespoon salt, and 11/2teaspoons pepper to the pot. Bring to a boil, then lower the heat and simmer uncovered for 30 minutes, until the vegetables are tender. Discard the bay leaf.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Add the beans and cooked pasta and heat through. The soup should be quite thick but if it's too thick, I add more chicken stock.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20421, u'name': u'cooked pasta'}]}, {u'equipment': [], u'step': u'Just before serving, reheat the soup, add the spinach, and toss with 2 big spoons (like tossing a salad). Cook just until the leaves are wilted. Stir in the white wine and pesto. Depending on the saltiness of the chicken stock, add another teaspoon or two of salt to taste.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve large shallow bowls of soup with a bruschetta on top. Sprinkled with Parmesan cheese, drizzle with olive oil and serve hot.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 425 degrees.Slice the baguette at a 45degree angle in 1/2-inch-thick slices.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Brush both sides of the bread with olive oil and bake for 6 minutes, until lightly toasted. Take the slices out of the oven and rub the surface of each one with the cut clove of garlic.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'aggregateLikes': 225, u'instructions': u"Watch how to make this recipe.                    Heat 2 tablespoons of olive oil over medium heat in a large, heavy pot or Dutch oven. Add the pancetta and cook over medium-low heat for 6 to 8 minutes, stirring occasionally, until lightly browned. Add the onions, carrots, celery, squash, garlic, and thyme and cook over medium heat, stirring occasionally, for 8 to 10 minutes, until the vegetables begin to soften.Add the tomatoes, 6 cups of the chicken stock, the bay leaf, 1 tablespoon salt, and 11/2teaspoons pepper to the pot. Bring to a boil, then lower the heat and simmer uncovered for 30 minutes, until the vegetables are tender. Discard the bay leaf. Add the beans and cooked pasta and heat through. The soup should be quite thick but if it's too thick, I add more chicken stock.                          Just before serving, reheat the soup, add the spinach, and toss with 2 big spoons (like tossing a salad). Cook just until the leaves are wilted. Stir in the white wine and pesto. Depending on the saltiness of the chicken stock, add another teaspoon or two of salt to taste. Serve large shallow bowls of soup with a bruschetta on top. Sprinkled with Parmesan cheese, drizzle with olive oil and serve hot.                          Preheat the oven to 425 degrees.Slice the baguette at a 45degree angle in 1/2-inch-thick slices. Brush both sides of the bread with olive oil and bake for 6 minutes, until lightly toasted. Take the slices out of the oven and rub the surface of each one with the cut clove of garlic.", u'spoonacularSourceUrl': u'https://spoonacular.com/winter-minestrone-and-garlic-bruschetta-408984', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}