{u'recipes': [{u'sourceName': u'Call Me PMC', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626598-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 626598, u'veryPopular': False, u'lowFodmap': True, u'title': u'Steak Stuffed Jalapenos', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 20, u'pricePerServing': 33.42, u'creditText': u'Call Me PMC', u'extendedIngredients': [{u'originalString': u'\xbc to 1/3 pound chuck eye steak (or your choice cut), cut into 8 strips', u'aisle': u'Meat', u'name': u'chuck eye steak', u'metaInformation': [u'cut into 8 strips', u'(or your choice cut)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 23145, u'unit': u'pound'}, {u'originalString': u'3 ounces cream cheese at room temperature, cut into 8 pieces', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cut into 8 pieces', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'ground black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'8 jalapenos, washed, cut in half add inside scrapped clean', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [u'washed', u'cut in half add inside scrapped clean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'8 slices thin cut bacon, cut in half', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'thin cut', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}], u'healthScore': 0.0, u'imageType': u'png', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.callmepmc.com/2015/01/steak-stuffed-jalapenos/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut jalapenos lengthwise, using a spoon clean out seeds.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}]}, {u'equipment': [], u'step': u'Cut steak against the grain into 8 strips slightly smaller than the jalapeno.Spoon the cream cheese into the pepper', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Add the un-cooked steak to the pepper and wrap the bacon around the jalapeno trying not to overlap the pepper. Secure with a toothpick if necessary.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add pepper to taste.Refrigerate at least 30 minutes.Preheat grill or skillet to medium heat or abuot 300 degrees.Rotate pepper to cook on all sides.Cook until bacon is crisp.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Serve hot or at room temperature.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is Rombauer Merlot. It has 4.8 out of 5 stars and a bottle costs about 26 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Enticing and lively red color; beautifully aromatic with black cherry and ripe plum. On the palate a purity of blackcurrant, cedar and mint flavors blend together seamlessly. Soft and supple, this wine has a medium-bodied mouth-feel with plush tannins that integrate with the generous finish.Our favorite pairings for this wine include chicken parmesan, cedar-planked salmon over wild rice, and mushroom pizza.', u'title': u'Rombauer Merlot', u'price': u'$25.59', u'id': 447938, u'link': u'https://www.wine.com/product/rombauer-merlot-2008/116883', u'imageUrl': u'https://spoonacular.com/productImages/447938-312x231.jpg'}]}, u'aggregateLikes': 330, u'instructions': u'Cut jalapenos lengthwise, using a spoon clean out seeds.Cut steak against the grain into 8 strips slightly smaller than the jalapeno.Spoon the cream cheese into the pepperAdd the un-cooked steak to the pepper and wrap the bacon around the jalapeno trying not to overlap the pepper. Secure with a toothpick if necessary.Add pepper to taste.Refrigerate at least 30 minutes.Preheat grill or skillet to medium heat or abuot 300 degrees.Rotate pepper to cook on all sides.Cook until bacon is crisp.Serve hot or at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/steak-stuffed-jalapenos-626598', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}