{u'recipes': [{u'sourceName': u'Steamy Kitchen', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/602414-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 602414, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Gumbo (with leftover Thanksgiving turkey)', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 169.32, u'creditText': u'Steamy Kitchen', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 bell peppers, diced', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10211821, u'unit': u''}, {u'originalString': u'4 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 14-ounce can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'2 stalks celery, diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'cooked rice', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'servings'}, {u'originalString': u'6 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'small handful fresh parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'handful'}, {u'originalString': u'5 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2-3 cups frozen or fresh okra', u'aisle': u'Produce', u'name': u'okra', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/okra.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11278, u'unit': u'cups'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon each: dried oregano, dried thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 pound kielbasa, smoked or polish sausage, cut into bite-sized pieces', u'aisle': u'Meat', u'name': u'polish sausage', u'metaInformation': [u'smoked', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7059, u'unit': u'pound'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 cups cooked, shredded leftover turkey', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'shredded', u'leftover', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 5165, u'unit': u'cups'}, {u'originalString': u'1 quart chicken or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'quart'}, {u'originalString': u'8 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.steamykitchen.com/19344-turkey-gumbo-leftover-thanksgiving-turkey-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Heat a large stockpot with the butter over medium heat. When the butter begins to bubble a bit, use a whisk or wooden spoon to add in the flour, a little at a time. Continue stirring for a 2 minutes, until the flour is fully incorporated into the butter. Turn the heat to low and cook for 10 minutes, stirring every 30 seconds or so, until the roux has turned into the color of peanut butter. Make sure that the roux does not burn - stay close by! Return heat to medium and add in the bell peppers, celery and onion and cook for 5 minutes.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in the garlic and cook another minute or so until fragrant.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add in the bay leaves, oregano, thyme, tomatoes, smoked sausage, broth and water. Bring to a boil and let simmer for 1 hour.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add in the okra, cook 2 minutes, then add in the cooked turkey. Taste and season with salt and pepper. Stir in chopped parsley.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/okra.jpg', u'id': 11278, u'name': u'okra'}]}, {u'equipment': [], u'step': u'Serve over cooked rice.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10220445, u'name': u'cooked rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Gumbo on the menu? Try pairing with Sauvignon Blanc, ros\xe9 Wine, and Albarino. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. The Twomey Cellars by Silver Oak Sauvignon Blanc with a 4.8 out of 5 star rating seems like a good match. It costs about 25 dollars per bottle.', u'pairedWines': [u'sauvignon blanc', u'rose wine', u'albarino'], u'productMatches': [{u'description': u'Our 2010 Twomey Napa Valley Sauvignon Blanc has a light straw-yellow color and a dynamic nose of honeydew melon, citrus blossoms, white jonquil, guava, custard apple and pie crust. It has beautiful acid balance, great mouthfeel without heaviness and a long clean finish redolent of lime zest and mascarpone.', u'title': u'Twomey Cellars by Silver Oak Sauvignon Blanc', u'price': u'$24.99', u'id': 442142, u'link': u'https://www.wine.com/product/twomey-cellars-by-silver-oak-sauvignon-blanc-2010/110148', u'imageUrl': u'https://spoonacular.com/productImages/442142-312x231.jpg'}]}, u'aggregateLikes': 65, u'instructions': u'Heat a large stockpot with the butter over medium heat. When the butter begins to bubble a bit, use a whisk or wooden spoon to add in the flour, a little at a time. Continue stirring for a 2 minutes, until the flour is fully incorporated into the butter. Turn the heat to low and cook for 10 minutes, stirring every 30 seconds or so, until the roux has turned into the color of peanut butter. Make sure that the roux does not burn - stay close by! Return heat to medium and add in the bell peppers, celery and onion and cook for 5 minutes. Add in the garlic and cook another minute or so until fragrant. Add in the bay leaves, oregano, thyme, tomatoes, smoked sausage, broth and water. Bring to a boil and let simmer for 1 hour. Add in the okra, cook 2 minutes, then add in the cooked turkey. Taste and season with salt and pepper. Stir in chopped parsley. Serve over cooked rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-gumbo-with-leftover-thanksgiving-turkey-602414', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}