{u'recipes': [{u'sourceName': u'Sugar Free Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/557518-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 557518, u'veryPopular': False, u'lowFodmap': False, u'title': u'Healthy Stuffed Turkey Sliders', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 161.85, u'creditText': u'Sugar Free Mom', u'extendedIngredients': [{u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tsp. garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'2 tsp Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'tsp'}, {u'originalString': u'2.5 lb. ground turkey, 93% lean', u'aisle': u'Meat', u'name': u'lean ground turkey', u'metaInformation': [u'93%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 5662, u'unit': u'lb'}, {u'originalString': u'\xbc c. 1 % milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'c'}, {u'originalString': u'\xbd c. Parmesan cheese, grated', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'c'}, {u'originalString': u'\xbd tsp. pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbd c. mozzarella, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'c'}, {u'originalString': u'\xbd c. whole wheat bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'whole wheat bread crumbs', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 99025, u'unit': u'c'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.sugarfreemom.com/recipes/healthy-stuffed-turkey-sliders/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Mix all ingredients together in a bowl and combine well.Preheat oven to 400 degrees.Using your hands form a ball somewhat smaller than the size of a tennis ball. Make 14-16 depending on size.Indent each ball with your thumb and place about 1-2 teaspoons of shredded cheese in each.Fold over the edges to cover the cheese so it won't leak out.Flatten and lay the sliders on a wire rack over a baking pan.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1011026, u'name': u'shredded cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake for 30 minutes or until a thermometer inserted in center reads 160 degrees Fahrenheit.Enjoy on a whole grain bun or top with my Cucumber Feta Relish!', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 170, u'instructions': u"Mix all ingredients together in a bowl and combine well.Preheat oven to 400 degrees.Using your hands form a ball somewhat smaller than the size of a tennis ball. Make 14-16 depending on size.Indent each ball with your thumb and place about 1-2 teaspoons of shredded cheese in each.Fold over the edges to cover the cheese so it won't leak out.Flatten and lay the sliders on a wire rack over a baking pan.Bake for 30 minutes or until a thermometer inserted in center reads 160 degrees Fahrenheit.Enjoy on a whole grain bun or top with my Cucumber Feta Relish!", u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-stuffed-turkey-sliders-557518', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}