{u'recipes': [{u'sourceName': u'Pinch of Yum', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/609338-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 609338, u'veryPopular': True, u'lowFodmap': False, u'title': u'French Toast with Pear Chutney and Mascarpone', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 168.63, u'creditText': u'Pinch of Yum', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'3 cinnamon sticks', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon sticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'2 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'\xbd cup half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup mascarpone cheese', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93820, u'unit': u'cup'}, {u'originalString': u'\xbd cup milk (I used almond milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(I used almond milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'4 pears (about 4-5 cups finely chopped)', u'aisle': u'Produce', u'name': u'pears', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 9252, u'unit': u'cups'}, {u'originalString': u'chopped pecan pieces for topping', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'pecan pieces', u'metaInformation': [u'chopped', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10012142, u'unit': u'pieces'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'2 teaspoons vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup white wine vinegar (or other sweet vinegar)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'sweet', u'white', u'(or other vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002068, u'unit': u'cup'}, {u'originalString': u"6 slices bakery-style wheat bread (I like Archer Farm's Harvest Grain bread from Target)", u'aisle': u'Bakery/Bread', u'name': u'whole wheat bread', u'metaInformation': [u'bakery-style', u"(I like Archer Farm's Harvest Grain bread from Target)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 18075, u'unit': u'slices'}, {u'originalString': u'1 tablespoon whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20080, u'unit': u'tablespoon'}, {u'originalString': u'\xbd yellow onion (about \xbd cup finely chopped)', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://pinchofyum.com/whole-wheat-french-toast-pear-chutney-mascarpone', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"The night before (if you can! if not, that's okay, too), place the butter and onion in a small saucepan and saute for several minutes until soft.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add all the other chutney ingredients and bring to a boil. Turn the heat down and simmer for 30-45 minutes, until the mixture is soft, sweet, and thickened into a texture like applesauce. If making ahead, store in the fridge.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a nonstick pan or griddle over medium high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the slices of bread in half so you have a total of 12 bread pieces.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk the egg yolks, half and half, milk, vanilla, and flour until smooth. Dip the bread in the egg mixture and transfer to the hot skillet. Fry for a few minutes on each side until golden brown (I don't recommend using butter - try to use a skillet or griddle that has a very smooth nonstick surface that makes flipping really easy). When the pieces are golden brown, arrange on four plates.If your chutney was made the night before, heat it back up again. Shmear the French toast with a little mascarpone, top with chutney, and sprinkle with pecans. For extra fun, scoop little spoonfuls of mascarpone over the French toast - the heat of the chutney will melt the mascarpone into pretty little pools of creamy and you will be in heaven.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 507, u'instructions': u"The night before (if you can! if not, that's okay, too), place the butter and onion in a small saucepan and saute for several minutes until soft. Add all the other chutney ingredients and bring to a boil. Turn the heat down and simmer for 30-45 minutes, until the mixture is soft, sweet, and thickened into a texture like applesauce. If making ahead, store in the fridge.Heat a nonstick pan or griddle over medium high heat. Cut the slices of bread in half so you have a total of 12 bread pieces. Whisk the egg yolks, half and half, milk, vanilla, and flour until smooth. Dip the bread in the egg mixture and transfer to the hot skillet. Fry for a few minutes on each side until golden brown (I don't recommend using butter - try to use a skillet or griddle that has a very smooth nonstick surface that makes flipping really easy). When the pieces are golden brown, arrange on four plates.If your chutney was made the night before, heat it back up again. Shmear the French toast with a little mascarpone, top with chutney, and sprinkle with pecans. For extra fun, scoop little spoonfuls of mascarpone over the French toast - the heat of the chutney will melt the mascarpone into pretty little pools of creamy and you will be in heaven.", u'spoonacularSourceUrl': u'https://spoonacular.com/french-toast-with-pear-chutney-and-mascarpone-609338', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}