{u'recipes': [{u'sourceName': u'Cooking Classy', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/620100-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 620100, u'veryPopular': True, u'lowFodmap': False, u'title': u'The Best Cornbread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 32.76, u'creditText': u'Cooking Classy', u'extendedIngredients': [{u'originalString': u'1 cup unsweetened applesauce (at room temperature)', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened', u'at room temperature', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9019, u'unit': u'cup'}, {u'originalString': u'1 1/2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'3/4 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 1/2 cups buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1230, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 35137, u'unit': u'cups'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 Tbsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbsp'}, {u'originalString': u'3/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'6 Tbsp butter, melted (I just used salted)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'melted', u'(I just used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'Tbsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.cookingclassy.com/2014/11/best-cornbread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'In a large mixing bowl, whisk together cornmeal and buttermilk until well blended, allow to rest at room temperature for 30 minutes. Preheat oven to 375 degrees during last 5 minutes of mixture resting. Butter a 13 by 9-inch baking dish, set aside In a mixing bowl, whisk together flour, baking powder, baking soda and salt, set aside.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add melted butter, applesauce, sugar, honey and eggs to cornmeal mixture and whisk until well combine. Stir in dry ingredients and whisk just until combine and no longer lumpy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'id': 9019, u'name': u'applesauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Pour mixture into prepared baking dish, spread into an even layer and bake 23 - 26 minutes until toothpick inserted in center comes out clean. Cool 5 - 10 minutes before slicing.', u'length': {u'number': 36, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with honey or whipped honey butter (recipe in notes below). Store in an airtight container.Recipe source: Cooking Classy', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Cornbread can be paired with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Chateau Ste. Michelle Cold Creek Vineyard Riesling with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'The Cold Creek Riesling is made from 40-year-old vines which contribute fruit intensity and concentration. This is a ripe, lush style of Riesling with aromas of ripe peaches, dried apricots and spice notes. It displays beautiful ripe fruit flavors with a crisp finish. View More', u'title': u'Chateau Ste. Michelle Cold Creek Vineyard Riesling', u'price': u'$14.99', u'id': 438970, u'link': u'https://www.wine.com/product/chateau-ste-michelle-cold-creek-vineyard-riesling-2013/132851', u'imageUrl': u'https://spoonacular.com/productImages/438970-312x231.jpg'}]}, u'aggregateLikes': 8179, u'instructions': u'In a large mixing bowl, whisk together cornmeal and buttermilk until well blended, allow to rest at room temperature for 30 minutes. Preheat oven to 375 degrees during last 5 minutes of mixture resting. Butter a 13 by 9-inch baking dish, set aside In a mixing bowl, whisk together flour, baking powder, baking soda and salt, set aside. Add melted butter, applesauce, sugar, honey and eggs to cornmeal mixture and whisk until well combine. Stir in dry ingredients and whisk just until combine and no longer lumpy. Pour mixture into prepared baking dish, spread into an even layer and bake 23 - 26 minutes until toothpick inserted in center comes out clean. Cool 5 - 10 minutes before slicing. Serve with honey or whipped honey butter (recipe in notes below). Store in an airtight container.Recipe source: Cooking Classy', u'spoonacularSourceUrl': u'https://spoonacular.com/the-best-cornbread-620100', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}