{u'recipes': [{u'sourceName': u'Pip and Debby', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/557881-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 557881, u'veryPopular': False, u'lowFodmap': False, u'title': u'Huevos Rancheros', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 157.1, u'creditText': u'Pip and Debby', u'extendedIngredients': [{u'originalString': u'14.5-oz. can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'2 6-inch corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'6-inchs', u'unitShort': u'6-inch', u'amount': 2.0, u'consistency': u'solid', u'id': 18363, u'unit': u'6-inch'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 bunch green onions, thinly sliced (white and light green parts only)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'light', u'thinly sliced', u'(white and green parts only)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunch'}, {u'originalString': u'1 jalape\xf1o pepper, finely chopped (optional)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 cup chopped fresh kale leaves', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cup'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.pipandebby.com/pip-ebby/2013/8/19/huevos-rancheros.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tablespoons of olive oil in a skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onions, garlic and jalape\xf1os (if using) and cook, stirring, until softened and fragrant, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the tomatoes, kale and cilantro and bring the mixture to a boil. Reduce to medium-low heat and simmer for 10 minutes, stirring occasionally.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. You could try Bernardus Rosella's Vineyard Pinot Noir. Reviewers quite like it with a 4.7 out of 5 star rating and a price of about 48 dollars per bottle.", u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The Santa Lucia Highlands are known as one of the premier Pinot Noir appellations of the world. One reason for this lofty reputation is Rosella's Vineyard. Gary Franscioni planted his home ranch, named for his lovely wife, in the heart of the Highlands. Gary's home vineyard is planted with a selection of the best available Pinot Noir clones and farmed with unparalleled passion and attention to detail. We at Bernardus are fortunate to have access to three small blocks: 2 planted with clone 777, and the third with the celebrated Pisoni clone.Each block is individually monitored for ripeness in order to hand-pick each clone at its perfect ripeness level. The grapes are sorted at the winery and fermented in small individual fermenters using specially selected yeasts. Once fermentation and pressing are complete, each lot is aged separately for 10 months in the finest French oak barrels. Each barrel is evaluated individually and the final selection is made through a lengthy series of tasting trials.The robe of our 2011 Rosella's is a deep crimson. On the nose we find aromas of candied red cherry fruits along with notes of oak and spice. The palate is very full and complex, exuding flavors of red cherry and berries, accented by notes of cinnamon and nutmeg. This is a beautifully intense wine that will age wonderfully for many years to come.", u'title': u"Bernardus Rosella's Vineyard Pinot Noir", u'price': u'$47.99', u'id': 465202, u'link': u'https://www.wine.com/product/bernardus-rosellas-vineyard-pinot-noir-2011/131978', u'imageUrl': u'https://spoonacular.com/productImages/465202-312x231.jpg'}]}, u'aggregateLikes': 230, u'instructions': u'Heat 2 tablespoons of olive oil in a skillet over medium heat. Add the onions, garlic and jalape\xf1os (if using) and cook, stirring, until softened and fragrant, about 3 minutes. Add the tomatoes, kale and cilantro and bring the mixture to a boil. Reduce to medium-low heat and simmer for 10 minutes, stirring occasionally.', u'spoonacularSourceUrl': u'https://spoonacular.com/huevos-rancheros-557881', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}