{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/604523-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 604523, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pecan Pie V', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 70.42, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/2 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'1 cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 tablespoon milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoon'}, {u'originalString': u'1 cup chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Pecan-Pie-V/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F (205 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, beat eggs until foamy, and stir in melted butter.  Stir in the brown sugar, white sugar and the flour; mix well. Last add the milk, vanilla and nuts.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour into an unbaked 9-in pie shell.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 10 minutes at 400 degrees, then reduce temperature to 350 degrees and bake for 30 to 40 minutes, or until done.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pecan Pie on the menu? Try pairing with Madeira, Pedro Xim\xe9nez, and Tawny Port. Sweet, nutty pecan pie deserves a wine to match - these dessert wines all have the right sweetness and the nutty notes. One wine you could try is Kenneth Volk El Pomar Junction Vineyard Verdelho. It has 1.7999999999999998 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'madeira', u'pedro ximenez', u'tawny port'], u'productMatches': [{u'description': u"Verdelho is a semi-aromatic white grape that was traditionally used in the production of the revered wines of the island of Madeira. Verdelho has found popularity with forward thinking vintners from around the world in the production of delicious table wines. This bottling is full bodied with tropical and citrus fruit aromas with grapefruit, melon and apple flavors. This refreshing wine can be enjoyed as an aperitif or served with seafoods or Pacific Rim cuisine. Verdelho's aroma and bouquet is unique and reminds me of citrus flowers and ripe Casaba melon.Its palate weight is more full-bodied than many other white wines.", u'title': u'Kenneth Volk El Pomar Junction Vineyard Verdelho', u'price': u'$11.99', u'id': 444264, u'link': u'https://www.wine.com/product/kenneth-volk-el-pomar-junction-vineyard-verdelho-2008/105981', u'imageUrl': u'https://spoonacular.com/productImages/444264-312x231.jpg'}]}, u'aggregateLikes': 2446, u'instructions': u'Preheat oven to 400 degrees F (205 degrees C).                            In a large bowl, beat eggs until foamy, and stir in melted butter.  Stir in the brown sugar, white sugar and the flour; mix well. Last add the milk, vanilla and nuts.                            Pour into an unbaked 9-in pie shell. Bake in preheated oven for 10 minutes at 400 degrees, then reduce temperature to 350 degrees and bake for 30 to 40 minutes, or until done.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/pecan-pie-v-604523', u'dishTypes': [u'dessert'], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}