{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/209806-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 209806, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salmon & spinach with tartare cream', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 536.25, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tsp caper, drained', u'aisle': u'Canned and Jarred', u'name': u'caper berries', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caper-berries.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002054, u'unit': u'tsp'}, {u'originalString': u'2 tbsp reduced-fat cr\xe8me fra\xeeche', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'creme fraiche', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001056, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp flat-leaf parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'juice \xbd lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'lemon wedges, to serve', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'2 skinless salmon fillets', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 2.0, u'consistency': u'solid', u'id': 15076, u'unit': u'fillet'}, {u'originalString': u'250g bag spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'g'}, {u'originalString': u'1 tsp sunflower or vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tsp'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/5872/salmon-and-spinach-with-tartare-cream', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a pan, season the salmonon both sides, then fry for 4 mins each sideuntil golden and the flesh flakes easily. Leaveto rest on a plate while you cook the spinach.Tip the leaves into the hot pan, seasonwell, then cover and leave to wilt for 1 min,stirring once or twice. Spoon the spinachonto plates, then top with the salmon. Gentlyheat the cr\xe8me fra\xeeche in the pan with asqueeze of the lemon juice, the capers andparsley, then season to taste. Be careful notto let it boil. Spoon the sauce over the fish,then serve with lemon wedges.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1001056, u'name': u'creme fraiche'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Vampire Pinot Grigio Wine. It has 4.5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This dry, zestful combination is reminiscent of ripe pears and roses', u'title': u'Vampire Pinot Grigio Wine', u'price': u'$17.95', u'id': 428219, u'link': u'https://www.amazon.com/2015-Vampire-Pinot-Grigio-Wine/dp/B00PSQ589E', u'imageUrl': u'https://spoonacular.com/productImages/428219-312x231.jpg'}]}, u'aggregateLikes': 992, u'instructions': u'Heat the oil in a pan, season the salmonon both sides, then fry for 4 mins each sideuntil golden and the flesh flakes easily. Leaveto rest on a plate while you cook the spinach.Tip the leaves into the hot pan, seasonwell, then cover and leave to wilt for 1 min,stirring once or twice. Spoon the spinachonto plates, then top with the salmon. Gentlyheat the cr\xe8me fra\xeeche in the pan with asqueeze of the lemon juice, the capers andparsley, then season to taste. Be careful notto let it boil. Spoon the sauce over the fish,then serve with lemon wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/salmon-spinach-with-tartare-cream-209806', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}