{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/202533-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 202533, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Swarm', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 154.53, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2 teaspoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'1/2 ounce fresh lemon juice from 1 lemon', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'ounce'}, {u'originalString': u'4 ounces white rum', u'aisle': u'Alcoholic Beverages', u'name': u'rum', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 14037, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'teaspoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/04/the-swarm-honey-bee-cocktail-with-cynar-easy-rum-drink-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine the honey and warm water in the bottom of a cocktail shaker and stir vigorously until completely combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the white rum, lemon juice, Cynar. Fill cocktail shaker with ice and shake until well chilled, about 15 seconds. Strain into two coupe glasses and serve immediately.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 47, u'instructions': u'Procedures                                                                              1                                                                            Combine the honey and warm water in the bottom of a cocktail shaker and stir vigorously until completely combined.                                                                                                                             2                                                                            Add the white rum, lemon juice, Cynar. Fill cocktail shaker with ice and shake until well chilled, about 15 seconds. Strain into two coupe glasses and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-swarm-202533', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}