{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/739496-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 739496, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cornbread-Chili Casserole', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 265.3, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons hot Mexican chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tablespoons'}, {u'originalString': u'1 12-ounce bag frozen whole-kernel white shoepeg corn, thawed', u'aisle': u'Produce', u'name': u'corn kernel', u'metaInformation': [u'white', u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11172, u'unit': u'ounce'}, {u'originalString': u'3 8-ounce boxes cornbread muffin mix (Jiffy preferred)', u'aisle': u'Baking', u'name': u'cornbread mix', u'metaInformation': [u'(Jiffy preferred)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornbread.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 18022, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 pounds lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 23557, u'unit': u'pounds'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 1/2 cups mild salsa (medium or hot if preferred)', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'hot', u'medium', u'( or if preferred)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 6164, u'unit': u'cups'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup shredded Cheddar (about 4 ounces)', u'aisle': u'Cheese', u'name': u'shredded cheddar', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounces'}, {u'originalString': u'1/4 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1/4 cup vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 25.0, u'imageType': u'jpeg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/trisha-yearwood/cornbread-chili-casserole.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet over medium heat, heat the oil until shimmering, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion and saute until soft, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the ground beef to the onion and saute, breaking it up with a spoon, until browned and cooked through, 8 to 10 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drain off any excess fat. Stir in the salsa, corn, vegetable broth, chili powder, cumin, 1 teaspoon salt and 1/2 teaspoon pepper.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer the mixture into a 9-by-13-inch baking dish, smoothing into an even layer.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, mix together the corn muffin mix with about 1 1/2 cups milk, or just enough to make it easy to spread.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-muffins.jpg', u'id': 10018022, u'name': u'corn muffin mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Spread it thinly over the chili mixture.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until browned to top, 30 to 35 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and set aside for 10 minutes to allow the casserole to set. Top with the Cheddar and sour cream before serving.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1843, u'instructions': u'Preheat the oven to 375 degrees F.                          In a large skillet over medium heat, heat the oil until shimmering, about 2 minutes. Add the onion and saute until soft, about 5 minutes. Add the ground beef to the onion and saute, breaking it up with a spoon, until browned and cooked through, 8 to 10 minutes. Drain off any excess fat. Stir in the salsa, corn, vegetable broth, chili powder, cumin, 1 teaspoon salt and 1/2 teaspoon pepper. Transfer the mixture into a 9-by-13-inch baking dish, smoothing into an even layer.                          In a large bowl, mix together the corn muffin mix with about 1 1/2 cups milk, or just enough to make it easy to spread. Spread it thinly over the chili mixture. Bake until browned to top, 30 to 35 minutes. Remove from the oven and set aside for 10 minutes to allow the casserole to set. Top with the Cheddar and sour cream before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/cornbread-chili-casserole-739496', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}