{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/476335-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 476335, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mac ‘n Cheese with Salsa Verde {Saturdays with Rachael Ray}', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 143.69, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1/2 pound macaroni', u'aisle': u'Pasta and Rice', u'name': u'macaroni', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 20499, u'unit': u'pound'}, {u'originalString': u'1 1/2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 cup pepper jack cheese, shredded', u'aisle': u'Cheese', u'name': u'pepper jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1025, u'unit': u'cup'}, {u'originalString': u'1/3 cup salsa verde', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa verde', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 27028, u'unit': u'cup'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup sharp cheddar cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1 boneless, skinless chicken breast, cooked and shredded', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'shredded', u'boneless', u'skinless', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.tasteandtellblog.com/saturdays-with-rachael-ray-mac-n-cheese-with-salsa-verde/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook pasta to al dente.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Drain and reserve.Melt butter in a saucepan over medium heat, sprinkle in flour, and whisk 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in milk and season with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Let thicken to coat the back of a spoon.  Melt the cheeses into the sauce.Fold the cheese sauce into the macaroni.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'id': 20499, u'name': u'macaroni'}]}, {u'equipment': [], u'step': u'Add the chicken and the salsa verde and stir to combine all ingredients.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa-verde.jpg', u'id': 27028, u'name': u'salsa verde'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Mexican. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Beaux Freres The Beaux Freres Vineyard Pinot Noir with a 4.1 out of 5 star rating seems like a good match. It costs about 56 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Shows dark plum/garnet with some amber and orange at the edge. The nose shows roasted herbs and meatiness with some background notes of sweet cherry, truffle and vegetal qualities. This is a distinctive Pinot Noir with aromatics that are very old-world. In the mouth the wine has always had a certain austerity but a bit of a gap in the middle. The wine has held up nicely over time but has never really developed the sweetness and charm that we would expect of our best Pinot Noirs.', u'title': u'Beaux Freres The Beaux Freres Vineyard Pinot Noir', u'price': u'$55.99', u'id': 445451, u'link': u'https://www.wine.com/product/beaux-freres-the-beaux-freres-vineyard-pinot-noir-1996/126352', u'imageUrl': u'https://spoonacular.com/productImages/445451-312x231.jpg'}]}, u'aggregateLikes': 83, u'instructions': u'Cook pasta to al dente.  Drain and reserve.Melt butter in a saucepan over medium heat, sprinkle in flour, and whisk 1 minute.  Whisk in milk and season with salt and pepper.  Let thicken to coat the back of a spoon.  Melt the cheeses into the sauce.Fold the cheese sauce into the macaroni.  Add the chicken and the salsa verde and stir to combine all ingredients.', u'spoonacularSourceUrl': u'https://spoonacular.com/mac-n-cheese-with-salsa-verde-saturdays-with-rachael-ray-476335', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}