{u'recipes': [{u'sourceName': u'Skinny Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/473148-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 473148, u'veryPopular': True, u'lowFodmap': True, u'title': u'Parchment-Wrapped Fish', u'diets': [u'gluten free', u'fodmap friendly', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 54.96, u'creditText': u'Skinny Chef', u'extendedIngredients': [{u'originalString': u'1/8 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons trans-fat free margarine', u'aisle': u'Condiments', u'name': u'fat-free mayo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 42193, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoons'}, {u'originalString': u'2 large lemons, juiced, about 1/4 cup', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'large', u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/4 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon sweet paprika', u'aisle': u'Spices and Seasonings', u'name': u'sweet paprika', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002028, u'unit': u'teaspoon'}, {u'originalString': u'2 tomatoes, seeded and finally chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'4 6-ounces white fish fillets, such as tilapia or cod or snapper', u'aisle': u'Seafood', u'name': u'white fish fillets', u'metaInformation': [u'white', u' such as tilapia or cod or snapper'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 10015261, u'unit': u'ounces'}, {u'originalString': u'1/4 cup white wine or champagne (optional)', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://skinnychef.com/recipes/fish-parchment', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400\xb0 F. Prepare you packets for baking. Tear 4 sheets of parchment paper 12 inches long.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Place 1 fillet on each sheet and distribute the remaining ingredients on top of the four fillets. Fold the paper over to form a packet and fold the edges, crimping tightly. Use straight pins or toothpicks to tightly secure the edges so there are no gaps.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place on a large baking tray and bake 12 to 15 minutes until the packets puff and the fish is no longer translucent inside. Watch out for the steam that might escape while opening the packets. Slide the opened packets onto plates and serve immediately.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Proverb Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Pear , Apple , Lime', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 758, u'instructions': u'Preheat the oven to 400\xb0 F. Prepare you packets for baking. Tear 4 sheets of parchment paper 12 inches long. Place 1 fillet on each sheet and distribute the remaining ingredients on top of the four fillets. Fold the paper over to form a packet and fold the edges, crimping tightly. Use straight pins or toothpicks to tightly secure the edges so there are no gaps.Place on a large baking tray and bake 12 to 15 minutes until the packets puff and the fish is no longer translucent inside. Watch out for the steam that might escape while opening the packets. Slide the opened packets onto plates and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/parchment-wrapped-fish-473148', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}