{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/754193-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 754193, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pralines', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 147.72, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 teaspoons bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'teaspoons'}, {u'originalString': u'3/4 cup lightly packed light brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 stick (1/2 cup) butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 teaspoon kosher salt, plus another teaspoon for sprinkling', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups chopped roasted pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'1/2 cup skim milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/duff-goldman/pralines.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 37, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}], u'step': u'Special equipment: Candy thermometer', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Place a large piece of parchment paper on a flat surface, preferably granite or wood.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Put all the ingredients in a large pot and attach a candy thermometer to the side. You need to be sure the thermometer goes deep into the mixture. Turn the heat to medium high.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Fill a bowl that's larger than the pot halfway with ice water and set it aside.", u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Stir the mixture with a wooden spoon. When everything has melted together, start checking the temperature. When the thermometer reaches exactly 236 degrees F, remove the pot from the heat and stick it in the bowl of cold water to stop the cooking process. Stir for 45 seconds while the pot is in the ice bath to evenly cool the entire mixture.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"With a large spoon, start dropping puddles of the mixture onto the parchment. Make sure you're getting some pecans in every spoonful. If you feel like it, sprinkle just a bit of salt on top.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Let them cool all the way. If you're in a humid environment, they might stay sticky, but put them in front of a fan and they should get dry.", u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u"Store them carefully in a tin, and don't stack them very high-three layers max, separated by wax paper.", u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Find this recipe and more in Duff', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Bakes: Think and', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Bake Like a Pro at Home ($27.50, William Morrow).', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 127, u'instructions': u"Special equipment: Candy thermometer              Place a large piece of parchment paper on a flat surface, preferably granite or wood.                          Put all the ingredients in a large pot and attach a candy thermometer to the side. You need to be sure the thermometer goes deep into the mixture. Turn the heat to medium high.                          Fill a bowl that's larger than the pot halfway with ice water and set it aside.                          Stir the mixture with a wooden spoon. When everything has melted together, start checking the temperature. When the thermometer reaches exactly 236 degrees F, remove the pot from the heat and stick it in the bowl of cold water to stop the cooking process. Stir for 45 seconds while the pot is in the ice bath to evenly cool the entire mixture.                          With a large spoon, start dropping puddles of the mixture onto the parchment. Make sure you're getting some pecans in every spoonful. If you feel like it, sprinkle just a bit of salt on top. Let them cool all the way. If you're in a humid environment, they might stay sticky, but put them in front of a fan and they should get dry.                          Store them carefully in a tin, and don't stack them very high-three layers max, separated by wax paper.                          Find this recipe and more in Duff Bakes: Think and Bake Like a Pro at Home ($27.50, William Morrow).", u'spoonacularSourceUrl': u'https://spoonacular.com/pralines-754193', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}