{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/415876-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 415876, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesy Company Casserole', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 61.56, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 cup soft bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'3 cups frozen chopped broccoli, thawed and drained', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'frozen', u'thawed', u'drained', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11090, u'unit': u'cups'}, {u'originalString': u'1/4 cup butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'2 cans (14-1/2 ounces each) diced tomatoes, undrained', u'aisle': u'Canned and Jarred', u'name': u'canned diced tomatoes', u'metaInformation': [u'diced', u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 11531, u'unit': u'ounces'}, {u'originalString': u'4 cups cooked elbow macaroni', u'aisle': u'Pasta and Rice', u'name': u'cooked elbow macaroni', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/macaroni.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20400, u'unit': u'cups'}, {u'originalString': u'4 cups cubed fully cooked ham', u'aisle': u'Meat', u'name': u'cooked ham', u'metaInformation': [u'cubed', u'fully cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 7214, u'unit': u'cups'}, {u'originalString': u'1 can (2.8 ounces) french-fried onions, chopped, optional', u'aisle': u'Canned and Jarred', u'name': u'fried onions', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fried-onions.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.8, u'consistency': u'solid', u'id': 93709, u'unit': u'ounces'}, {u'originalString': u'1 small green pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'3/4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 package (10 ounces) frozen peas, thawed', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11304, u'unit': u'ounces'}, {u'originalString': u'8 ounces process cheese (Velveeta), cubed', u'aisle': u'Cheese', u'name': u'process american cheese', u'metaInformation': [u'cubed', u'(Velveeta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1253, u'unit': u'ounces'}, {u'originalString': u'1/2 cup crushed stuffing mix', u'aisle': u'Bakery/Bread;Pasta and Rice', u'name': u'stuffing mix', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18081, u'unit': u'cup'}, {u'originalString': u'1 tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cheesy-company-casserole', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, cook and stir cheese and milk over low heat until cheese is melted. Stir in tomatoes until blended.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove from the heat; stir in the mayonnaise and Worcestershire sauce until blended. Stir in the ham, macaroni, broccoli, peas, green pepper, onion, stuffing mix and onions if desired.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'id': 18081, u'name': u'stuffing mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Transfer to two greased 2-1/2-qt. baking dishes. Toss bread crumbs and butter; sprinkle over the top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake, uncovered, at 350\xb0 for 35-40 minutes or until bubbly.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 33, u'instructions': u"Directions                                                                                In a large saucepan, cook and stir cheese and milk over low heat until cheese is melted. Stir in tomatoes until blended. Remove from the heat; stir in the mayonnaise and Worcestershire sauce until blended. Stir in the ham, macaroni, broccoli, peas, green pepper, onion, stuffing mix and onions if desired.                                                                                           Transfer to two greased 2-1/2-qt. baking dishes. Toss bread crumbs and butter; sprinkle over the top. Bake, uncovered, at 350\xb0 for 35-40 minutes or until bubbly.                                        Yield: 2 casseroles (8-10 servings each).                                                                                                     Editor's Note: Reduced-fat or fat-free mayonnaise or salad dressing may not be substituted for regular mayonnaise or salad dressing.                                                                                                Originally published as Company Casserole in  Casserole Cookbook2001, p157                                                                                                                                                                                                       Nutritional Facts                                                                             1 serving (1 cup) equals 230 calories, 15 g fat (5 g saturated fat), 32 mg cholesterol, 649 mg sodium, 15 g carbohydrate, 2 g fiber, 10 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-company-casserole-415876', u'dishTypes': [u'side dish'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}