{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/463236-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 463236, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Hazelnut Dressing', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 130.09, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 cups chopped peeled apples', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u'cups'}, {u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'1 cup cooked wild rice', u'aisle': u'Pasta and Rice', u'name': u'cooked wild rice', u'metaInformation': [u'wild', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wild-rice-cooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20089, u'unit': u'cup'}, {u'originalString': u'4-1/2 cups seasoned stuffing croutons', u'aisle': u'Bakery/Bread;Pasta and Rice', u'name': u'stuffing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stuffing-mix.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 18082, u'unit': u'cups'}, {u'originalString': u'1/2 cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1/2 cup minced fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1/2 cup chopped hazelnuts or pecans, toasted', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'toasted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12120, u'unit': u'cup'}, {u'originalString': u'1-1/4 cups reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'1-1/4 cups each chopped celery and onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cups'}, {u'originalString': u'1/4 cup orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 pound reduced-fat pork sausage', u'aisle': u'Meat', u'name': u'pork sausage', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 1007063, u'unit': u'pound'}, {u'originalString': u'1 teaspoon poultry seasoning', u'aisle': u'Spices and Seasonings', u'name': u'poultry seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2034, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cranberry-hazelnut-dressing', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, bring cranberries and juice to a boil.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the heat; cover and set aside. In a large nonstick skillet, saute celery and onions in oil. Stir in poultry seasoning.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'id': 2034, u'name': u'poultry seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a large bowl.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the same skillet, cook sausage over medium heat until no longer pink; drain and add to bowl.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Add next five ingredients and reserved cranberry mixture; toss to combine.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with broth. Sprinkle with salt and pepper; toss to coat.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place in a 13-in. x 9-in. baking dish coated with cooking spray. Cover; bake at 325\xb0 for 35 minutes. Uncover; bake 10-15 minutes or until lightly browned.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7, u'instructions': u'Directions                                                                                In a small saucepan, bring cranberries and juice to a boil. Remove from the heat; cover and set aside. In a large nonstick skillet, saute celery and onions in oil. Stir in poultry seasoning. Place in a large bowl.                                                                                           In the same skillet, cook sausage over medium heat until no longer pink; drain and add to bowl. Add next five ingredients and reserved cranberry mixture; toss to combine. Drizzle with broth. Sprinkle with salt and pepper; toss to coat.                                                                                            Place in a 13-in. x 9-in. baking dish coated with cooking spray. Cover; bake at 325\xb0 for 35 minutes. Uncover; bake 10-15 minutes or until lightly browned.                                        Yield: 12 servings.                                                                                                                         Originally published as Cranberry Hazelnut Dressing in  Light & TastyOctober/November 2003, p6                                                                                                                                                                                                         Nutritional Facts                                                                             One serving (1 cup) equals 212 calories, 8 g fat (2 g saturated fat), 13 mg cholesterol, 657 mg sodium, 27 g carbohydrate, 3 g fiber, 7 g protein. Diabetic Exchanges: 1 starch, 1 lean meat, 1 fat, 1/2 fruit.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-hazelnut-dressing-463236', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}