{u'recipes': [{u'sourceName': u'Gal on a Mission', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/721351-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 721351, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Crockpot Chicken Stew (Low Carb, Keto)', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 186.84, u'creditText': u'Gal on a Mission', u'extendedIngredients': [{u'originalString': u'2 medium carrots (1/2 cup), peeled and finely diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced', u'medium', u'peeled', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'2 celery sticks (1 cup), diced', u'aisle': u'Produce', u'name': u'celery sticks', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'2 cups chicken stock*', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'28 ounces skinless and deboned chicken thighs diced into 1" pieces', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [u'diced', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 5091, u'unit': u'ounces'}, {u'originalString': u'\xbc teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'xantham gum, to desired thickness starting at ⅛ teaspoon', u'aisle': u'Sweet Snacks', u'name': u'gum drop', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spice-drops-or-gumdrops.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 19106, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'\xbd onion (1/2 cup), diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 spring fresh rosemary or \xbd teaspoon dried rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'dried', u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2036, u'unit': u''}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.galonamission.com/easy-crockpot-chicken-stew-low-carb-keto/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place the chicken stock, carrots, celery, onion, chicken thighs, rosemary, garlic, thyme, oregano, and spinach into a 3-quart crockpot or larger. Cook on high for 2 hours or on low for 4 hours.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add salt and pepper, to taste.Stir in spinach.Sprinkle and thicken with xantham gum to desired thickness starting at th teaspoon. Continue to whisk until mix and cook for another 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 231, u'instructions': u'Place the chicken stock, carrots, celery, onion, chicken thighs, rosemary, garlic, thyme, oregano, and spinach into a 3-quart crockpot or larger. Cook on high for 2 hours or on low for 4 hours.Add salt and pepper, to taste.Stir in spinach.Sprinkle and thicken with xantham gum to desired thickness starting at th teaspoon. Continue to whisk until mix and cook for another 10 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-crockpot-chicken-stew-low-carb-keto-721351', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 125, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}