{u'recipes': [{u'sourceName': u'I am a Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/666596-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 666596, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crispy Oven Fried Panko Chicken Thighs', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 104.59, u'creditText': u'I am a Food Blog', u'extendedIngredients': [{u'originalString': u'4-6 BONE-IN, SKIN ON CHICKEN THIGHS', u'aisle': u'Meat', u'name': u'bone-in chicken thighs', u'metaInformation': [u'bone-in', u', skin on'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1005091, u'unit': u''}, {u'originalString': u'1 CUP BUTTERMILK', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'CUP', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'CUP'}, {u'originalString': u'1/4 tsp CAYENNE', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'tsp'}, {u'originalString': u'1 CUP PANKO', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'CUP', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'CUP'}, {u'originalString': u'1/2 tsp PAPRIKA, GARLIC POWDER, ONION POWDER', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'1 tsp FRESHLY GROUND PEPPER', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp SALT', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://iamafoodblog.com/crispy-oven-fried-panko-chicken-thighs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat the oven to 400F.Toast the panko in a dry pan over low heat until golden brown and crunchy, about 2-3 minutes, stirring often.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}]}, {u'equipment': [], u'step': u'Remove from the heat, stir in the spices and move to a shallow container.Dip the chicken thighs in the buttermilk and then the panko mixture, pressing to make sure the crumbs stick on both sides.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Place the chicken, skin-side up on a lined baking sheet or wire rack inside a rimmed baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until golden brown and cooked through, 40-45 minutes. Enjoy hot!', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Thighs can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 35 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 129, u'instructions': u'<p>Preheat the oven to 400F.</p><p>Toast the panko in a dry pan over low heat until golden brown and crunchy, about 2-3 minutes, stirring often. Remove from the heat, stir in the spices and move to a shallow container.</p><p>Dip the chicken thighs in the buttermilk and then the panko mixture, pressing to make sure the crumbs stick on both sides.</p><p>Place the chicken, skin-side up on a lined baking sheet or wire rack inside a rimmed baking sheet.</p><p>Bake until golden brown and cooked through, 40-45 minutes. Enjoy hot!</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-oven-fried-panko-chicken-thighs-666596', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}