{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598434-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 598434, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eggs Benedict', u'diets': [], u'preparationMinutes': 35, u'pricePerServing': 215.39, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'12 to 16 tablespoons (6 to 8 ounces) very soft unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'ounces'}, {u'originalString': u'4 thin slices boiled ham or prosciutto', u'aisle': u'Meat', u'name': u'cooked ham', u'metaInformation': [u'boiled', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 7214, u'unit': u'slices'}, {u'originalString': u'3 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'4 large eggs, the fresher the better', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup hollandaise sauce', u'aisle': u'Oil, Vinegar, Salad Dressing;Spices and Seasonings', u'name': u'hollandaise sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hollandaise-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93801, u'unit': u'cup'}, {u'originalString': u'1 tablespoon freshly squeezed lemon juice, or more if needed', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'4 warm poached eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'poached eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poached-egg.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1131, u'unit': u''}, {u'originalString': u'Salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoon'}, {u'originalString': u'4 slices of brioche or home-style white bread, cut into 4-inch rounds, or English-muffin halves', u'aisle': u'Bakery/Bread', u'name': u'white bread', u'metaInformation': [u'white', u'brioche or home-style', u'cut into 4-inch rounds, or english-muffin halves'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slices'}, {u'originalString': u'2 tablespoons distilled white vinegar, per 2 quarts water', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white distilled vinegar', u'metaInformation': [u'white', u'per 2 quarts water'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoons'}, {u'originalString': u'Freshly ground white pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2032, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://leitesculinaria.com/507/recipes-julia-child-eggs-benedict.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the hollandaise sauce1.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hollandaise-sauce.jpg', u'id': 93801, u'name': u'hollandaise sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the yolks, water, and lemon juice in a saucepan that’s off the heat for a few moments, until the mixture is thick and pale. (This prepares them for what is to come.)2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the pan over moderately low heat and continue to whisk at a reasonable speed, reaching all over the bottom and insides of the pan where the eggs tend to overcook. To moderate the heat, frequently move the pan off the burner for a few seconds, and then back on. (If, by chance, the eggs seem to be cooking too fast, set the pan in the bowl of cold water to cool the bottom, then continue.) As they cook, the eggs will become frothy and increase in volume and then thicken. When you can see the pan bottom through the streaks of the whisk and the eggs are thick and smooth, remove the pan from the heat.3.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the soft butter in spoonfuls, whisking constantly to incorporate each addition before adding more. As the emulsion forms, you may add the butter in slightly larger amounts, always whisking until fully absorbed. Continue incorporating butter until the sauce has thickened to the consistency that you want.4. Season the hollandaise sauce lightly with salt and a dash of cayenne pepper, whisking it well. Taste and adjust the seasoning, adding droplets of lemon juice if needed.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hollandaise-sauce.jpg', u'id': 93801, u'name': u'hollandaise sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve lukewarm.Poach the eggs5. Fill the pan with water to a depth of 2 inches or so, add the vinegar, and bring to a slow boil.6. Rapidly crack and open each egg into the water, holding the shell as close to the surface as possible. The eggs will cool the water; adjust the heat to maintain a slow simmer. After a few moments, when the whites have just begun to set, drag the back of the slotted spoon gently across the top of the eggs, to move them off the pan bottom so they don’t stick. Cook the eggs for about 4 minutes, adjusting the heat as necessary.7. To test for doneness, lift 1 egg from the water with the slotted spoon and gently press both white and yolk. The whites should feel fully set but not too firm, and the yolks very soft. If you prefer firmer eggs, poach the eggs longer.8. When the eggs are set the way you like them, remove the eggs from the saucepan with the slotted spoon or strainer and immerse them in a bowl of warm tap water to wash off the vinegar. Set the spoon on a clean towel (or folded paper towels) for a moment to remove excess water. Immediately assemble the eggs Benedict.Assemble the eggs Benedict9. Just before serving, toast the bread circles or muffins lightly, butter both sides, and warm the ham and the optional truffle slices in a frying pan with a tablespoon butter.10. Center a toast round on each warm serving plate. Drape a slice of ham over the toast and top it with a poached egg. Spoon some hollandaise sauce generously over each egg and top with a warm truffle slice, if desired.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hollandaise-sauce.jpg', u'id': 93801, u'name': u'hollandaise sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poached-egg.png', u'id': 1131, u'name': u'poached egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 77, u'instructions': u'Make the hollandaise sauce1. Whisk the yolks, water, and lemon juice in a saucepan that’s off the heat for a few moments, until the mixture is thick and pale. (This prepares them for what is to come.)2. Place the pan over moderately low heat and continue to whisk at a reasonable speed, reaching all over the bottom and insides of the pan where the eggs tend to overcook. To moderate the heat, frequently move the pan off the burner for a few seconds, and then back on. (If, by chance, the eggs seem to be cooking too fast, set the pan in the bowl of cold water to cool the bottom, then continue.) As they cook, the eggs will become frothy and increase in volume and then thicken. When you can see the pan bottom through the streaks of the whisk and the eggs are thick and smooth, remove the pan from the heat.3. Add the soft butter in spoonfuls, whisking constantly to incorporate each addition before adding more. As the emulsion forms, you may add the butter in slightly larger amounts, always whisking until fully absorbed. Continue incorporating butter until the sauce has thickened to the consistency that you want.4. Season the hollandaise sauce lightly with salt and a dash of cayenne pepper, whisking it well. Taste and adjust the seasoning, adding droplets of lemon juice if needed. Serve lukewarm.Poach the eggs5. Fill the pan with water to a depth of 2 inches or so, add the vinegar, and bring to a slow boil.6. Rapidly crack and open each egg into the water, holding the shell as close to the surface as possible. The eggs will cool the water; adjust the heat to maintain a slow simmer. After a few moments, when the whites have just begun to set, drag the back of the slotted spoon gently across the top of the eggs, to move them off the pan bottom so they don’t stick. Cook the eggs for about 4 minutes, adjusting the heat as necessary.7. To test for doneness, lift 1 egg from the water with the slotted spoon and gently press both white and yolk. The whites should feel fully set but not too firm, and the yolks very soft. If you prefer firmer eggs, poach the eggs longer.8. When the eggs are set the way you like them, remove the eggs from the saucepan with the slotted spoon or strainer and immerse them in a bowl of warm tap water to wash off the vinegar. Set the spoon on a clean towel (or folded paper towels) for a moment to remove excess water. Immediately assemble the eggs Benedict.Assemble the eggs Benedict9. Just before serving, toast the bread circles or muffins lightly, butter both sides, and warm the ham and the optional truffle slices in a frying pan with a tablespoon butter.10. Center a toast round on each warm serving plate. Drape a slice of ham over the toast and top it with a poached egg. Spoon some hollandaise sauce generously over each egg and top with a warm truffle slice, if desired. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/eggs-benedict-598434', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}