{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/582913-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 582913, u'veryPopular': True, u'lowFodmap': False, u'title': u'Caramel Cheesecake – Cheesecake Factory', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 258.3, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'\xbc cup almonds, finely chopped', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'2-3 tablespoons of melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1\xbd pound of cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 1017, u'unit': u'pound'}, {u'originalString': u'5 Large eggs, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup of flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 teaspoons of lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'\xbc cup pecans, finely chopped', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'16 ounces of sour cream, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1056, u'unit': u'ounces'}, {u'originalString': u"2 teaspoons of vanilla (or any flavor extract you'd like)", u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [u"or any flavor extract you'd like)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'\xbe cup vanilla wafers, chopped', u'aisle': u'Sweet Snacks', u'name': u'vanilla wafers', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-wafers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 18609, u'unit': u'cup'}, {u'originalString': u'\xbc cup walnuts, finely choped', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://dailydishrecipes.com/caramel-cheesecake-cheesecake-factory-recipe-ccc/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'In a food processor, mix up all of the nuts and the vanilla wafer crumbs.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add butter to the mixture and mix well.Press the mixture into a spring form pan… even out the crust so it’s the same height all around, going up the sides of the pan as well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake at 350 for about 10 minutes and then allow to cool completely before adding the filling. Drop temperature of oven down to 325In a mixing bowl, beat the cream cheese until it is light and fluffy. On low, add the sugar, beating until it is creamy. I do all of this in my stand mixer, so I can add each egg individually. If you need to use a handheld mixer, beat well between each egg.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the flour, the vanilla and the lemon juice and mix everything together really well.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the sour cream and mix together well.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the cheesecake mixture into the spring form pan. Cook in a 325 degree oven for 1 hour and 15 minutes. Open the door slightly and allow the cheesecake to “rest” in the oven for an additional hour with the oven OFF.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven after an hour and allow to cool all the way to room temperature before you put it into the refrigerator for 24 hours.Trust me, it needs to be refrigerated that long. It gives all the flavors a chance to marry each other and will make the cheesecake rich and full of flavor. Reserve some of the cheesecake mixture to decorate with if you’d like or simply use whipped cream or topping.Enjoy!', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 749, u'instructions': u'In a food processor, mix up all of the nuts and the vanilla wafer crumbs. Add butter to the mixture and mix well.Press the mixture into a spring form pan… even out the crust so it’s the same height all around, going up the sides of the pan as well. Bake at 350 for about 10 minutes and then allow to cool completely before adding the filling. Drop temperature of oven down to 325In a mixing bowl, beat the cream cheese until it is light and fluffy. On low, add the sugar, beating until it is creamy. I do all of this in my stand mixer, so I can add each egg individually. If you need to use a handheld mixer, beat well between each egg.Add the flour, the vanilla and the lemon juice and mix everything together really well.Add the sour cream and mix together well.Pour the cheesecake mixture into the spring form pan. Cook in a 325 degree oven for 1 hour and 15 minutes. Open the door slightly and allow the cheesecake to “rest” in the oven for an additional hour with the oven OFF. Remove from the oven after an hour and allow to cool all the way to room temperature before you put it into the refrigerator for 24 hours.Trust me, it needs to be refrigerated that long. It gives all the flavors a chance to marry each other and will make the cheesecake rich and full of flavor. Reserve some of the cheesecake mixture to decorate with if you’d like or simply use whipped cream or topping.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-cheesecake-cheesecake-factory-582913', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}