{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549172-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 549172, u'veryPopular': True, u'lowFodmap': False, u'title': u'Reese’s Monster Cookies', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 25.24, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 cups creamy peanut butter (name brand works best)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [u'(name brand works best)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10116098, u'unit': u'cups'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cups'}, {u'originalString': u"3/4 cup m&m's", u'aisle': u'Sweet Snacks', u'name': u"m&m's", u'metaInformation': [], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19157, u'unit': u'cup'}, {u'originalString': u'4 1/2 cups quick oats', u'aisle': u'Cereal', u'name': u'oats', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u"3/4 cup Reese's Peanut Butter Cups, chopped", u'aisle': u'Sweet Snacks', u'name': u'peanut butter cups', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 19150, u'unit': u'cup'}, {u'originalString': u'1/2 cup raisins * optional', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup semi sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 stick softened, unsalted butter (8 tablespoons)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.ohsweetbasil.com/2014/03/reeses-monster-cookies-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat the oven to 350 degrees. In a large bowl or mixer, add the butter and peanut butter and mix until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [], u'step': u'Add the sugar and cream again.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the eggs, vanilla and salt and mix on low speed until everything is smooth. In a separate bowl, add the oats and baking soda and mix with a whisk, then dump into the creamed mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Add the raisins, chocolate chips, m&m's, and Reese's. Spoon onto a baking sheet and bake for 8-9 minutes. Enjoy!", u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'id': 19157, u'name': u'm&ms'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1795, u'instructions': u"Heat the oven to 350 degrees. In a large bowl or mixer, add the butter and peanut butter and mix until smooth. Add the sugar and cream again. Add the eggs, vanilla and salt and mix on low speed until everything is smooth. In a separate bowl, add the oats and baking soda and mix with a whisk, then dump into the creamed mixture. Add the raisins, chocolate chips, m&m's, and Reese's. Spoon onto a baking sheet and bake for 8-9 minutes. Enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/reeses-monster-cookies-549172', u'dishTypes': [], u'occasions': [u'halloween'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 13, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}