{u'recipes': [{u'sourceName': u'Nutmeg Nanny', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/586844-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 586844, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow Cooker Beef Barley Soup', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 307.31, u'creditText': u'Nutmeg Nanny', u'extendedIngredients': [{u'originalString': u'48oz. beef stock - more if needed', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 48.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'oz'}, {u'originalString': u'1 14oz. can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'6 carrots - chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2.5 lb. chuck roast - cut into bite size pieces*', u'aisle': u'Meat', u'name': u'chuck roast', u'metaInformation': [u'cut into bite size pieces*'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 13786, u'unit': u'lb'}, {u'originalString': u'1 green pepper - chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'2 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'2 medium onions - chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 cup pearl barley', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'pearl barley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20005, u'unit': u'cup'}, {u'originalString': u'1 teaspoon fresh cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'5 sprigs of fresh thyme - leaved pulled off stem', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 5.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.nutmegnanny.com/2011/12/07/slow-cooker-beef-barley-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add all ingredients to a large 6 quart slow cooker, give a quick stir and cook on low for 8-10 hours.Every few hours I like to give mine a stir and check the liquid level. If it looks as though there is not enough liquid you can add more stock or water.* I like to freeze my roast for about 20 minutes before cubing. It makes cutting the meat a bit easier.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 4577, u'instructions': u'Add all ingredients to a large 6 quart slow cooker, give a quick stir and cook on low for 8-10 hours.Every few hours I like to give mine a stir and check the liquid level. If it looks as though there is not enough liquid you can add more stock or water.* I like to freeze my roast for about 20 minutes before cubing. It makes cutting the meat a bit easier.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-beef-barley-soup-586844', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 600, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}