{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/444642-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 444642, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cinnamon Glazed Popcorn', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 259.39, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon dried orange peel', u'aisle': u'Produce', u'name': u'orange peel', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoon'}, {u'originalString': u'2 quarts popped popcorn', u'aisle': u'Savory Snacks', u'name': u'popcorn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 2.0, u'consistency': u'liquid', u'id': 19034, u'unit': u'quarts'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 67.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cinnamon-glazed-popcorn', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place popcorn in a greased 15-in. x 10-in. x 1-in. baking pan. In a small bowl, beat the egg white, sugar, orange peel, cinnamon and salt until well blended.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour over popcorn; toss to coat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}]}, {u'equipment': [], u'step': u'Bake at 300\xb0 for 30-35 minutes, stirring once. Cool completely. Store in an airtight container.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood can be paired with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bollinger Brut Special Cuvee with a 4.3 out of 5 star rating seems like a good match. It costs about 60 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'A golden color, distinctive of black grape varieties. Very fine bubbles. On the nose, it has a beautiful aromatic complexity, ripe fruit and spicy aromas, with hints of roasted apples, apple compote and peaches. On the palate, there is a subtle combination of structure, length and vivacity. The bubbles are like velvet. Flavors of pear, brioche and spicy aromas, notes of fresh walnut.Pair with all fish, especially sushi and sashimi, shellfish such as shrimp, prawns, crayfish and grilled lobster, poultry and white meat, cashews, parmesan or prosciutto.', u'title': u'Bollinger Brut Special Cuvee', u'price': u'$59.99', u'id': 433020, u'link': u'https://www.wine.com/product/bollinger-brut-special-cuvee/513', u'imageUrl': u'https://spoonacular.com/productImages/433020-312x231.jpg'}]}, u'aggregateLikes': 15, u'instructions': u'Directions                                                                                Place popcorn in a greased 15-in. x 10-in. x 1-in. baking pan. In a small bowl, beat the egg white, sugar, orange peel, cinnamon and salt until well blended.                                                                                            Pour over popcorn; toss to coat. Bake at 300\xb0 for 30-35 minutes, stirring once. Cool completely. Store in an airtight container.                                        Yield: 2 quarts.                                                                                                                         Originally published as Cinnamon Popcorn in  Quick CookingSeptember/October 2004, p58                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cinnamon-glazed-popcorn-444642', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}