{u'recipes': [{u'sourceName': u'Recipes Food and Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/513637-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 513637, u'veryPopular': False, u'lowFodmap': False, u'title': u'Meatballs with Caramelized Onion Mushroom Gravy', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 206.77, u'creditText': u'Recipes Food and Cooking', u'extendedIngredients': [{u'originalString': u'2 tablespoons beef base', u'aisle': u'Canned and Jarred', u'name': u'beef base', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1016076, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup cracker crumbs', u'aisle': u'Savory Snacks', u'name': u'cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10018621, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 minced garlic clove', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 – 3 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'Gravy', u'aisle': u'Canned and Jarred', u'name': u'gravy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 6997, u'unit': u'servings'}, {u'originalString': u'1 lb. ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'Meatballs', u'aisle': u'Meat', u'name': u'meatballs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'unitLong': u'ball', u'unitShort': u'balls', u'amount': 1.0, u'consistency': u'solid', u'id': 10110219, u'unit': u'balls'}, {u'originalString': u'1 lb. sliced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'lb'}, {u'originalString': u'1 teaspoon oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup finely chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 tablespoon Worcestershire Sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://recipesfoodandcooking.com/2013/01/15/meatballs-with-caramelized-onion-mushroom-gravy/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put all meatball ingredients in a bowl and mix it together. This is easiest done with your hands.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}]}, {u'equipment': [], u'step': u'Mix together for several minutes.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll meat mixture into walnut sized balls and place on a greased cookie sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 400 degrees for 15 minutes.While the meatballs are baking start the gravy by browning the onions in oil until they start to caramelize.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'id': 6997, u'name': u'gravy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add garlic, continue to cook for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add mushrooms and cook for another 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add water, beef base, salt and pepper. Bring to a boil and add meatballs. Simmer for 15 minutes or longer gently. Stir together cornstarch and 1/4 cup of water. Stir into meatballs. Cook for 5 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'id': 1016076, u'name': u'beef base'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'id': 10110219, u'name': u'meatballs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 31, u'instructions': u'Put all meatball ingredients in a bowl and mix it together. This is easiest done with your hands. Mix together for several minutes. Roll meat mixture into walnut sized balls and place on a greased cookie sheet. Bake at 400 degrees for 15 minutes.While the meatballs are baking start the gravy by browning the onions in oil until they start to caramelize. Add garlic, continue to cook for 15 minutes. Add mushrooms and cook for another 5 minutes. Add water, beef base, salt and pepper. Bring to a boil and add meatballs. Simmer for 15 minutes or longer gently. Stir together cornstarch and 1/4 cup of water. Stir into meatballs. Cook for 5 minutes. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatballs-with-caramelized-onion-mushroom-gravy-513637', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}