{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/597193-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 597193, u'veryPopular': False, u'lowFodmap': False, u'title': u'Summertime Pasta Primavera', u'diets': [], u'pricePerServing': 314.75, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'1 bunch asparagus, trimmed and cut into bite-sized pieces', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed', u'cut into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'bunch'}, {u'originalString': u'1 pint cherry tomatoes, cut in half', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'pint'}, {u'originalString': u'Fresh basil for garnish', u'aisle': u'Produce', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2044, u'unit': u'servings'}, {u'originalString': u'1/4 cup half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1 cup ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1036, u'unit': u'cup'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'8 ounces short pasta (I like campagnelle for this recipe, but penne or ziti will work just as well)', u'aisle': u'Pasta and Rice', u'name': u'short pasta', u'metaInformation': [u'for this recipe, but penne or ziti will work just as well)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 20499, u'unit': u'ounces'}, {u'originalString': u'1 small summer squash, quartered and sliced', u'aisle': u'Produce', u'name': u'summer squash', u'metaInformation': [u'small', u'sliced', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11641, u'unit': u''}, {u'originalString': u'1/2 cup chopped walnuts', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 65.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.framedcooks.com/2013/06/summertime-pasta-primavera.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook pasta according to package directions, adding in the asparagus and squash in the last 2 minutes of cooking time.  Scoop out 1/2 cup of pasta water, and then drain.2. While the pasta is cooking, mix together the ricotta and the half and half.  Season to taste with salt and pepper, and thin with the pasta water as needed to make a light sauce.3. Gently toss together pasta with cooked vegetables and the sauce.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}, {u'equipment': [], u'step': u'Add the cherry tomatoes and walnuts and gently toss again.  Scatter with basil, grind some fresh pepper on top and serve!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10311529, u'name': u'cherry tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'aggregateLikes': 220, u'instructions': u'1. Cook pasta according to package directions, adding in the asparagus and squash in the last 2 minutes of cooking time.  Scoop out 1/2 cup of pasta water, and then drain.2. While the pasta is cooking, mix together the ricotta and the half and half.  Season to taste with salt and pepper, and thin with the pasta water as needed to make a light sauce.3. Gently toss together pasta with cooked vegetables and the sauce.  Add the cherry tomatoes and walnuts and gently toss again.  Scatter with basil, grind some fresh pepper on top and serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/summertime-pasta-primavera-597193', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}