{u'recipes': [{u'sourceName': u'An Edible Mosaic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/612662-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 612662, u'veryPopular': True, u'lowFodmap': False, u'title': u'Flourless Chocolate Pear Hazelnut Cake with Bahlsen Waffeletten', u'diets': [], u'preparationMinutes': 35, u'pricePerServing': 110.67, u'creditText': u'An Edible Mosaic', u'extendedIngredients': [{u'originalString': u'3/4 teaspoon coarse sea salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup (20 g) cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 19165, u'unit': u'g'}, {u'originalString': u'1/2 (3 1/2 oz/100 g) box Bahlsen Waffeletten (Dark) cookies, coarsely chopped', u'aisle': u'Sweet Snacks', u'name': u'cookies', u'metaInformation': [u'dark', u'coarsely chopped', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 10118192, u'unit': u''}, {u'originalString': u'1/8 teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'6 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup (85 g) hazelnut meal', u'aisle': u'Gluten Free;Health Foods', u'name': u'hazelnut meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 93810, u'unit': u'g'}, {u'originalString': u'1/4 cup toasted hazelnuts, coarsely chopped', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'toasted', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12120, u'unit': u'cup'}, {u'originalString': u'1/2 cup (120 ml) heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 120.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'ml'}, {u'originalString': u'3/4 cup (162 g) light brown sugar, lightly packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 162.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'1 teaspoon hazelnut extract', u'aisle': u'Baking', u'name': u'hazelnut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12120, u'unit': u'teaspoon'}, {u'originalString': u'3/4 lb (340 g) semisweet (60% cacao) chocolate, broken into pieces', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [u'60%', u'( cacao)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 340.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'g'}, {u'originalString': u'1/2 cup (70 g) smooth pear butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'smooth peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 70.0, u'consistency': u'solid', u'id': 16150, u'unit': u'g'}, {u'originalString': u'3/4 cup (170 g) unsalted butter, plus more for greasing the pan', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'plus more for greasing the pan'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 170.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'1 1/2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.anediblemosaic.com/?p=18255', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350F. Generously grease a 9-inch springform pan with butter and line the bottom with a round piece of parchment paper; set aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Add the hazelnut meal, cocoa powder, sea salt, cream of tartar, and 1/2 box Bahlsen Waffeletten cookies to a food processor and pulse until the cookies are completely crumbled; set aside.Melt the chocolate and butter together in a microwave or double boiler. Stir in the pear butter, vanilla extract, and hazelnut extract.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': None, u'id': 93810, u'name': u'hazelnut meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in the hazelnut meal mixture.Use a handheld electric mixer to beat the eggs and brown sugar together in a large bowl until theyre pale golden, light and fluffy, and nearly doubled in volume, about 10 minutes. Stir 1/3 of the fluffy egg mixture into the chocolate mixture. Once incorporated, fold in another 1/3 of the egg mixture until nearly completely incorporated, and then fold in the remaining 1/3 of the egg mixture. Be careful not to over-mix or deflate the eggs completely; a few streaks of egg in the batter is fine.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': None, u'id': 93810, u'name': u'hazelnut meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}], u'step': u'Pour the batter into the prepared springform pan.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake until the cake is set and a wooden pick inserted in the center comes out with just a couple crumbs (do not bake until a wooden pick comes out clean because the cake will be overcooked), about 55 to 60 minutes.Straight out of the oven, transfer the cake to a wire rack to cool completely to room temperature. Once cooled, cover the cake and transfer it to the fridge to chill for 4 hours or overnight. Once chilled, run a knife along the edge of the cake to help loosen it from the pan, and then invert the cake onto a cake platter and peel off the parchment paper.For the ganache, melt the chocolate and heavy cream together in a microwave or double boiler just until the chocolate is melted (being careful not to overheat), and gently stir to combine.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'Let the ganache cool a couple minutes, and then starting in the center, spread it across the top of the inverted cake, letting it drip down the sides.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the toppings decoratively to the top.Chill the cake until the ganache sets (about 1 hour) before slicing and serving; store any leftovers wrapped in the fridge.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 432, u'instructions': u'Preheat oven to 350F. Generously grease a 9-inch springform pan with butter and line the bottom with a round piece of parchment paper; set aside.Add the hazelnut meal, cocoa powder, sea salt, cream of tartar, and 1/2 box Bahlsen Waffeletten cookies to a food processor and pulse until the cookies are completely crumbled; set aside.Melt the chocolate and butter together in a microwave or double boiler. Stir in the pear butter, vanilla extract, and hazelnut extract. Mix in the hazelnut meal mixture.Use a handheld electric mixer to beat the eggs and brown sugar together in a large bowl until theyre pale golden, light and fluffy, and nearly doubled in volume, about 10 minutes. Stir 1/3 of the fluffy egg mixture into the chocolate mixture. Once incorporated, fold in another 1/3 of the egg mixture until nearly completely incorporated, and then fold in the remaining 1/3 of the egg mixture. Be careful not to over-mix or deflate the eggs completely; a few streaks of egg in the batter is fine.Pour the batter into the prepared springform pan. Bake until the cake is set and a wooden pick inserted in the center comes out with just a couple crumbs (do not bake until a wooden pick comes out clean because the cake will be overcooked), about 55 to 60 minutes.Straight out of the oven, transfer the cake to a wire rack to cool completely to room temperature. Once cooled, cover the cake and transfer it to the fridge to chill for 4 hours or overnight. Once chilled, run a knife along the edge of the cake to help loosen it from the pan, and then invert the cake onto a cake platter and peel off the parchment paper.For the ganache, melt the chocolate and heavy cream together in a microwave or double boiler just until the chocolate is melted (being careful not to overheat), and gently stir to combine. Let the ganache cool a couple minutes, and then starting in the center, spread it across the top of the inverted cake, letting it drip down the sides. Add the toppings decoratively to the top.Chill the cake until the ganache sets (about 1 hour) before slicing and serving; store any leftovers wrapped in the fridge.', u'spoonacularSourceUrl': u'https://spoonacular.com/flourless-chocolate-pear-hazelnut-cake-with-bahlsen-waffeletten-612662', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}