{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/552752-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 552752, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spanakopita Dip {Spinach & Feta with Dill}', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 71.03, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'1 - 2 oz. feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1019, u'unit': u'oz'}, {u'originalString': u'1 teaspoon dried dill (fresh would be even better!)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'dried', u'fresh', u'( would be even better!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup frozen spinach, thawed, with all the moisture squeezed out (measured AFTER toweling out the wetness)', u'aisle': u'Frozen', u'name': u'frozen spinach', u'metaInformation': [u'frozen', u'with all the moisture squeezed out (measured after toweling out the wetness)', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11463, u'unit': u'cup'}, {u'originalString': u'1 clove of garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1/4 cup light mayonnaise', u'aisle': u'Condiments', u'name': u'light mayonnaise', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4641, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'1/4 - 1/2 teaspoon salt (more or less to taste)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'(more or less )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'About 1 Tablespoon finely chopped sun-dried tomato', u'aisle': u'Canned and Jarred;Produce', u'name': u'sun dried tomato', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11955, u'unit': u'Tablespoon'}, {u'originalString': u'1/4 of a sweet onion', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/spanakopita-dip-spinach-feta-with-dill/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'First, thaw your spinach and with a clean towel (that you don\'t mind if it turns a little "green"), towel off all the excess moisture. The spinach will be very dense. You want about 1/2 cup of this dense  green stuff. Now, put the spinach in a handi chopper with the garlic, onion, mayo, dill, salt, onion powder and feta cheese and pulse until everything is finely chopped and blended. Scrape the spinach mixture out of the food processor into a bowl and stir in the Greek yogurt and the sun dried tomato. Put in the fridge for at least an hour before serving to let the flavors meld.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sundried-tomatoes.png', u'id': 11955, u'name': u'sun dried tomatoes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve with toasted ciabatta or other crusty bread (or veggies!). Or spread it on a sandwich.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip can be paired with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 899, u'instructions': u'First, thaw your spinach and with a clean towel (that you don\'t mind if it turns a little "green"), towel off all the excess moisture. The spinach will be very dense. You want about 1/2 cup of this dense  green stuff. Now, put the spinach in a handi chopper with the garlic, onion, mayo, dill, salt, onion powder and feta cheese and pulse until everything is finely chopped and blended. Scrape the spinach mixture out of the food processor into a bowl and stir in the Greek yogurt and the sun dried tomato. Put in the fridge for at least an hour before serving to let the flavors meld.Serve with toasted ciabatta or other crusty bread (or veggies!). Or spread it on a sandwich.', u'spoonacularSourceUrl': u'https://spoonacular.com/spanakopita-dip-spinach-feta-with-dill-552752', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}