{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/549727-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 549727, u'veryPopular': True, u'lowFodmap': False, u'title': u'Homemade Barbecue Sauce……Just like Sweet Baby Ray’s', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 38.4, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u"1/4-1/2 teaspoon cayenne pepper (use less if you don't like the heat)", u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u"(use less if you don't like the heat)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'1 cup dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'2 1/2 teaspoons ground mustard', u'aisle': u'Spices and Seasonings', u'name': u'ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoons'}, {u'originalString': u'1 1/4 cups ketchup, preferably organic', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 11935, u'unit': u'cups'}, {u'originalString': u'1 1/2 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19304, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup pineapple juice (or you can sub apple cider vinegar)', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [u'canned', u'(or you can sub apple cider vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9273, u'unit': u'cup'}, {u'originalString': u'2 teaspoons smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon worchestire sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'tablespoon'}, {u'originalString': u'1/8 cold water mixed with 1 tablespoon corn starch (optional)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'mixed', u'with 1 tablespoon corn starch ', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.125, u'consistency': u'liquid', u'id': 14412, u'unit': u''}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.halfbakedharvest.com/homemade-barbecue-sauce-just-like-sweet-baby-rays/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine all the ingredients except the water and corn starch mixture in a medium size sauce pot. Bring to a boil and reduce and simmer for five minutes or until all the sugar has dissolved. If you like a thicker BBQ Sauce add the water and corn starch mixture. Simmer until desired thickness is reached, but watch closely. It thickens really fast!', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve immediately or cover and store in fridge.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 25657, u'instructions': u'Combine all the ingredients except the water and corn starch mixture in a medium size sauce pot. Bring to a boil and reduce and simmer for five minutes or until all the sugar has dissolved. If you like a thicker BBQ Sauce add the water and corn starch mixture. Simmer until desired thickness is reached, but watch closely. It thickens really fast! Serve immediately or cover and store in fridge.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-barbecue-saucejust-like-sweet-baby-rays-549727', u'dishTypes': [u'sauce'], u'occasions': [u"father's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}