{u'recipes': [{u'sourceName': u'Oh Sweet Basil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/717872-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 717872, u'veryPopular': False, u'lowFodmap': False, u'title': u'Restaurant Worthy Crunchy Chicken Fingers', u'diets': [], u'preparationMinutes': 240, u'pricePerServing': 70.24, u'creditText': u'Oh Sweet Basil', u'extendedIngredients': [{u'originalString': u'\xbd Teaspoon Baking Powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'Teaspoon'}, {u'originalString': u'\xbd Cup Buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1230, u'unit': u'Cup'}, {u'originalString': u'\xbc Cup Corn Flakes, crushed', u'aisle': u'Cereal', u'name': u'corn flakes', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 8020, u'unit': u'Cup'}, {u'originalString': u'1 Egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd Cup Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'Cup'}, {u'originalString': u'\xbc Cup Panko Bread Crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'Cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10018079, u'unit': u'Cup'}, {u'originalString': u'1 Quart Peanut Oil (or canola) for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [u'for frying', u'(or canola)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 4042, u'unit': u''}, {u'originalString': u'\xbc Teaspoon Pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'Teaspoon'}, {u'originalString': u'1 Teaspoon Season Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'Teaspoon'}, {u'originalString': u'2 Boneless, skinless Chicken Breast, sliced in strips', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless', u'sliced in strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.ohsweetbasil.com/restaurant-worthy-crunchy-chicken-fingers.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Place the egg, buttermilk and chicken in a ziploc bag and place in the fridge for 4 hours.In a pie dish, mix the corn flakes, bread crumbs, flour, baking powder, seasoning and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes.jpg', u'id': 8020, u'name': u'corn flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Heat the oil to medium or 350 degrees.Take the chicken out of the bag and dredge in the dry mixture, back in the buttermilk and then back in the dry mixture again. Fry, turning occasionally until golden, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The District 7 Estate Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 153, u'instructions': u'Place the egg, buttermilk and chicken in a ziploc bag and place in the fridge for 4 hours.In a pie dish, mix the corn flakes, bread crumbs, flour, baking powder, seasoning and pepper.Heat the oil to medium or 350 degrees.Take the chicken out of the bag and dredge in the dry mixture, back in the buttermilk and then back in the dry mixture again. Fry, turning occasionally until golden, about 5 minutes. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/restaurant-worthy-crunchy-chicken-fingers-717872', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 245, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}