{u'recipes': [{u'sourceName': u'Call Me PMC', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/625179-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 625179, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apricot Almond Energy Bars', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 119.97, u'creditText': u'Call Me PMC', u'extendedIngredients': [{u'originalString': u'2 cups almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cups'}, {u'originalString': u'1 tablespoon chia seeds', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12006, u'unit': u'tablespoon'}, {u'originalString': u'2 cup dates', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9087, u'unit': u'cup'}, {u'originalString': u'2 cup dried apricots', u'aisle': u'Dried Fruits;Produce', u'name': u'dried apricots', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-apricots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9032, u'unit': u'cup'}, {u'originalString': u'4 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons old-fashion rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 8120, u'unit': u'tablespoons'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 63.0, u'sourceUrl': u'http://www.callmepmc.com/2015/01/apricot-almond-energy-bars-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line a 8x8 inch pan with aluminum foil or waxed paper, spray with non-stick spray if using foil.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add all ingredients to a food processor. Pulse until mixture is the consistency you prefer. I go for medium texture, as seen.Dump mixture into pan and press flat using your fingertips. Press firmly so mixture sticks together.You can eat it right away or allow to set and it will stick and hold together better.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 19, u'instructions': u'Line a 8x8 inch pan with aluminum foil or waxed paper, spray with non-stick spray if using foil.Add all ingredients to a food processor. Pulse until mixture is the consistency you prefer. I go for medium texture, as seen.Dump mixture into pan and press flat using your fingertips. Press firmly so mixture sticks together.You can eat it right away or allow to set and it will stick and hold together better.', u'spoonacularSourceUrl': u'https://spoonacular.com/apricot-almond-energy-bars-625179', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}