{u'recipes': [{u'sourceName': u'A Farm Girls Dabbles', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/617596-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 617596, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pickled Vegetables {quick and easy refrigerator pickles!}', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 109.99, u'creditText': u'A Farm Girls Dabbles', u'extendedIngredients': [{u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'6 c. thinly sliced vegetables - use any combination of carrots, golden beets, sweet bell peppers, celery, cucumbers, cauliflower, etc.', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'sweet', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 11124, u'unit': u'c'}, {u'originalString': u'1/2 c. cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 2048, u'unit': u'c'}, {u'originalString': u'6 sprigs fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 6.0, u'consistency': u'solid', u'id': 2045, u'unit': u'sprigs'}, {u'originalString': u'2 large garlic cloves, thinly sliced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2-1/2 T. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'T'}, {u'originalString': u'1/2 T. peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'peppercorns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022030, u'unit': u'T'}, {u'originalString': u'1 c. rice wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'c'}, {u'originalString': u'3/4 c. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'1/2 c. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'c'}, {u'originalString': u'2 T. yellow mustard seeds', u'aisle': u'Spices and Seasonings', u'name': u'yellow mustard seeds', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2024, u'unit': u'T'}, {u'originalString': u'1/2 of a sweet yellow onion, thinly sliced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'sweet', u'yellow', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.afarmgirlsdabbles.com/2014/10/20/pickled-vegetables-recipe-quick-easy/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large heat-safe bowl, combine onion, garlic, and your choice of vegetables. Then top with the dill.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Place mustard seeds and peppercorns in a small ziplock bag, cover the bag with a towel, and use a kitchen mallet or rolling pin to crack the mustard seeds and peppercorns up a bit. Then pour them into a coffee filter, add the bay leaf, and tie the filter securely with kitchen string.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the spices to a medium sized pan along with the vinegars, water, sugar, and salt. Bring to a boil and stir until sugar dissolves.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour boiling mixture, along with the spices, evenly over vegetables.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let come to room temperature, give everything a stir, and then cover and refrigerate. After 24 hours, discard the spices and transfer pickled vegetables to a large jar or a few smaller jars if desired. Keeps very well for up to a month stored in the refrigerator.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 245, u'instructions': u'In a large heat-safe bowl, combine onion, garlic, and your choice of vegetables. Then top with the dill. Place mustard seeds and peppercorns in a small ziplock bag, cover the bag with a towel, and use a kitchen mallet or rolling pin to crack the mustard seeds and peppercorns up a bit. Then pour them into a coffee filter, add the bay leaf, and tie the filter securely with kitchen string. Add the spices to a medium sized pan along with the vinegars, water, sugar, and salt. Bring to a boil and stir until sugar dissolves. Pour boiling mixture, along with the spices, evenly over vegetables. Let come to room temperature, give everything a stir, and then cover and refrigerate. After 24 hours, discard the spices and transfer pickled vegetables to a large jar or a few smaller jars if desired. Keeps very well for up to a month stored in the refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/pickled-vegetables-quick-and-easy-refrigerator-pickles-617596', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}