{u'recipes': [{u'sourceName': u'Fifteen Spatulas', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/558937-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 558937, u'veryPopular': False, u'lowFodmap': False, u'title': u'Barley Risotto with Asparagus and Parmigiano', u'diets': [], u'pricePerServing': 176.97, u'creditText': u'Fifteen Spatulas', u'extendedIngredients': [{u'originalString': u'1/2 lb asparagus spears, pre-boiled for 2 minutes', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'for 2 minutes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11011, u'unit': u'lb'}, {u'originalString': u'3-4 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1/2 a small onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 cup grated parmigiano reggiano (to taste)', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'grated', u'to taste', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'chopped parsley or basil, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'3/4 cup pearled barley', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'pearled barley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20005, u'unit': u'cup'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup brandy, or do 1/2 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14084, u'unit': u'cup'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.fifteenspatulas.com/barley-risotto-with-asparagus-and-parmigiano/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the chicken stock into a saucepan and bring to a boil.  Reduce to a simmer and place a lid on the pot to keep it warm.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat up another pot over medium heat, then add the olive oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the onion to the pot and cook for 5 minutes, until slightly softened.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the barley and toast for 2 minutes, stirring frequently.  Toasting will prevent the barley shell from breaking later on.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the brandy, and cook for another minute until the brandy is absorbed.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the hot stock a little bit at a time, adding just enough to cover the surface of the barley.  Stir the barley frequently.  Once the liquid is absorbed, add stock again, and repeat this process for the next 25 minutes or so, until the barley is al dente.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the heat and stir in the parmesan, asparagus, and herbs.  Enjoy!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chianti, Trebbiano, and Verdicchio are great choices for Risotto. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Felsina Chianti Colli Senesi with a 4.1 out of 5 star rating seems like a good match. It costs about 21 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 78, u'instructions': u'Pour the chicken stock into a saucepan and bring to a boil.  Reduce to a simmer and place a lid on the pot to keep it warm.Heat up another pot over medium heat, then add the olive oil.  Add the onion to the pot and cook for 5 minutes, until slightly softened.  Add the barley and toast for 2 minutes, stirring frequently.  Toasting will prevent the barley shell from breaking later on. Add the brandy, and cook for another minute until the brandy is absorbed.Add the hot stock a little bit at a time, adding just enough to cover the surface of the barley.  Stir the barley frequently.  Once the liquid is absorbed, add stock again, and repeat this process for the next 25 minutes or so, until the barley is al dente. Remove from the heat and stir in the parmesan, asparagus, and herbs.  Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/barley-risotto-with-asparagus-and-parmigiano-558937', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}