{u'recipes': [{u'sourceName': u'Cookin Canuck', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/794046-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 794046, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegetable Hand Roll (Temaki) with Avocado Wasabi Yogurt', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 67.38, u'creditText': u'Cookin Canuck', u'extendedIngredients': [{u'originalString': u'\xbd California avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'\xbe California avocado, cut into 12 slices', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'cut into 12 slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.75, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 \xbd cups cooked brown rice', u'aisle': u'Pasta and Rice', u'name': u'cooked brown rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20041, u'unit': u'cups'}, {u'originalString': u'1 6-inch piece English cucumber, cut lengthwise into 12 strips', u'aisle': u'Produce', u'name': u'english cucumber', u'metaInformation': [u'english', u'cut lengthwise into 12 strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10111205, u'unit': u'piece'}, {u'originalString': u'1 tsp grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'3 sheet nori (seaweed sheets)', u'aisle': u'Ethnic Foods', u'name': u'nori', u'metaInformation': [u'(seaweed sheets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'unitLong': u'sheets', u'unitShort': u'sheet', u'amount': 3.0, u'consistency': u'liquid', u'id': 11446, u'unit': u'sheet'}, {u'originalString': u'\xbc cup plain nonfat yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain nonfat yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1118, u'unit': u'cup'}, {u'originalString': u'\xbd red bell pepper, cut into 12 strips', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cut into 12 strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'\xbc tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1\xbd tsp low sodium soy sauce (or tamari for gluten free)', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'gluten free', u'low sodium', u'for )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 16124, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp wasabi paste', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'wasabi paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wasabi-paste.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 10011990, u'unit': u'tsp'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.cookincanuck.com/2016/07/vegetable-hand-roll-recipe-temaki-avocado-wasabi-yogurt/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, mash the avocado with the back of a fork until smooth. Stir in the yogurt, ginger, soy sauce, wasabi paste and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wasabi-paste.jpg', u'id': 10011990, u'name': u'wasabi paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}], u'step': u'Cut each sheet of nori in half, using scissors.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}]}, {u'equipment': [], u'step': u'Place  cup of rice at the end of each piece of nori. Spoon 1 tablespoon of the avocado yogurt over the rice. Top with 2 slices each of avocado, cucumber and red bell pepper.Fold the bottom corner of the nori diagonally over the rice and vegetables. Continue to roll until a cone is formed.Repeat with the remaining 5 sheets of nori, sauce and vegetables.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 349, u'instructions': u'In a small bowl, mash the avocado with the back of a fork until smooth. Stir in the yogurt, ginger, soy sauce, wasabi paste and salt.Cut each sheet of nori in half, using scissors.Place  cup of rice at the end of each piece of nori. Spoon 1 tablespoon of the avocado yogurt over the rice. Top with 2 slices each of avocado, cucumber and red bell pepper.Fold the bottom corner of the nori diagonally over the rice and vegetables. Continue to roll until a cone is formed.Repeat with the remaining 5 sheets of nori, sauce and vegetables. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetable-hand-roll-temaki-with-avocado-wasabi-yogurt-794046', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}