{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/476599-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 476599, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Coconut Nests', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 60.17, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'2 cups chow mein noodles', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'chow mein noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/udon-noodles.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93803, u'unit': u'cups'}, {u'originalString': u'24 ounces chocolate chips (your preference for milk, semi-sweet or dark)', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark', u'for milk, semi-sweet or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'ounces'}, {u'originalString': u'2 cups sweetened coconut flake', u'aisle': u'Baking', u'name': u'flake coconut', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12108, u'unit': u'cups'}, {u'originalString': u'72 small egg shaped chocolate candies', u'aisle': u'Sweet Snacks', u'name': u"M&M'S Chocolate Candies", u'metaInformation': [u'small'], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'', u'unitShort': u'', u'amount': 72.0, u'consistency': u'solid', u'id': 19157, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://addapinch.com/cooking/2013/03/28/chocolate-coconut-nests-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Prepare two sheet pans with parchment paper. Set aside.Melt chocolate chips according to package instructions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Add chow mein noodles and coconut to the melted chocolate and carefully combine until noodles and coconut are well-coated with the chocolate.Heap teaspoons full of mixture and drop onto parchment paper. Carefully press 3 small egg shapped chocolate candies into each, forming a "nest". Allow to cool.You may also into the freezer for 10 minutes to firm more quickly, if desired.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/udon-noodles.png', u'id': 93803, u'name': u'chow mein noodles'}]}, {u'equipment': [], u'step': u'Serve or store in an airtight container.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 330, u'instructions': u'Prepare two sheet pans with parchment paper. Set aside.Melt chocolate chips according to package instructions. Add chow mein noodles and coconut to the melted chocolate and carefully combine until noodles and coconut are well-coated with the chocolate.Heap teaspoons full of mixture and drop onto parchment paper. Carefully press 3 small egg shapped chocolate candies into each, forming a "nest". Allow to cool.You may also into the freezer for 10 minutes to firm more quickly, if desired.Serve or store in an airtight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-coconut-nests-476599', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 17, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}