{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/471668-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 471668, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easter Meat Pie', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 214.01, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 pound cooked ham, chopped', u'aisle': u'Meat', u'name': u'cooked ham', u'metaInformation': [u'cooked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7214, u'unit': u'pound'}, {u'originalString': u'6 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'8 ounces mozzarella cheese, grated', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1026, u'unit': u'ounces'}, {u'originalString': u'1/4 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1/4 pound prosciutto, chopped', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 10010123, u'unit': u'pound'}, {u'originalString': u'2 pounds ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 1036, u'unit': u'pounds'}, {u'originalString': u'1/2 pound Genoa salami, chopped', u'aisle': u'Meat', u'name': u'salami', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 7071, u'unit': u'pound'}, {u'originalString': u'4 (9 inch) unbaked pie crusts', u'aisle': u'Refrigerated', u'name': u'unbaked pie crusts', u'metaInformation': [u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'9-inchs', u'unitShort': u'9-inch', u'amount': 4.0, u'consistency': u'solid', u'id': 18334, u'unit': u'9-inch'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Easter-Meat-Pie/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees F (165 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place ricotta in a large mixing bowl and add eggs one at a time while mixing on low speed. Stir in mozzarella, ham, salami, and prosciutto until all ingredients are well combined. Line two 9 inch pans with pastry. Spoon half of mixture into each pan. Sprinkle half of the Parmesan cheese over each pie, then cover with top pastry. Crimp edges and cut steam vents in tops.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'id': 7071, u'name': u'salami'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 1 hour, until crust is golden brown. Cool on racks.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 469, u'instructions': u'Preheat oven to 325 degrees F (165 degrees C).                            Place ricotta in a large mixing bowl and add eggs one at a time while mixing on low speed. Stir in mozzarella, ham, salami, and prosciutto until all ingredients are well combined. Line two 9 inch pans with pastry. Spoon half of mixture into each pan. Sprinkle half of the Parmesan cheese over each pie, then cover with top pastry. Crimp edges and cut steam vents in tops.                            Bake in preheated oven for 1 hour, until crust is golden brown. Cool on racks.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/easter-meat-pie-471668', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}