{u'recipes': [{u'sourceName': u'The Wanderlust Kitchen', u'cuisines': [u'african'], u'image': u'https://spoonacular.com/recipeImages/715038-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 715038, u'veryPopular': False, u'lowFodmap': False, u'title': u'Harissa Shakshuka (North African Eggs in Purgatory)', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 182.98, u'creditText': u'The Wanderlust Kitchen', u'extendedIngredients': [{u'originalString': u'\xbc teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 (14-ounce) can no-salt-added diced tomatoes, with juices', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'with juices', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'Crusty bread for serving', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10018029, u'unit': u'servings'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons minced fresh garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'2 ounces goat cheese, thinly sliced into coins', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'thinly sliced into coins'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon harissa spice mix', u'aisle': u'Spices and Seasonings', u'name': u'spice mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup chopped yellow onion', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://thewanderlustkitchen.com/harissa-shakshuka-north-african-eggs-purgatory/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees Fahrenheit.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a oven-safe skillet set over medium-low heat. Once the oil is shimmering, add the onions and saut until soft, about 5-7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic and harissa; saut until fragrant, about 60 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour in the tomatoes and season the mixture with the salt and pepper. Simmer the mixture, using a wooden spoon to help break down the tomatoes, until thickened, about 10 minutes.Arrange the goat cheese slices around the pan and turn off the heat. Crack the eggs into a small dish, then add them to the pan one at a time. Season each egg with additional salt and pepper, then bake in the preheated until the whites are set, about 7-10 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Shakshuka works really well with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. The Bellafina Prosecco with a 4.6 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u"Intensely aromatic and crisp on the palate, with aromas and flavorsof yellow apple, white peach, pear and notes of white flowers.Excellent as an aperitif, it is a perfect accompaniment to hors-d'oeuvres and delicate first courses. Also wonderful with fish and shellfish.", u'title': u'Bellafina Prosecco', u'price': u'$11.99', u'id': 461572, u'link': u'https://www.wine.com/product/bellafina-prosecco/136821', u'imageUrl': u'https://spoonacular.com/productImages/461572-312x231.jpg'}]}, u'aggregateLikes': 45, u'instructions': u'Preheat the oven to 375 degrees Fahrenheit.Heat the olive oil in a oven-safe skillet set over medium-low heat. Once the oil is shimmering, add the onions and saut until soft, about 5-7 minutes. Add the garlic and harissa; saut until fragrant, about 60 seconds.Pour in the tomatoes and season the mixture with the salt and pepper. Simmer the mixture, using a wooden spoon to help break down the tomatoes, until thickened, about 10 minutes.Arrange the goat cheese slices around the pan and turn off the heat. Crack the eggs into a small dish, then add them to the pan one at a time. Season each egg with additional salt and pepper, then bake in the preheated until the whites are set, about 7-10 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/harissa-shakshuka-north-african-eggs-in-purgatory-715038', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}