{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/595220-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 595220, u'veryPopular': True, u'lowFodmap': False, u'title': u'Parmesan Chicken Nuggets', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 135.91, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'\xbc cup (half stick) butter melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'(half stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 cup Panko bread crumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'\xbd cup freshly grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 \xbd pounds boneless skinless chicken breasts cut into one inch cubes', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cut into one inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.afamilyfeast.com/parmesan-chicken-nuggets/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix bread crumbs with Parmesan cheese in a medium bowl.Dip chicken cubes in melted butter then bread crumb mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Place on sheet tray lined with parchment paper or use cooking spray.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Bake for 15 minutes. If not browned enough, place under the broiler just long enough to brown.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with marinara sauce or honey Dijon ranch dressing.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'citrus , fruity , pineapple', u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 4914, u'instructions': u'Preheat oven to 375 degrees.Mix bread crumbs with Parmesan cheese in a medium bowl.Dip chicken cubes in melted butter then bread crumb mixture.  Place on sheet tray lined with parchment paper or use cooking spray. Bake for 15 minutes. If not browned enough, place under the broiler just long enough to brown.  Serve with marinara sauce or honey Dijon ranch dressing.', u'spoonacularSourceUrl': u'https://spoonacular.com/parmesan-chicken-nuggets-595220', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}