{u'recipes': [{u'sourceName': u'Martha Stewart', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/8418-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 8418, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Steak Sandwiches With Goat Cheese And Arugula', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 365.41, u'creditText': u'Martha Stewart', u'extendedIngredients': [{u'originalString': u'2 bunches arugula (about 10 ozs total), stems trimmed', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [u'trimmed', u'( 10 ozs total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'bunches', u'unitShort': u'bunches', u'amount': 2.0, u'consistency': u'solid', u'id': 11959, u'unit': u'bunches'}, {u'originalString': u'2 baguettes, split', u'aisle': u'Bakery/Bread', u'name': u'baguettes', u'metaInformation': [u'split'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'Coarse salt and ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'5 ozs fresh goat cheese, room temperature', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'fresh', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ozs'}, {u'originalString': u'1/4 cup grainy mustard', u'aisle': u'Condiments', u'name': u'grainy mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-grain-mustard.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1012046, u'unit': u'cup'}, {u'originalString': u'1 large red onion, sliced 1/2 inch thick', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'3 boneless rib-eye steaks (each about 1 lb and 1 inch thick), excess fat removed', u'aisle': u'Meat', u'name': u'rib-eye steaks', u'metaInformation': [u'boneless', u'fat removed', u'(each 1 lb and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 23232, u'unit': u''}, {u'originalString': u'Vegetable oil, for grates', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for grates'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.marthastewart.com/314059/grilled-steak-sandwiches-with-goat-chees', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Meanwhile, grill onion until tender and charred, 4 to 5 minutes per side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Transfer to a plate; separate into rings. (To store, refrigerate steaks and onion, up to 1 day.)', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is Sagebrush Annie's Ventura County Cabernet Sauvignon & Merlot Ventura County. It has 5 out of 5 stars and a bottle costs about 32 dollars.", u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': None, u'title': u"Sagebrush Annie's Ventura County Cabernet Sauvignon & Merlot Ventura County", u'price': u'$32.0', u'id': 469320, u'link': u'https://www.amazon.com/Sagebrush-Annies-Ventura-Cabernet-Sauvignon/dp/B00BI8KTSG', u'imageUrl': u'https://spoonacular.com/productImages/469320-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Meanwhile, grill onion until tender and charred, 4 to 5 minutes per side. Transfer to a plate; separate into rings. (To store, refrigerate steaks and onion, up to 1 day.)', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-steak-sandwiches-with-goat-cheese-and-arugula-8418', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}