{u'recipes': [{u'sourceName': u'Blahnik Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608112-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 608112, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mango Kiwi Lemonade Popsicles', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 10, u'pricePerServing': 43.42, u'creditText': u'Blahnik Baker', u'extendedIngredients': [{u'originalString': u'Sweetener of you choice, to taste (I used honey but you can use maple syrup, agave or stevia)', u'aisle': u'Oil, Vinegar, Salad Dressing;Milk, Eggs, Other Dairy', u'name': u'fat of choice', u'metaInformation': [u'to taste', u'(I used honey but you can use maple syrup, agave or stevia)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 1011001, u'unit': u'can'}, {u'originalString': u'2 kiwis, peeled and sliced', u'aisle': u'Produce', u'name': u'kiwis', u'metaInformation': [u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9148, u'unit': u''}, {u'originalString': u'Fresh lemon juice from 1 lemon', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 mango, peeled and cubed (you will only use half)', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'cubed', u'peeled', u'(you will only use half)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://blahnikbaker.com/mango-kiwi-lemonade-popsicles/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'In a large cup, measure water and squeeze lemon juice into cup. Stir in sweetener of your choice.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-sticks.jpg', u'id': 408704, u'name': u'popsicle sticks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-molds.jpg', u'id': 405929, u'name': u'popsicle molds'}], u'step': u'Add chopped fruits into popsicle molds. Fill molds about two-thirds full with lemonade mixture. Freeze for about an hour and then add in your popsicle sticks. Freeze for 3-4 hours until solid.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 518, u'instructions': u'In a large cup, measure water and squeeze lemon juice into cup. Stir in sweetener of your choice.Add chopped fruits into popsicle molds. Fill molds about two-thirds full with lemonade mixture. Freeze for about an hour and then add in your popsicle sticks. Freeze for 3-4 hours until solid.', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-kiwi-lemonade-popsicles-608112', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}