{u'recipes': [{u'sourceName': u'Bakerette', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/585703-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 585703, u'veryPopular': False, u'lowFodmap': False, u'title': u'Graveyard Pudding', u'diets': [], u'pricePerServing': 173.76, u'creditText': u'Bakerette', u'extendedIngredients': [{u'originalString': u'1/2 package of Oreos or chocolate sandwich cookies, cream filling removed and cookies crushed', u'aisle': u'Sweet Snacks', u'name': u'chocolate sandwich cookies', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'packages', u'unitShort': u'pkg', u'amount': 0.5, u'consistency': u'solid', u'id': 18166, u'unit': u'package'}, {u'originalString': u"Tubes of decorating icing--orange, red, and brown work well (feel free to use homemade icing if you wish, I'm just lazy :P)", u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [u'red', u'homemade', u'well', u"(feel free to use icing if you wish, I'm just lazy :P)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'servings'}, {u'originalString': u"1 box of instant chocolate pudding mix (I prefer homemade pudding. Here's a good homemade chocolate pudding recipe to try)", u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [u'good', u'homemade', u"(I prefer pudding. Here's a chocolate pudding recipe to try)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 19184, u'unit': u'box'}, {u'originalString': u'Oval-shaped vanilla cookies (to be used as headstones--Nabisco or Pepperidge Farm Milano cookies work well)', u'aisle': u'Sweet Snacks', u'name': u'vanilla wafer cookies', u'metaInformation': [u'oval-shaped', u'well', u'(to be used as headstones--Nabisco or Pepperidge Farm Milano cookies work )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-wafers.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18609, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://bakerette.com/graveyard-pudding/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare pudding as directed and set aside to slightly cool (approx. 10 minutes).If using Gummi worms, place a worm or two at the bottom of the cup.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour pudding over the top of the worms; filling cup about 2/3 of the way up (you need enough room to add the Oreo "dirt").', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Place pudding cups in the fridge for approximately 1 hour to set.In the meantime, remove the white cream fillings from the Oreos and discard. Crush the cookies in a plastic bag with a rolling pin or in a food processor. Set aside.Arrange a few Milano cookies on a plate or other flat surface and use the tubes of decorating icing to decorate your tombstones. "RIP" or "BOO" are traditional, but if you have a finer icing tip, it would be fun to add your family\'s names or guest names to the tombstones. Allow the icing time enough to set.After the hour is up, remove the pudding cups from the fridge and carefully insert the cookie tombstones into the pudding.Top the pudding with crushed Oreos around the tombstone.Decorate with candies or plastic scary items as desired. Small plastic spiders, cobwebs, or mini monsters are a nice addition.Return to the fridge to continue the setting process.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 258, u'instructions': u'Prepare pudding as directed and set aside to slightly cool (approx. 10 minutes).If using Gummi worms, place a worm or two at the bottom of the cup. Pour pudding over the top of the worms; filling cup about 2/3 of the way up (you need enough room to add the Oreo "dirt").Place pudding cups in the fridge for approximately 1 hour to set.In the meantime, remove the white cream fillings from the Oreos and discard. Crush the cookies in a plastic bag with a rolling pin or in a food processor. Set aside.Arrange a few Milano cookies on a plate or other flat surface and use the tubes of decorating icing to decorate your tombstones. "RIP" or "BOO" are traditional, but if you have a finer icing tip, it would be fun to add your family\'s names or guest names to the tombstones. Allow the icing time enough to set.After the hour is up, remove the pudding cups from the fridge and carefully insert the cookie tombstones into the pudding.Top the pudding with crushed Oreos around the tombstone.Decorate with candies or plastic scary items as desired. Small plastic spiders, cobwebs, or mini monsters are a nice addition.Return to the fridge to continue the setting process.', u'spoonacularSourceUrl': u'https://spoonacular.com/graveyard-pudding-585703', u'dishTypes': [], u'occasions': [u'halloween'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}