{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/520577-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 520577, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skinny Pina Colada Smoothie (vegan, gluten-free)', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 2, u'pricePerServing': 317.31, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1 medium to large ripe banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'medium to large', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'about 1/4 cup shredded coconut, optional and to taste', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon coconut extract, or to taste', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 12104, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon rum or Malibu Coconut Rum, optional', u'aisle': u'Alcoholic Beverages', u'name': u'coconut rum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10314037, u'unit': u'tablespoon'}, {u'originalString': u'maraschino cherries for garnishing, optional', u'aisle': u'Canned and Jarred', u'name': u'maraschino cherries', u'metaInformation': [u'for garnishing, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maraschino.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 9328, u'unit': u'servings'}, {u'originalString': u'1 cup fresh or frozen pineapple chunks (or one 8-ounce can crushed pineapple, in juice)', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'fresh', u'crushed', u'canned', u'(or one 8-ounce can pineapple, in juice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'cup'}, {u'originalString': u'sweetener, optional and to taste (to keep skinny, use no-calorie sweetener such as liquid vanilla stevia drops, white stevia powder, Splenda, etc.)', u'aisle': u'Baking', u'name': u'swerve sweetener', u'metaInformation': [u'white', u'to taste', u'(to keep skinny, use no-calorie sweetener such as liquid vanilla stevia drops, stevia powder, Splenda, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-substitute.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 99084, u'unit': u'c'}, {u'originalString': u'about 1/2 cup unsweetened vanilla almond milk, or as desired for consistency (or your favorite milk; coconut milk is excellent here)', u'aisle': u'?', u'name': u'as desired', u'metaInformation': [u'unsweetened', u'excellent', u'for consistency (or your favorite milk; coconut milk is  here)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.averiecooks.com/2013/09/skinny-pina-colada-smoothie.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine pineapple, banana, milk, coconut extract, and optional sweetener in a blender and blend until smooth and creamy. Optionally add rum, to taste, and blend. (Intended for those for whom alcohol consumption is appropriate; always drink responsibly) Optionally garnish and serve immediately. Leftover portion may be frozen for up to 2 months.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'alcohol'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Gewurztraminer, and Riesling are my top picks for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try L'Ecole 41 Chenin Blanc. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish. View More', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 26830, u'instructions': u'Combine pineapple, banana, milk, coconut extract, and optional sweetener in a blender and blend until smooth and creamy. Optionally add rum, to taste, and blend. (Intended for those for whom alcohol consumption is appropriate; always drink responsibly) Optionally garnish and serve immediately. Leftover portion may be frozen for up to 2 months.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-pina-colada-smoothie-vegan-gluten-free-520577', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 2, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}