{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/207401-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 207401, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cook the Book: Kashmiri Pilaf', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 126.08, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 cup basmati rice, rinsed until the water runs clear and soaked in water while cooking the onions', u'aisle': u'Pasta and Rice', u'name': u'basmati rice', u'metaInformation': [u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10020444, u'unit': u'cup'}, {u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 tablespoons blanched almonds, roughly chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'blanched almonds', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blanched-almonds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12062, u'unit': u'tablespoons'}, {u'originalString': u'3 inch piece of cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 3.0, u'consistency': u'solid', u'id': 1002010, u'unit': u'inch'}, {u'originalString': u'3/4 teaspoon cumin seeds', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'2 dried figs, chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dried figs', u'metaInformation': [u'dried', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-dried.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9094, u'unit': u''}, {u'originalString': u'3 green cardamom pods', u'aisle': u'Spices and Seasonings', u'name': u'green cardamom pods', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1022006, u'unit': u''}, {u'originalString': u'1 small–medium onion, peeled and sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tablespoons raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9299, u'unit': u'tablespoons'}, {u'originalString': u'A good pinch of saffron strands, soaked in 2 tbsp hot milk', u'aisle': u'Ethnic Foods;Spices and Seasonings;Gourmet', u'name': u'saffron', u'metaInformation': [u'hot', u'good'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2037, u'unit': u'pinch'}, {u'originalString': u'Salt and lots of freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'2 tablespoons walnuts or pistachios', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12155, u'unit': u'tablespoons'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/01/kashmiri-pilaf-indian-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the oil in a large nonstick saucepan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the whole spices and the bay leaf and cook over low heat for 30 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [], u'step': u'Add the onion and cook until soft and golden, then add the almonds and raisins and cook for a couple of minutes.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the drained rice to the pan. Stir it in the spiced oil for a minute and add 1 3/4 cups water, the saffron milk, figs and salt to taste. Bring to a boil and boil for a couple of minutes, then reduce the heat to low, cover, and cook for 7–8 minutes. Taste, the grains should be cooked; if not, cover for another minute. Season and add the walnuts or pistachios. Fluff up with a fork as you stir them in. Leave for 4 minutes to allow any excess water to be soaked up by the rice.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saffron.jpg', u'id': 2037, u'name': u'saffron'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve hot.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 21, u'instructions': u'Procedures                                                                              1                                                                            Heat the oil in a large nonstick saucepan. Add the whole spices and the bay leaf and cook over low heat for 30 seconds. Add the onion and cook until soft and golden, then add the almonds and raisins and cook for a couple of minutes.                                                                                                                            2                                                                            Add the drained rice to the pan. Stir it in the spiced oil for a minute and add 1 3/4 cups water, the saffron milk, figs and salt to taste. Bring to a boil and boil for a couple of minutes, then reduce the heat to low, cover, and cook for 7–8 minutes. Taste, the grains should be cooked; if not, cover for another minute. Season and add the walnuts or pistachios. Fluff up with a fork as you stir them in. Leave for 4 minutes to allow any excess water to be soaked up by the rice. Serve hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/cook-the-book-kashmiri-pilaf-207401', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}