{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/475176-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 475176, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet Potato Hash', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 5, u'pricePerServing': 184.5, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'cilantro', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'5 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd cup prepared salsa or pico de gallo', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'pico de gallo', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pico-de-gallo.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 27027, u'unit': u'cup'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 pound sausage or chorizo', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1017063, u'unit': u'pound'}, {u'originalString': u'3 sweet potatoes, peeled', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://addapinch.com/cooking/2014/01/26/sweet-potato-hash-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404778, u'name': u'box grater'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut sweet potatoes lengthwise to allow them to fit into the tube of food processor fitted with the julienne slicing blade or simply shred the sweet potatoes using the largest size holes of a box grater. Set aside.Crumble sausage or chorizo into a 12-inch cast iron skillet over medium heat. Allow to begin browning and then add sweet potatoes to the skillet, stirring constantly for about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Add in onion and garlic and stir to combine well. Cover with a lid and allow to cook for about 5 more minutes or until the sweet potatoes have become soft and tender with some crispy edges.Make five large indentions into the hash with the back of a large spoon. Crack one egg into each of the indentions.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place skillet into the preheated oven and bake until the eggs have just set, about 8 to 12 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and spoon on salsa or pico de gallo and sprinkle with salt and pepper. Top with sprigs of cilantro.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pico-de-gallo.jpg', u'id': 27027, u'name': u'pico de gallo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 278, u'instructions': u'Preheat oven to 325 F. Cut sweet potatoes lengthwise to allow them to fit into the tube of food processor fitted with the julienne slicing blade or simply shred the sweet potatoes using the largest size holes of a box grater. Set aside.Crumble sausage or chorizo into a 12-inch cast iron skillet over medium heat. Allow to begin browning and then add sweet potatoes to the skillet, stirring constantly for about 2 minutes. Add in onion and garlic and stir to combine well. Cover with a lid and allow to cook for about 5 more minutes or until the sweet potatoes have become soft and tender with some crispy edges.Make five large indentions into the hash with the back of a large spoon. Crack one egg into each of the indentions. Place skillet into the preheated oven and bake until the eggs have just set, about 8 to 12 minutes.Remove from the oven and spoon on salsa or pico de gallo and sprinkle with salt and pepper. Top with sprigs of cilantro.Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-hash-475176', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}