{u'recipes': [{u'sourceName': u'Table for Two Blog', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/593868-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 593868, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chorizo Stout Sloppy Joes', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 239.6, u'creditText': u'Table for Two Blog', u'extendedIngredients': [{u'originalString': u'12 weight ounces chorizo', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 7019, u'unit': u''}, {u'originalString': u'4 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbc tsp. ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 pound ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10219, u'unit': u'pound'}, {u'originalString': u'2 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbd onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 red bell pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 cup stout beer', u'aisle': u'Alcoholic Beverages', u'name': u'stout beer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93619, u'unit': u'cup'}, {u'originalString': u'8 kaiser rolls (I used potato rolls)', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [u'(I used potato rolls)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'\xbd cup tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11887, u'unit': u'cup'}, {u'originalString': u'6 weight ounces cheese (cheddar, swiss, or pepper jack), sliced', u'aisle': u'?', u'name': u'weight ounces cheese', u'metaInformation': [u'sliced', u'(cheddar, swiss, or pepper jack)'], u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'unit': u''}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.tablefortwoblog.com/chorizo-stout-sloppy-joes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a skillet over medium-high heat, add the olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the red bell pepper and onion and saut\xe9 until softened, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic and cook for about 30 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the ground pork and chorizo, cook until browned and mostly cooked through, breaking them into smaller pieces throughout the cooking process.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 10219, u'name': u'ground pork'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}]}, {u'equipment': [], u'step': u'Drain off most of the grease that has accumulated.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the stout, tomato paste, cumin, black pepper, stir, and simmer until everything is cooked through, another 10 minutes.Toast the buns in the oven on a baking sheet or a toaster oven.Scoop meat into buns, cover with cheese slice, and put the top of the bun on. Repeat on all eight sandwiches.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'id': 93619, u'name': u'stout'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 48, u'instructions': u'In a skillet over medium-high heat, add the olive oil. Add the red bell pepper and onion and saut\xe9 until softened, about 5 minutes. Add the garlic and cook for about 30 seconds.Add the ground pork and chorizo, cook until browned and mostly cooked through, breaking them into smaller pieces throughout the cooking process. Drain off most of the grease that has accumulated.Add the stout, tomato paste, cumin, black pepper, stir, and simmer until everything is cooked through, another 10 minutes.Toast the buns in the oven on a baking sheet or a toaster oven.Scoop meat into buns, cover with cheese slice, and put the top of the bun on. Repeat on all eight sandwiches.Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/chorizo-stout-sloppy-joes-593868', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}