{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/450046-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 450046, u'veryPopular': False, u'lowFodmap': False, u'title': u'Asparagus Ham Bites', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 17.44, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'6 fresh thin asparagus spears', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'fresh', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11011, u'unit': u''}, {u'originalString': u'6 thin slices deli ham', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 10010151, u'unit': u'slices'}, {u'originalString': u'1 tablespoon honey mustard', u'aisle': u'Condiments', u'name': u'honey mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4703, u'unit': u'tablespoon'}, {u'originalString': u'6 thin slices Monterey Jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'slices'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'6 slices whole wheat bread, crusts removed', u'aisle': u'Bakery/Bread', u'name': u'whole wheat bread', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-whole-wheat.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 18075, u'unit': u'slices'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/asparagus-ham-bites', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Trim asparagus to 5-1/4 in. Flatten bread with a rolling pin; brush one side of each slice with oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place bread, oiled side down, on an ungreased baking sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread each slice with mustard; top with cheese, ham and asparagus.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [], u'step': u'Roll up tightly and place seam side down.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350\xb0 for 12-14 minutes or until just crisp. Sprinkle with paprika.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}]}, {u'equipment': [], u'step': u'Cut each roll into four pieces.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 7, u'instructions': u'Directions                                                                                Trim asparagus to 5-1/4 in. Flatten bread with a rolling pin; brush one side of each slice with oil. Place bread, oiled side down, on an ungreased baking sheet. Spread each slice with mustard; top with cheese, ham and asparagus. Roll up tightly and place seam side down.                                                                                           Bake at 350\xb0 for 12-14 minutes or until just crisp. Sprinkle with paprika. Cut each roll into four pieces.                                        Yield: 2 dozen.                                                                                                     Editor’s Note: For best results, use a firm 100% whole wheat bread.                                                                                                Originally published as Asparagus Ham Bites in  Quick CookingNovember/December 2004, p32                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/asparagus-ham-bites-450046', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}