{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/517582-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 517582, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eyeball Truffles', u'diets': [], u'preparationMinutes': 50, u'pricePerServing': 99.68, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'candy coated chocolate pieces', u'aisle': u'Sweet Snacks', u'name': u'candy coated chocolate pieces', u'metaInformation': [], u'image': u"https://spoonacular.com/cdn/ingredients_100x100/candy-coated-chocolate-pieces-or-M&M's.jpg", u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19157, u'unit': u'pieces'}, {u'originalString': u'white candy melts (or white chocolate bark)', u'aisle': u'Baking', u'name': u'candy melts', u'metaInformation': [u'white', u'(or chocolate bark)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 36.0, u'consistency': u'solid', u'id': 93775, u'unit': u'servings'}, {u'originalString': u'1 (1 pound 2 ounce) package chocolate sandwich cookies (Oreos)', u'aisle': u'Sweet Snacks', u'name': u'chocolate sandwich cookies', u'metaInformation': [u'(Oreos)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 18166, u'unit': u'pound'}, {u'originalString': u'1 (8-ounce) package cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'red decorator icing', u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 36.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://www.recipegirl.com/2010/10/29/eyeball-truffles/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Open package of cookies and set 7 cookies aside to eat later.  Put remaining cookies (including the cream center) in a large zip bag and crush them to fine crumbs.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place crumbs in a bowl and add the cream cheese.  Use the back of a sturdy spoon to help blend it together.2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll the mixture into 1-inch balls and place them on a wax paper-lined cookie sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Place in the freezer for about 20 minutes, or until they are chilled and firmed up a bit.3.  Melt white candy as directed on the package and then (using a teaspoon) dip balls melted white chocolate, tap off extra and set aside on wax paper covered cookie sheet to dry.4.  Use the blue decorator icing to pipe on a circle in the center of the truffle (to make the iris).  Press a piece of candy coated chocolate in the center (to make the pupil).5.  Use the red decorator icing to squiggle lines from the center out to the sides- to create a bloodshot-look for the eyeball.6.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}, {u'equipment': [], u'step': u'Let dry & then refrigerate until ready to serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 84, u'instructions': u'1.  Open package of cookies and set 7 cookies aside to eat later.  Put remaining cookies (including the cream center) in a large zip bag and crush them to fine crumbs.  Place crumbs in a bowl and add the cream cheese.  Use the back of a sturdy spoon to help blend it together.2.  Roll the mixture into 1-inch balls and place them on a wax paper-lined cookie sheet.  Place in the freezer for about 20 minutes, or until they are chilled and firmed up a bit.3.  Melt white candy as directed on the package and then (using a teaspoon) dip balls melted white chocolate, tap off extra and set aside on wax paper covered cookie sheet to dry.4.  Use the blue decorator icing to pipe on a circle in the center of the truffle (to make the iris).  Press a piece of candy coated chocolate in the center (to make the pupil).5.  Use the red decorator icing to squiggle lines from the center out to the sides- to create a bloodshot-look for the eyeball.6.  Let dry & then refrigerate until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/eyeball-truffles-517582', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'halloween'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}