{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/605478-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 605478, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy One Skillet Lasagna', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 175.78, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'3 Leaves Basil, chopped', u'aisle': u'Produce', u'name': u'basil', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'Leaves', u'unitShort': u'Leaves', u'amount': 3.0, u'consistency': u'solid', u'id': 2044, u'unit': u'Leaves'}, {u'originalString': u'1/4 tsp Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'6 ounces Lasagna noodles, broken into thirds and cooked', u'aisle': u'Pasta and Rice', u'name': u'cooked lasagna noodles', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10620421, u'unit': u'ounces'}, {u'originalString': u'2 cloves Garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 (14.5 oz) Cans Diced Italian Tomatoes, drained', u'aisle': u'Produce', u'name': u'italian tomatoes', u'metaInformation': [u'diced', u'italian', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 29.0, u'consistency': u'solid', u'id': 10211529, u'unit': u'oz'}, {u'originalString': u'1 cup Mushrooms, chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1 1/2 Tbsp Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1 Onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 Tbsp shredded Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp Parsley', u'aisle': u'Produce', u'name': u'parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'1/2 cup Part Skim Mozzarella, shredded', u'aisle': u'Cheese', u'name': u'part skim mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1028, u'unit': u'cup'}, {u'originalString': u'1/2 cup Ricotta Cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1036, u'unit': u'cup'}, {u'originalString': u'1 tsp Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'1/4 cup Tomato Sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.countrycleaver.com/2014/07/easy-one-skillet-lasagna.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a large non-stick skillet over medium high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onions and cook until softened, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic and mushrooms and cook until garlic is fragrant, about one minute.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add in diced tomatoes, tomato sauce, basil, salt and pepper. Cook mixture until it thickens up a bit, around five minutes.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Add noodles to skilelt and stir into the mixture well.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add scoops of ricotta cheese over the noodles, add in mozzarella and parmesan cheeses. Stir in parsley. Cook about two more minutes, or until thickened.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve with additional basil on top.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'aggregateLikes': 68, u'instructions': u'Heat oil in a large non-stick skillet over medium high heat. Add onions and cook until softened, about 4 minutes. Add garlic and mushrooms and cook until garlic is fragrant, about one minute. Add in diced tomatoes, tomato sauce, basil, salt and pepper. Cook mixture until it thickens up a bit, around five minutes.Add noodles to skilelt and stir into the mixture well. Add scoops of ricotta cheese over the noodles, add in mozzarella and parmesan cheeses. Stir in parsley. Cook about two more minutes, or until thickened.Serve with additional basil on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-one-skillet-lasagna-605478', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}