{u'recipes': [{u'sourceName': u'Mother Rimmy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/531282-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 531282, u'veryPopular': False, u'lowFodmap': True, u'title': u'Prawn and Lobster Cocktail', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 169.2, u'creditText': u'Mother Rimmy', u'extendedIngredients': [{u'originalString': u'4 cups arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11959, u'unit': u'cups'}, {u'originalString': u'\xbc cup ketchup, low sugar', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'1 large lemon, quartered', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'large', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'1 large lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'8 ounces shrimp , medium, cooked without tails', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'cooked', u', without tails'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'ounces'}, {u'originalString': u'4 drops Tabasco sauce', u'aisle': u'Condiments', u'name': u'tabasco sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 4.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'drops'}, {u'originalString': u'2 sprigs thyme, stems removed', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'\xbd tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}, {u'originalString': u'8 ounces surimi, chopped', u'aisle': u'?', u'name': u'surimi', u'metaInformation': [u'chopped'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'unit': u'ounces'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://motherrimmy.com/how-to-make-prawn-and-lobster-seafood-cocktail-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine mayonnaise, ketchup, Worcestershire sauce, paprika and the juice of 1 lemon. Season with Tabasco sauce, salt and pepper to taste and chill for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'id': 11935, u'name': u'ketchup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Add chilled surimi and shrimp with with the sauce and mix thoroughly.Mound 1 cup arugula on a medium plate and spray with cooking olive oil cooking spray and a sprinkle of salt and pepper. Top with 1/4 cocktail mixture. Repeat with 3 more plates. Sprinkle plates with thyme leaves.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Serve with lemon quarters on the side.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Lobster Avocado Cocktail. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Combine mayonnaise, ketchup, Worcestershire sauce, paprika and the juice of 1 lemon. Season with Tabasco sauce, salt and pepper to taste and chill for 10 minutes.Add chilled surimi and shrimp with with the sauce and mix thoroughly.Mound 1 cup arugula on a medium plate and spray with cooking olive oil cooking spray and a sprinkle of salt and pepper. Top with 1/4 cocktail mixture. Repeat with 3 more plates. Sprinkle plates with thyme leaves.Serve with lemon quarters on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/prawn-and-lobster-cocktail-531282', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}