{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/223211-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 223211, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peppered plums with almond ice', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 146.84, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'397g can condensed milk', u'aisle': u'Baking', u'name': u'condensed milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 397.0, u'consistency': u'solid', u'id': 1095, u'unit': u'g'}, {u'originalString': u'2 generous tsp demerara sugar', u'aisle': u'Health Foods;Baking', u'name': u'demerara sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10019908, u'unit': u''}, {u'originalString': u'300ml full-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'full-fat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'50g ground almonds', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'ground almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 93740, u'unit': u'g'}, {u'originalString': u'about 5 tbsp maple syrup, for drizzling', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tbsp'}, {u'originalString': u'1 generous tsp crushed black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'peppercorns', u'metaInformation': [u'black', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u''}, {u'originalString': u'9 plums, halved and stoned', u'aisle': u'Produce', u'name': u'plums', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'consistency': u'solid', u'id': 9279, u'unit': u''}, {u'originalString': u'50g caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2847/peppered-plums-with-almond-ice', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'To make the almond ice, put the milk in a panwith the ground almonds and sugar and bring tothe boil. Simmer for 2-3 mins, then pour into abowl and cool. Strain through a fine sieve, squeezingevery last drop of milk and flavour from the almondswith the back of a spoon.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 93740, u'name': u'almond meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the almondmilk with the condensed milk, adding a few dropsof almond extract to taste, if you like. Churn in an ice cream machine for 15-20 mins, then freeze.Can be made up to 2 weeks ahead.Put a serving bowl for the almond ice in thefreezer. Arrange the plums on a deep baking tray,cut side up.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}]}, {u'equipment': [], u'step': u'Mix together the crushed peppercornsand demerara sugar and sprinkle over the plums.Can be done up to 2 hrs ahead.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/unprocessed-brown-sugar.png', u'id': 10019908, u'name': u'demerara sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drizzle the maple syrup on top. Put under a preheatedgrill for 6-10 mins until the plums are tender.Now finish it in style. While the plums are grilling, scoop out spoonfulsof the almond ice into the chilled bowl. return to thefreezer until the plums are ready. Arrange the plumson a platter and pour over the syrup from the tray.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}]}, {u'equipment': [], u'step': u'Serve warm with almond ice and flaked almonds.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 8, u'instructions': u'To make the almond ice, put the milk in a panwith the ground almonds and sugar and bring tothe boil. Simmer for 2-3 mins, then pour into abowl and cool. Strain through a fine sieve, squeezingevery last drop of milk and flavour from the almondswith the back of a spoon. Whisk together the almondmilk with the condensed milk, adding a few dropsof almond extract to taste, if you like. Churn in an ice cream machine for 15-20 mins, then freeze.Can be made up to 2 weeks ahead.Put a serving bowl for the almond ice in thefreezer. Arrange the plums on a deep baking tray,cut side up. Mix together the crushed peppercornsand demerara sugar and sprinkle over the plums.Can be done up to 2 hrs ahead.Drizzle the maple syrup on top. Put under a preheatedgrill for 6-10 mins until the plums are tender.Now finish it in style. While the plums are grilling, scoop out spoonfulsof the almond ice into the chilled bowl. return to thefreezer until the plums are ready. Arrange the plumson a platter and pour over the syrup from the tray.Serve warm with almond ice and flaked almonds.', u'spoonacularSourceUrl': u'https://spoonacular.com/peppered-plums-with-almond-ice-223211', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}