{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/582695-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 582695, u'veryPopular': False, u'lowFodmap': False, u'title': u'Southwestern Chipotle Sandwich Wraps', u'diets': [], u'pricePerServing': 156.35, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'2 Tbs. shredded cheese, mexican blend is perfect or a slice of cheese - we usually use shredded but we were out so the day I took the photos - it was a slice of cheese and it was just as good!)', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. Chipotle Sauce (recipe below) - or more for more spice (I like more, my kids like less).', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle', u'metaInformation': [u'(recipe below)', u'(I like more, my kids like less)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u'Tbs'}, {u'originalString': u'1-2 Tbs. of pureed Chipotle Chili in Adobo, for as much or as little spice as you like (open the can take out a bit and puree it until you get 2 Tbs.)', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chili peppers in adobo', u'metaInformation': [u'pureed', u'for as much or as little spice as you like (open the can take out a bit and puree it until you get 2 tbs.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u'Tbs'}, {u'originalString': u'1-2 c. chicken breast, cooked and cut into strips or cut again into squares. We use spicy seasoning to cook the chicken.', u'aisle': u'Meat', u'name': u'cooked chicken breast', u'metaInformation': [u'cooked', u'cut into strips or cut again into squares. we use spicy seasoning to cook the chicken.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 5064, u'unit': u'c'}, {u'originalString': u'4 flour tortillas (make your own by going to the recipe I link above)', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'(make your own by going to the recipe I link above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'\xbd Tbs. of minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'Tbs'}, {u'originalString': u'4 pieces of fresh lettuce or fresh spinach', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11252, u'unit': u'pieces'}, {u'originalString': u'1 c. light mayonnaise', u'aisle': u'Condiments', u'name': u'light mayonnaise', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4641, u'unit': u'c'}, {u'originalString': u'1 Tbs. of lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'Tbs'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://dailydishrecipes.com/southwestern-chipotle-sandwich-wraps/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'For the wrap: Lay out your flour tortilla.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'id': 10218364, u'name': u'flour tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}, {u'equipment': [], u'step': u'Spread about a tablespoon of the spicy chipotle sauce on the tortilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Add more if you like more spice.Layer the chicken on top of the sauce.Sprinkle the shredded cheese on top of the chicken.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add a piece of lettuce.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u"Combine all of the ingredients listed for the sauce together in a food processor or a blender until smooth. Can be used on sandwiches, meat, veggies and more. We store it in a re-purposed squeezable mustard or mayo bottle and keep it in the fridge for about 2 weeks. (doesn't usually last any longer than that, because we eat it all)", u'number': 1, u'ingredients': []}], u'name': u'Roll up and eat. Yum!For the Chipotle Sauce'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 89, u'instructions': u"For the wrap: Lay out your flour tortilla.Spread about a tablespoon of the spicy chipotle sauce on the tortilla. Add more if you like more spice.Layer the chicken on top of the sauce.Sprinkle the shredded cheese on top of the chicken.Add a piece of lettuce.Roll up and eat. Yum!For the Chipotle Sauce: Combine all of the ingredients listed for the sauce together in a food processor or a blender until smooth. Can be used on sandwiches, meat, veggies and more. We store it in a re-purposed squeezable mustard or mayo bottle and keep it in the fridge for about 2 weeks. (doesn't usually last any longer than that, because we eat it all)", u'spoonacularSourceUrl': u'https://spoonacular.com/southwestern-chipotle-sandwich-wraps-582695', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}