{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/437963-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 437963, u'veryPopular': False, u'lowFodmap': False, u'title': u'Horn of Plenty Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 40, u'pricePerServing': 75.71, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'6 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'3 cups fresh or frozen cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 9078, u'unit': u'cups'}, {u'originalString': u'3 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1 unpricked pastry shell (9 inches), baked', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry shell', u'metaInformation': [u'(9 inches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pastry-shells.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10018337, u'unit': u''}, {u'originalString': u'1/2 cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'Pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1-1/2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1/2 cup chopped peeled tart apple', u'aisle': u'Produce', u'name': u'tart apple', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1029003, u'unit': u'cup'}, {u'originalString': u'1/2 cup chopped walnuts', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}, {u'originalString': u'1/3 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/horn-of-plenty-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, bring sugar and water to a boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the cranberries, raisins, walnuts and apple; cover and simmer for 15 minutes and berries have popped, stirring occasionally. Stir in butter and salt. Spoon into pie shell.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, beat egg whites until stiff peaks form; gradually beat in brown sugar, 1 tablespoon at a time.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [], u'step': u'Pour over hot filling, sealing to edges of pastry.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 325\xb0 for 20 minutes or until golden brown. Cool completely. Store in the refrigerator.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Snake River Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Made from the grapes left to hang on the vine in our estate Arena Valley Vineyard, Late Harvest Riesling is our original dessert wine. Our 2011 has a limeade nose with a hint of minerals and a honey finish. Enjoy this wine with fruit based desserts or as a refreshing aperitif.', u'title': u'Snake River Late Harvest Riesling', u'price': u'$16.0', u'id': 431450, u'link': u'https://www.amazon.com/2010-Snake-River-Harvest-Riesling/dp/B00GWUM1A4', u'imageUrl': u'https://spoonacular.com/productImages/431450-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'Directions                                                                                In a large saucepan, bring sugar and water to a boil. Add the cranberries, raisins, walnuts and apple; cover and simmer for 15 minutes and berries have popped, stirring occasionally. Stir in butter and salt. Spoon into pie shell.                                                                                            In a large bowl, beat egg whites until stiff peaks form; gradually beat in brown sugar, 1 tablespoon at a time. Pour over hot filling, sealing to edges of pastry.                                                                                            Bake at 325\xb0 for 20 minutes or until golden brown. Cool completely. Store in the refrigerator.                                        Yield: 6-8 servings.                                                                                                                         Originally published as Horn of Plenty Pie in  CountryDecember/January 1998, p49                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 slice) equals 419 calories, 13 g fat (4 g saturated fat), 9 mg cholesterol, 159 mg sodium, 74 g carbohydrate, 2 g fiber, 5 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/horn-of-plenty-pie-437963', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}