{u'recipes': [{u'sourceName': u'Pip and Debby', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/827844-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 827844, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ham Egg and Veggie Scramble using Sugardale Ham', u'diets': [u'gluten free', u'ketogenic'], u'pricePerServing': 154.23, u'creditText': u'Pip and Debby', u'extendedIngredients': [{u'originalString': u'8 large eggs (with 1 tablespoon water), beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'with 1 tablespoon water), beaten', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 green bell pepper, seeded and chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 cup chopped Sugardale Classic Semi-Boneless Ham', u'aisle': u'Meat', u'name': u'ham', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10151, u'unit': u'cup'}, {u'originalString': u'1 jalape\xf1o pepper, sliced or chopped (optional)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'8-oz. package mushrooms, rinsed and chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'rinsed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'Salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'Salsa or taco sauce for topping, if desired', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'for topping, if desired'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.pipandebby.com/pip-ebby/ham-eggs-veggie-scramble-sugardale', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the bell pepper, mushrooms, red onion and jalapeo peppers (if using). Cook until soft and fragrant, approximately 3-5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}, {u'equipment': [], u'step': u'Add the Sugardale ham and cook for an additional 2 minutes, or until heated through.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Scramble on the menu? Try pairing with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. One wine you could try is Bellafina Prosecco. It has 4.6 out of 5 stars and a bottle costs about 12 dollars.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u"Intensely aromatic and crisp on the palate, with aromas and flavorsof yellow apple, white peach, pear and notes of white flowers.Excellent as an aperitif, it is a perfect accompaniment to hors-d'oeuvres and delicate first courses. Also wonderful with fish and shellfish.", u'title': u'Bellafina Prosecco', u'price': u'$11.99', u'id': 461572, u'link': u'https://www.wine.com/product/bellafina-prosecco/136821', u'imageUrl': u'https://spoonacular.com/productImages/461572-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Heat the olive oil in a skillet over medium heat. Add the bell pepper, mushrooms, red onion and jalapeo peppers (if using). Cook until soft and fragrant, approximately 3-5 minutes. Add the Sugardale ham and cook for an additional 2 minutes, or until heated through.', u'spoonacularSourceUrl': u'https://spoonacular.com/ham-egg-and-veggie-scramble-using-sugardale-ham-827844', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}