{u'recipes': [{u'sourceName': u'Bake Your Day', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/552411-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 552411, u'veryPopular': True, u'lowFodmap': False, u'title': u'BBQ Chicken Nachos', u'diets': [u'gluten free'], u'pricePerServing': 176.01, u'creditText': u'Bake Your Day', u'extendedIngredients': [{u'originalString': u'1/2 cup BBQ sauce + more for drizzle and dipping', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'for drizzle and dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'Black olives', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'servings'}, {u'originalString': u'Cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'3 cups cooked chicken (see note below)', u'aisle': u'Meat', u'name': u'cooked chicken', u'metaInformation': [u'cooked', u'(see note below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 5112, u'unit': u'cups'}, {u'originalString': u'1 tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'Green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'Jalapenos', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11979, u'unit': u'servings'}, {u'originalString': u'4 dashes liquid smoke', u'aisle': u'Spices and Seasonings;Condiments', u'name': u'liquid smoke', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 4.0, u'consistency': u'solid', u'id': 93627, u'unit': u'dashes'}, {u'originalString': u'Red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'servings'}, {u'originalString': u'1 Tbs. red onions, chopped', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'Tbs'}, {u'originalString': u'Shredded cheese', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'servings'}, {u'originalString': u'Tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u'servings'}, {u'originalString': u'Tortilla chips', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19056, u'unit': u'servings'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.bakeyourday.net/bbq-chicken-nachos/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine the chicken, BBQ sauce, liquid smoke, red onion and garlic powder in a sauce pot over medium heat.  Cook, stirring often, for about 8 minutes until the sauce has thickened slightly.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 93627, u'name': u'liquid smoke'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Remove from heat.  Turn the broiler on to hi.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread a thin layer of tortilla chips on a baking sheet.  Top with the BBQ chicken, tomatoes, cilantro, cheese, olives, jalapenos, onions, cheese and any other toppings that you desire.Broil the nachos for 7-8 minutes until the cheese is melted and golden brown.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Garnish with additional cilantro and BBQ sauce.Cassie’s Notes:I cooked about 1 pound of chicken breasts for this recipe.  I seasoned both sides of the chicken breasts with salt and pepper, and cooked over medium heat in a large skillet for about 6 minutes on each side, and then shredded the chicken after it had cooled slightly.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Perrier-Jouet Belle Epoque with a 4.4 out of 5 star rating seems like a good match. It costs about 129 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'The 1996 vintage was superb for the Champagne region, yielding ripe, balanced, clean fruit with excellent flavors. A blend of approximately half Chardonnay and half Pinot Noir this crystal bright, light-bodied Champagne is elegant and distinctive. Opening with aromas of fresh pineapple, lemon and white florals, warming into complex scents of pear. A rich bouquet of white fruits end in subtle notes of honey and vanilla. The bead is intense with brisk effervescence, swirling up into a generous and persistent mousse. It is a balanced, extremely refined wine that, if properly stored, should keep for years, especially if bottled in magnums or jeroboams.Beyond the toasts and ship launchings, Champagne has a place at every dinner table. The 1996 Fleur de Champagne pairs is the perfect wine to serve with smoked oysters, game hens, delicate Japanese fish dishes, Fettuccini Alfredo or risotto. After a patient search for a master glassmaker capable of reproducing a bottle with the 1902 Gall\xe9 design, Perrier Jou\xebt launched in 1969, its famous "flower bottle" with an arabesque design of anemones. The first bottles of Fleur de Champagne revealed a Champagne of vivacious delicacy, the epitome of the refined and engaging style of the Art Nouveau movement. Since then, it has been the signature Champagne of Perrier Jou\xebt and is considered one of the world\'s most celebrated Champagnes.', u'title': u'Perrier-Jouet Belle Epoque', u'price': u'$129.0', u'id': 433586, u'link': u'https://www.wine.com/product/perrier-jouet-belle-epoque-1996/7383', u'imageUrl': u'https://spoonacular.com/productImages/433586-312x231.jpg'}]}, u'aggregateLikes': 1857, u'instructions': u'Combine the chicken, BBQ sauce, liquid smoke, red onion and garlic powder in a sauce pot over medium heat.  Cook, stirring often, for about 8 minutes until the sauce has thickened slightly.  Remove from heat.  Turn the broiler on to hi.  Spread a thin layer of tortilla chips on a baking sheet.  Top with the BBQ chicken, tomatoes, cilantro, cheese, olives, jalapenos, onions, cheese and any other toppings that you desire.Broil the nachos for 7-8 minutes until the cheese is melted and golden brown.  Garnish with additional cilantro and BBQ sauce.Cassie’s Notes:I cooked about 1 pound of chicken breasts for this recipe.  I seasoned both sides of the chicken breasts with salt and pepper, and cooked over medium heat in a large skillet for about 6 minutes on each side, and then shredded the chicken after it had cooled slightly.', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-chicken-nachos-552411', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}