{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/431896-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 431896, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blueberry Sauce', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 66.47, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 cup fresh or frozen blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'1 teaspoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 teaspoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon grated lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'Vanilla ice cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'servings'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/blueberry-sauce-2', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a small saucepan, combine the sugar, cornstarch and salt. Gradually whisk in water until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the blueberries, lemon juice and peel; bring to a boil over medium heat, stirring constantly. Cook 2-3 minutes longer or until thickened, stirring occasionally (some berries will remain whole).', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Serve warm or chilled over ice cream.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 25, u'instructions': u'Directions                                                                                In a small saucepan, combine the sugar, cornstarch and salt. Gradually whisk in water until smooth. Add the blueberries, lemon juice and peel; bring to a boil over medium heat, stirring constantly. Cook 2-3 minutes longer or until thickened, stirring occasionally (some berries will remain whole). Serve warm or chilled over ice cream.                                        Yield: 3/4 cup.                                                                                                                         Originally published as Blueberry Sauce in  Cooking for 2Summer 2007, p25                                                                                                                                                                                                        Nutritional Facts                                                                             1/4 cup (calculated without ice cream) equals 96 calories, trace fat (trace saturated fat), 0 cholesterol, 52 mg sodium, 25 g carbohydrate, 1 g fiber, trace protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-sauce-431896', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}