{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/753021-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 753021, u'veryPopular': False, u'lowFodmap': False, u'title': u'Poached Oysters in Champagne with a Julienne of Vegetables, Leaf Spinach and Prosciutto Ham', u'diets': [u'gluten free', u'primal', u'pescatarian'], u'pricePerServing': 578.41, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter, cut into small cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'small', u'cut into  cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 carrot', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 ounces champagne', u'aisle': u'Alcoholic Beverages', u'name': u'champagne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'liquid', u'id': 10043155, u'unit': u'ounces'}, {u'originalString': u'1-ounce cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'ounce'}, {u'originalString': u'1 clove garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/2 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 leek', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'20 oysters (plus juice)', u'aisle': u'Seafood', u'name': u'oysters', u'metaInformation': [u'(plus juice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 15167, u'unit': u''}, {u'originalString': u'2 ounces prosciutto, julienned', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'ounces'}, {u'originalString': u'Salt, freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 shallots, sliced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'2 ounces snow peas', u'aisle': u'Produce', u'name': u'snow peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 11300, u'unit': u'ounces'}, {u'originalString': u'8 ounces fresh leaf spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'ounces'}, {u'originalString': u'1 glass white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'glas', u'unitShort': u'glass', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'glass'}], u'healthScore': 27.0, u'imageType': u'jpeg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/poached-oysters-champagne-julienne-vegetables-leaf-spinach-prosciutto-ham-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Shuck the oysters. Reserve the oyster juice. Wash the shells.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'id': 15167, u'name': u'oysters'}]}, {u'equipment': [], u'step': u'Cut the vegetables into strips and steam. Set aside Blanch the spinach and set aside Peel and cut the shallots into small dice, then add the white wine and reduce until only 1 tablespoon remains.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'id': 14106, u'name': u'white wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the cream reduce for 30 seconds, then whisk in the butter. Season with salt and pepper. Set aside.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Heat a sauteuse.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in the cream, oyster juice, champagne and garlic.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'id': 10043155, u'name': u'champagne'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the oyster, prosciutto and poach for 2 to 3 minutes, then add the shallot-butter sauce off the heat. Spoon into the oyster shells; top with the spinach, then top with the oysters and place a small pile of the steamed vegetables on each oyster.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'id': 15167, u'name': u'oysters'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Serve on a bed of blanched seaweed or on a bed of mixed peppercorns.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 9, u'instructions': u'Shuck the oysters. Reserve the oyster juice. Wash the shells. Cut the vegetables into strips and steam. Set aside Blanch the spinach and set aside Peel and cut the shallots into small dice, then add the white wine and reduce until only 1 tablespoon remains. Add the cream reduce for 30 seconds, then whisk in the butter. Season with salt and pepper. Set aside.                          Heat a sauteuse. Pour in the cream, oyster juice, champagne and garlic. Add the oyster, prosciutto and poach for 2 to 3 minutes, then add the shallot-butter sauce off the heat. Spoon into the oyster shells; top with the spinach, then top with the oysters and place a small pile of the steamed vegetables on each oyster. Serve on a bed of blanched seaweed or on a bed of mixed peppercorns.', u'spoonacularSourceUrl': u'https://spoonacular.com/poached-oysters-in-champagne-with-a-julienne-of-vegetables-leaf-spinach-and-prosciutto-ham-753021', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"new year's eve"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}