{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/698361-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 698361, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bulgur Salad with Asian Accents', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 83.91, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 1/4 cups bulgur, (see Note)', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'bulgur', u'metaInformation': [u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bulgur.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20012, u'unit': u'cups'}, {u'originalString': u'1/4 cup toasted cashews, (see Tip)', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [u'toasted', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons chile-garlic sauce', u'aisle': u'Ethnic Foods', u'name': u'chile garlic sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 93749, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon finely chopped fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 tablespoons reduced-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 16424, u'unit': u'tablespoons'}, {u'originalString': u'2 cups lightly packed radish sprouts, (3 ounces)', u'aisle': u'Produce', u'name': u'radish sprouts', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfalfa-sprouts.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 11676, u'unit': u'ounces'}, {u'originalString': u'1/4 cup rice-wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice-wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022053, u'unit': u'cup'}, {u'originalString': u'1 bunch scallions, trimmed and chopped', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'trimmed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'bunch'}, {u'originalString': u'1 tablespoon sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'1 2/3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.6666666666666665, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/bulgur_salad_with_asian_accents.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread nuts on a baking sheet and bake at 350F, stirring once, until fragrant, 7 to 9 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u"Note Bulgur is made by parboiling, drying and coarsely grinding or cracking wheat berries. Don't confuse bulgur with cracked wheat, which is simply thatcracked wheat. Since the parboiling step is skipped, cracked wheat must be cooked for up to an hour whereas bulgur simply needs a quick soak in hot water for most uses. Look for it in the natural-foods section of large supermarkets, near other grains, or online at kalustyans.com, lebaneseproducts.com.Tip To toast cashews"}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are great choices for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is NV Mindbender Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u"Note: Bulgur is made by parboiling, drying and coarsely grinding or cracking wheat berries. Don't confuse bulgur with cracked wheat, which is simply thatcracked wheat. Since the parboiling step is skipped, cracked wheat must be cooked for up to an hour whereas bulgur simply needs a quick soak in hot water for most uses. Look for it in the natural-foods section of large supermarkets, near other grains, or online at kalustyans.com, lebaneseproducts.com.Tip: To toast cashews: Spread nuts on a baking sheet and bake at 350F, stirring once, until fragrant, 7 to 9 minutes.", u'spoonacularSourceUrl': u'https://spoonacular.com/bulgur-salad-with-asian-accents-698361', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}