{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/479627-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 479627, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crescent Wrapped Jalapeno and Artichoke Dip Stuffed Peppers', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 99.11, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'4 anaheim peppers (sub poblano if needed)', u'aisle': u'Produce', u'name': u'anaheim peppers', u'metaInformation': [u'(sub poblano if needed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10031015, u'unit': u''}, {u'originalString': u'Cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2031, u'unit': u'servings'}, {u'originalString': u'1 tube crescent rolls (8 crescents)', u'aisle': u'Refrigerated', u'name': u'crescent rolls', u'metaInformation': [u'(8 crescents)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'tube', u'unitShort': u'tube', u'amount': 1.0, u'consistency': u'solid', u'id': 93618, u'unit': u'tube'}, {u'originalString': u'1 container La Terra Fina Jalapeno and Artichoke Dip', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'container', u'unitShort': u'container', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u'container'}, {u'originalString': u'Paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2028, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.neighborfoodblog.com/2013/09/crescent-wrapped-jalapeno-and-artichoke-dip-stuffed-peppers.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the peppers in half lengthwise and remove the seeds. Stuff each of the pepper halves with several Tablespoons of the Jalapeno and Artichoke Dip. Sprinkle cayenne pepper and paprika evenly over the top of each pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll out the crescent rolls and place a pepper on each one. Wrap the crescent around the pepper and place them on a baking sheet lined with parchment paper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake peppers in the oven for 11-13 minutes or until puffed and golden brown.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Freixenet Sparkling Cordon Negro Brut Cava with a 4.2 out of 5 star rating seems like a good match. It costs about 10 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'A Cava with an exceptional, fresh, fruity style and a lingering aroma. It is the perfect partner for the finest food and excellent at any time.Blend: 35% Macabeo, 25% Xarel\xb7lo, 40% Parellada View More', u'title': u'Freixenet Sparkling Cordon Negro Brut Cava', u'price': u'$9.99', u'id': 466158, u'link': u'https://www.wine.com/product/freixenet-sparkling-cordon-negro-brut-cava/1615', u'imageUrl': u'https://spoonacular.com/productImages/466158-312x231.jpg'}]}, u'aggregateLikes': 172, u'instructions': u'Preheat oven to 375 degrees.Cut the peppers in half lengthwise and remove the seeds. Stuff each of the pepper halves with several Tablespoons of the Jalapeno and Artichoke Dip. Sprinkle cayenne pepper and paprika evenly over the top of each pepper.Roll out the crescent rolls and place a pepper on each one. Wrap the crescent around the pepper and place them on a baking sheet lined with parchment paper.Bake peppers in the oven for 11-13 minutes or until puffed and golden brown. Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/crescent-wrapped-jalapeno-and-artichoke-dip-stuffed-peppers-479627', u'dishTypes': [], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}