{u'recipes': [{u'sourceName': u'My Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/881861-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 881861, u'veryPopular': False, u'lowFodmap': False, u'title': u'Herbed Ricotta, Asparagus, and Phyllo Tart', u'diets': [], u'pricePerServing': 144.0, u'creditText': u'My Recipes', u'extendedIngredients': [{u'originalString': u'1 1/2 pounds medium asparagus spears, trimmed to a length of 6 1/2 in.', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'medium', u'trimmed to a length of 6 1/2 in.'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11011, u'unit': u'pounds'}, {u'originalString': u'1/4 cup chopped fresh flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1 tablespoon fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'1 garlic clove, grated', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon kosher salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 tablespoons 1% low-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'1%', u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1174, u'unit': u'tablespoons'}, {u'originalString': u'3 1/2 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.5, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 ounce Parmigiano-Reggiano cheese, shaved (about 1/4 cup)', u'aisle': u'Cheese', u'name': u'parmigiano reggiano cheese', u'metaInformation': [u'shaved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'3/4 cup part-skim ricotta cheese', u'aisle': u'Cheese', u'name': u'part-skim ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1037, u'unit': u'cup'}, {u'originalString': u'12 (14- x 9-in.) frozen phyllo pastry sheets, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo pastry', u'metaInformation': [u'frozen', u'thawed', u'(14- x 9-in.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 12.0, u'consistency': u'solid', u'id': 18338, u'unit': u'sheets'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.myrecipes.com/recipe/herbed-ricotta-asparagus-phyllo-tart', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400F.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Stir together ricotta, parsley, milk, thyme, garlic, and 3/8 teaspoon salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place 1 phyllo sheet on a baking sheet lined with parchment paper. (Cover remaining dough to keep it from drying out.) Lightly brush phyllo sheet with oil, and top with another phyllo sheet. Repeat layers with remaining phyllo sheets and oil, reserving 1 teaspoon oil to brush on asparagus.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'id': 18338, u'name': u'filo pastry'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Spread ricotta mixture on phyllo stack, leaving a 1/2-inch border. Arrange asparagus spears side by side over ricotta mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Brush asparagus with remaining 1 teaspoon oil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Bake at 400F until phyllo is browned and crisp, 22 to 25 minutes. Sprinkle with remaining 1/8 teaspoon salt; top with shaved cheese.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Tart can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 104, u'instructions': u'Preheat oven to 400F.                                                                                                Stir together ricotta, parsley, milk, thyme, garlic, and 3/8 teaspoon salt.                                                                                                Place 1 phyllo sheet on a baking sheet lined with parchment paper. (Cover remaining dough to keep it from drying out.) Lightly brush phyllo sheet with oil, and top with another phyllo sheet. Repeat layers with remaining phyllo sheets and oil, reserving 1 teaspoon oil to brush on asparagus.                                                                                                Spread ricotta mixture on phyllo stack, leaving a 1/2-inch border. Arrange asparagus spears side by side over ricotta mixture. Brush asparagus with remaining 1 teaspoon oil. Bake at 400F until phyllo is browned and crisp, 22 to 25 minutes. Sprinkle with remaining 1/8 teaspoon salt; top with shaved cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/herbed-ricotta-asparagus-and-phyllo-tart-881861', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}