{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/479252-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479252, u'veryPopular': True, u'lowFodmap': False, u'title': u'Meatless Monday: Skillet Home Fries with Herbs de Provence', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'pricePerServing': 122.91, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon herbs de Provence', u'aisle': u'Produce;Spices and Seasonings', u'name': u'herbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002044, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 large russet potato (about 1 pound), cut into \xbd-inch cubes', u'aisle': u'Produce', u'name': u'russet potato', u'metaInformation': [u'large', u'cut into \xbd-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11353, u'unit': u'pound'}, {u'originalString': u'\xbd teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon paprika (sweet Hungarian)', u'aisle': u'Spices and Seasonings', u'name': u'sweet paprika', u'metaInformation': [u'sweet', u'( Hungarian)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002028, u'unit': u'teaspoon'}, {u'originalString': u'1 large sweet potato (about 1 pound), cut into \xbd-inch cubes', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'large', u'cut into \xbd-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u'pound'}], u'healthScore': 57.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://feedmephoebe.com/2013/02/meatless-monday-skillet-home-fries-with-herbs-de-provence/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 425 degrees.In a large 15-inch cast iron skillet, toss the potato with the remaining ingredients until well combined. Arrange in an even layer, with as little overlap as possible.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the middle of the oven for 20 minutes until the bottom of the potatoes is just starting to brown.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the oven and using a sturdy flat metal spatula, redistribute the potatoes. If little pieces get stuck on the bottom of the pan, don’t worry. They’ll just become all the more crispy and delicious. Arrange in a even layer, and return to the oven.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for another 15 to 20 minutes, until the potatoes are very crispy on the outside and tender on the inside.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the potatoes alongside eggs or savory crepes. They taste great with aioli, romesco, or a spicy pesto on the side.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 931, u'instructions': u'Preheat the oven to 425 degrees.In a large 15-inch cast iron skillet, toss the potato with the remaining ingredients until well combined. Arrange in an even layer, with as little overlap as possible. Bake in the middle of the oven for 20 minutes until the bottom of the potatoes is just starting to brown.Remove the pan from the oven and using a sturdy flat metal spatula, redistribute the potatoes. If little pieces get stuck on the bottom of the pan, don’t worry. They’ll just become all the more crispy and delicious. Arrange in a even layer, and return to the oven. Bake for another 15 to 20 minutes, until the potatoes are very crispy on the outside and tender on the inside.Serve the potatoes alongside eggs or savory crepes. They taste great with aioli, romesco, or a spicy pesto on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatless-monday-skillet-home-fries-with-herbs-de-provence-479252', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}