{u'recipes': [{u'sourceName': u'Inspiralized', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/563927-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 563927, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bacon & Brussels Sprouts Potato Noodle Casserole', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 103.82, u'creditText': u'Inspiralized', u'extendedIngredients': [{u'originalString': u'4-5 strips of bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'6-8 brussels sprouts', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11098, u'unit': u''}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 large (320+g) Idaho potatoes, peeled, Blade C (or sweet potatoes!)', u'aisle': u'Produce', u'name': u'idaho potatoes', u'metaInformation': [u'large', u'peeled', u'(or sweet potatoes!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'1/2 cup diced red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'1/4 tsp red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'tsp'}, {u'originalString': u'1.25 cup shredded cheddar cheese (optional)', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.inspiralized.com/2014/02/11/bacon-brussels-sprouts-potato-noodle-casserole/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to high broil.Chop the bottoms off of the brussel sprouts and then slice thinly, lengthwise. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a large skillet over medium heat and place in the bacon slices. Cook the bacon until crispy and transfer to a paper towel lined plate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain the skillet of all bacon grease except 1 tbsp. To the same skillet, add in the garlic, cook for 30 seconds and then add in the red pepper flakes and onions. Cook the onions for about 2 minutes and then add in the brussel sprouts. Cook the brussel sprouts for about 3 minutes, tossing frequently and then add in the potato noodles and crumble in the bacon.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the potato noodles cook for about 2 minutes, tossing frequently. Then, cover the skillet with a lid and let sit cooking for 3 minutes. Uncover, stir and cook another 3 minutes or until noodles are fully cooked and slightly browned.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the contents of the skillet into a casserole dish in an even layer and serve! When serving, cut into sections first to cut up the noodles. Optional: Sprinkle cheddar cheese on top and broil for 2-3 minutes or until cheese melts into the casserole. Then, cut into sections and serve!', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'aggregateLikes': 377, u'instructions': u'Preheat the oven to high broil.Chop the bottoms off of the brussel sprouts and then slice thinly, lengthwise. Set aside.Place a large skillet over medium heat and place in the bacon slices. Cook the bacon until crispy and transfer to a paper towel lined plate. Drain the skillet of all bacon grease except 1 tbsp. To the same skillet, add in the garlic, cook for 30 seconds and then add in the red pepper flakes and onions. Cook the onions for about 2 minutes and then add in the brussel sprouts. Cook the brussel sprouts for about 3 minutes, tossing frequently and then add in the potato noodles and crumble in the bacon.Let the potato noodles cook for about 2 minutes, tossing frequently. Then, cover the skillet with a lid and let sit cooking for 3 minutes. Uncover, stir and cook another 3 minutes or until noodles are fully cooked and slightly browned.Pour the contents of the skillet into a casserole dish in an even layer and serve! When serving, cut into sections first to cut up the noodles. Optional: Sprinkle cheddar cheese on top and broil for 2-3 minutes or until cheese melts into the casserole. Then, cut into sections and serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-brussels-sprouts-potato-noodle-casserole-563927', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}