{u'recipes': [{u'sourceName': u'Jo Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/559216-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 559216, u'veryPopular': True, u'lowFodmap': False, u'title': u'Day 5: Pretzel Turtles', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 43.95, u'creditText': u'Jo Cooks', u'extendedIngredients': [{u'originalString': u'35 caramels', u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 35.0, u'consistency': u'solid', u'id': 19074, u'unit': u''}, {u'originalString': u'12 oz good dark chocolate, melted', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'good', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'oz'}, {u'originalString': u'1 tsp fleur de sel', u'aisle': u'Spices and Seasonings', u'name': u'fleur de sel', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022047, u'unit': u'tsp'}, {u'originalString': u'35 whole pecan halves', u'aisle': u'Nuts;Baking', u'name': u'pecan', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 35.0, u'consistency': u'solid', u'id': 12142, u'unit': u''}, {u'originalString': u'35 whole pretzel twists', u'aisle': u'Savory Snacks', u'name': u'pretzel twists', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 35.0, u'consistency': u'solid', u'id': 10219047, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.jocooks.com/other/sweets/day-5-pretzel-turtles/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 325 F degrees.Roast the pecan halves for 5 minutes or so.Next lay the pretzels on a baking sheet lined with silpat, and then set a caramel on top of each pretzel.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the baking sheet in the oven for about 5 to 6 minutes until the caramels soften, but make sure they do not melt. Next press pecan halves them on top of the caramels.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel candy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Remove the prezels from the baking sheet. Use a measuring tablespoon to spoon small dollops, about half a tbsp of chocolate in each, of chocolate over the baking silpat. Take the prezels and gently press on top of the chocolate. Continue until finished.If you have some left over chocolate, drizzle some on top of the pretzels and sprinkle with fleur de sel.Allow them to cool completely before serving, to speed this up you can pop them in the fridge.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1022047, u'name': u'fleur de sel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pretzels.jpg', u'id': 19047, u'name': u'pretzels'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Nicolas Feuillatte Blanc de Blancs. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 65 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Subtle glints of lime-blossom green, with delicate, abundant bubbles. The wine offers aromas of white flowers, such ashawthorn and acacia, as well as more subtle scents of citrus fruits, pears and even limeblossom. Very generous on the palate. Lively, fresh and powerful on the attack.', u'title': u'Nicolas Feuillatte Blanc de Blancs', u'price': u'$64.99', u'id': 442400, u'link': u'https://www.wine.com/product/nicolas-feuillatte-blanc-de-blancs-2005/127127', u'imageUrl': u'https://spoonacular.com/productImages/442400-312x231.jpg'}]}, u'aggregateLikes': 1826, u'instructions': u'Preheat your oven to 325 F degrees.Roast the pecan halves for 5 minutes or so.Next lay the pretzels on a baking sheet lined with silpat, and then set a caramel on top of each pretzel.Place the baking sheet in the oven for about 5 to 6 minutes until the caramels soften, but make sure they do not melt. Next press pecan halves them on top of the caramels.Remove the prezels from the baking sheet. Use a measuring tablespoon to spoon small dollops, about half a tbsp of chocolate in each, of chocolate over the baking silpat. Take the prezels and gently press on top of the chocolate. Continue until finished.If you have some left over chocolate, drizzle some on top of the pretzels and sprinkle with fleur de sel.Allow them to cool completely before serving, to speed this up you can pop them in the fridge.', u'spoonacularSourceUrl': u'https://spoonacular.com/day-5-pretzel-turtles-559216', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'dessert', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 35, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}