{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626708-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 626708, u'veryPopular': False, u'lowFodmap': False, u'title': u'The Balanced Diet: Salmon and Quinoa Bowls with Kale and Tahini-Yogurt Sauce', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 404.21, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'1 medium carrot, peeled and thinly sliced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'medium', u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 cups cooked chickpeas, rinsed and drained if canned', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'canned', u'rinsed', u'cooked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16057, u'unit': u'cups'}, {u'originalString': u'1/4 cup dried currants, cranberries or cherries', u'aisle': u'Produce', u'name': u'dried currants', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/currants.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9085, u'unit': u'cup'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 tablespoon hemp seeds (optional)', u'aisle': u'Health Foods', u'name': u'hemp seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shelled-hemp-seeds.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93602, u'unit': u'tablespoon'}, {u'originalString': u'1 bunch Lacinato, Tuscan or dinosaur kale, thick stems removed and thinly sliced', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'thick', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11233, u'unit': u'bunch'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 cup white quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'4 4-ounce sockeye salmon fillets (skin on)', u'aisle': u'Seafood', u'name': u'salmon fillets', u'metaInformation': [u'(skin on)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 15076, u'unit': u'ounce'}, {u'originalString': u'1/2 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup tahini paste', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12698, u'unit': u'cup'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://feedmephoebe.com/2015/01/balanced-diet-salmon-quinoa-bowls-kale-tahini-yogurt-sauce/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, combine the quinoa and 2 cups water. Bring to a boil, cover, and reduce the heat to low. Cook for 15 minutes, then let stand covered for 10 minutes off the heat. Fluff with a fork and set aside. Meanwhile in a large mixing bowl, combine the kale, carrots, lemon juice, garlic, 2 tablespoons of olive oil and 1/2 teaspoon sea salt. With clean hands, toss the kale until very well coated in the lemon and oil.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Add the cooked quinoa to the kale along with the chickpeas, dried fruit and hemp seeds (if using).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shelled-hemp-seeds.png', u'id': 93602, u'name': u'hemp seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'id': 16057, u'name': u'chickpeas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Mix until well-incorporated and taste for seasoning.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Heat 2 tablespoons of oil in a large nonstick or cast iron skillet. Pat the salmon dry and season with salt. Cook the salmon skin-side down over high heat until nicely browned, 2-3 minutes. Carefully flip the fish and cook for another 2 minutes, until opaque up the sides. Divide the quinoa between 4 bowls and top with the seared salmon.In a medium mixing bowl, whisk together the ingredients for the sauce until smooth.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add more water as necessary to make the sauce drizzle-friendly. Spoon over the fish and serve immediately.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Tramin Pinot Grigio with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Bright yellow in color with coppery reflections and clear fruit aromas of pear, citrus, honeysuckle, tropical fruits and light spices. Firm, velvety and rich on the palate, with well-integrated acidity. A very round and satisfying wine. Recommended with fish antipasti, risotto with asparagus, omelets and pasta', u'title': u'Tramin Pinot Grigio', u'price': u'$18.29', u'id': 448227, u'link': u'https://www.wine.com/product/tramin-pinot-grigio-2009/106454', u'imageUrl': u'https://spoonacular.com/productImages/448227-312x231.jpg'}]}, u'aggregateLikes': 44, u'instructions': u'In a medium saucepan, combine the quinoa and 2 cups water. Bring to a boil, cover, and reduce the heat to low. Cook for 15 minutes, then let stand covered for 10 minutes off the heat. Fluff with a fork and set aside. Meanwhile in a large mixing bowl, combine the kale, carrots, lemon juice, garlic, 2 tablespoons of olive oil and 1/2 teaspoon sea salt. With clean hands, toss the kale until very well coated in the lemon and oil. Add the cooked quinoa to the kale along with the chickpeas, dried fruit and hemp seeds (if using). Mix until well-incorporated and taste for seasoning. Heat 2 tablespoons of oil in a large nonstick or cast iron skillet. Pat the salmon dry and season with salt. Cook the salmon skin-side down over high heat until nicely browned, 2-3 minutes. Carefully flip the fish and cook for another 2 minutes, until opaque up the sides. Divide the quinoa between 4 bowls and top with the seared salmon.In a medium mixing bowl, whisk together the ingredients for the sauce until smooth. Add more water as necessary to make the sauce drizzle-friendly. Spoon over the fish and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/the-balanced-diet-salmon-and-quinoa-bowls-with-kale-and-tahini-yogurt-sauce-626708', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}