{u'recipes': [{u'sourceName': u'Cook Nourish Bliss', u'cuisines': [u'caribbean', u'central american'], u'image': u'https://spoonacular.com/recipeImages/764771-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 764771, u'veryPopular': True, u'lowFodmap': False, u'title': u'Caribbean Chicken Bowls with Coconut Rice', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 35, u'pricePerServing': 279.78, u'creditText': u'Cook Nourish Bliss', u'extendedIngredients': [{u'originalString': u'1 large avocado, pitted and sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'pitted', u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 \xbd cups uncooked brown basmati rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20040, u'unit': u'cups'}, {u'originalString': u'\xbd cup chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 cup canned full-fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full-fat coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'2 large cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 (1-inch) piece ginger, grated', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'3 tablespoons freshly squeezed lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoon'}, {u'originalString': u'1/3 cup plus 2 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 medium orange bell pepper, sliced', u'aisle': u'Produce', u'name': u'orange bell pepper', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011821, u'unit': u''}, {u'originalString': u'pinch of pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1 \xbd to 2 cups chopped fresh pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9266, u'unit': u'cups'}, {u'originalString': u'1 medium red bell pepper, sliced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 medium red onion, sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'\xbc teaspoon fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'2 large boneless skinless chicken breasts, butterflied in half all the way through', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'2 \xbe cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://cooknourishbliss.com/2016/05/11/caribbean-chicken-bowls/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the  cup olive oil, lime juice, garlic, ginger, maple syrup, salt and pepper to a small bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to combine.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Add the chicken to a large ziplock plastic bag and pour in the majority of the marinade, reserving about  cup for later. Seal the bag and use your fingers to mix everything together.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the chicken to the refrigerator and let sit for 25 minutes.When the chicken is done marinating, set a large nonstick skillet over medium / medium high heat.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add in the remaining 2 tablespoons olive oil (if you used the pan for the veggies and it still has some oil, you can add a bit less).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken to the pan (shake off the excess marinade first) and sear for about 3 to 4 minutes, until lightly browned and the chicken releases easily. Flip the chicken pieces over and cook for an additional 3 to 5 minutes, or until browned and the internal temperature registers 165F.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the pan and allow to rest for about 10 minutes before slicing (or you can cut into chunks).For the rice:While the chicken is marinating, add the rice, coconut milk, water and salt to a medium saucepan. Bring the mixture to a boil, give it a stir, then cover and turn down the heat to medium-low / low.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let simmer for about 30 to 40 minutes, or until the water is absorbed and the rice is tender. Turn off the heat and let stand for 5 to 10 minutes untouched. Fluff the rice with a fork and stir in the fresh cilantro.For the veggies:Set a large nonstick skillet over medium heat.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add in the olive oil. When hot, add in the onion, both peppers, the salt and pepper. Cook for about 5 to 7 minutes, until crisp tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove to a bowl and cover loosely to keep warm (use this same skillet to cook the chicken!).To serve:Scoop some of the coconut rice into a bowl. Top with some of the chicken, the sauteed veggies, some pineapple and avocado.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Drizzle with a touch of the reserved lime vinaigrette.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with the plantain chips and lime wedges, if desired.', u'number': 12, u'ingredients': []}], u'name': u'For the chicken'}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Aromas of apricot, guava and pineapple juice mingle with hints of sweet vanilla and warm toasty notes.', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 435, u'instructions': u'For the chicken:Add the  cup olive oil, lime juice, garlic, ginger, maple syrup, salt and pepper to a small bowl. Whisk to combine. Add the chicken to a large ziplock plastic bag and pour in the majority of the marinade, reserving about  cup for later. Seal the bag and use your fingers to mix everything together. Transfer the chicken to the refrigerator and let sit for 25 minutes.When the chicken is done marinating, set a large nonstick skillet over medium / medium high heat. Add in the remaining 2 tablespoons olive oil (if you used the pan for the veggies and it still has some oil, you can add a bit less). Add the chicken to the pan (shake off the excess marinade first) and sear for about 3 to 4 minutes, until lightly browned and the chicken releases easily. Flip the chicken pieces over and cook for an additional 3 to 5 minutes, or until browned and the internal temperature registers 165F. Remove from the pan and allow to rest for about 10 minutes before slicing (or you can cut into chunks).For the rice:While the chicken is marinating, add the rice, coconut milk, water and salt to a medium saucepan. Bring the mixture to a boil, give it a stir, then cover and turn down the heat to medium-low / low. Let simmer for about 30 to 40 minutes, or until the water is absorbed and the rice is tender. Turn off the heat and let stand for 5 to 10 minutes untouched. Fluff the rice with a fork and stir in the fresh cilantro.For the veggies:Set a large nonstick skillet over medium heat. Add in the olive oil. When hot, add in the onion, both peppers, the salt and pepper. Cook for about 5 to 7 minutes, until crisp tender. Remove to a bowl and cover loosely to keep warm (use this same skillet to cook the chicken!).To serve:Scoop some of the coconut rice into a bowl. Top with some of the chicken, the sauteed veggies, some pineapple and avocado. Drizzle with a touch of the reserved lime vinaigrette. Serve with the plantain chips and lime wedges, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/caribbean-chicken-bowls-with-coconut-rice-764771', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}