{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608760-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 608760, u'veryPopular': False, u'lowFodmap': False, u'title': u'How to Make and Freeze (Pumpkin) Toaster Waffles', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 49.63, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'2 Tbsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'2/3 cups packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 19334, u'unit': u'cups'}, {u'originalString': u'1 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 1/2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 tsp ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2011, u'unit': u'tsp'}, {u'originalString': u'1 tsp ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'3 1/2 cups milk or buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 tsp freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1 1/2 cups pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11424, u'unit': u'cups'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'3/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2014/08/how-to-make-and-freeze-pumpkin-toaster-waffles.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put all the wet ingredients in a bowl and whisk together well.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together all the dry ingredients in a large bowl, taking care to work out any lumps of brown sugar.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/belgian-waffle-iron.jpg', u'id': 404753, u'name': u'waffle iron'}], u'step': u'Add the wet ingredients to the dry, and blend just until everything is combined.Make the waffles according to the direction for your waffle maker.  After each waffle is cooked, put it immediately onto a cooling rack and let cool to room temperature.Lay out a layer of completely cooled waffles on a baking sheet.  Cover with parchment or waxed paper and add another layer on top.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/straw.jpg', u'id': 405924, u'name': u'drinking straws'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the entire pan in the freezer and let the waffles freeze until firm.  This will take several hours. When the waffles are frozen, put one (or two) into zip lock freezer baggies.  If you want to get really fancy you can suck the extra air out of the bags with a straw (this will help them stay fresh longer.)  Close the zipper most of the way, insert a straw, and suck out as much air as you can by inhaling into the straw.  Quickly zip the bag shut and return to the freezer.  When toasting the waffles, use the defrost setting of your toaster, if you have one.  Otherwise experiment with which setting on your toaster gets the waffles hot throughout.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 257, u'instructions': u'Put all the wet ingredients in a bowl and whisk together well.Whisk together all the dry ingredients in a large bowl, taking care to work out any lumps of brown sugar.  Add the wet ingredients to the dry, and blend just until everything is combined.Make the waffles according to the direction for your waffle maker.  After each waffle is cooked, put it immediately onto a cooling rack and let cool to room temperature.Lay out a layer of completely cooled waffles on a baking sheet.  Cover with parchment or waxed paper and add another layer on top.  Put the entire pan in the freezer and let the waffles freeze until firm.  This will take several hours. When the waffles are frozen, put one (or two) into zip lock freezer baggies.  If you want to get really fancy you can suck the extra air out of the bags with a straw (this will help them stay fresh longer.)  Close the zipper most of the way, insert a straw, and suck out as much air as you can by inhaling into the straw.  Quickly zip the bag shut and return to the freezer.  When toasting the waffles, use the defrost setting of your toaster, if you have one.  Otherwise experiment with which setting on your toaster gets the waffles hot throughout.', u'spoonacularSourceUrl': u'https://spoonacular.com/how-to-make-and-freeze-pumpkin-toaster-waffles-608760', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}