{u'recipes': [{u'sourceName': u'Happy Food Healthy Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/486993-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 486993, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Graveyard Cups', u'diets': [], u'pricePerServing': 55.18, u'creditText': u'Happy Food Healthy Life', u'extendedIngredients': [{u'originalString': u'1/4 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 15-ounce can pumpkin puree (not pumpkin pie filling)', u'aisle': u'Baking', u'name': u'canned pumpkin puree', u'metaInformation': [u'canned', u'(not pumpkin pie filling)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11424, u'unit': u'ounce'}, {u'originalString': u'1 package of chocolate sandwich cookies, processed into crumbs', u'aisle': u'Sweet Snacks', u'name': u'chocolate sandwich cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18166, u'unit': u'package'}, {u'originalString': u'2 boxes of Jell-o chocolate pudding', u'aisle': u'Sweet Snacks;Health Foods', u'name': u'chocolate soy pudding', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'boxes', u'unitShort': u'boxes', u'amount': 2.0, u'consistency': u'liquid', u'id': 93700, u'unit': u'boxes'}, {u'originalString': u'2 containers of Cool Whip (I used fat free)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat free cool whip', u'metaInformation': [u'fat free', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'containers', u'unitShort': u'containers', u'amount': 2.0, u'consistency': u'solid', u'id': 1200, u'unit': u'containers'}, {u'originalString': u'gummy worms, oval-shaped cookies for tombstones (I used Pepperidge Farms Milano), candy pumpkins, etc', u'aisle': u'Sweet Snacks', u'name': u'gummy worms', u'metaInformation': [u'oval-shaped', u'for tombstones (i used pepperidge farms milano), candy pumpkins, etc'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gummy-worms.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 93642, u'unit': u'servings'}, {u'originalString': u'6 cups milk (I used 1%)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'1%', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 Tablespoon pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'Tablespoon'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://happyfoodhealthylife.com/2013/10/29/pumpkin-graveyard-dirt-cups/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine chocolate pudding and milk.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk for about 2 minutes, and set into the refrigerator while you mix the pumpkin.In a medium bowl, combine the pumpkin, 1 container of Cool Whip, pumpkin pie spice, and brown sugar. Stir until completely combined.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}]}, {u'equipment': [], u'step': u'Add the remaining container of Cool Whip to the chocolate pudding and mix until just combined.In small plastic cups, layer the chocolate pudding, cookie crumbs, and pumpkin mixture. Top with a final layer of cookie crumbs to look like dirt. Decorate with worms, "tombstones" and any other candy you\'d like.Keep refrigerated until ready to serve.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 154, u'instructions': u'In a large bowl, combine chocolate pudding and milk. Whisk for about 2 minutes, and set into the refrigerator while you mix the pumpkin.In a medium bowl, combine the pumpkin, 1 container of Cool Whip, pumpkin pie spice, and brown sugar. Stir until completely combined.Add the remaining container of Cool Whip to the chocolate pudding and mix until just combined.In small plastic cups, layer the chocolate pudding, cookie crumbs, and pumpkin mixture. Top with a final layer of cookie crumbs to look like dirt. Decorate with worms, "tombstones" and any other candy you\'d like.Keep refrigerated until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-graveyard-cups-486993', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'halloween'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 20, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}