{u'recipes': [{u'sourceName': u'Will Cook for Smiles', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626372-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 626372, u'veryPopular': False, u'lowFodmap': True, u'title': u'Sun Dried Tomato Feta Stuffed Chicken', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 203.18, u'creditText': u'Will Cook for Smiles', u'extendedIngredients': [{u'originalString': u'3 oz feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1019, u'unit': u'oz'}, {u'originalString': u'1 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp fresh Italian parsley, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'fresh', u'italian', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp pesto', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93698, u'unit': u'Tbsp'}, {u'originalString': u'Salt, fresh cracked pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'3 boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'2 Tbsp vegetable oil (for cooking)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'(for cooking)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'Tbsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.willcookforsmiles.com/2015/01/sun-dried-tomato-feta-stuffed-chicken.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Lay chicken breast flat on the cutting board. Carefully, slide the knife (hold it sideways with blade facing away from you) at the top (wider part) of the chicken breast, in the center, and cut a pocket in the middle. DO NOT slice all the way through the bottom or the sides of the chicken breast. Your ultimate goal is to create a pocket inside the breast with opening at the top. Repeat with all three breasts.In a small bowl, mix minced sun dried tomatoes, Feta cheese, oil, parsley, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix well until evenly combined.Stuff each chicken breast with equal amount of tomato/feta mixture, making sure it is evenly distributed through the pocket. Lightly press each chicken breast.Rub each chicken with about a tablespoon of pesto.Preheat a large cooking pan on medium heat and add vegetable oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place stuffed chicken breasts in the pan.Cook over medium/ medium-low heat until done making sure that both sides get nice and golden (lots of flavor comes from the chicken cooked to golden brown). This could take 20-30 minutes, depending on thickness of the chicken.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try District 7 Estate Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Lay chicken breast flat on the cutting board. Carefully, slide the knife (hold it sideways with blade facing away from you) at the top (wider part) of the chicken breast, in the center, and cut a pocket in the middle. DO NOT slice all the way through the bottom or the sides of the chicken breast. Your ultimate goal is to create a pocket inside the breast with opening at the top. Repeat with all three breasts.In a small bowl, mix minced sun dried tomatoes, Feta cheese, oil, parsley, salt and pepper. Mix well until evenly combined.Stuff each chicken breast with equal amount of tomato/feta mixture, making sure it is evenly distributed through the pocket. Lightly press each chicken breast.Rub each chicken with about a tablespoon of pesto.Preheat a large cooking pan on medium heat and add vegetable oil. Place stuffed chicken breasts in the pan.Cook over medium/ medium-low heat until done making sure that both sides get nice and golden (lots of flavor comes from the chicken cooked to golden brown). This could take 20-30 minutes, depending on thickness of the chicken.', u'spoonacularSourceUrl': u'https://spoonacular.com/sun-dried-tomato-feta-stuffed-chicken-626372', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}