{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/747194-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 130, u'id': 747194, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kickoff Cupcakes', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 59.75, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 1/2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u"8 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'2 large eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'A few drops brown food coloring', u'aisle': u'Baking', u'name': u'food coloring', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 3.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'drops'}, {u'originalString': u'A few drops green food coloring', u'aisle': u'Baking', u'name': u'food coloring', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 3.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'drops'}, {u'originalString': u'A few drops yellow food coloring', u'aisle': u'Baking', u'name': u'food coloring', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 3.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'drops'}, {u'originalString': u'1 large tube white gel icing', u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [u'white', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'tube', u'unitShort': u'tube', u'amount': 1.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'tube'}, {u'originalString': u'2 teaspoons instant coffee', u'aisle': u'Tea and Coffee', u'name': u'instant coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 14214, u'unit': u'teaspoons'}, {u'originalString': u'About 2 teaspoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'teaspoons'}, {u'originalString': u'A few drops orange food coloring', u'aisle': u'Baking', u'name': u'orange food coloring', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 3.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'drops'}, {u'originalString': u'1/2 teaspoon fine salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'4 sticks unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'sticks'}, {u'originalString': u'3/4 cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'3/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1 tablespoon white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoon'}], u'healthScore': 0.0, u'imageType': u'jpeg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/patricia-heaton/kickoff-cupcakes.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Special equipment: an ice cream scoop and a small offset spatula', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the cupcakes: Preheat the oven to 350 degrees F. Line two 12-cup muffin tins with silver foil liners.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the flour, sugar, baking powder, baking soda and salt in a large bowl. In another bowl, whisk together the oil, eggs, vinegar, vanilla, coffee and 1 cup water until well blended.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour the egg mixture into the flour mixture and stir until just incorporated.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-scoop.jpg', u'id': 404742, u'name': u'ice cream scoop'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u'Using an ice cream scoop, divide the batter evenly between the prepared muffin cups, filling each cup halfway.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until a wooden pick inserted into the center of a cupcake comes out clean, 18 to 20 minutes. Cool the cupcakes in the pans 5 minutes.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Remove from the pans and cool completely on a wire cooling rack.', u'number': 7, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u"Put the butter and confectioners' sugar in a stand mixer fitted with a paddle attachment. Beat until well combined and smooth.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [], u'step': u'Add a little milk, about 1/4 teaspoon at a time, and beat well after each addition until the frosting reaches a nice spreadable consistency.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Divide the frosting among 4 bowls.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'Mix into each the green, brown, yellow or orange food coloring, drop by drop, until you achieve the colors desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'orange food color'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Decorate the Cupcakes: Using a small offset spatula, spread the brown and orange frosting over 12 of the cupcakes so that each top is half brown and half orange. Repeat with the 12 remaining cupcakes using the yellow and green frosting. Use the white gel icing to draw a line down the center of each cupcake top, dividing the colors. Then make 3 cross hatch marks across the white line on each to resemble football stitching.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 10019230, u'name': u'icing'}]}], u'name': u'For the frosting'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cupcakes. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 159, u'instructions': u"Special equipment: an ice cream scoop and a small offset spatula                          For the cupcakes: Preheat the oven to 350 degrees F. Line two 12-cup muffin tins with silver foil liners.                          Whisk together the flour, sugar, baking powder, baking soda and salt in a large bowl. In another bowl, whisk together the oil, eggs, vinegar, vanilla, coffee and 1 cup water until well blended. Pour the egg mixture into the flour mixture and stir until just incorporated.                          Using an ice cream scoop, divide the batter evenly between the prepared muffin cups, filling each cup halfway. Bake until a wooden pick inserted into the center of a cupcake comes out clean, 18 to 20 minutes. Cool the cupcakes in the pans 5 minutes. Remove from the pans and cool completely on a wire cooling rack.                          For the frosting: Put the butter and confectioners' sugar in a stand mixer fitted with a paddle attachment. Beat until well combined and smooth. Add a little milk, about 1/4 teaspoon at a time, and beat well after each addition until the frosting reaches a nice spreadable consistency.                          Divide the frosting among 4 bowls. Mix into each the green, brown, yellow or orange food coloring, drop by drop, until you achieve the colors desired.                          Decorate the Cupcakes: Using a small offset spatula, spread the brown and orange frosting over 12 of the cupcakes so that each top is half brown and half orange. Repeat with the 12 remaining cupcakes using the yellow and green frosting. Use the white gel icing to draw a line down the center of each cupcake top, dividing the colors. Then make 3 cross hatch marks across the white line on each to resemble football stitching.", u'spoonacularSourceUrl': u'https://spoonacular.com/kickoff-cupcakes-747194', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 190, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}