{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/832328-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 832328, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pecan, Pineapple and Gorgonzola Cheese Ball with Dried Cranberries', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 160.81, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'1 can crushed pineapple (12 oz) drained', u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 9354, u'unit': u'oz'}, {u'originalString': u'2 packages cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'packages', u'unitShort': u'packages', u'amount': 2.0, u'consistency': u'solid', u'id': 1017, u'unit': u'packages'}, {u'originalString': u'1/2 c dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9079, u'unit': u'c'}, {u'originalString': u'1/4 cup gorgonzola cheese crumbles', u'aisle': u'Cheese', u'name': u'gorgonzola cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1011004, u'unit': u'cup'}, {u'originalString': u'2 Tbsp diced green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tbsp'}, {u'originalString': u'1/2 cup parsley, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups chopped pecans, toasted', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'toasted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u'1-2 tsp sea salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.creative-culinary.com/pecan-pineapple-gorgonzola-cheese-ball-dried-cranberries/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u'Using a stand mixer, blend all ingredients except nuts and parsley.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Place in fridge for 30 minutes. Split mixture in half and form into two balls and roll first in nuts, then in chopped parsley. Refrigerate until ready to serve.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve with crackers and fresh fruit if desired.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 65, u'instructions': u'InstructionsUsing a stand mixer, blend all ingredients except nuts and parsley. Place in fridge for 30 minutes. Split mixture in half and form into two balls and roll first in nuts, then in chopped parsley. Refrigerate until ready to serve. Serve with crackers and fresh fruit if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/pecan-pineapple-and-gorgonzola-cheese-ball-with-dried-cranberries-832328', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}