{u'recipes': [{u'sourceName': u"Jul's Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556503-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 556503, u'veryPopular': False, u'lowFodmap': False, u'title': u"My grandma's choux pastries", u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 34.52, u'creditText': u"Jul's Kitchen", u'extendedIngredients': [{u'originalString': u'2 heaping tablespoons of corn starch', u'aisle': u'Baking', u'name': u'corn starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'50 g of extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'g'}, {u'originalString': u'100 g of flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'Zest of 1 organic unwaxed lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'4 tablespoons of caster sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'100 g of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'g'}, {u'originalString': u'500 ml of whole fresh milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'fresh', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://en.julskitchen.com/dessert/choux-pastries', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the custard in advance, so it will have time to cool down.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Heat the milk in a saucepan with the zest of an organic lemon and remove from the heat as soon as it starts simmering.In another saucepan whisk the eggs with the sugar and the corn starch: do it carefully to avoid any lumps.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour slowly the hot milk in a thin stream over the eggs, stirring constantly with a whisk to prevent scrambled eggs.Bring the saucepan back on a low flame and stir constantly with a whisk until it thickens, you will need about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer into a bowl, cover tightly with cling film and let it cool down completely.Now make the choux pastries.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour water and olive oil in a small non stick saucepan, bring it to the boil. As soon as it starts bubbling add the flour in one go. Toast the flour for about five minutes, beating constantly and vigorously with a wooden spoon, until you have a golden ball of dough that will leave the sides of the saucepan clean.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from the stove, transfer into a bowl and let it cool slightly. After a few minutes add the beaten eggs and whip with an electric beater for about five minutes, until smooth, glossy and thick.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 210.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat the oven to 210\xb0C and line a tray with parchment paper. Shape mandarin sized balls with two tablespoons and lay them onto the lined baking tray. You should obtain about 8 choux pastries.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for about 25 minutes, until golden brown and puffed up.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and let them cool down.Spoon the cooled and thick custard into a pastry bag and fill the choux pastries. Dust with icing sugar and serve immediately.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 310, u'instructions': u'Make the custard in advance, so it will have time to cool down. Heat the milk in a saucepan with the zest of an organic lemon and remove from the heat as soon as it starts simmering.In another saucepan whisk the eggs with the sugar and the corn starch: do it carefully to avoid any lumps. Pour slowly the hot milk in a thin stream over the eggs, stirring constantly with a whisk to prevent scrambled eggs.Bring the saucepan back on a low flame and stir constantly with a whisk until it thickens, you will need about 5 minutes. Transfer into a bowl, cover tightly with cling film and let it cool down completely.Now make the choux pastries. Pour water and olive oil in a small non stick saucepan, bring it to the boil. As soon as it starts bubbling add the flour in one go. Toast the flour for about five minutes, beating constantly and vigorously with a wooden spoon, until you have a golden ball of dough that will leave the sides of the saucepan clean.Remove from the stove, transfer into a bowl and let it cool slightly. After a few minutes add the beaten eggs and whip with an electric beater for about five minutes, until smooth, glossy and thick.Heat the oven to 210\xb0C and line a tray with parchment paper. Shape mandarin sized balls with two tablespoons and lay them onto the lined baking tray. You should obtain about 8 choux pastries.Bake for about 25 minutes, until golden brown and puffed up. Remove from the oven and let them cool down.Spoon the cooled and thick custard into a pastry bag and fill the choux pastries. Dust with icing sugar and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/my-grandmas-choux-pastries-556503', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}