{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/432089-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 432089, u'veryPopular': False, u'lowFodmap': False, u'title': u'Christmas Stollen', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 60, u'pricePerServing': 21.39, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 packages (1/4 ounce each) active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'consistency': u'solid', u'id': 18375, u'unit': u'ounce'}, {u'originalString': u'1 cup sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1 teaspoon butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoon'}, {u'originalString': u'1 cup coarsely chopped red candied cherries', u'aisle': u'Produce;Baking', u'name': u'candied cherries', u'metaInformation': [u'red', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-cherries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93742, u'unit': u'cup'}, {u'originalString': u'3/4 cup chopped candied citron', u'aisle': u'Produce;Baking', u'name': u'candied citron', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-orange.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9426, u'unit': u'cup'}, {u'originalString': u"1 cup confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'5 to 5-1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'3/4 teaspoon ground cardamom', u'aisle': u'Spices and Seasonings', u'name': u'ground cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2006, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon ground mace', u'aisle': u'Spices and Seasonings', u'name': u'ground mace', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2022, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon grated lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'4 teaspoons 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'teaspoons'}, {u'originalString': u'3/4 cup chopped candied pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9266, u'unit': u'cup'}, {u'originalString': u'1 cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup warm water (110\xb0 to 115\xb0)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(110\xb0 to 115\xb0)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/christmas-stollen-3', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, dissolve yeast in warm water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Add the milk, sugar, butter, eggs, lemon peel, cardamom, salt, mace and 3 cups flour. Beat until smooth. Stir in enough remaining flour to form a soft dough (dough will be sticky). Stir in the cherries, almonds, raisins, pineapple and citron.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon peel'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 2006, u'name': u'cardamom'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2022, u'name': u'ground mace'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Turn onto a floured surface; knead until smooth and elastic, about 6-8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a greased bowl, turning once to grease the top. Cover and let rise in a warm place until doubled, about 1 hour.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Punch dough down. Turn onto a floured surface. Divide into four portions. Shape each into a 12-in. x 7-in. oval. Fold long side over to within 1/2-in. of opposite side; press edges lightly to seal.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place 5 in. apart on lightly greased baking sheets. Cover and let rise until doubled, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350\xb0 for 22-28 minutes or until golden brown.', u'length': {u'number': 28, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Remove to wire racks to cool.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"For icing, in a small bowl, combine the confectioners' sugar, milk, butter, vanilla and salt.", u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drizzle over stollens.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Dornfelder and Riesling are my top picks for Stollen. Beer might seem like the natural pick for German food, but German riesling pairs wonderfully with seafood and schnitzel, while a German red like Dornfelder goes well with beef and game meat.', u'pairedWines': [u'dornfelder', u'riesling'], u'productMatches': [{u'description': None, u'title': u'King Frosch Dornfelder Dry All Natural German', u'price': u'$19.95', u'id': 432076, u'link': u'https://www.amazon.com/King-Frosch-Dornfelder-Natural-German/dp/B00F29YBGI', u'imageUrl': u'https://spoonacular.com/productImages/432076-312x231.jpg'}]}, u'aggregateLikes': 36, u'instructions': u"Directions                                                                                In a large bowl, dissolve yeast in warm water. Add the milk, sugar, butter, eggs, lemon peel, cardamom, salt, mace and 3 cups flour. Beat until smooth. Stir in enough remaining flour to form a soft dough (dough will be sticky). Stir in the cherries, almonds, raisins, pineapple and citron.                                                                                           Turn onto a floured surface; knead until smooth and elastic, about 6-8 minutes. Place in a greased bowl, turning once to grease the top. Cover and let rise in a warm place until doubled, about 1 hour.                                                                                           Punch dough down. Turn onto a floured surface. Divide into four portions. Shape each into a 12-in. x 7-in. oval. Fold long side over to within 1/2-in. of opposite side; press edges lightly to seal. Place 5 in. apart on lightly greased baking sheets. Cover and let rise until doubled, about 30 minutes.                                                                                           Bake at 350\xb0 for 22-28 minutes or until golden brown. Remove to wire racks to cool.                                                                                           For icing, in a small bowl, combine the confectioners' sugar, milk, butter, vanilla and salt. Drizzle over stollens.                                        Yield: 4 loaves (12 slices each).                                                                                                                         Originally published as Christmas Stollen in  Taste of Home Christmas AnnualAnnual 2010, p121                                                                                                                                                                                                       Nutritional Facts                                                                             1 slice equals 164 calories, 4 g fat (2 g saturated fat), 16 mg cholesterol, 71 mg sodium, 30 g carbohydrate, 1 g fiber, 3 g protein. Diabetic Exchanges: 2 starch, 1/2 fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/christmas-stollen-432089', u'dishTypes': [u'dessert'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}