{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/517041-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 517041, u'veryPopular': False, u'lowFodmap': True, u'title': u'Strawberry Lemonade', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 144.63, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1 cup granulated white sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'servings'}, {u'originalString': u'1 cup freshly squeezed lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1 Tablespoon grated lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'Tablespoon'}, {u'originalString': u'mint sprigs for garnish, optional', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'sprig', u'unitShort': u'sprigs', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'sprigs'}, {u'originalString': u'2 cups sparkling water', u'aisle': u'Beverages', u'name': u'sparkling water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'cups'}, {u'originalString': u'1 pint fresh strawberries, trimmed & halved', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'trimmed', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'pint'}, {u'originalString': u'strawberry halves for garnish, optional', u'aisle': u'Produce', u'name': u'strawberry', u'metaInformation': [u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'halve', u'unitShort': u'halves', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'halves'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.recipegirl.com/2007/04/13/strawberry-lemonade/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, bring water and sugar to boil.  Reduce heat and simmer, stirring occasionally, until the sugar dissolves.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the lemon zest and juice, stir and remove from heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Let cool completely.2.  In a blender, puree the strawberries with about 1/2 cup of the lemon syrup.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Add the pureed strawberries to the remaining lemon syrup.  Stir; pour through a strainer into a pitcher.  Refrigerate until well-chilled.3.  When ready to serve, add sparkling water to the pitcher and stir well.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Pour over glasses filled with ice, and serve garnished with mint and/or strawberry halves.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 262, u'instructions': u'1.  In a medium saucepan, bring water and sugar to boil.  Reduce heat and simmer, stirring occasionally, until the sugar dissolves.  Add the lemon zest and juice, stir and remove from heat.  Let cool completely.2.  In a blender, puree the strawberries with about 1/2 cup of the lemon syrup.  Add the pureed strawberries to the remaining lemon syrup.  Stir; pour through a strainer into a pitcher.  Refrigerate until well-chilled.3.  When ready to serve, add sparkling water to the pitcher and stir well.  Pour over glasses filled with ice, and serve garnished with mint and/or strawberry halves.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-lemonade-517041', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}