{u'recipes': [{u'sourceName': u'Will Cook for Smiles', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/553935-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 553935, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chipotle Tomato Pepper Cheeseburger', u'diets': [], u'pricePerServing': 408.03, u'creditText': u'Will Cook for Smiles', u'extendedIngredients': [{u'originalString': u'Bell peppers', u'aisle': u'Produce', u'name': u'bell peppers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 10211821, u'unit': u'servings'}, {u'originalString': u'1/4 cup bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'Fresh Ciabatta bun', u'aisle': u'Bakery/Bread', u'name': u'ciabatta bun', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ciabatta.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 93699, u'unit': u'servings'}, {u'originalString': u'1 Tbs minced fresh herbs (parsley)', u'aisle': u'Produce', u'name': u'fresh herbs', u'metaInformation': [u'fresh', u'minced', u'(parsley)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 1012024, u'unit': u'Tbs'}, {u'originalString': u'1 lb ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'1 lb ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10219, u'unit': u'lb'}, {u'originalString': u'1/2 cup diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 cup diced red bell pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'salt pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 Tbs Hidden Valley Spicy Chipotle Pepper sandwich spread', u'aisle': u'Produce', u'name': u'spicy pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u'Tbs'}, {u'originalString': u'2 slices Ages Swiss cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 1040, u'unit': u'slices'}, {u'originalString': u'2 Tbs tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'Tbs'}, {u'originalString': u'Tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11529, u'unit': u'servings'}, {u'originalString': u'Tomato pepper burger patty', u'aisle': u'Frozen', u'name': u'vegetarian burger patty', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 16147, u'unit': u'servings'}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://willcookforsmiles.com/2013/10/chipotle-tomato-pepper-cheeseburger.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine all the ingredients for burger patties in a mixing bowl and mix until all ingredients are evenly incorporated. Form the burger patties.Preheat the pan on medium heat (with some oil) and cook the patties until desired temperature is reached.Top the patties with cheese right away to let them melt. Build the sandwich as desired.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger can be paired with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Don Rodolfo Malbec. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 12 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'An intense ruby red color with violet flashes. Aromas of berries, cassis and plums. This Malbec is a burst of dark cherry and blackberry with a rich, plush finish.', u'title': u'Don Rodolfo Malbec', u'price': u'$11.99', u'id': 438361, u'link': u'https://www.wine.com/product/don-rodolfo-malbec-2015/153771', u'imageUrl': u'https://spoonacular.com/productImages/438361-312x231.jpg'}]}, u'aggregateLikes': 845, u'instructions': u'Combine all the ingredients for burger patties in a mixing bowl and mix until all ingredients are evenly incorporated. Form the burger patties.Preheat the pan on medium heat (with some oil) and cook the patties until desired temperature is reached.Top the patties with cheese right away to let them melt. Build the sandwich as desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/chipotle-tomato-pepper-cheeseburger-553935', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}