{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/490831-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 490831, u'veryPopular': True, u'lowFodmap': False, u'title': u'Coconut Mango Smoothie', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 423.04, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 cup frozen mango chunks', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u'cup'}, {u'originalString': u'1 cup unsweetened coconut milk', u'aisle': u'Canned and Jarred', u'name': u'unsweetened coconut milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'cup'}, {u'originalString': u'1 scoop vanilla protein powder', u'aisle': u'Health Foods', u'name': u'vanilla protein powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'solid', u'id': 99076, u'unit': u'scoop'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://insidebrucrewlife.com/2013/11/coconut-mango-smoothie/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine all ingredients in a blender. Pulse until smooth and creamy.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into a glass and top with extra frozen fruit, if desired. Makes 1 serving.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 2824, u'instructions': u'Combine all ingredients in a blender. Pulse until smooth and creamy. Pour into a glass and top with extra frozen fruit, if desired. Makes 1 serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-mango-smoothie-490831', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}