{u'recipes': [{u'sourceName': u'The Baking Pan', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/672123-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 672123, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peanut Brittle', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 120, u'pricePerServing': 179.22, u'creditText': u'The Baking Pan', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoons'}, {u'originalString': u'1 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'\xbd cup dark corn syrup', u'aisle': u'Baking', u'name': u'dark corn syrup', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19349, u'unit': u'cup'}, {u'originalString': u'3 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'4 cups (1\xbc pounds) roasted, skinless, unsalted peanuts', u'aisle': u'Produce', u'name': u'roasted garlic', u'metaInformation': [u'unsalted', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 11215, u'unit': u'pounds'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons unsalted butter, cut into small pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'small', u'cut into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'\xbe cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://thebakingpan.com/recipes/candy/peanut-brittle/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large, at least 4 quart-size, heavy-bottomed pan, combine granulated sugar, light corn syrup, dark corn syrup, and water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19349, u'name': u'dark corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat over medium-low heat, stirring constantly with a rubber spatula or wooden spoon, until the sugar is completely dissolved. Stir gently to avoid splashing the mixture onto the sides of the pan. When the mixture begins to simmer, cover the pan tightly with a lid for 3 to 4 minutes to allow condensation to form and run down the inside of the pan to help wash away stray sugar crystals.Increase the heat to medium high and bring to a boil, without stirring, until the syrup reaches a temperature of 240 degrees F, a soft ball stage, using a candy or instant read thermometer to gauge the temperature. While the syrup is cooking, wash away any sugar crystals that form on the sides of the pan by wiping upwards with a damp pastry brush so the sugar crystals dont fall back into the syrup.When the mixture has reached 240 degrees, immediately add the peanuts, stirring to mix. Continue boiling the mixture, stirring frequently and scraping the pot bottom to avoid scorching, until the mixture reaches a temperature of 300 degrees F, a hard crack stage. Be careful, the sugar is extremely hot and will burn your skin if you touch it. Immediately remove pan from the heat. Tip: Lower the heat when the temperature reaches about 295 degrees to slow the cooking because at this point it will quickly reach 300 degrees.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the butter, vanilla, and salt; stir carefully and quickly to thoroughly mix. Be careful, the sugar is extremely hot and will burn your skin if you touch it.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the baking soda and stir quickly to thoroughly mix, about 20 seconds; the mixture will immediately start foaming and turn lighter in color and increasing in volume.After you have stirred in the baking soda, and while the mixture is still foaming, immediately pour half of the brittle onto each of the prepared baking pans. Do not scrape out the pan as separated ingredients will mar the top of the brittle. Using a lightly buttered heavy spatula (a spatula that is not too flexible) quickly spread the brittle over the pan about  inch thick. Tip: You must work quickly because it takes less than a minute for the brittle to start cooling, once cooled it will be difficult to spread. Tip: You can stretch the brittle a bit while it is still warm and pliable to make a thinner brittle. Wear rubber gloves so you dont burn your hands, lightly butter your fingertips, gently lift the edges and pull gently from the middle out to the edges. Pull all around the brittle to stretch to an even thickness. It the brittle is too hot to handle wait about 5 seconds and try again.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}]}, {u'equipment': [], u'step': u'Let the brittle cool completely, at least one hour and then break into pieces. Store in a tightly covered container at room temperature or refrigerate. Makes about 3 pounds.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 46, u'instructions': u'In a large, at least 4 quart-size, heavy-bottomed pan, combine granulated sugar, light corn syrup, dark corn syrup, and water. Heat over medium-low heat, stirring constantly with a rubber spatula or wooden spoon, until the sugar is completely dissolved. Stir gently to avoid splashing the mixture onto the sides of the pan. When the mixture begins to simmer, cover the pan tightly with a lid for 3 to 4 minutes to allow condensation to form and run down the inside of the pan to help wash away stray sugar crystals.Increase the heat to medium high and bring to a boil, without stirring, until the syrup reaches a temperature of 240 degrees F, a soft ball stage, using a candy or instant read thermometer to gauge the temperature. While the syrup is cooking, wash away any sugar crystals that form on the sides of the pan by wiping upwards with a damp pastry brush so the sugar crystals dont fall back into the syrup.When the mixture has reached 240 degrees, immediately add the peanuts, stirring to mix. Continue boiling the mixture, stirring frequently and scraping the pot bottom to avoid scorching, until the mixture reaches a temperature of 300 degrees F, a hard crack stage. Be careful, the sugar is extremely hot and will burn your skin if you touch it. Immediately remove pan from the heat. Tip: Lower the heat when the temperature reaches about 295 degrees to slow the cooking because at this point it will quickly reach 300 degrees.Add the butter, vanilla, and salt; stir carefully and quickly to thoroughly mix. Be careful, the sugar is extremely hot and will burn your skin if you touch it. Add the baking soda and stir quickly to thoroughly mix, about 20 seconds; the mixture will immediately start foaming and turn lighter in color and increasing in volume.After you have stirred in the baking soda, and while the mixture is still foaming, immediately pour half of the brittle onto each of the prepared baking pans. Do not scrape out the pan as separated ingredients will mar the top of the brittle. Using a lightly buttered heavy spatula (a spatula that is not too flexible) quickly spread the brittle over the pan about  inch thick. Tip: You must work quickly because it takes less than a minute for the brittle to start cooling, once cooled it will be difficult to spread. Tip: You can stretch the brittle a bit while it is still warm and pliable to make a thinner brittle. Wear rubber gloves so you dont burn your hands, lightly butter your fingertips, gently lift the edges and pull gently from the middle out to the edges. Pull all around the brittle to stretch to an even thickness. It the brittle is too hot to handle wait about 5 seconds and try again.Let the brittle cool completely, at least one hour and then break into pieces. Store in a tightly covered container at room temperature or refrigerate. Makes about 3 pounds.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-brittle-672123', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}