{u'recipes': [{u'sourceName': u'Christines Recipes ', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/526266-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 526266, u'veryPopular': False, u'lowFodmap': False, u'title': u'Singaporean Chilli Crab', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 45, u'pricePerServing': 260.89, u'creditText': u'Christines Recipes ', u'extendedIngredients': [{u'originalString': u'5 red chillies, deseeded and roughly chopped', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'red', u'deseeded', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 Tbsp clear honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'clear honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbsp'}, {u'originalString': u'boiled long-grain rice, to serve', u'aisle': u'Pasta and Rice', u'name': u'cooked rice', u'metaInformation': [u'long-grain', u'boiled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10220445, u'unit': u'servings'}, {u'originalString': u'1.5kg / 3lb 5oz uncooked brown or blue swimmer crabs, or crab claws, scrubbed (I used mud crab.)', u'aisle': u'Seafood', u'name': u'crab', u'metaInformation': [u'blue', u'uncooked', u'scrubbed', u'(I used mud crab.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'kgs', u'unitShort': u'kg', u'amount': 1.5, u'consistency': u'solid', u'id': 15136, u'unit': u'kg'}, {u'originalString': u'2 dried chillies', u'aisle': u'Produce;Ethnic Foods;Spices and Seasonings', u'name': u'dried chillies', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-arbol-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10111962, u'unit': u''}, {u'originalString': u'2 garlic cloves, roughly chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'5cm/2in piece of root ginger, peeled and roughly chopped', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'peeled', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'3 Tbsp light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'Tbsp'}, {u'originalString': u'6 shallots, roughly chopped', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 tsp roasted shrimp paste (I used bottled smooth shrimp paste)', u'aisle': u'Seafood', u'name': u'shrimp paste', u'metaInformation': [u'(I used bottled smooth shrimp paste)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp-paste.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93657, u'unit': u'tsp'}, {u'originalString': u'3 Tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp chilli sauce', u'aisle': u'Ethnic Foods', u'name': u'sweet chilli sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-sauce.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 98962, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp tomato ketchup', u'aisle': u'Condiments', u'name': u'tomato ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'Tbsp'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://en.christinesrecipes.com/2013/01/singaporean-chilli-crab-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'To prepare each crab, pull off the triangular bony tail flap and discard. Press your thumb under the rear end of the crab and lift the body away from the back shell. Discard the shell and remove and discard the stomach bag and the gills at the sides of the body. Rinse the crab flesh and claws under running cold water and pat dry with kitchen paper. Pull the 2 front claws from the bodies and then, using the back of a knife or a mallet, slightly crack the shell of each claw.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 15136, u'name': u'crab'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Cut the crabs into quarters with a large-bladed knife. If using crab claws only, rinse under running cold water and crack the claws slightly using a large-bladed knife.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Tramin Pinot Grigio with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Bright yellow in color with coppery reflections and clear fruit aromas of pear, citrus, honeysuckle, tropical fruits and light spices. Firm, velvety and rich on the palate, with well-integrated acidity. A very round and satisfying wine. Recommended with fish antipasti, risotto with asparagus, omelets and pasta View More', u'title': u'Tramin Pinot Grigio', u'price': u'$18.29', u'id': 448227, u'link': u'https://www.wine.com/product/tramin-pinot-grigio-2009/106454', u'imageUrl': u'https://spoonacular.com/productImages/448227-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'To prepare each crab, pull off the triangular bony tail flap and discard. Press your thumb under the rear end of the crab and lift the body away from the back shell. Discard the shell and remove and discard the stomach bag and the gills at the sides of the body. Rinse the crab flesh and claws under running cold water and pat dry with kitchen paper. Pull the 2 front claws from the bodies and then, using the back of a knife or a mallet, slightly crack the shell of each claw. Cut the crabs into quarters with a large-bladed knife. If using crab claws only, rinse under running cold water and crack the claws slightly using a large-bladed knife.', u'spoonacularSourceUrl': u'https://spoonacular.com/singaporean-chilli-crab-526266', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}