{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/219459-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 219459, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lighter moussaka with crunchy feta & oregano', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 372.2, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 large aubergine, finely chopped', u'aisle': u'Produce', u'name': u'aubergine', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'1 low-sodium lamb or beef stock cube', u'aisle': u'Canned and Jarred', u'name': u'beef stock cube', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6076, u'unit': u''}, {u'originalString': u'2 tbsp breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18079, u'unit': u'tbsp'}, {u'originalString': u'2 courgettes, finely chopped', u'aisle': u'Produce', u'name': u'courgettes', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}, {u'originalString': u'75g light feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 1019, u'unit': u'g'}, {u'originalString': u'300g extra-lean lamb mince', u'aisle': u'Meat', u'name': u'lean lamb mince', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 17353, u'unit': u'g'}, {u'originalString': u'200g low-fat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat greek yogurt', u'metaInformation': [u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 93652, u'unit': u'g'}, {u'originalString': u'1 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'2 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'680g jar passata with garlic & herbs', u'aisle': u'Canned and Jarred', u'name': u'passata', u'metaInformation': [u'with garlic & herbs'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/passata.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 680.0, u'consistency': u'solid', u'id': 10011547, u'unit': u'g'}, {u'originalString': u'140g red lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red lentils', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 10016069, u'unit': u'g'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/lighter-moussaka-crunchy-feta-oregano', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a dry non-stick pan and add the lamb, breaking it up with a fork. Cook until brown, then tip the meat into a bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in the pan and fry the courgettes and aubergines until golden, about 6-8 mins.Return the meat to the pan and add the lentils, half the oregano and the passata. Crumble in the stock cube. Fill the passata jar to about half full with water (about 340ml), swirl and add to the pan. Simmer for 25-30 mins until the lentils are tender, adding more water if you need to. Season to taste.', u'length': {u'number': 38, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': None, u'id': 1026076, u'name': u'bouillon cube'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/passata.jpg', u'id': 10011547, u'name': u'passata'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat the grill to high. Mash together the rest of the oregano with the yogurt, feta and some seasoning.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Pour the lamb mixture into 1 large or 4 individual ovenproof dishes, spoon over the topping, scatter on the crumbs, then grill for 3-4 mins until bubbling.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with salad and flatbreads, if you like.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Moussaka can be paired with Assyrtiko and Moschofilero. If you feel like going Greek with your Greek food, assyrtiko and moschofilero are both lovely white wines to pair with chicken, seafood, etc. Agiorgitiko is a full bodied red suitable for roasted meats and lamb. The Sigalas Assyrtiko Santorini with a 4.2 out of 5 star rating seems like a good match. It costs about 22 dollars per bottle.', u'pairedWines': [u'assyrtiko', u'moschofilero'], u'productMatches': [{u'description': u'Straw blonde color with light shades of green, with a subtle nose ofcitrus fruit. Excellent structure with a depth of flavor and high acidity, which brings the flavors to the front and adds freshness, with a lasting after-taste. Has the characteristic minerally taste of an world class Assyrtiko.', u'title': u'Sigalas Assyrtiko Santorini', u'price': u'$21.99', u'id': 438698, u'link': u'https://www.wine.com/product/sigalas-assyrtiko-santorini-2015/151225', u'imageUrl': u'https://spoonacular.com/productImages/438698-312x231.jpg'}]}, u'aggregateLikes': 140, u'instructions': u'Heat a dry non-stick pan and add the lamb, breaking it up with a fork. Cook until brown, then tip the meat into a bowl. Heat the oil in the pan and fry the courgettes and aubergines until golden, about 6-8 mins.Return the meat to the pan and add the lentils, half the oregano and the passata. Crumble in the stock cube. Fill the passata jar to about half full with water (about 340ml), swirl and add to the pan. Simmer for 25-30 mins until the lentils are tender, adding more water if you need to. Season to taste.Heat the grill to high. Mash together the rest of the oregano with the yogurt, feta and some seasoning. Pour the lamb mixture into 1 large or 4 individual ovenproof dishes, spoon over the topping, scatter on the crumbs, then grill for 3-4 mins until bubbling. Serve with salad and flatbreads, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/lighter-moussaka-with-crunchy-feta-oregano-219459', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}