{u'recipes': [{u'sourceName': u'Spice Up the Curry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600675-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 600675, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eggless Mango Cheesecake | No bake, No gelatin Cheesecake', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 76.9, u'creditText': u'Spice Up the Curry', u'extendedIngredients': [{u'originalString': u'Melted butter - \xbc cup', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'Heavy whipping cream or malai – \xbd cup *Notes', u'aisle': u'Bakery/Bread', u'name': u'cup cake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 18139, u'unit': u''}, {u'originalString': u'Graham cracker crumbs or crushed digestive biscuits- 1 cup', u'aisle': u'Sweet Snacks', u'name': u'digestive biscuits', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/digestive-biscuits.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18173, u'unit': u'cup'}, {u'originalString': u'Granulated sugar – \xbe cup, reduce if using store bought sweetened mango puree', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'sweetened', u'store bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u''}, {u'originalString': u'Granulated Sugar - 2 tablespoons', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'Lemon juice – 1-2 tablespoons, freshly squeezed', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'Mangoes – 2 medium or 1 cup, pureed', u'aisle': u'Produce', u'name': u'mangoes', u'metaInformation': [u'pureed', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u'cup'}, {u'originalString': u'Milk - I will be making fresh paneer out of it and use it in cheesecake. But you can take a shortcut and use store bought 200 grams of crumbled or shredded paneer.', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'fresh', u'shredded', u'store bought', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'can'}, {u'originalString': u'Milk – 4 \xbc cups *Notes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'Thick yogurt – \xbc cup', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1116, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.spiceupthecurry.com/mango-cheese-cake-egg-less/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix the crust ingredients well and press into the pan tightly and evenly. keep it refrigerated for 15-20 minutes. Meanwhile make cheesecake filling.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the milk in a pan for paneer. Once it boils, start adding the lemon juice and stir. It will curdle. Once all the milk curdles turn off the stove. Strain the paneer and whey using muslin cloth.rinse it under cold water and squeeze out all the water.In a bowl, whip the cream till it gets stiff peak. and keep it aside.In the blender puree the mangoes and sugar. add paneer and thick yogurt, blend it again.Then remove it to a bowl. add whipped cream and fold it in.pour the filling on the prepared crust. let it set in refrigerator for 6-7 hours or overnight.Once set, serve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 95, u'instructions': u'Mix the crust ingredients well and press into the pan tightly and evenly. keep it refrigerated for 15-20 minutes. Meanwhile make cheesecake filling.Heat the milk in a pan for paneer. Once it boils, start adding the lemon juice and stir. It will curdle. Once all the milk curdles turn off the stove. Strain the paneer and whey using muslin cloth.rinse it under cold water and squeeze out all the water.In a bowl, whip the cream till it gets stiff peak. and keep it aside.In the blender puree the mangoes and sugar. add paneer and thick yogurt, blend it again.Then remove it to a bowl. add whipped cream and fold it in.pour the filling on the prepared crust. let it set in refrigerator for 6-7 hours or overnight.Once set, serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/eggless-mango-cheesecake-no-bake-no-gelatin-cheesecake-600675', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}