{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/696177-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 696177, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salmon, Cream Cheese & Dill Souffl\xe9', u'diets': [u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 115.63, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'2 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons fine, dry breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'dry breadcrumbs', u'metaInformation': [u'dry', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18079, u'unit': u'tablespoons'}, {u'originalString': u'8 large egg whites, at room temperature (see Tips)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large', u'at room temperature', u'(see Tips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'4 large egg yolks, at room temperature (see Tips)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large', u'at room temperature', u'(see Tips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 tablespoons chopped fresh dill or 2 teaspoons dried', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'dried', u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tablespoons'}, {u'originalString': u'4 ounces reduced-fat cream cheese (Neufch\xe2tel), softened', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [u'softened', u'reduced-fat', u'(Neufch\xe2tel)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounces'}, {u'originalString': u'1 1/2 cups low-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1174, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 ounces smoked salmon, chopped', u'aisle': u'Seafood', u'name': u'smoked salmon', u'metaInformation': [u'smoked', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 15077, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup white whole-wheat flour (see Tips) or all-purpose flour', u'aisle': u'Baking', u'name': u'white flour', u'metaInformation': [u'whole-wheat', u'white', u'all-purpose', u'(see Tips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/salmon_dill_souffle.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Position rack in lower third of oven; preheat to 375F. Coat eight 10-ounce ramekins or a 2 1/2-quart souffl dish (or similar-size baking dish) with cooking spray. Sprinkle with enough breadcrumbs to generously coat the inside, tilting to evenly distribute; tap out excess.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Place ramekins on a baking sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat milk in a small saucepan over medium heat until steaming. Melt butter and oil in a medium saucepan over medium-low heat.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in flour and cook, whisking, for 2 minutes. Slowly whisk in the hot milk and cook over medium-low heat, whisking, until the mixture is the consistency of thick batter, 2 to 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a large bowl.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in egg yolks, one at a time, until incorporated.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in cream cheese until melted, then stir in salmon, dill and pepper.Clean and dry a large mixing bowl and beaters, making sure there are no traces of oil. (Any fat in your egg whites may prevent your souffl from rising properly.) Beat egg whites in the bowl with an electric mixer on medium speed until foamy.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add salt; gradually increase speed to high and beat until shiny and stiff, but not dry. Do not overbeat: stop when the egg whites hold their shape in the bowl and on the beater but dont look overly dry or lumpy.Using a rubber spatula, stir one-third of the whites into the egg-yolk mixture to lighten it. Gently fold in the remaining egg whites just until evenly distributed. Its OK if a few white streaks remain. Spoon the batter into the prepared dish(es).', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake until puffed and firm to the touch, 20 to 24 minutes for 10-ounce souffls, 38 to 42 minutes for a 2 1/2-quart souffl. (Resist the temptation to take a peek until the last 5 minutes of bakingan open oven door will let in too much cool air and may interrupt the rising.) Once out of the oven, even a beautifully puffed souffl will slowly deflate, so go directly to the table to show off its beauty, then serve it at once.', u'length': {u'number': 63, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Tiamo Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u"Light straw yellow color. Fresh and rich fruity aromas of apple and pear with a hint of citrus fruit that fade into the floral bouquet. Fresh and fruity, very clean and crisp.Tiamo Pinot Grigio pairs well with a wide array of lighter cuisine, especially fish/shellfish, poultry, pastas in cream sauce and softer cheeses. It's also an ideal aperitif.", u'title': u'Tiamo Pinot Grigio', u'price': u'$8.49', u'id': 438682, u'link': u'https://www.wine.com/product/tiamo-pinot-grigio-2008/98091', u'imageUrl': u'https://spoonacular.com/productImages/438682-312x231.jpg'}]}, u'aggregateLikes': 863, u'instructions': u'Position rack in lower third of oven; preheat to 375F. Coat eight 10-ounce ramekins or a 2 1/2-quart souffl dish (or similar-size baking dish) with cooking spray. Sprinkle with enough breadcrumbs to generously coat the inside, tilting to evenly distribute; tap out excess. Place ramekins on a baking sheet.Heat milk in a small saucepan over medium heat until steaming. Melt butter and oil in a medium saucepan over medium-low heat. Whisk in flour and cook, whisking, for 2 minutes. Slowly whisk in the hot milk and cook over medium-low heat, whisking, until the mixture is the consistency of thick batter, 2 to 4 minutes. Transfer to a large bowl. Whisk in egg yolks, one at a time, until incorporated. Whisk in cream cheese until melted, then stir in salmon, dill and pepper.Clean and dry a large mixing bowl and beaters, making sure there are no traces of oil. (Any fat in your egg whites may prevent your souffl from rising properly.) Beat egg whites in the bowl with an electric mixer on medium speed until foamy. Add salt; gradually increase speed to high and beat until shiny and stiff, but not dry. Do not overbeat: stop when the egg whites hold their shape in the bowl and on the beater but dont look overly dry or lumpy.Using a rubber spatula, stir one-third of the whites into the egg-yolk mixture to lighten it. Gently fold in the remaining egg whites just until evenly distributed. Its OK if a few white streaks remain. Spoon the batter into the prepared dish(es).Bake until puffed and firm to the touch, 20 to 24 minutes for 10-ounce souffls, 38 to 42 minutes for a 2 1/2-quart souffl. (Resist the temptation to take a peek until the last 5 minutes of bakingan open oven door will let in too much cool air and may interrupt the rising.) Once out of the oven, even a beautifully puffed souffl will slowly deflate, so go directly to the table to show off its beauty, then serve it at once.', u'spoonacularSourceUrl': u'https://spoonacular.com/salmon-cream-cheese-dill-souffl-696177', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}