{u'recipes': [{u'sourceName': u'Diethood', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/566449-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 566449, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Chip Cookie Sandwiches with Nutella Cream Cheese Filling', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 66.0, u'creditText': u'Diethood', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 sticks butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'sticks'}, {u'originalString': u'1 package (8 oz.) cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 cup Nutella', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'nutella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19125, u'unit': u'cup'}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 bag (12 oz.) semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'oz'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup white chocolate chips, melted', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10019087, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://diethood.com/2013/01/22/chocolate-chip-cookie-sandwiches-with-nutella-cream-cheese-filling/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350. Line 3 baking sheets with parchment paper and set aside. Sift together the flour and baking soda in a small bowl and set aside. In a large mixing bowl, combine the butter, sugar, and light brown sugar; beat on medium speed until light and fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'id': 19334, u'name': u'light brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add the salt, vanilla, and eggs and continue to beat on low until thoroughly combined.Slowly add the flour mixture and mix until combined. Stir in the chocolate chips.Drop by rounded tablespoon onto prepared baking sheets, 2 inches apart.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake for 8 to 10 minutes, or until cookies are golden brown around the edges.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Remove and let cool for 2 minutes on the baking sheet; transfer to a wire rack, and let cool completely. While the cookies are cooling, make the Filling', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a medium-sized mixing bowl combine the cream cheese and powdered sugar; beat with electric mixer on medium speed until creamy.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add in the melted white chocolate chips and Nutella; continue to mix until thoroughly combined.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'id': 10019087, u'name': u'white chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'id': 19125, u'name': u'chocolate hazelnut spread'}]}, {u'equipment': [], u'step': u'Let sit in the refrigerator for 10 minutes before using.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the frosting on the flat side of half of the cookies and put the remaining cookies on top. Refrigerate for 20 minutes to allow the filling to stiffen slightly.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve cookies at room temperature.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 640, u'instructions': u'Preheat oven to 350. Line 3 baking sheets with parchment paper and set aside. Sift together the flour and baking soda in a small bowl and set aside. In a large mixing bowl, combine the butter, sugar, and light brown sugar; beat on medium speed until light and fluffy.Add the salt, vanilla, and eggs and continue to beat on low until thoroughly combined.Slowly add the flour mixture and mix until combined. Stir in the chocolate chips.Drop by rounded tablespoon onto prepared baking sheets, 2 inches apart.Bake for 8 to 10 minutes, or until cookies are golden brown around the edges. Remove and let cool for 2 minutes on the baking sheet; transfer to a wire rack, and let cool completely. While the cookies are cooling, make the FillingIn a medium-sized mixing bowl combine the cream cheese and powdered sugar; beat with electric mixer on medium speed until creamy.Add in the melted white chocolate chips and Nutella; continue to mix until thoroughly combined.Let sit in the refrigerator for 10 minutes before using.Spread the frosting on the flat side of half of the cookies and put the remaining cookies on top. Refrigerate for 20 minutes to allow the filling to stiffen slightly. Serve cookies at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-chip-cookie-sandwiches-with-nutella-cream-cheese-filling-566449', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 18, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}