{u'recipes': [{u'sourceName': u'Just a Taste', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/608342-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 608342, u'veryPopular': True, u'lowFodmap': False, u'title': u'Baked Teriyaki Chicken Meatballs', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 27.83, u'creditText': u'Just a Taste', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup crushed pineapple (juices drained)', u'aisle': u'Canned and Jarred', u'name': u'crushed pineapple', u'metaInformation': [u'crushed', u'drained', u'(juices )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'liquid', u'id': 1019354, u'unit': u''}, {u'originalString': u'2 teaspoons minced fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 pounds ground chicken', u'aisle': u'Meat', u'name': u'ground chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 5332, u'unit': u'pounds'}, {u'originalString': u'2 Tablespoons low sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/4 cup Panko breadcrumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'1/4 cup pineapple juice', u'aisle': u'Beverages', u'name': u'pineapple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9273, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 Tablespoons minced scallions', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tablespoons'}, {u'originalString': u'1 Tablespoon water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.justataste.com/2014/08/baked-teriyaki-chicken-meatballs-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Make the meatballs:Preheat the oven to 500\xbaF. Spray a mini-muffin pan or baking dish with cooking spray.In a small bowl, stir together the milk and Panko breadcrumbs and let sit for 5 minutes.In a large bowl, combine the ground chicken, garlic, ginger, scallions, soy sauce, crushed pineapple, pepper and soaked breadcrumbs. Use your hands to thoroughly combine the meat mixture and then shape it into balls using 2 to 3 tablespoons of meat per meatball.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1019354, u'name': u'crushed pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 5332, u'name': u'ground chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the shaped meatballs into the prepared pan and bake for 12 to 15 minutes until the meatballs are fully cooked. While the meatballs are baking, prepare the sauce.Make the sauce:In a medium saucepan set over medium heat, whisk together the soy sauce, water, pineapple juice, brown sugar, garlic and ginger. Cook, whisking constantly, until the sugar has dissolved fully. In a small bowl, whisk together the cornstarch with the water to make a slurry.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-juice.jpg', u'id': 9273, u'name': u'pineapple juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the slurry into the sauce and simmer until it has thickened to the consistency of syrup, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the meatballs from the oven and transfer them into a large bowl.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the sauce on top and toss to coat.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Serve immediately.Kelly's Notes:After draining the crushed pineapple, use the resulting juice in the sauce recipe.The meatball mixture will be very wet while you are shaping it into balls, however the added liquid from the milk and crushed pineapple helps guarantee the meatballs will be very moist.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'id': 1019354, u'name': u'crushed pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 20812, u'instructions': u"Make the meatballs:Preheat the oven to 500\xbaF. Spray a mini-muffin pan or baking dish with cooking spray.In a small bowl, stir together the milk and Panko breadcrumbs and let sit for 5 minutes.In a large bowl, combine the ground chicken, garlic, ginger, scallions, soy sauce, crushed pineapple, pepper and soaked breadcrumbs. Use your hands to thoroughly combine the meat mixture and then shape it into balls using 2 to 3 tablespoons of meat per meatball.Place the shaped meatballs into the prepared pan and bake for 12 to 15 minutes until the meatballs are fully cooked. While the meatballs are baking, prepare the sauce.Make the sauce:In a medium saucepan set over medium heat, whisk together the soy sauce, water, pineapple juice, brown sugar, garlic and ginger. Cook, whisking constantly, until the sugar has dissolved fully. In a small bowl, whisk together the cornstarch with the water to make a slurry. Whisk the slurry into the sauce and simmer until it has thickened to the consistency of syrup, about 5 minutes.Remove the meatballs from the oven and transfer them into a large bowl. Pour the sauce on top and toss to coat. Serve immediately.Kelly's Notes:After draining the crushed pineapple, use the resulting juice in the sauce recipe.The meatball mixture will be very wet while you are shaping it into balls, however the added liquid from the milk and crushed pineapple helps guarantee the meatballs will be very moist.", u'spoonacularSourceUrl': u'https://spoonacular.com/baked-teriyaki-chicken-meatballs-608342', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}