{u'recipes': [{u'sourceName': u'Just One Cookbook', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/540928-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 540928, u'veryPopular': False, u'lowFodmap': True, u'title': u'Japanese Cucumber Salad', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 116.69, u'creditText': u'Just One Cookbook', u'extendedIngredients': [{u'originalString': u'4 crab sticks (kanikama) (optional)', u'aisle': u'Seafood', u'name': u'crab', u'metaInformation': [u'(kanikama)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 15136, u'unit': u''}, {u'originalString': u'2 Japanese cucumbers (2/3 English cucumber)', u'aisle': u'Produce', u'name': u'cucumbers', u'metaInformation': [u'english'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'3 Tbsp. rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'Tbsp'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'Sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'\xbd Tbsp. soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsp. dashi stock (For vegetarian, use kombu dashi or water)', u'aisle': u'Ethnic Foods', u'name': u'dashi', u'metaInformation': [u'(For vegetarian, use kombu dashi or water)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1006963, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp. wakame', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'wakame', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wakame.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 11669, u'unit': u'Tbsp'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.justonecookbook.com/recipes/japanese-cucumber-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'If you are using Japanese cucumber, this step called “Itazuri” is necessary. Wash the cucumber and sprinkle salt. With both hands, rub the cucumber against the cutting board. It removes the pointy bumps on the cucumber and it helps absorb the dressing.Peel the cucumber and slice into thin slices.Sprinkle salt and rub the cucumber each other gently with hands. After cucumber is wilted (about 5 minutes), wash the cucumber under cold water. Squeeze the cucumber to get rid of water.Put dried wakame in a small bowl and soak in water. After 10 minutes, squeeze dry to get rid of water.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wakame.jpg', u'id': 11669, u'name': u'wakame'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Cut the crab sticks in half.In a small saucepan, combine dressing ingredients and mix well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 15136, u'name': u'crab'}]}, {u'equipment': [], u'step': u'Heat until sugar is all dissolved.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove from heat and set aside.In a large bowl, combine cucumber, wakame, and crab sticks.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wakame.jpg', u'id': 11669, u'name': u'wakame'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 15136, u'name': u'crab'}]}, {u'equipment': [], u'step': u'Pour the dressing over and mix together. Sprinkle sesame seeds and enjoy at room temperature or chilled.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are great choices for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Dry Creek Vineyard Dry Chenin Blanc, Wine with a 5 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This beautiful wine is wonderfully consistent vintage after vintage. We receive superior Chenin Blanc fruit from the Wilson Ranch in Clarksburg, allowing us to produce an expressive, nuanced and delicious wine. At first swirl, aromatics of white pear, pineapple and banana spring forward from the glass. On the palate, the wine is refreshing with flavors of ripe tangerine and peaches. The mouthfeel is lively, but rich and has a subtle creaminess. 100% stainless steel fermentation guarantees the fresh fruit character fans of this wine have come to appreciate over the years. This is the quintessential summer sipper and the perfect wine to pair with fresh oysters!', u'title': u'Dry Creek Vineyard Dry Chenin Blanc, Wine', u'price': u'$15.0', u'id': 430261, u'link': u'https://www.amazon.com/Dry-Creek-Vineyard-Chenin-Clarksburg/dp/B01N30XOBY', u'imageUrl': u'https://spoonacular.com/productImages/430261-312x231.jpg'}]}, u'aggregateLikes': 60, u'instructions': u'If you are using Japanese cucumber, this step called “Itazuri” is necessary. Wash the cucumber and sprinkle salt. With both hands, rub the cucumber against the cutting board. It removes the pointy bumps on the cucumber and it helps absorb the dressing.Peel the cucumber and slice into thin slices.Sprinkle salt and rub the cucumber each other gently with hands. After cucumber is wilted (about 5 minutes), wash the cucumber under cold water. Squeeze the cucumber to get rid of water.Put dried wakame in a small bowl and soak in water. After 10 minutes, squeeze dry to get rid of water.Cut the crab sticks in half.In a small saucepan, combine dressing ingredients and mix well. Heat until sugar is all dissolved. Remove from heat and set aside.In a large bowl, combine cucumber, wakame, and crab sticks. Pour the dressing over and mix together. Sprinkle sesame seeds and enjoy at room temperature or chilled.', u'spoonacularSourceUrl': u'https://spoonacular.com/japanese-cucumber-salad-540928', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}