{u'recipes': [{u'sourceName': u'Jelly Toast Blog', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/608215-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 608215, u'veryPopular': False, u'lowFodmap': True, u'title': u'caramel espresso martini', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 201.44, u'creditText': u'Jelly Toast Blog', u'extendedIngredients': [{u'originalString': u'1 1/2 ounces HiLine Coffee Espresso (I used their Liberty Blend), chilled', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'chilled', u'(I used their Liberty Blend)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'solid', u'id': 14209, u'unit': u'ounces'}, {u'originalString': u'1 ounce creme de cocoa (white)', u'aisle': u'Alcoholic Beverages', u'name': u'creme de cocoa', u'metaInformation': [u'white', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/creme-de-cacao.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 93712, u'unit': u'ounce'}, {u'originalString': u'ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'serving'}, {u'originalString': u'1 ounce Kahlua', u'aisle': u'Alcoholic Beverages', u'name': u'kahlua', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coffee-liqueur.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 93716, u'unit': u'ounce'}, {u'originalString': u'1 1/2 ounces caramel vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'liquid', u'id': 14051, u'unit': u'ounces'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 2.0, u'sourceUrl': u'http://jellytoastblog.com/2014/08/espresso-martini.html/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [], u'winePairing': {u'pairingText': u"Riesling, Sparkling Wine, and Zinfandel are great choices for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Columbia Winery Cellarmaster's Riesling with a 4.7 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 121, u'instructions': u'Directions:Fill a cocktail shaker with ice and add cocktail ingredients. Replace the lid and shake until chilled. Strain into a martini glass and serve. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-espresso-martini-608215', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}