{u'recipes': [{u'sourceName': u'Sarahs Cucina Bella', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/535845-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 535845, u'veryPopular': False, u'lowFodmap': False, u'title': u'Whole Wheat Biscuit', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 18.02, u'creditText': u'Sarahs Cucina Bella', u'extendedIngredients': [{u'originalString': u'1/2 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 1/2 tbsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tbsp'}, {u'originalString': u'1 tsp kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1 cup low-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1174, u'unit': u'cup'}, {u'originalString': u'1 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1/4 cup cold unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 1/2 cup whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20080, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://sarahscucinabella.com/2010/03/02/whole-wheat-biscuit-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Preheat oven to 450 degrees.Sift together the all purpose flour, whole wheat flour, baking powder, sugar and salt in a medium bowl. Using two knives, cut in the butter until it's finely chopped and the mixture resembles crumbles.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20080, u'name': u'whole wheat flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u"Add the milk and stir until just combined. The dough should be moist, but not in one cohesive ball yet.Turn the dough out onto a well floured surface. Knead the dough 10-15 times (it's going to be sticky). Then lift it, reflour the board and set it back down. (This is a good time to wash your hands). Sprinkle the top of the dough with additional flour as well as the rolling pin.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Roll the dough out to a thin sheet and fold in two ends.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out again and repeat the process 2-3 times. Then, roll it to a 3/4-inch thickness. Use a biscuit cutter (2 1/2-3 inches) to cut biscuits.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place them on an ungreased cookie sheet.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake the biscuits for 12-14 minutes, until golden brown.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 98, u'instructions': u"Preheat oven to 450 degrees.Sift together the all purpose flour, whole wheat flour, baking powder, sugar and salt in a medium bowl. Using two knives, cut in the butter until it's finely chopped and the mixture resembles crumbles. Add the milk and stir until just combined. The dough should be moist, but not in one cohesive ball yet.Turn the dough out onto a well floured surface. Knead the dough 10-15 times (it's going to be sticky). Then lift it, reflour the board and set it back down. (This is a good time to wash your hands). Sprinkle the top of the dough with additional flour as well as the rolling pin. Roll the dough out to a thin sheet and fold in two ends. Roll out again and repeat the process 2-3 times. Then, roll it to a 3/4-inch thickness. Use a biscuit cutter (2 1/2-3 inches) to cut biscuits. Place them on an ungreased cookie sheet.Bake the biscuits for 12-14 minutes, until golden brown. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/whole-wheat-biscuit-535845', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}