{u'recipes': [{u'sourceName': u'Skinny Taste', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/858086-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 858086, u'veryPopular': True, u'lowFodmap': False, u'title': u'Honey Teriyaki Drumsticks', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 116.8, u'creditText': u'Skinny Taste', u'extendedIngredients': [{u'originalString': u'8 drumsticks (28 oz), skinless', u'aisle': u'Meat', u'name': u'drumsticks', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 5066, u'unit': u'oz'}, {u'originalString': u'1 teaspoon fresh grated ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tbsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp rice wine', u'aisle': u'Alcoholic Beverages', u'name': u'rice wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 43479, u'unit': u'tbsp'}, {u'originalString': u'chopped scallions', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'1 tbsp sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tbsp'}, {u'originalString': u'1/4 cup low sodium soy sauce (or gluten free)', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'gluten free', u'low sodium', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16124, u'unit': u'cup'}, {u'originalString': u'1 teaspoon sriracha (optional)', u'aisle': u'Condiments', u'name': u'sriracha', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'teaspoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.skinnytaste.com/honey-teriyaki-drumsticks-skillet-or-instant-pot/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine soy sauce, rice wine, honey, garlic, ginger and sriracha in a skillet and cook medium-low, stirring for about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 43479, u'name': u'rice wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add the chicken and cook 5 minutes, covered. Turn chicken, cover and cook 20 minutes over medium-low. Turn again, cover and cook 15 minutes, until the chicken is very tender.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': None, u'id': 414093, u'name': u'instant pot'}], u'step': u"Remove the cover, if the sauce isn't thick simmer uncovered until sauce thickens, about 2 minutes. Finish with scallions and sesame seeds.Instant Pot directions: Use saute button, when hot add soy sauce, rice wine, honey, garlic, ginger and sriracha and cook 2 minutes, stirring.", u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 43479, u'name': u'rice wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add the chicken, cover and lock the lid. Cook on high pressure 15 to 20 minutes until the chicken is tender. When pressure releases, finish with scallions and sesame seeds.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Drumsticks works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 5836, u'instructions': u"Combine soy sauce, rice wine, honey, garlic, ginger and sriracha in a skillet and cook medium-low, stirring for about 2 minutes. Add the chicken and cook 5 minutes, covered. Turn chicken, cover and cook 20 minutes over medium-low. Turn again, cover and cook 15 minutes, until the chicken is very tender. Remove the cover, if the sauce isn't thick simmer uncovered until sauce thickens, about 2 minutes. Finish with scallions and sesame seeds.Instant Pot directions: Use saute button, when hot add soy sauce, rice wine, honey, garlic, ginger and sriracha and cook 2 minutes, stirring. Add the chicken, cover and lock the lid. Cook on high pressure 15 to 20 minutes until the chicken is tender. When pressure releases, finish with scallions and sesame seeds.", u'spoonacularSourceUrl': u'https://spoonacular.com/honey-teriyaki-drumsticks-858086', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}