{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/596885-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 596885, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cereal Milk Ice Cream', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 131.86, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 tablespoon light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons freeze-dried corn powder (optional)', u'aisle': u'Dried Fruits', u'name': u'freeze dried strawberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/freeze-dried-strawberries.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 98946, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 gelatin sheets or 1/4 teaspoon powdered gelatin', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'sheet', u'unitShort': u'sheets', u'amount': 1.0, u'consistency': u'solid', u'id': 19177, u'unit': u'sheets'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons light brown sugar, tightly packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup milk powder', u'aisle': u'Baking', u'name': u'milk powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1090, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://leitesculinaria.com/81513/recipes-cereal-milk-ice-cream.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'If using sheet gelatin, soak it in a small bowl of cold water until it has become soft, about 2 minutes. If the gelatin still has hard bits to it, it needs to bloom longer. If it is so soft it is falling apart, it is overbloomed; discard the gelatin and start over. Gently squeeze the bloomed gelatin to remove any excess water before using.If using powdered gelatin, sprinkle it evenly over a scant 2 tablespoons cold water in a cup. If you pour the powdered gelatin into a pile on top of the water, the granules in the center will remain hard and will not bloom. If you use too much water to bloom the gelatin, it will dilute the flavor of the recipe and its consistency will be looser than intended. Allow the granules to soften entirely in the cold water for 3 to 5 minutes.2. Warm a little bit of the cereal milk and whisk in the gelatin to dissolve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin-leaves.png', u'id': 10019177, u'name': u'sheet gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the remaining cereal milk, the corn powder, if using, sugar, salt, milk powder, and corn syrup until everything is fully dissolved and incorporated. This is your ice-cream base.3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'id': 1090, u'name': u'powdered milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Pour the mixture through a fine-mesh sieve into your ice-cream maker and freeze according to the manufacturer’s instructions. The ice cream is best made just before serving, but it will keep in an airtight container in the freezer for up to 2 weeks.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 47, u'instructions': u'1. If using sheet gelatin, soak it in a small bowl of cold water until it has become soft, about 2 minutes. If the gelatin still has hard bits to it, it needs to bloom longer. If it is so soft it is falling apart, it is overbloomed; discard the gelatin and start over. Gently squeeze the bloomed gelatin to remove any excess water before using.If using powdered gelatin, sprinkle it evenly over a scant 2 tablespoons cold water in a cup. If you pour the powdered gelatin into a pile on top of the water, the granules in the center will remain hard and will not bloom. If you use too much water to bloom the gelatin, it will dilute the flavor of the recipe and its consistency will be looser than intended. Allow the granules to soften entirely in the cold water for 3 to 5 minutes.2. Warm a little bit of the cereal milk and whisk in the gelatin to dissolve. Whisk in the remaining cereal milk, the corn powder, if using, sugar, salt, milk powder, and corn syrup until everything is fully dissolved and incorporated. This is your ice-cream base.3. Pour the mixture through a fine-mesh sieve into your ice-cream maker and freeze according to the manufacturer’s instructions. The ice cream is best made just before serving, but it will keep in an airtight container in the freezer for up to 2 weeks.', u'spoonacularSourceUrl': u'https://spoonacular.com/cereal-milk-ice-cream-596885', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}