{u'recipes': [{u'sourceName': u'A Pretty Life in the Suburbs', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/524286-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 524286, u'veryPopular': False, u'lowFodmap': False, u'title': u'Best Ever Hamburgers', u'diets': [u'gluten free'], u'pricePerServing': 90.24, u'creditText': u'A Pretty Life in the Suburbs', u'extendedIngredients': [{u'originalString': u'1-2 tbsp brown sugar (optional)', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 lb of lean ground beef', u'aisle': u'Meat', u'name': u'lean ground beef', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground-red.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 23557, u'unit': u'lb'}, {u'originalString': u'2 tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'1 small onion, minced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'salt & pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 46.0, u'sourceUrl': u'http://www.aprettylifeinthesuburbs.com/2011/04/whats-for-dinner-hamburgers.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine all ingredients.Shape into patties. I usually make mine about 5 inches wide and \xbe inch thick.These are best left to rest in the fridge for at least 1 hour before BBQing.BBQ until the burger is well done, with no pink inside.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger on the menu? Try pairing with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Finca La Malena Malbec. It has 5 out of 5 stars and a bottle costs about 14 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'100% Malbec from eastern Mendoza. Limestone and clay soils, cool winters and warm summers provide great fruit concentration, and smooth tannins. Dark ruby in color reflecting light in an array of orange/purple hues. Pleasant nose filled with hints of red forest fruits and herbs. Young round tannins give it a silky sensuous texture that leads to a rich mouthfeel. Mouthwatering layers of red berries, plum, vanilla and spice open as it warms up, delivering a rich varietal character. A delicate finish that bridges the gap between drinks and lingers well after the last sip.', u'title': u'Finca La Malena Malbec', u'price': u'$13.99', u'id': 431374, u'link': u'https://www.amazon.com/2015-Finca-Malena-Malbec-750mL/dp/B01N9QTXGO', u'imageUrl': u'https://spoonacular.com/productImages/431374-312x231.jpg'}]}, u'aggregateLikes': 259, u'instructions': u'Combine all ingredients.Shape into patties. I usually make mine about 5 inches wide and \xbe inch thick.These are best left to rest in the fridge for at least 1 hour before BBQing.BBQ until the burger is well done, with no pink inside.', u'spoonacularSourceUrl': u'https://spoonacular.com/best-ever-hamburgers-524286', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}