{u'recipes': [{u'sourceName': u'Gimme Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/675870-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 675870, u'veryPopular': False, u'lowFodmap': False, u'title': u'Low-Carb Cauliflower Crust Bread Sticks', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 198.17, u'creditText': u'Gimme Delicious', u'extendedIngredients': [{u'originalString': u'2-3 tablespoons italian breadcrumbs (optional: please see note below)', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [u'italian', u'(optional: please see note below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18079, u'unit': u'tablespoons'}, {u'originalString': u'3 cups cauliflower florets', u'aisle': u'Produce', u'name': u'cauliflower florets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10011135, u'unit': u'cups'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tsp crushed garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'2 cloves garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons softened light butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'light butter', u'metaInformation': [u'light', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4602, u'unit': u'tablespoons'}, {u'originalString': u'*Optional Marinara sauce for dipping', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [u'for dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'servings'}, {u'originalString': u'2 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'\xbd cup Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'\xbd cup grated parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'\xbd cup grated reduced fat mozzarella cheese', u'aisle': u'Cheese', u'name': u'reduced fat shredded mozzarella cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001028, u'unit': u'cup'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbd cup shredded reduced fat mozzarella cheese or tex-mex cheese', u'aisle': u'?', u'name': u'tex-mex cheese', u'metaInformation': [u'shredded'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}, {u'originalString': u'Toppings', u'aisle': u'?', u'name': u'toppings', u'metaInformation': [], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'unit': u'servings'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://gimmedelicious.com/2015/08/13/low-carb-cauliflower-crust-breadsticks/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F. Rinse cauliflower separate into florets.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place cauliflower florets in a food processor and process until it reaches a rice/couscous texture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10011135, u'name': u'cauliflower florets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place the cauliflower in a microwave container and cover with lid or plastic wrap. Microwavable for 5-7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the microwaved cauliflower in a large bowl and add the eggs, Parmesan and Mozzarella, oregano, crushed garlic and stir until combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Transfer to the baking stone or sheet, and using your hands, pat out into a large rectangle', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 400 degrees for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix 2 the tablespoons butter and diced garlic in a small bowl then spread the butter and garlic mixture over baked cauliflower bread and top with Parmesan and Mozzarella cheeses.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place back in the 400 degree oven for 5 minutes or until all the cheese is bubbly and melted.Slice and', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with warm marinara or your favorite dipping sauce!', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The MYX Fusions Myxotica Moscato ( half-bottle) with a 4.5 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"This limited edition Myxotica Moscato was released in promotion of Nicki Minaj's third album The Pink Print. A delicious passion fruit flavored moscato in a pink autographed bottle.", u'title': u'MYX Fusions Myxotica Moscato ( half-bottle)', u'price': u'$11.99', u'id': 439091, u'link': u'https://www.wine.com/product/myx-fusions-myxotica-moscato-375ml-half-bottle/140093', u'imageUrl': u'https://spoonacular.com/productImages/439091-312x231.jpg'}]}, u'aggregateLikes': 222, u'instructions': u'Preheat oven to 400 degrees F. Rinse cauliflower separate into florets. Place cauliflower florets in a food processor and process until it reaches a rice/couscous texture. Place the cauliflower in a microwave container and cover with lid or plastic wrap. Microwavable for 5-7 minutes. Place the microwaved cauliflower in a large bowl and add the eggs, Parmesan and Mozzarella, oregano, crushed garlic and stir until combined.Transfer to the baking stone or sheet, and using your hands, pat out into a large rectangleBake at 400 degrees for 15 minutes. Remove from oven. Mix 2 the tablespoons butter and diced garlic in a small bowl then spread the butter and garlic mixture over baked cauliflower bread and top with Parmesan and Mozzarella cheeses.Place back in the 400 degree oven for 5 minutes or until all the cheese is bubbly and melted.Slice and Serve with warm marinara or your favorite dipping sauce!', u'spoonacularSourceUrl': u'https://spoonacular.com/low-carb-cauliflower-crust-bread-sticks-675870', u'dishTypes': [u'side dish', u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}