{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/426361-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 105, u'id': 426361, u'veryPopular': False, u'lowFodmap': False, u'title': u"Al's Baked Swiss Steak", u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 315.77, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/4 cup beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6008, u'unit': u'cup'}, {u'originalString': u'1 pound boneless beef round steak', u'aisle': u'Meat', u'name': u'beef steak', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 23232, u'unit': u'pound'}, {u'originalString': u'1 (14.5 ounce) can stewed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1/2 cup chopped carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1/4 cup chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 tablespoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 green bell pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1/4 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u"1/2 teaspoon seasoned salt (such as LAWRY'S\xae)", u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [u"(such as LAWRY'S\xae)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1042047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup shredded sharp Cheddar cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Als-Baked-Swiss-Steak/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F (175 degrees C). Grease a shallow baking dish.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut steak into four portions and pound to 1/4-inch thickness; season with salt, pepper, and seasoned salt. Coat meat evenly with about 1 tablespoon flour.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1042047, u'name': u'seasoned salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Heat oil in a skillet over medium heat. Cook beef in hot oil until browned completely, 3 to 5 minutes per side; transfer to prepared baking dish reserving drippings in the skillet.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'To the drippings, add tomatoes, onion, green bell pepper, beef broth, carrots, celery, garlic, 1 tablespoon flour, and Worcestershire sauce. Bring the tomato mixture to a boil; cook and stir for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour the mixture over the meat in the baking dish. Cover dish with aluminum foil.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake until beef is completely tender, about 90 minutes. Sprinkle cheese over beef and return to oven uncovered until cheese is melted, 3 to 5 minutes.', u'length': {u'number': 93, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is Sagebrush Annie's Ventura County Cabernet Sauvignon & Merlot Ventura County. It has 5 out of 5 stars and a bottle costs about 32 dollars.", u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': None, u'title': u"Sagebrush Annie's Ventura County Cabernet Sauvignon & Merlot Ventura County", u'price': u'$32.0', u'id': 469320, u'link': u'https://www.amazon.com/Sagebrush-Annies-Ventura-Cabernet-Sauvignon/dp/B00BI8KTSG', u'imageUrl': u'https://spoonacular.com/productImages/469320-312x231.jpg'}]}, u'aggregateLikes': 41, u'instructions': u'Preheat oven to 350 degrees F (175 degrees C). Grease a shallow baking dish.                            Cut steak into four portions and pound to 1/4-inch thickness; season with salt, pepper, and seasoned salt. Coat meat evenly with about 1 tablespoon flour.                            Heat oil in a skillet over medium heat. Cook beef in hot oil until browned completely, 3 to 5 minutes per side; transfer to prepared baking dish reserving drippings in the skillet.                            To the drippings, add tomatoes, onion, green bell pepper, beef broth, carrots, celery, garlic, 1 tablespoon flour, and Worcestershire sauce. Bring the tomato mixture to a boil; cook and stir for 2 minutes. Pour the mixture over the meat in the baking dish. Cover dish with aluminum foil.                            Bake until beef is completely tender, about 90 minutes. Sprinkle cheese over beef and return to oven uncovered until cheese is melted, 3 to 5 minutes.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/als-baked-swiss-steak-426361', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 125, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}