{u'recipes': [{u'sourceName': u'Fit Foodie Finds', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/612874-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 612874, u'veryPopular': False, u'lowFodmap': True, u'title': u'Herb Roasted Whole Chicken', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 20, u'pricePerServing': 256.15, u'creditText': u'Fit Foodie Finds', u'extendedIngredients': [{u'originalString': u'- 1 teaspoon basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'teaspoon'}, {u'originalString': u'-2 tablespoons of grass fed butter, thinly sliced', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'grass fed', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'-2 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'-1/2 lemon (juice)', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'(juice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'-1 Tablespoon of olive oil (for brushing)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'(for brushing)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoon'}, {u'originalString': u'-4 medium potatoes', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'-Roasting Chicken (Approx 4 lbs)', u'aisle': u'Meat', u'name': u'roasting chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 5109, u'unit': u'lbs'}, {u'originalString': u'- 1 teaspoon rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2036, u'unit': u'teaspoon'}, {u'originalString': u'-salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'- 1 teaspoon thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'-1 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://fitfoodiefinds.com/2014/09/herb-roasted-whole-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Begin by preheating oven to 400F.Next, prep roasting chicken, by removing the innards from the cavity (usually it's in a bag inside the cavity).", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 5109, u'name': u'roasting chicken'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the chicken on a roasting pan with rack. You are more than welcome to trim the fat at this point, but it creates delicious flavor if you leave it on. Prep potatoes, by cutting them into quarters and placing on the bottom of the pan around the chicken.Next, rub chicken with about a tablespoon of olive oil. Then, season chicken (and potato wedges) with salt and pepper (to taste), thyme, rosemary, and basil. Again- all of these spices are to taste. I used about 1/2 teaspoon - 1 teaspoon of each spice. Take a half a lemon and squeeze juice over the top of chicken. And, place 2 tablespoons of butter (thinly sliced) and a wedge of lemon on top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Pour about 2 cups of chicken stock on the bottom of your roasting pan. This will be used for basting later.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place chicken in oven at 400F and let roast for about 60 minutes. At this point, baste chicken with chicken stock from the bottom of pan.', u'length': {u'number': 60, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place back in oven and let cook for 15-30 minutes longer. Instert meat thermometer in one of the chicken breasts. It should read ~180. If it has not reached this temperature, baste again and place back in oven to continue cooking until done.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Whole Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Chehalem INOX Chardonnay. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 54, u'instructions': u"<ol><li>Begin by preheating oven to 400F.</li><li>Next, prep roasting chicken, by removing the innards from the cavity (usually it's in a bag inside the cavity). </li><li>Place the chicken on a roasting pan with rack. You are more than welcome to trim the fat at this point, but it creates delicious flavor if you leave it on. </li><li>Prep potatoes, by cutting them into quarters and placing on the bottom of the pan around the chicken.</li><li>Next, rub chicken with about a tablespoon of olive oil. Then, season chicken (and potato wedges) with salt and pepper (to taste), thyme, rosemary, and basil. Again- all of these spices are to taste. I used about 1/2 teaspoon - 1 teaspoon of each spice. Take a half a lemon and squeeze juice over the top of chicken. And, place 2 tablespoons of butter (thinly sliced) and a wedge of lemon on top.</li><li>Pour about 2 cups of chicken stock on the bottom of your roasting pan. This will be used for basting later. </li><li>Place chicken in oven at 400F and let roast for about 60 minutes. At this point, baste chicken with chicken stock from the bottom of pan. </li><li>Place back in oven and let cook for 15-30 minutes longer. Instert meat thermometer in one of the chicken breasts. It should read ~180. If it has not reached this temperature, baste again and place back in oven to continue cooking until done.</li></ol>", u'spoonacularSourceUrl': u'https://spoonacular.com/herb-roasted-whole-chicken-612874', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}