{u'recipes': [{u'sourceName': u'The Roasted Root', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/842938-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 842938, u'veryPopular': False, u'lowFodmap': False, u'title': u'Double Chocolate Chickpea or Black Bean Brownies', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 60.28, u'creditText': u'The Roasted Root', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1 14-ounce can chickpeas , drained and rinsed (see note)*', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained and rinsed (see note)*', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 16058, u'unit': u'ounce'}, {u'originalString': u'3 tablespoons olive oil or coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'2/3 cup coconut sugar (see note)**', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'2/3 cup dark chocolate chips', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 10019071, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground cinnamon , optional', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.theroastedroot.net/double-chocolate-black-bean-brownies/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees Fahrenheit. Lightly oil an 8" x 8" baking pan, and line the pan with parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and rinse the chickpeas (or black beans).', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add them to a blender along with the rest of the ingredients, except for the chocolate chips. Blend well until a thick, smooth batter results.Stir the chocolate chips into the batter', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer the batter to the prepared baking dish and spread into an even layer.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake on the center rack of the preheated oven for 24 to 18 minutes, until the center of the brownies have set up. Note: The center of the brownies will not test clean when poked with a tooth pick - this is normal.', u'length': {u'number': 24, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove brownies from the oven and allow them to rest 1 hour before cutting and serving.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 163, u'instructions': u'Preheat the oven to 350 degrees Fahrenheit. Lightly oil an 8" x 8" baking pan, and line the pan with parchment paper.Drain and rinse the chickpeas (or black beans). Add them to a blender along with the rest of the ingredients, except for the chocolate chips. Blend well until a thick, smooth batter results.Stir the chocolate chips into the batterTransfer the batter to the prepared baking dish and spread into an even layer. Bake on the center rack of the preheated oven for 24 to 18 minutes, until the center of the brownies have set up. Note: The center of the brownies will not test clean when poked with a tooth pick - this is normal.Remove brownies from the oven and allow them to rest 1 hour before cutting and serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/double-chocolate-chickpea-or-black-bean-brownies-842938', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 9, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}