{u'recipes': [{u'sourceName': u'Healthy Seasonal Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/524229-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 110, u'id': 524229, u'veryPopular': True, u'lowFodmap': False, u'title': u'chicken and chickpea green goddess power salad', u'diets': [u'gluten free'], u'preparationMinutes': 40, u'pricePerServing': 345.26, u'creditText': u'Healthy Seasonal Recipes', u'extendedIngredients': [{u'originalString': u'\xbd avocado, skin and pit removed', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 cup canned chickpeas, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16058, u'unit': u'cup'}, {u'originalString': u'1 carrot, peeled, and cut into paper-thin ribbons with vegetable peeler', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'paper-thin', u'with vegetable peeler', u'peeled', u'cut into  ribbons '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 tablespoons chopped chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoons'}, {u'originalString': u'\xbd European cucumber, seeded and cut into chunks', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'seeded', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'\xbd cup crumbled feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'8 cups spring greens, washed and spun dry', u'aisle': u'Produce', u'name': u'greens', u'metaInformation': [u'dry', u'washed and spun '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cups'}, {u'originalString': u'1/3 cup non-fat buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'non fat buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93650, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup red wine vinegar, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022068, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons Italian Seasoning herb mix', u'aisle': u'Spices and Seasonings', u'name': u'seasoning mix', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'teaspoons'}, {u'originalString': u'4 teaspoons sesame tahini sauce', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 12023, u'unit': u'teaspoons'}, {u'originalString': u'1 pound boneless skinless chicken breast, tenders removed', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'1 teaspoon chopped tarragon, optional', u'aisle': u'Produce;Spices and Seasonings', u'name': u'tarragon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.healthyseasonalrecipes.com/chicken-chickpea-green-goddess-power-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/meat-mallet.jpg', u'id': 3846, u'name': u'meat tenderizer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place garlic cloves in a large Ziploc bag, press air out and seal the bag. Smash garlic with the smooth side of a meat mallet. Open bag and add chicken breasts. Press air out of bag and reseal. Pound meat through the bag until the thickest part of the breast is level with the thinnest, about 3/4 -inch thick. Open bag again and add tenders, \xbc cup water, 3 tablespoons vinegar, Italian herb mix and \xbd teaspoon salt. Press out air and reseal bag and agitate until the chicken is coated in the herb garlic mixture. Refrigerate 30 minutes to 2 hours. Preheat grill to medium-high heat.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'id': 1015062, u'name': u'chicken tenders'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove chicken from marinade and discard marinade. Oil grill rack . Grill chicken until no-longer pink in the center, 4 to 5 minutes per side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let rest about 5 minutes before cutting into chunks.  Puree avocado, buttermilk, the remaining 1 tablespoon vinegar, tahini, chives, parsley, tarragon and the remaining \xbd teaspoon salt in a mini prep or food processor until smooth, scraping down sides as necessary. Arrange greens in four bowls. Top with carrot, cucumber, chickpeas, feta and the chicken.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Drizzle dressing over the salads and serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Waterbrook Reserve Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 2180, u'instructions': u'Place garlic cloves in a large Ziploc bag, press air out and seal the bag. Smash garlic with the smooth side of a meat mallet. Open bag and add chicken breasts. Press air out of bag and reseal. Pound meat through the bag until the thickest part of the breast is level with the thinnest, about 3/4 -inch thick. Open bag again and add tenders, \xbc cup water, 3 tablespoons vinegar, Italian herb mix and \xbd teaspoon salt. Press out air and reseal bag and agitate until the chicken is coated in the herb garlic mixture. Refrigerate 30 minutes to 2 hours. Preheat grill to medium-high heat. Remove chicken from marinade and discard marinade. Oil grill rack . Grill chicken until no-longer pink in the center, 4 to 5 minutes per side. Let rest about 5 minutes before cutting into chunks.  Puree avocado, buttermilk, the remaining 1 tablespoon vinegar, tahini, chives, parsley, tarragon and the remaining \xbd teaspoon salt in a mini prep or food processor until smooth, scraping down sides as necessary. Arrange greens in four bowls. Top with carrot, cucumber, chickpeas, feta and the chicken. Drizzle dressing over the salads and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-and-chickpea-green-goddess-power-salad-524229', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}