{u'recipes': [{u'sourceName': u'Jelly Toast Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/503665-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 503665, u'veryPopular': False, u'lowFodmap': False, u'title': u'peachy cinnamon coffee cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 40, u'pricePerServing': 77.12, u'creditText': u'Jelly Toast Blog', u'extendedIngredients': [{u'originalString': u'1 1/2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'6 oz block style cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'block style', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups of flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 1/4 cup granulated sugar, divided', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 cup light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3 medium peaches, cut in half and pits removed', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'medium', u'cut in half and pits removed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 stick unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'stick', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'stick'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://jellytoastblog.com/2012/08/peachy-cinnamon-coffee-cake.html/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add vanilla extract and beat another 30 seconds. Crack eggs into small bowl, and with the mixer on low, add one at a time to the butter mixture. Beat well after each addition.In a medium bowl, whisk together flour, baking powder and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the flour mixture to the butter mixture and mix at low speed until blended.In a small bowl, mix chopped peaches, \xbc white sugar and cinnamon. Toss to combine. Reserve \xbd cup of peach mixture for the top of the cake. Gently fold in remaining peach mixture into the batter using a spatula.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour batter into greased pan. Sprinkle reserved peaches on top of batter, being careful not to push peaches down into the batter.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake for 1 hour and 15 minutes. The cake will be done when the edges begin to pull away from the pan.Allow to cool completely before removing from pan. Store extra cake covered, at room temp for 3 days.Enjoy!', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 15, u'instructions': u'Directions:Preheat oven to 400\xb0. Arrange the peaches, cut side up on a rimmed baking sheet. Roast for 25 min or until they begin to soften. Allow the peaches to cool and remove skins and cop peaches. Yield about 3 cups.Adjust oven temp to 350\xb0. Grease a 9 inch springform pan with non stick spray and set aside.In the bowl of an electric mixer, cream together 1 cup of granulated sugar, brown sugar, butter and cream cheese until creamy and light in color. This should take about 3-4 min. Add vanilla extract and beat another 30 seconds. Crack eggs into small bowl, and with the mixer on low, add one at a time to the butter mixture. Beat well after each addition.In a medium bowl, whisk together flour, baking powder and salt. Add the flour mixture to the butter mixture and mix at low speed until blended.In a small bowl, mix chopped peaches, \xbc white sugar and cinnamon. Toss to combine. Reserve \xbd cup of peach mixture for the top of the cake. Gently fold in remaining peach mixture into the batter using a spatula.Pour batter into greased pan. Sprinkle reserved peaches on top of batter, being careful not to push peaches down into the batter.Bake for 1 hour and 15 minutes. The cake will be done when the edges begin to pull away from the pan.Allow to cool completely before removing from pan. Store extra cake covered, at room temp for 3 days.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/peachy-cinnamon-coffee-cake-503665', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}