{u'recipes': [{u'sourceName': u'Foxes Love Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/512156-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 512156, u'veryPopular': False, u'lowFodmap': True, u'title': u'Clementine, Whiskey & Wine Cocktail #SundaySupper', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'pricePerServing': 351.77, u'creditText': u'Foxes Love Lemons', u'extendedIngredients': [{u'originalString': u'3 ounces Gallo Family Vineyards Cabernet Sauvignon, for floating', u'aisle': u'Alcoholic Beverages', u'name': u'cabernet sauvignon', u'metaInformation': [u'for floating'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 14097, u'unit': u'ounces'}, {u'originalString': u'4 clementines, peeled and segmented', u'aisle': u'Produce', u'name': u'clementines', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9433, u'unit': u''}, {u'originalString': u'Juice of 1/2 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'3 ounces Clementine Simple Syrup', u'aisle': u'Alcoholic Beverages', u'name': u'simple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 90480, u'unit': u'ounces'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'3 ounces whiskey', u'aisle': u'Alcoholic Beverages', u'name': u'whiskey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'liquid', u'id': 14052, u'unit': u'ounces'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://foxeslovelemons.com/clementine-whiskey-wine-cocktail-sundaysupper/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Make Clementine Simple Syrup: In medium saucepan, stir together clementines, sugar and water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 90480, u'name': u'simple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'id': 9433, u'name': u'clementine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Heat to boiling, then reduce heat to medium-low and simmer 5 minutes. Strain through a fine-mesh strainer, pressing on fruit to extract as much liquid as possible. Refrigerate until cool. Makes about 1-1/2 cups simple syrup. Fill two rocks glasses with ice; add a few cherries to each glass, if desired. Fill cocktail shaker with ice; add Clementine Simple Syrup, whiskey and lemon juice, and shake well.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 90480, u'name': u'simple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'id': 9433, u'name': u'clementine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'id': 14052, u'name': u'whiskey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Pour whiskey mixture over ice in glasses.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whiskey-bottle.jpg', u'id': 14052, u'name': u'whiskey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Pour wine floater over top of cocktails by slowly pouring wine over a small spoon set over each glass.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 18, u'instructions': u'Make Clementine Simple Syrup: In medium saucepan, stir together clementines, sugar and water. Heat to boiling, then reduce heat to medium-low and simmer 5 minutes. Strain through a fine-mesh strainer, pressing on fruit to extract as much liquid as possible. Refrigerate until cool. Makes about 1-1/2 cups simple syrup. Fill two rocks glasses with ice; add a few cherries to each glass, if desired. Fill cocktail shaker with ice; add Clementine Simple Syrup, whiskey and lemon juice, and shake well. Pour whiskey mixture over ice in glasses. Pour wine floater over top of cocktails by slowly pouring wine over a small spoon set over each glass.', u'spoonacularSourceUrl': u'https://spoonacular.com/clementine-whiskey-wine-cocktail-sundaysupper-512156', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}