{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/607398-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_6', u'id': 607398, u'veryPopular': False, u'lowFodmap': False, u'title': u"Nectarine, Tomato and Basil Salad With Torn Mozzarella From 'A Change of Appetite", u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 43.51, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'Leaves from 1 large bunch of basil', u'aisle': u'Produce', u'name': u'basil leaves', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'Leave', u'unitShort': u'Leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'Leaves'}, {u'originalString': u'3 tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'3 nectarines', u'aisle': u'Produce', u'name': u'nectarines', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nectarines.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9191, u'unit': u''}, {u'originalString': u'Salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/2 tablespoons white balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white balsamic vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1012069, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2014/07/nectarine-tomato-and-basil-salad-with-torn-mozzarella-a-change-of-appetite.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Halve and pit the nectarines and cut each half into four equal wedges. Halve smaller plum tomatoes or quarter larger ones, and slice the large tomato. Tear the mozzarella coarsely into pieces.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nectarines.jpg', u'id': 9191, u'name': u'nectarine'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Get a wide, shallow bowl and layer the salad components, seasoning and sprinkling with white balsamic and extra virgin oil as you work.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 26, u'instructions': u'Procedures                                                          1                                              Halve and pit the nectarines and cut each half into four equal wedges. Halve smaller plum tomatoes or quarter larger ones, and slice the large tomato. Tear the mozzarella coarsely into pieces.                                                                                    2                                              Get a wide, shallow bowl and layer the salad components, seasoning and sprinkling with white balsamic and extra virgin oil as you work. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/nectarine-tomato-and-basil-salad-with-torn-mozzarella-from-a-change-of-appetite-607398', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}