{u'recipes': [{u'sourceName': u'Neighbor Food Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608025-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 608025, u'veryPopular': False, u'lowFodmap': False, u'title': u'How Roasted Tomatoes and Goat Cheese Can Help Ferguson Heal', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 157.57, u'creditText': u'Neighbor Food Blog', u'extendedIngredients': [{u'originalString': u'1 Tablespoon butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoon'}, {u'originalString': u'3 cups cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cups'}, {u'originalString': u'\xbd french baguette, sliced', u'aisle': u'Bakery/Bread', u'name': u'french baguette', u'metaInformation': [u'french', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'6 ounces goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'Fresh ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'Fresh basil and olive oil for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'fresh', u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Kosher or Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'A few pinches sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pinches', u'unitShort': u'pinches', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pinches'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.neighborfoodblog.com/2014/08/roasted-tomatoes-and-goat-cheese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread the tomatoes out on a baking sheet. Toss with 1-2 Tablespoons of olive oil until the tomatoes are well coated, then sprinkle evenly with salt, a few pinches of sugar and fresh ground pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in the oven for 15-20 minutes or until tomatoes are soft and sweet.Meanwhile, mix together the remaining olive oil and butter. Use a pastry brush to brush both sides of the baguette slices with the mixture then line them on a baking sheet.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place them in the oven with the tomatoes and bake for 15-20 minutes or until browned and crisped.When the tomatoes are done, transfer them to an oven safe plate or serving bowl and top with the goat cheese (you can slice it, crumble it, or leave it in a log).', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place it back in the oven for an additional 5 minutes to warm the goat cheese.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven, drizzle with a little bit more olive oil and sprinkle with fresh basil.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Serve with toasted baguette, crackers, or veggies.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 269, u'instructions': u'Preheat the oven to 400 degrees. Spread the tomatoes out on a baking sheet. Toss with 1-2 Tablespoons of olive oil until the tomatoes are well coated, then sprinkle evenly with salt, a few pinches of sugar and fresh ground pepper. Place in the oven for 15-20 minutes or until tomatoes are soft and sweet.Meanwhile, mix together the remaining olive oil and butter. Use a pastry brush to brush both sides of the baguette slices with the mixture then line them on a baking sheet. Place them in the oven with the tomatoes and bake for 15-20 minutes or until browned and crisped.When the tomatoes are done, transfer them to an oven safe plate or serving bowl and top with the goat cheese (you can slice it, crumble it, or leave it in a log). Place it back in the oven for an additional 5 minutes to warm the goat cheese. Remove from the oven, drizzle with a little bit more olive oil and sprinkle with fresh basil. Serve with toasted baguette, crackers, or veggies.', u'spoonacularSourceUrl': u'https://spoonacular.com/how-roasted-tomatoes-and-goat-cheese-can-help-ferguson-heal-608025', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}