{u'recipes': [{u'sourceName': u'Slender Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/615451-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 615451, u'veryPopular': False, u'lowFodmap': False, u'title': u'Black Olive and Feta Turkey Burgers', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 250.81, u'creditText': u'Slender Kitchen', u'extendedIngredients': [{u'originalString': u'1/4 cup black olives, chopped', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1059195, u'unit': u'cup'}, {u'originalString': u'\xbd tsp. black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'2 tsp. dried dill, divided', u'aisle': u'Spices and Seasonings', u'name': u'dried dill', u'metaInformation': [u'dried', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2017, u'unit': u'tsp'}, {u'originalString': u'2 garlic cloves, minced, divided', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'divided', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd cup 0% Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'0%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 lb. 99% lean ground turkey', u'aisle': u'Meat', u'name': u'lean ground turkey', u'metaInformation': [u'99%', u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5662, u'unit': u'lb'}, {u'originalString': u'1-2 tsp. lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tsp'}, {u'originalString': u'1/4 cup red onion, minced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'6 tbsp. crumbled reduced fat feta cheese, divided', u'aisle': u'Cheese', u'name': u'reduced fat cheese', u'metaInformation': [u'divided', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1168, u'unit': u'tbsp'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.slenderkitchen.com/black-olive-and-feta-turkey-burgers/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Using your hands, gently mix together the turkey, red onion, olives, 1 garlic clove, 4 tbsp. feta cheese, 1 tsp. dried dill,  tsp. black pepper, and  tsp. salt. Divide into 4 patties.In another bowl, combine the yogurt, 2 tbsp. feta cheese, 1 tsp. dill, 1 garlic clove, and lemon juice to make the sauce. Taste and season with salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2017, u'name': u'dried dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat a grill, grill pan, or skillet over medium high heat. Cook the burgers for about 5 minutes per side or until completely cooked.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with 2 tbsp. yogurt feta sauce.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Turkey Burgers works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Nieto Senetiner Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Wine of well defined profile, deep red color and great intensity. Aromas of small red fruits and plums dominate the nose; the vanilla scents from the oak barrel add elegance. Mouthfeel shows a great personality, great body and is fruity, well balanced and sensual.This wine pairs well with grilled meats, pasta with red sauce, salmon and veal.', u'title': u'Nieto Senetiner Malbec', u'price': u'$14.99', u'id': 440601, u'link': u'https://www.wine.com/product/nieto-senetiner-malbec-2011/124685', u'imageUrl': u'https://spoonacular.com/productImages/440601-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'Using your hands, gently mix together the turkey, red onion, olives, 1 garlic clove, 4 tbsp. feta cheese, 1 tsp. dried dill,  tsp. black pepper, and  tsp. salt. Divide into 4 patties.In another bowl, combine the yogurt, 2 tbsp. feta cheese, 1 tsp. dill, 1 garlic clove, and lemon juice to make the sauce. Taste and season with salt and pepper.Heat a grill, grill pan, or skillet over medium high heat. Cook the burgers for about 5 minutes per side or until completely cooked.Serve with 2 tbsp. yogurt feta sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/black-olive-and-feta-turkey-burgers-615451', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}