{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/598681-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 598681, u'veryPopular': True, u'lowFodmap': False, u'title': u'Venison Burgers', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 628.1, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'A handful arugula', u'aisle': u'Produce', u'name': u'arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'handful'}, {u'originalString': u'4 to 6 good-quality burger buns, toasted or grilled', u'aisle': u'Bakery/Bread', u'name': u'burger buns', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'Sliced dill pickles', u'aisle': u'Canned and Jarred', u'name': u'dill pickles', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10011937, u'unit': u'servings'}, {u'originalString': u'4 large egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'4 to 6 slices Emmentaler cheese', u'aisle': u'Cheese', u'name': u'emmentaler cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1040, u'unit': u'slices'}, {u'originalString': u'1 1/2 pounds ground venison', u'aisle': u'Meat', u'name': u'ground venison', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 17343, u'unit': u'pounds'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'servings'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'6 ounces bacon or pancetta, ground', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10410123, u'unit': u'ounces'}, {u'originalString': u'Coarsely ground mustard', u'aisle': u'Condiments', u'name': u'stone ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'servings'}, {u'originalString': u'Dash Worcestershire sauce, or more to taste', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'Dash'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://leitesculinaria.com/82712/recipes-venison-burgers.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Build a really hot fire in a grill or preheat a large cast-iron skillet over high heat.2. In a bowl, combine the venison, bacon, salt, pepper, egg yolks, and Worcestershire sauce with your hands. Divvy the mixture into 4 to 6 balls. Gently form each into a 1 1/2-inch-thick patty.3. Carefully brush the grill rack or skillet with a little oil. Grill or sear the patties until very well browned on one side, about 5 minutes. Flip and place a slice of cheese on top of each patty. Cook for about 3 minutes more for medium-rare to medium, or longer according to your desired doneness.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve the burgers on the buns with mustard, mayonnaise, pickles, and arugula.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill-pickles.jpg', u'id': 11937, u'name': u'pickles'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are great choices for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Gascon Malbec with a 4.5 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'A classic expression of the grape, our Don Miguel Gasc\xf3n Malbec opens with intense aromas of blackberry, plum and a hint of mocha. On the palate, dark fruit flavors are finely intertwined with notes of spice, licorice and chocolate for a magnificent full-bodied Malbec. Round tannins and a plush mouthfeel lead the way to a long, velvety finish.', u'title': u'Gascon Malbec', u'price': u'$12.99', u'id': 437536, u'link': u'https://www.wine.com/product/gascon-malbec-2012/128058', u'imageUrl': u'https://spoonacular.com/productImages/437536-312x231.jpg'}]}, u'aggregateLikes': 722, u'instructions': u'1. Build a really hot fire in a grill or preheat a large cast-iron skillet over high heat.2. In a bowl, combine the venison, bacon, salt, pepper, egg yolks, and Worcestershire sauce with your hands. Divvy the mixture into 4 to 6 balls. Gently form each into a 1 1/2-inch-thick patty.3. Carefully brush the grill rack or skillet with a little oil. Grill or sear the patties until very well browned on one side, about 5 minutes. Flip and place a slice of cheese on top of each patty. Cook for about 3 minutes more for medium-rare to medium, or longer according to your desired doneness. Serve the burgers on the buns with mustard, mayonnaise, pickles, and arugula.', u'spoonacularSourceUrl': u'https://spoonacular.com/venison-burgers-598681', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}