{u'recipes': [{u'sourceName': u'Just as Delish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/498090-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 498090, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple Starfruit Spiced Crisp', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 121.19, u'creditText': u'Just as Delish', u'extendedIngredients': [{u'originalString': u'50g (1/4 cup) Brown Sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon Ground Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon Ground Cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'40 ml (1/3 cup) Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'500g Apples (about 3 medium), preferably a mix of red and green apples', u'aisle': u'Produce', u'name': u'red apples', u'metaInformation': [u'green', u'red', u'( 3 medium)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 1029003, u'unit': u'g'}, {u'originalString': u'20 grams Rice Flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'rice flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 20061, u'unit': u'grams'}, {u'originalString': u'50 grams Rolled Oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 8120, u'unit': u'grams'}, {u'originalString': u'\xbd teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'300g Starfruit (about 3 medium)', u'aisle': u'Produce', u'name': u'starfruit', u'metaInformation': [u'( 3 medium)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/starfruit.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 9060, u'unit': u'g'}, {u'originalString': u'30 grams Wheat Flour', u'aisle': u'Baking', u'name': u'wheat flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 30.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'\xbd teaspoon Ground Aniseed (or substitute with the spice)', u'aisle': u'?', u'name': u'ground aniseed', u'metaInformation': [u'with the spice)'], u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'unit': u'teaspoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.justasdelish.com/2011/10/apple-starfruit-spiced-crisp/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'In a medium mixing bowl, combine the first 9 ingredients and stir well with a fork, make sure all of the dry ingredients are moistened by the oil. If making in advance, transfer to an airtight container and keep in the fridge. Preheat the oven to 180\xb0C (360\xb0F).Peel the apples or you can retain the skin like me. Quarter and core the apples and star fruits, then cut into small chunks.Arrange the fruit chunks over the bottom of a baking dish (I use is a 20cm rectangle dish) and sprinkle evenly with the crisp topping.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Bake in oven for about 40 minutes, until the apples are tender and the topping golden brown, checking regularly to make sure it doesn't darken too much.", u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Serve slightly warm or at room temperature and top with fresh fruits. ]', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Crisp. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u"In a medium mixing bowl, combine the first 9 ingredients and stir well with a fork, make sure all of the dry ingredients are moistened by the oil. If making in advance, transfer to an airtight container and keep in the fridge. Preheat the oven to 180\xb0C (360\xb0F).Peel the apples or you can retain the skin like me. Quarter and core the apples and star fruits, then cut into small chunks.Arrange the fruit chunks over the bottom of a baking dish (I use is a 20cm rectangle dish) and sprinkle evenly with the crisp topping.  Bake in oven for about 40 minutes, until the apples are tender and the topping golden brown, checking regularly to make sure it doesn't darken too much.Serve slightly warm or at room temperature and top with fresh fruits. ]", u'spoonacularSourceUrl': u'https://spoonacular.com/apple-starfruit-spiced-crisp-498090', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}