{u'recipes': [{u'sourceName': u'Simple Nourished Living', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/615586-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 615586, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mel’s Easy Slow Cooker Pork Chops', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 190.21, u'creditText': u'Simple Nourished Living', u'extendedIngredients': [{u'originalString': u'2 cloves garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon instant tapioca', u'aisle': u'Baking', u'name': u'instant tapioca', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tapioca-pearls.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93660, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'\xbc cup reduced-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16424, u'unit': u'cup'}, {u'originalString': u'4 pork chops, about 1-inch thick (5 ounces each)', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 10010062, u'unit': u'ounces'}, {u'originalString': u'\xbc teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt and pepper for seasoning', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://simple-nourished-living.com/2014/09/mels-easy-slow-cooker-pork-chops-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Ideal Slow Cooker Size: 1-1/2 to 3-1/2 Quart. (I used my new 1-1/2 quart oval one)Coat a large skillet with nonstick spray.Season the pork chops on both sides with salt and pepper. Brown the pork chops for 1-2 minutes on each side until golden.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer the chops to the slow cooker.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the garlic to the drippings in the skillet and stir constantly over medium low heat until the garlic is aromatic and golden (but not burned or it will turn bitter!). Stir in the soy sauce, broth, brown sugar and red pepper flakes. Cook, stirring constantly, until the sugar is dissolves. Stir in the tapioca and pour over the chops.Cover and cook on LOW for 4 to 6 hours or until the meat is fork tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'aggregateLikes': 100, u'instructions': u'Ideal Slow Cooker Size: 1-1/2 to 3-1/2 Quart. (I used my new 1-1/2 quart oval one)Coat a large skillet with nonstick spray.Season the pork chops on both sides with salt and pepper. Brown the pork chops for 1-2 minutes on each side until golden. Transfer the chops to the slow cooker. Add the garlic to the drippings in the skillet and stir constantly over medium low heat until the garlic is aromatic and golden (but not burned or it will turn bitter!). Stir in the soy sauce, broth, brown sugar and red pepper flakes. Cook, stirring constantly, until the sugar is dissolves. Stir in the tapioca and pour over the chops.Cover and cook on LOW for 4 to 6 hours or until the meat is fork tender.', u'spoonacularSourceUrl': u'https://spoonacular.com/mels-easy-slow-cooker-pork-chops-615586', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}