{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/195382-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 195382, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cakespy: Thanksgiving Leftover Cranberry Nut Squares', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 31.7, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'3/4 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'Leftover cranberry sauce (I used a little over 1 cup) or 1 cup or so dried cranberries', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'dried', u'leftover'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9078, u'unit': u'cup'}, {u'originalString': u'2 eggs, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups nuts (I used salted, mixed nuts)', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'mixed', u'salted', u'(I used , nuts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12135, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2009/11/cakespy-thanksgiving-leftover-cranberry-nut-squares-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Make the crust: Preheat the oven to 375\xb0F. Grease an 9x13-inch pan thoroughly, and line the bottom with a strip of parchment paper so that the ends poke out on the sides— this will make your life much easier when removing the bars from the pan. In an electric mixer fitted with a paddle, beat the butter with the sugar at medium speed until light and fluffy, about 2 minutes. At low speed, beat in the flour and salt until a soft dough forms. Press the dough over the bottom of the prepared pan, patting it in evenly and firmly.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the center of the oven for about 12 to 15 minutes, until the crust is lightly golden on the edges and the top has a dull look.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put the corn syrup and brown sugar in a heavy saucepan over medium heat and cook, stirring occasionally, until the sugar dissolves.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from heat and add the butter and vanilla.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Let the mixture cool, and then add the eggs and whisk until smooth (don't add the eggs while the mixture is still very hot, otherwise you'll have scrambled eggs!). Put off to the side for a moment while you follow the next two steps.", u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'3', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the cranberry sauce evenly on top of the baked and cooled crust, or if you are using dried cranberries, scatter them evenly.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Scatter the nuts evenly on top of the cranberry layer.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'id': 12135, u'name': u'nuts'}]}, {u'equipment': [], u'step': u'5', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour the liquid mixture over everything. It will be a thick mixture--try to pour it so that you get even coverage over the other toppings. If needed, use a spatula to distribute, but be gentle so that you do not tear up the bottom layer.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'6', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake in a 325\xb0F oven (a lower temperature than you used for pre-baking the crust) for about 45 to 50 minutes, or until the filling is lightly bubbling on the sides and looks firm in the middle.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 16, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool thoroughly--the filling will continue to set as it cools.', u'number': 17, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 29, u'instructions': u"Procedures                                                                              1                                                                             Make the crust: Preheat the oven to 375\xb0F. Grease an 9x13-inch pan thoroughly, and line the bottom with a strip of parchment paper so that the ends poke out on the sides— this will make your life much easier when removing the bars from the pan. In an electric mixer fitted with a paddle, beat the butter with the sugar at medium speed until light and fluffy, about 2 minutes. At low speed, beat in the flour and salt until a soft dough forms. Press the dough over the bottom of the prepared pan, patting it in evenly and firmly. Bake in the center of the oven for about 12 to 15 minutes, until the crust is lightly golden on the edges and the top has a dull look. Let cool.                                                                                                                            2                                                                            Put the corn syrup and brown sugar in a heavy saucepan over medium heat and cook, stirring occasionally, until the sugar dissolves. Remove from heat and add the butter and vanilla. Let the mixture cool, and then add the eggs and whisk until smooth (don't add the eggs while the mixture is still very hot, otherwise you'll have scrambled eggs!). Put off to the side for a moment while you follow the next two steps.                                                                                                                            3                                                                            Spread the cranberry sauce evenly on top of the baked and cooled crust, or if you are using dried cranberries, scatter them evenly.                                                                                                                             4                                                                            Scatter the nuts evenly on top of the cranberry layer.                                                                                                                            5                                                                            Pour the liquid mixture over everything. It will be a thick mixture--try to pour it so that you get even coverage over the other toppings. If needed, use a spatula to distribute, but be gentle so that you do not tear up the bottom layer.                                                                                                                            6                                                                            Bake in a 325\xb0F oven (a lower temperature than you used for pre-baking the crust) for about 45 to 50 minutes, or until the filling is lightly bubbling on the sides and looks firm in the middle. Let cool thoroughly--the filling will continue to set as it cools.", u'spoonacularSourceUrl': u'https://spoonacular.com/cakespy-thanksgiving-leftover-cranberry-nut-squares-195382', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}