{u'recipes': [{u'sourceName': u'What Jew Wanna Eat', u'cuisines': [u'jewish'], u'image': u'https://spoonacular.com/recipeImages/835906-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 835906, u'veryPopular': True, u'lowFodmap': False, u'title': u'General Tso’s Latkes', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 40, u'pricePerServing': 102.59, u'creditText': u'What Jew Wanna Eat', u'extendedIngredients': [{u'originalString': u'2 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20027, u'unit': u'cup'}, {u'originalString': u'2 tablespoons onion, minced and dried well', u'aisle': u'Spices and Seasonings', u'name': u'dried onion', u'metaInformation': [u'dried', u'minced', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11284, u'unit': u'tablespoons'}, {u'originalString': u'1 large egg, whisked', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd teaspoon minced fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'2 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'clove', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 tablespoons all-purpose or gluten-free flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'gluten-free flour', u'metaInformation': [u'gluten-free', u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93620, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup green bell pepper, diced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11333, u'unit': u'cup'}, {u'originalString': u'2 tablespoons green onions, diced (greens and whites)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'diced', u'(greens and whites)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon Hoisin sauce', u'aisle': u'Ethnic Foods', u'name': u'hoisin sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6175, u'unit': u'tablespoon'}, {u'originalString': u'\xbc cup red bell pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'2-4 dried red chiles, seeded and chopped (these are hot!!!)', u'aisle': u'Produce', u'name': u'red chiles', u'metaInformation': [u'dried', u'red', u'seeded', u'chopped', u'(these are hot!!!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 tablespoons rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tablespoons'}, {u'originalString': u'5 cups (2 pound) russet potatoes, washed and peeled', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'washed and peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11353, u'unit': u'pound'}, {u'originalString': u'\xbd teaspoon salt, plus more for seasoning', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'plus more for seasoning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup light sesame oil or other high-heat oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4058, u'unit': u'cup'}, {u'originalString': u'1 tablespoon light sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'Sesame seeds for garnish', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 12023, u'unit': u'servings'}, {u'originalString': u'1 tablespoon soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://whatjewwannaeat.com/general-tsos-latkes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404631, u'name': u'grater'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'First, make your sauce. Head sesame oil in a large saute pan. Then add ginger, chiles, garlic, green onions and bell peppers and saute until the peppers start to soften.Then add in remaining sauce ingredients and bring to a boil. Simmer for 5 minutes until thick. Set aside. Warm before serving.Now, latkes time. Start by shredding your potatoes with a grater into a bowl of ice water.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Let sit for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove potatoes, squeezing out the moisture into the water. Dry potatoes very well with towels.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let water sit 10 minutes for starch to accumulate on the bottom. Carefully drain water, reserving the white starch on the bottom.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place potatoes in a large bowl, dry again very well. Then add in the onion, garlic, egg, flour and salt and reserved starch and combine.Meanwhile, heat up sesame oil in a large saute pan. Scoop two tablespoon dollops of the potato mixture and flatten lightly and fry until light golden brown, about 3 minutes. Then flip and fry the other side. Season immediately with salt and drain on a rack over paper towels. Repeat with remaining latkes.Coat latkes in cornstarch and refry them until golden brown.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u"Serve latkes hot with warm General Tso's Sauce.", u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1801, u'instructions': u"First, make your sauce. Head sesame oil in a large saute pan. Then add ginger, chiles, garlic, green onions and bell peppers and saute until the peppers start to soften.Then add in remaining sauce ingredients and bring to a boil. Simmer for 5 minutes until thick. Set aside. Warm before serving.Now, latkes time. Start by shredding your potatoes with a grater into a bowl of ice water. Let sit for 10 minutes. Remove potatoes, squeezing out the moisture into the water. Dry potatoes very well with towels. Let water sit 10 minutes for starch to accumulate on the bottom. Carefully drain water, reserving the white starch on the bottom.Place potatoes in a large bowl, dry again very well. Then add in the onion, garlic, egg, flour and salt and reserved starch and combine.Meanwhile, heat up sesame oil in a large saute pan. Scoop two tablespoon dollops of the potato mixture and flatten lightly and fry until light golden brown, about 3 minutes. Then flip and fry the other side. Season immediately with salt and drain on a rack over paper towels. Repeat with remaining latkes.Coat latkes in cornstarch and refry them until golden brown.Serve latkes hot with warm General Tso's Sauce.", u'spoonacularSourceUrl': u'https://spoonacular.com/general-tsos-latkes-835906', u'dishTypes': [u'side dish'], u'occasions': [u'hanukkah'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}