{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/580794-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 580794, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lemon, Rosemary and Olive Oil Shortbread', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 51.55, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'1\xbc cups powdered sugar (yields sweet shortbread, scale back to 1 cup or just \xbe cup for less sweet/more savory cookies)', u'aisle': u'Bakery/Bread', u'name': u'cup cake', u'metaInformation': [u'sweet', u'for less sweet/more savory cookies)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 18139, u'unit': u'cups'}, {u'originalString': u'1 cup California Olive Ranch Everyday Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon fine grain sea salt salt', u'aisle': u'Spices and Seasonings', u'name': u'fine grain sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon chopped fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'2 lemons (preferably organic), zested', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'organic', u'(preferably )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'3 cups white whole wheat flour', u'aisle': u'Baking', u'name': u'white whole wheat flour', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 93824, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://cookieandkate.com/2013/lemon-rosemary-olive-oil-shortbread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 325 degrees Fahrenheit. In a medium-sized mixing bowl, whisk together the flour, sugar, salt, rosemary and lemon zest.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour in the olive oil and stir until all of the dry mixture is incorporated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Transfer the dough to a 9 by 9-inch baker (my porcelain one didn't require greasing, but you might want to grease your pan first to be safe). Use your fingers to squish the dough into an even layer. Prick the surface of the dough all over with a fork (a diagonal pattern looks nice).", u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until the surface feels firm to the touch and is lightly golden around the edges (keep an eye on it), about 45 to 55 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from oven and let the pan cool for 20 minutes. Then, using a very sharp knife, slice the shortbread into 8 even columns and 4 even rows (cookies will be roughly 1 inch wide by 2\xbd inches long). Try to let the cookies cool before using a small spatula to remove them from the pan, or serve them directly from the pan.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 70, u'instructions': u"Preheat the oven to 325 degrees Fahrenheit. In a medium-sized mixing bowl, whisk together the flour, sugar, salt, rosemary and lemon zest. Pour in the olive oil and stir until all of the dry mixture is incorporated.Transfer the dough to a 9 by 9-inch baker (my porcelain one didn't require greasing, but you might want to grease your pan first to be safe). Use your fingers to squish the dough into an even layer. Prick the surface of the dough all over with a fork (a diagonal pattern looks nice). Bake until the surface feels firm to the touch and is lightly golden around the edges (keep an eye on it), about 45 to 55 minutes.Remove from oven and let the pan cool for 20 minutes. Then, using a very sharp knife, slice the shortbread into 8 even columns and 4 even rows (cookies will be roughly 1 inch wide by 2\xbd inches long). Try to let the cookies cool before using a small spatula to remove them from the pan, or serve them directly from the pan.", u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-rosemary-and-olive-oil-shortbread-580794', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 32, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}