{u'recipes': [{u'sourceName': u'Martha Stewart', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/1136-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 1136, u'veryPopular': False, u'lowFodmap': True, u'title': u'Grilled Fish', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'fodmap friendly', u'whole 30', u'pescatarian'], u'pricePerServing': 132.74, u'creditText': u'Martha Stewart', u'extendedIngredients': [{u'originalString': u'1 Tbsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup finely chopped cilantro, plus sprigs for garnishing', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'finely chopped', u'for garnishing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 tsps coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsps'}, {u'originalString': u'1 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'Lime wedges, for garnishing', u'aisle': u'Produce', u'name': u'lime wedges', u'metaInformation': [u'for garnishing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'servings'}, {u'originalString': u'4 Tbsps (1/4 cup) extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 Tbsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'Tbsp'}, {u'originalString': u'2-lb fillet of striped bass or red snapper, skin intact', u'aisle': u'Seafood', u'name': u'red snapper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-snapper-fresh.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 15101, u'unit': u'lb'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.marthastewart.com/340262/grilled-fish', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Stir together spices and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Mix in olive oil and cilantro. Use a sharp knife to make shallow slashes about 1 1/2 inches apart into the fish skin; transfer to a large dish and rub both sides with spice mixture. Refrigerate for 30 minutes to 2 hours.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Casa Catelli Pinot Grigio. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food. View More', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Stir together spices and salt. Mix in olive oil and cilantro. Use a sharp knife to make shallow slashes about 1 1/2 inches apart into the fish skin; transfer to a large dish and rub both sides with spice mixture. Refrigerate for 30 minutes to 2 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-fish-1136', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}