{u'recipes': [{u'sourceName': u'A Girl Worth saving', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/541999-556x370.png', u'cheap': False, u'gaps': u'GAPS_3', u'cookingMinutes': 45, u'id': 541999, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ginger Chicken', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'ketogenic'], u'preparationMinutes': 10, u'pricePerServing': 52.6, u'creditText': u'A Girl Worth saving', u'extendedIngredients': [{u'originalString': u'1.25lbs of chicken legs', u'aisle': u'Meat', u'name': u'chicken legs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 5075, u'unit': u'lbs'}, {u'originalString': u'1 tbsp of coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tbsp'}, {u'originalString': u'1 piece of fresh ginger, roughly 1" wide x 2" tall x \xbd" thick, peeled and sliced', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'thick', u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'1 stalk of green onion chopped.', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'stalk'}, {u'originalString': u'2 tbsp of diced red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp Sea Salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'1 small yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 3.0, u'imageType': u'png', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.agirlworthsaving.net/2012/06/ginger-chicken-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine the coconut oil, chopped yellow onion and ginger in a skillet over medium heat and cook for 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 10511282, u'name': u'yellow onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place your chicken legs in the skillet and add your seasonings. Cover with a lid.Turn the heat to low and allow to cook covered for 35 - 40 minutes.The chicken legs will release water creating a gingery sauce. Throw in the red onion for the last 3 minutes.Optional:For more color on the chicken remove them from the skillet and broil for 3 - 5 minutes and return to the pan.Top with chopped green onion and enjoy!', u'length': {u'number': 48, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'id': 5075, u'name': u'chicken leg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 771, u'instructions': u'Combine the coconut oil, chopped yellow onion and ginger in a skillet over medium heat and cook for 3 minutes.Place your chicken legs in the skillet and add your seasonings. Cover with a lid.Turn the heat to low and allow to cook covered for 35 - 40 minutes.The chicken legs will release water creating a gingery sauce. Throw in the red onion for the last 3 minutes.Optional:For more color on the chicken remove them from the skillet and broil for 3 - 5 minutes and return to the pan.Top with chopped green onion and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/ginger-chicken-541999', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 55, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}