{u'recipes': [{u'sourceName': u'My Goodness Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/727585-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 727585, u'veryPopular': False, u'lowFodmap': False, u'title': u'Almost Healthy Oreo Smoothie for big and little kids', u'diets': [], u'preparationMinutes': 3, u'pricePerServing': 191.09, u'creditText': u'My Goodness Kitchen', u'extendedIngredients': [{u'originalString': u'1 cup unsweetened almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'cup'}, {u'originalString': u'1 frozen banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 Tbs cashew butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'cashew butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 12088, u'unit': u'Tbs'}, {u'originalString': u'1 cup coconut water (or regular)', u'aisle': u'Beverages', u'name': u'coconut water', u'metaInformation': [u'(or regular)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12119, u'unit': u'cup'}, {u'originalString': u'1 Tbs flaxseed powder', u'aisle': u'Health Foods;Baking', u'name': u'flaxseed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 10012220, u'unit': u'Tbs'}, {u'originalString': u'handful ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'handful'}, {u'originalString': u'1 Tbs maple syrup (optional)', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'Tbs'}, {u'originalString': u'6 Oreo cookies', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'\xbd tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 7.0, u'imageType': u'jpeg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://thegoodnessexchange.com/almost-healthy-oreo-smoothie-for-big-and-little-kids/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Put all ingredients in a blender and blend until the Oreos have broken down and the mixture is smooth and creamy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [], u'step': u'Serve with crushed Oreos sprinkled on top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Put all ingredients in a blender and blend until the Oreos have broken down and the mixture is smooth and creamy. Serve with crushed Oreos sprinkled on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/almost-healthy-oreo-smoothie-for-big-and-little-kids-727585', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 3, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}