{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497262-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 497262, u'veryPopular': False, u'lowFodmap': False, u'title': u'Honey-Soy Chicken Drumsticks', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 115.29, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'8 chicken drumsticks', u'aisle': u'Meat', u'name': u'chicken drumsticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 5066, u'unit': u''}, {u'originalString': u'1 tbsp fresh cilantro, chopped for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'4 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tbsp ginger, minced', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp of honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'2 scallions, chopped, for garnish', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tsp sesame seeds, for garnish', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tsp'}, {u'originalString': u'5 tbsp of soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2013/10/honey-soy-chicken-drumsticks.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine the honey, soy sauce, garlic, and ginger together in a large zip lock bag.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add the chicken drumsticks to the bag and seal.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'id': 5066, u'name': u'chicken drumsticks'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into the refrigerator for at least 4 hours.  Preheat oven to 425 degrees. Line a baking sheet with tinfoil then coat with cooking spray.Lay chicken on the baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 35 minutes, or until a cooked through.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the remaining marinade over the chicken every 10 minutes.Sprinkle some fresh cilantro, sesame seeds, and green onions on top and serve with Garlic Rice with Green Onions and Cilantro.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken Drumsticks works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Chehalem INOX Chardonnay. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 265, u'instructions': u'Combine the honey, soy sauce, garlic, and ginger together in a large zip lock bag. Add the chicken drumsticks to the bag and seal. Place into the refrigerator for at least 4 hours.  Preheat oven to 425 degrees. Line a baking sheet with tinfoil then coat with cooking spray.Lay chicken on the baking sheet. Bake for 35 minutes, or until a cooked through. Brush the remaining marinade over the chicken every 10 minutes.Sprinkle some fresh cilantro, sesame seeds, and green onions on top and serve with Garlic Rice with Green Onions and Cilantro.', u'spoonacularSourceUrl': u'https://spoonacular.com/honey-soy-chicken-drumsticks-497262', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}