{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/437359-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 155, u'id': 437359, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bavarian Pot Roast', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 168.98, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1-1/2 cups apple juice', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 9016, u'unit': u'cups'}, {u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 beef chuck pot roast (about 5 pounds)', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 5.0, u'consistency': u'solid', u'id': 13786, u'unit': u'pounds'}, {u'originalString': u'1 can (8 ounces) tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoons'}, {u'originalString': u'8 to 12 ounces fresh whole mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'fresh', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 to 1-1/2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoon'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/bavarian-pot-roast-2', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a large Dutch oven, heat oil over high and brown meat on all sides.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine all remaining ingredients except mushrooms; pour over meat. Cover and reduce heat to simmer. Cook 2-1/2 to 3 hours or until meat is tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Transfer met to platter; keep warm.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Add mushrooms to cooking juices; simmer 5 minutes. With a slotted spoon, remove mushrooms and spoon over roast.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Meanwhile, reduce cooking juices to desired thickness by cooking over high heat. Spoon a portion of the gravy over roast and pass the rest.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 179, u'instructions': u'Directions                                                                                In a large Dutch oven, heat oil over high and brown meat on all sides. Combine all remaining ingredients except mushrooms; pour over meat. Cover and reduce heat to simmer. Cook 2-1/2 to 3 hours or until meat is tender. Transfer met to platter; keep warm. Add mushrooms to cooking juices; simmer 5 minutes. With a slotted spoon, remove mushrooms and spoon over roast.                                                                                            Meanwhile, reduce cooking juices to desired thickness by cooking over high heat. Spoon a portion of the gravy over roast and pass the rest.                                        Yield: 12-15 servings.                                                                                                                         Originally published as Bavarian Pot Roast in  Country ExtraSeptember  1991, p49                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 297 calories, 16 g fat (6 g saturated fat), 98 mg cholesterol, 291 mg sodium, 6 g carbohydrate, 1 g fiber, 30 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/bavarian-pot-roast-437359', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 175, u'servings': 15, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}