{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597036-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 597036, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy One Bowl Apple Cake', u'diets': [u'dairy free'], u'pricePerServing': 66.31, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'1 21 ounce can apple pie filling', u'aisle': u'Baking', u'name': u'apple pie filling', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-pie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 19312, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'2 teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'2 eggs, slightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'slightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup chopped walnuts or pecans', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 39.0, u'sourceUrl': u'http://www.framedcooks.com/2013/02/easy-one-bowl-apple-cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Grease a 9 inch round casserole or cake pan and preheat oven to 350.2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Mix together all ingredients except raisins and nuts until well-combined.  Stir in nuts and raisins and transfer mixture to baking dish.3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake until deep golden brown, about an hour and 15 minutes.  A toothpick inserted into the center of the cake should come out almost clean - start testing after cake has baked for an hour.4.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool, and serve with caramel sauce.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 614, u'instructions': u'1. Grease a 9 inch round casserole or cake pan and preheat oven to 350.2. Mix together all ingredients except raisins and nuts until well-combined.  Stir in nuts and raisins and transfer mixture to baking dish.3. Bake until deep golden brown, about an hour and 15 minutes.  A toothpick inserted into the center of the cake should come out almost clean - start testing after cake has baked for an hour.4. Let cool, and serve with caramel sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-one-bowl-apple-cake-597036', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}