{u'recipes': [{u'sourceName': u'Mommie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/525893-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 525893, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Galaktoboureko with Salted Orange Caramel Syrup', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 1300.34, u'creditText': u'Mommie Cooks', u'extendedIngredients': [{u'originalString': u'1/2 cup All Purpose Flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tsp Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'4 Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups Heavy Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'3 Tbsp Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbsp'}, {u'originalString': u'1 Navel Orange, Juiced (about 1/3 to 1/2 cups worth)', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9206, u'unit': u''}, {u'originalString': u'1 tsp Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'3 cups Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'16 Sheets Phyllo Dough', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'Sheets', u'unitShort': u'Sheets', u'amount': 16.0, u'consistency': u'solid', u'id': 18338, u'unit': u'Sheets'}, {u'originalString': u'1 tsp Pumpkin Pie Spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'tsp'}, {u'originalString': u'1 15 Oz. Can Pumpkin Puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'Ozs', u'unitShort': u'Oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11424, u'unit': u'Oz'}, {u'originalString': u'1/2 tsp Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 cup Sugar, Divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'4 Tbsp Unsalted Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp Vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1 cup White Sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 90.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.mommiecooks.com/2012/10/24/galaktoboureko/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 268, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'To make the custard, combine the milk, cream, flour, 3/4 cups of the sugar and salt in a large sauce pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Heat on medium until mixture begins to thicken.  Once thick, remove from heat and let sit for five minutes.In a separate bowl whisk together the eggs, the remaining 1/4 cup of sugar and the vanilla.Grab a 1/2c measuring cup and fill with the warm custard mixture.Slowly pour into the eggs, whisking as you do it.Once it's fully incorporated, take the egg mixture and slowly pour it back into the custard whisking the custard as you add until fully combined.Finish off the custard by carefully whisking in the pumpkin and the spice.  Set to the side.After melting the stick of butter, squeeze the honey into it and swirl it around a few times to get it good and mixed.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush some of the butter mixture across the bottom of a 9x13" pan.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add a layer of phyllo and brush the top with butter.  Repeat this process until you have 8 layers of butter brushed dough.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the pumpkin custard over the top and spread evenly.Lay a phyllo sheet over the top and brush with butter.  Continue process until you have 8 layers over the top of the custard.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the custard into a 350 degree oven for 35-40 minutes or until the custard is cooked through and the phyllo is a beautiful golden brown.While the custard is baking, grab up a large saucepan and heat up the sugar for the caramel.Once the sugar is completely caramelized and liquidy, pour in the milk.  Note that it will fizzle and spit a bit and your sugar will most likely harden back up from the quick drop in temperature.  Simply continue to stir and heat for another 5 to 10 minutes until the sugar turns back to liquid and mixes completely with the milk.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Remove from the heat and add in the butter.Once the butter is melted add in the vanilla, cinnamon and salt.Finish by squeezing in the fresh orange juice.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour the caramel sauce over the cooked custard and let sit for at least an hour to give time for the syrup to soak in.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with a dollop of whipped cream if desired.  This dessert can be kept covered in the fridge for up to four days but is best eaten on the day it is made.', u'number': 9, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 311, u'instructions': u'To make the custard, combine the milk, cream, flour, 3/4 cups of the sugar and salt in a large sauce pan.Heat on medium until mixture begins to thicken.  Once thick, remove from heat and let sit for five minutes.In a separate bowl whisk together the eggs, the remaining 1/4 cup of sugar and the vanilla.Grab a 1/2c measuring cup and fill with the warm custard mixture.Slowly pour into the eggs, whisking as you do it.Once it\'s fully incorporated, take the egg mixture and slowly pour it back into the custard whisking the custard as you add until fully combined.Finish off the custard by carefully whisking in the pumpkin and the spice.  Set to the side.After melting the stick of butter, squeeze the honey into it and swirl it around a few times to get it good and mixed.Brush some of the butter mixture across the bottom of a 9x13" pan.Add a layer of phyllo and brush the top with butter.  Repeat this process until you have 8 layers of butter brushed dough.Pour the pumpkin custard over the top and spread evenly.Lay a phyllo sheet over the top and brush with butter.  Continue process until you have 8 layers over the top of the custard.Place the custard into a 350 degree oven for 35-40 minutes or until the custard is cooked through and the phyllo is a beautiful golden brown.While the custard is baking, grab up a large saucepan and heat up the sugar for the caramel.Once the sugar is completely caramelized and liquidy, pour in the milk.  Note that it will fizzle and spit a bit and your sugar will most likely harden back up from the quick drop in temperature.  Simply continue to stir and heat for another 5 to 10 minutes until the sugar turns back to liquid and mixes completely with the milk.Remove from the heat and add in the butter.Once the butter is melted add in the vanilla, cinnamon and salt.Finish by squeezing in the fresh orange juice.Pour the caramel sauce over the cooked custard and let sit for at least an hour to give time for the syrup to soak in.Serve with a dollop of whipped cream if desired.  This dessert can be kept covered in the fridge for up to four days but is best eaten on the day it is made.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-galaktoboureko-with-salted-orange-caramel-syrup-525893', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}