{u'recipes': [{u'sourceName': u'Magnolia Days', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/564511-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 564511, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cinnamon Pecan Sticky Buns for #TwelveLoaves', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 46.58, u'creditText': u'Magnolia Days', u'extendedIngredients': [{u'originalString': u'2 1/2 teaspoons active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'1 tablespoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons granulated sugar, plus 1/2 teaspoon', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup nonfat dry milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1085, u'unit': u'cup'}, {u'originalString': u'1 cup chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1/2 cup instant mashed potato flakes', u'aisle': u'Pasta and Rice', u'name': u'potato flakes', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-potatoes.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11378, u'unit': u'cup'}, {u'originalString': u'1 1/4 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'3 cups unbleached all-purpose flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10020081, u'unit': u'cups'}, {u'originalString': u'6 tablespoons unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 cup water, plus more if needed', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'plus more if needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 cup brown sugar, light or dark, firmly packed', u'aisle': u'?', u'name': u'firmly', u'metaInformation': [u'dark', u'light', u'packed'], u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://magnoliadays.com/2013/cinnamon-pecan-sticky-buns/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat the water to 100 to 110 degrees F (or whatever temperature is recommended on the package for activating yeast). In a small bowl, add the yeast, 1/4 cup of the water, and 1/2 teaspoon sugar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let the yeast sit at room temperature for 15 minutes until it is bubbly and has expanded.In the bowl of a stand mixer, add the flour, 3 tablespoons sugar, salt, dry milk, and potato flakes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-potatoes.png', u'id': 11378, u'name': u'instant potatoes flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to combine.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the butter, yeast mixture, and remaining water.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place bowl on the stand mixer with a dough hook. Turn the mixer to the second speed and knead for 5 to 7 minutes. If dough looks a little dry add more warm water, 1 tablespoon at a time. The dough should barely clean the sides of the bowl and possibly stick at the bottom.Lightly grease a large bowl.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the dough in the bowl, roll the dough around, and turn the dough over (to give a light coating of the grease all over the dough ball). Loosely cover the dough and let rise at room temperature until it has nearly doubled in bulk, about 1 to 1 1/2 hours.While the dough is rising lightly grease two 9-inch round cake pans, prepare the glaze and filling.In a small pan or bowl, whisk together the melted butter and corn syrup.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the glaze equally into the pans. Sprinkle the brown sugar and pecans evenly and equally into the pans. Set pans aside.In a small bowl, whisk together the sugar, cinnamon, and flour. Set aside.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Transfer the dough to a lightly greased surface or silicone rolling mat.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}], u'step': u'Roll out the dough to a 16- X 12-inch rectangle. Sprinkle filling evenly over the dough except for 1-inch on one of the long edges. Starting with a sugar covered 16-inch long edge, roll the dough into a log (so it will be a 16-inch log). Pinch to seal the edge but not the ends.Use a serrated knife to cut the log into 16 slices that are 1-inch wide.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place 8 slices into each pan. Cover the pans and let buns rise until they spread out and are touching, about 1 to 1 1/2 hours.Preheat the oven to 350 degrees F while the buns are rising.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake the sticky buns for 15 minutes. Loosely cover (tent) them with aluminum foil and bake until they are a light golden color, about 10 to 15 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the buns from the oven and immediately loosen the edges with a knife and turn them out on a rack over parchment paper. Scrape any glaze from the pans to the top of the buns. The glaze is very hot and sticky so be careful. Do not let buns sit in the pan to cool or the glaze will stick to the pan.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm or at room temperature. Store leftovers in a sealed container at room temperature.', u'number': 13, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 241, u'instructions': u'Heat the water to 100 to 110 degrees F (or whatever temperature is recommended on the package for activating yeast). In a small bowl, add the yeast, 1/4 cup of the water, and 1/2 teaspoon sugar. Let the yeast sit at room temperature for 15 minutes until it is bubbly and has expanded.In the bowl of a stand mixer, add the flour, 3 tablespoons sugar, salt, dry milk, and potato flakes. Whisk to combine. Add the butter, yeast mixture, and remaining water. Place bowl on the stand mixer with a dough hook. Turn the mixer to the second speed and knead for 5 to 7 minutes. If dough looks a little dry add more warm water, 1 tablespoon at a time. The dough should barely clean the sides of the bowl and possibly stick at the bottom.Lightly grease a large bowl. Place the dough in the bowl, roll the dough around, and turn the dough over (to give a light coating of the grease all over the dough ball). Loosely cover the dough and let rise at room temperature until it has nearly doubled in bulk, about 1 to 1 1/2 hours.While the dough is rising lightly grease two 9-inch round cake pans, prepare the glaze and filling.In a small pan or bowl, whisk together the melted butter and corn syrup. Pour the glaze equally into the pans. Sprinkle the brown sugar and pecans evenly and equally into the pans. Set pans aside.In a small bowl, whisk together the sugar, cinnamon, and flour. Set aside.Transfer the dough to a lightly greased surface or silicone rolling mat. Roll out the dough to a 16- X 12-inch rectangle. Sprinkle filling evenly over the dough except for 1-inch on one of the long edges. Starting with a sugar covered 16-inch long edge, roll the dough into a log (so it will be a 16-inch log). Pinch to seal the edge but not the ends.Use a serrated knife to cut the log into 16 slices that are 1-inch wide. Place 8 slices into each pan. Cover the pans and let buns rise until they spread out and are touching, about 1 to 1 1/2 hours.Preheat the oven to 350 degrees F while the buns are rising.Bake the sticky buns for 15 minutes. Loosely cover (tent) them with aluminum foil and bake until they are a light golden color, about 10 to 15 minutes.Remove the buns from the oven and immediately loosen the edges with a knife and turn them out on a rack over parchment paper. Scrape any glaze from the pans to the top of the buns. The glaze is very hot and sticky so be careful. Do not let buns sit in the pan to cool or the glaze will stick to the pan. Serve warm or at room temperature. Store leftovers in a sealed container at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/cinnamon-pecan-sticky-buns-for-twelveloaves-564511', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 240, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}