{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/514127-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 514127, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tuna Melt Tostadas: Add some crunch to a classic sandwich', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 237.55, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'6 corn tostadas', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11168, u'unit': u''}, {u'originalString': u'\xbc c. dill relish', u'aisle': u'Condiments', u'name': u'dill pickle relish', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 11944, u'unit': u'c'}, {u'originalString': u'4 roma tomatoes, diced', u'aisle': u'Produce', u'name': u'roma tomatoes', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}, {u'originalString': u'1 head romaine lettuce, sliced into \xbc" strips', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'sliced into \xbc" strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'head'}, {u'originalString': u'salt and pepper, optional', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 c. sharp cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'c'}, {u'originalString': u'2 tbsp. spicy brown mustard', u'aisle': u'Condiments', u'name': u'spicy brown mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'tbsp'}, {u'originalString': u'15 oz. canned tuna, drained (three 5-oz. cans, I like solid white albacore)', u'aisle': u'Canned and Jarred', u'name': u'tuna', u'metaInformation': [u'white', u'canned', u'drained', u'(three 5-oz. cans, I like solid albacore)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 15119, u'unit': u'oz'}], u'healthScore': 92.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://wearychef.com/2013/09/13/tuna-melt-tostadas/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F.Stir together tuna, mayonnaise, mustard, and relish.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'id': 15119, u'name': u'tuna'}]}, {u'equipment': [], u'step': u'Spread the tuna salad evenly over each tostada. Sprinkle cheese over the tops.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'id': 15119, u'name': u'tuna'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 8 minutes, until cheese is melted and tostada edges are just starting to brown.Top with lettuce, then tomato, and sprinkle tops with salt and/or pepper if desired.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve, and enjoy the fun of trying to balance your vegetables on top!', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 126, u'instructions': u'Preheat oven to 375 degrees F.Stir together tuna, mayonnaise, mustard, and relish.Spread the tuna salad evenly over each tostada. Sprinkle cheese over the tops.Bake in preheated oven for 8 minutes, until cheese is melted and tostada edges are just starting to brown.Top with lettuce, then tomato, and sprinkle tops with salt and/or pepper if desired. Serve, and enjoy the fun of trying to balance your vegetables on top!', u'spoonacularSourceUrl': u'https://spoonacular.com/tuna-melt-tostadas-add-some-crunch-to-a-classic-sandwich-514127', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 18, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}