{u'recipes': [{u'sourceName': u'Oh She Glows', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619598-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619598, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fall Detox Salad + Hurricane Sandy Fundraiser Update', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'pricePerServing': 542.8, u'creditText': u'Oh She Glows', u'extendedIngredients': [{u'originalString': u'1 apple, diced (I used Honeycrisp)', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'diced', u'(I used Honeycrisp)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'400 grams brussels sprouts (about 18), washed and stems removed', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'washed and stems removed', u'( 18)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 11098, u'unit': u'grams'}, {u'originalString': u'280 grams carrots (about 2 large), peeled', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'( 2 large)', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 280.0, u'consistency': u'solid', u'id': 11124, u'unit': u'grams'}, {u'originalString': u'1 large celery stalk, diced', u'aisle': u'Produce', u'name': u'celery stalk', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'2-4 tbsp fresh lemon juice, to taste', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'Pure maple syrup, to taste', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'serving'}, {u'originalString': u'4-6 tbsp raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 9299, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup sunflower seeds', u'aisle': u'Savory Snacks', u'name': u'sunflower seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12036, u'unit': u'cup'}, {u'originalString': u'1/4 tsp fine grain sea salt or Herbamare, or to taste', u'aisle': u'?', u'name': u'herbamare', u'metaInformation': [u'to taste', u'fine'], u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'unit': u'tsp'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://ohsheglows.com/2012/11/05/fall-detox-salad-hurricane-sandy-fundraiser-update/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404631, u'name': u'grater'}], u'step': u'Add the grate/shred blade to food processor. Turn machine on and drop in the brussels sprouts to shred. Now drop in the carrots to shred. Alternatively, you can finely chop brussels and shred carrots with a hand-held grater.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Transfer to a large mixing bowl.2. Stir in the diced apple, celery, sunflower seeds, and raisins into the carrot and brussels sprout mixture.3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'id': 12036, u'name': u'sunflower seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Add lemon juice, salt, pepper, and optional fresh thyme to taste.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Add a small amount of maple sryup (about 1/2-1.5 tsp) to take the edge off the lemon juice. Sprinkle with cinnamon if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [], u'step': u'Serve & enjoy!You may notice my blog header no longer looks like a gardening blog. Im happy to be back to food  to be honest, I dont know what I was thinking with my last header. I now have an artist working on my blog logo, so that should be ready to show you by the end of the year. Baby steps :)Share on Facebook | Twitter | Pinterest | Goolge+ | Stumble Upon', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try Downton Abbey Countess of Grantham Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 53896, u'instructions': u'1. Add the grate/shred blade to food processor. Turn machine on and drop in the brussels sprouts to shred. Now drop in the carrots to shred. Alternatively, you can finely chop brussels and shred carrots with a hand-held grater. Transfer to a large mixing bowl.2. Stir in the diced apple, celery, sunflower seeds, and raisins into the carrot and brussels sprout mixture.3. Add lemon juice, salt, pepper, and optional fresh thyme to taste. Add a small amount of maple sryup (about 1/2-1.5 tsp) to take the edge off the lemon juice. Sprinkle with cinnamon if desired. Serve & enjoy!You may notice my blog header no longer looks like a gardening blog. Im happy to be back to food  to be honest, I dont know what I was thinking with my last header. I now have an artist working on my blog logo, so that should be ready to show you by the end of the year. Baby steps :)Share on Facebook | Twitter | Pinterest | Goolge+ | Stumble Upon', u'spoonacularSourceUrl': u'https://spoonacular.com/fall-detox-salad-+-hurricane-sandy-fundraiser-update-619598', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [u'fall'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}