{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/358081-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 358081, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spinach and Goat Cheese Tartlets', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 43.65, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'Chopped chives, for garnish', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 11156, u'unit': u'servings'}, {u'originalString': u'2 large eggs, separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'separated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'teaspoon'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'3 1/2 ounces mild goat cheese, softened', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 teaspoons finely grated lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'Pinch of freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons grated parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'3 sheets frozen phyllo dough, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 3.0, u'consistency': u'solid', u'id': 18338, u'unit': u'sheets'}, {u'originalString': u'1 large shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 10-ounce box frozen chopped spinach, thawed and squeezed dry', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'frozen', u'dry', u'thawed', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'ounce'}, {u'originalString': u'4 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'Vegetable oil, for brushing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'1 tablespoon white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/susans-spinach-and-goat-cheese-tartlets-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees. Melt 1 tablespoon butter.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place 1 phyllo sheet on a clean surface (cover the other sheets with a damp towel), brush with melted butter and sprinkle with 1 teaspoon parmesan. Cover with another phyllo sheet, brush with more butter and sprinkle with another teaspoon parmesan. Top with the remaining phyllo sheet and brush with butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Cut the phyllo stack into 24 squares, about 3 inches each.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mini-muffin-tray.jpg', u'id': 405905, u'name': u'mini muffin tray'}], u'step': u'Brush a 24-cup mini muffin tin with oil, then firmly press a phyllo square, buttered-side down, into each cup.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until golden, 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Meanwhile, heat the remaining 3 tablespoons butter in a saucepan over medium heat.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add the shallot and garlic and cook until translucent. Stir in the flour, then add the milk and stir until the mixture is smooth, 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add the nutmeg, 1/2 teaspoon salt, and pepper to taste. Stir in the goat cheese, lemon zest and vinegar until the cheese melts.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove from the heat and mix in the egg yolks, then the spinach.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Beat the egg whites to stiff peaks and fold into the spinach filling. Spoon about 1 tablespoon filling into each phyllo cup and top with the remaining parmesan.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake until the filling is set, 15 minutes. Cool slightly in the pan; remove and top with the chives.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}, {u'equipment': [], u'step': u'Photograph by Kate Sears', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The G.H. Mumm Brut Cordon Rouge with a 4.2 out of 5 star rating seems like a good match. It costs about 50 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'A long aging provides additional flavors of vanilla, roasted nuts and a hint of toast. A result of the carefully chosen infusion of terroir and reserve wines, the finish is long. Imparting to the finish is lightness from Chardonnay, fruitiness from Pinot Noir and roundness provided by Pinot Meunier.', u'title': u'G.H. Mumm Brut Cordon Rouge', u'price': u'$49.99', u'id': 453261, u'link': u'https://www.wine.com/product/gh-mumm-brut-cordon-rouge/518', u'imageUrl': u'https://spoonacular.com/productImages/453261-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Preheat the oven to 350 degrees. Melt 1 tablespoon butter. Place 1 phyllo sheet on a clean surface (cover the other sheets with a damp towel), brush with melted butter and sprinkle with 1 teaspoon parmesan. Cover with another phyllo sheet, brush with more butter and sprinkle with another teaspoon parmesan. Top with the remaining phyllo sheet and brush with butter. Cut the phyllo stack into 24 squares, about 3 inches each. Brush a 24-cup mini muffin tin with oil, then firmly press a phyllo square, buttered-side down, into each cup. Bake until golden, 10 minutes.                          Meanwhile, heat the remaining 3 tablespoons butter in a saucepan over medium heat. Add the shallot and garlic and cook until translucent. Stir in the flour, then add the milk and stir until the mixture is smooth, 1 minute. Add the nutmeg, 1/2 teaspoon salt, and pepper to taste. Stir in the goat cheese, lemon zest and vinegar until the cheese melts. Remove from the heat and mix in the egg yolks, then the spinach.                          Beat the egg whites to stiff peaks and fold into the spinach filling. Spoon about 1 tablespoon filling into each phyllo cup and top with the remaining parmesan. Bake until the filling is set, 15 minutes. Cool slightly in the pan; remove and top with the chives.                          Photograph by Kate Sears', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-and-goat-cheese-tartlets-358081', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}