{u'recipes': [{u'sourceName': u'Olgas Flavor Factory', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/484900-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 484900, u'veryPopular': False, u'lowFodmap': False, u'title': u'Seared Scallops With a Lemon-Parsley Sauce', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 129.7, u'creditText': u'Olgas Flavor Factory', u'extendedIngredients': [{u'originalString': u'\xbd Tablespoon butter or oil', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoon'}, {u'originalString': u'1 Tablespoon fresh parsley, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tablespoon'}, {u'originalString': u'juice from one lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1-2 Tablespoons oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tablespoons'}, {u'originalString': u'2-4 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'salt, pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'\xbe lb sea scallops', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 1012047, u'unit': u'lb'}, {u'originalString': u'1 small shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.olgasflavorfactory.com/main-course/seared-scallops-with-a-lemon-parsley-sauce/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Blot the scallops dry with paper towels. Season with salt and pepper on both sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat \xbe-1 Tablespoon of oil in a nonstick skillet on high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u"Add the scallops and cook the scallops until golden brown on both sides, about 2-3 minutes per side.You might have to cook the scallops in two batches. You don't want them to be too close together, or they will steam instead of sear and start eeking out liquid.It's very important not to touch the scallops until they are ready to turn, so that the scallops get that awesome sear. Set the scallops aside.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the butter to the skillet over medium heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the shallot, season with salt and pepper and cook for 3-5 minutes, until tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add the parsley, lemon juice and olive oil. Season with salt and pepper.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve the scallops with the sauce.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Fetzer Vineyards Valley Oaks Pinot Grigio. Reviewers quite like it with a 5 out of 5 star rating and a price of about 11 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'This Pinot Grigio is clean with a fruit forward character and a crisp acid backbone . There are aromas of mango, pear, orange spice, lemongrass and pineapple. In the mouth, there are flavors of tropical fruit, apples, pears and a nice orange citrus note, balanced with minerality and a wonderful, round finish.', u'title': u'Fetzer Vineyards Valley Oaks Pinot Grigio', u'price': u'$10.99', u'id': 428373, u'link': u'https://www.amazon.com/Fetzer-Vineyards-Valley-Pinot-Grigio/dp/B0725QB94C', u'imageUrl': u'https://spoonacular.com/productImages/428373-312x231.jpg'}]}, u'aggregateLikes': 98, u'instructions': u"Blot the scallops dry with paper towels. Season with salt and pepper on both sides.Heat \xbe-1 Tablespoon of oil in a nonstick skillet on high heat. Add the scallops and cook the scallops until golden brown on both sides, about 2-3 minutes per side.You might have to cook the scallops in two batches. You don't want them to be too close together, or they will steam instead of sear and start eeking out liquid.It's very important not to touch the scallops until they are ready to turn, so that the scallops get that awesome sear. Set the scallops aside.Add the butter to the skillet over medium heat. Add the shallot, season with salt and pepper and cook for 3-5 minutes, until tender.Add the parsley, lemon juice and olive oil. Season with salt and pepper.Serve the scallops with the sauce.", u'spoonacularSourceUrl': u'https://spoonacular.com/seared-scallops-with-a-lemon-parsley-sauce-484900', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}