{u'recipes': [{u'sourceName': u'The Little Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/530832-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 530832, u'veryPopular': True, u'lowFodmap': False, u'title': u'Loaded Baked Potato Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 45, u'pricePerServing': 94.7, u'creditText': u'The Little Kitchen', u'extendedIngredients': [{u'originalString': u'2 heads of broccoli, florets cut', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'heads', u'unitShort': u'heads', u'amount': 2.0, u'consistency': u'solid', u'id': 11090, u'unit': u'heads'}, {u'originalString': u'6 green onions, sliced and divided in half', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'divided', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'3 to 3.25 pounds Idaho Russet potatoes, scrubbed and washed', u'aisle': u'Produce', u'name': u'idaho potatoes', u'metaInformation': [u'washed', u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11353, u'unit': u''}, {u'originalString': u'5 cups low sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'1 cup sharp cheddar, grated (and more for topping)', u'aisle': u'Cheese', u'name': u'sharp cheddar', u'metaInformation': [u'grated', u'for topping)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'4 Tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tablespoons'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.thelittlekitchen.net/2012/10/31/loaded-baked-potato-soup-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 400 degrees and line a cookie sheet with foil.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place potatoes on cookie sheet and bake for 60 minutes. After baking, allow potatoes to cool for 20 to 30 minutes or cool enough for you to handle.', u'length': {u'number': 80, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the potato peels and chop into 1 to 1.5 inch cubes.Melt butter on medium heat in a large heavy bottom French oven, I used my 5.5 quart Le Creuset.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add half of the green onions and cook for 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [], u'step': u'Add potatoes and season with salt and pepper. Stir and cook for 4 to 5 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}], u'step': u'Add chicken broth and turn heat to high and bring to a boil. After it comes to a boil, turn heat back down to medium or medium low and allow to simmer for about 5 to 6 minutes. Using a potato masher, mash the potatoes in the broth, about 5 to 6 times.How to temper cream and sour cream', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add cream and sour cream by tempering. Do not add both directly to the pot, first take a measuring cup and remove about 1-2 cups of potato soup mixture into a bowl.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add half of the cream and mix thoroughly with a wooden spoon.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Pour cream-potato soup mixture back into the pot and repeat for the remaining cream and sour cream. By tempering, you ensure the cream and sour cream doesn't curdle in the soup.", u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add the 1 cup of cheddar cheese and all of the broccoli to the soup and simmer for about 20 to 25 minutes on low to medium low heat. Season with salt and pepper to taste.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [], u'step': u'Serve with cheese, bacon and green onion as toppings.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'aggregateLikes': 6218, u'instructions': u"Heat oven to 400 degrees and line a cookie sheet with foil. Place potatoes on cookie sheet and bake for 60 minutes. After baking, allow potatoes to cool for 20 to 30 minutes or cool enough for you to handle. Remove the potato peels and chop into 1 to 1.5 inch cubes.Melt butter on medium heat in a large heavy bottom French oven, I used my 5.5 quart Le Creuset. Add half of the green onions and cook for 1-2 minutes. Add potatoes and season with salt and pepper. Stir and cook for 4 to 5 minutes.Add chicken broth and turn heat to high and bring to a boil. After it comes to a boil, turn heat back down to medium or medium low and allow to simmer for about 5 to 6 minutes. Using a potato masher, mash the potatoes in the broth, about 5 to 6 times.How to temper cream and sour creamAdd cream and sour cream by tempering. Do not add both directly to the pot, first take a measuring cup and remove about 1-2 cups of potato soup mixture into a bowl. Add half of the cream and mix thoroughly with a wooden spoon. Pour cream-potato soup mixture back into the pot and repeat for the remaining cream and sour cream. By tempering, you ensure the cream and sour cream doesn't curdle in the soup.Add the 1 cup of cheddar cheese and all of the broccoli to the soup and simmer for about 20 to 25 minutes on low to medium low heat. Season with salt and pepper to taste.Serve with cheese, bacon and green onion as toppings.", u'spoonacularSourceUrl': u'https://spoonacular.com/loaded-baked-potato-soup-530832', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 165, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}