{u'recipes': [{u'sourceName': u'Eat at Home Cooks', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/504223-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 504223, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vietnam Fried Rice', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 39.65, u'creditText': u'Eat at Home Cooks', u'extendedIngredients': [{u'originalString': u'4 Tbs. cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tbs'}, {u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 cup leftover or frozen vegetables (I used frozen peas and carrots)', u'aisle': u'Produce', u'name': u'mixed vegetables', u'metaInformation': [u'frozen', u'leftover', u'(I used peas and carrots)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-vegetables.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11583, u'unit': u'cup'}, {u'originalString': u'1 large onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tsp. pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'2 cup rice', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20444, u'unit': u'cup'}, {u'originalString': u'1 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 Tbs. soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'Tbs'}, {u'originalString': u'1 tsp.. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}, {u'originalString': u'1 lb. any cooked or raw meat (I used 2 large boneless chicken breasts that I sliced thin)', u'aisle': u'?', u'name': u'any', u'metaInformation': [u'raw', u'boneless', u'large', u'cooked', u'sliced', u'thin', u'(I used 2 chicken breasts that I )'], u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'unit': u'lb'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://eatathomecooks.com/2009/01/vietnam-fried-rice.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook the rice. In a hot skillet add the oil and stir fry the meat if it’s not cooked. I sprinkled some soy sauce on the chicken before I stir fried it.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the meat from the skillet and add the garlic, onion, salt, pepper, sugar and soy sauce. I didn’t measure any of this, just eye-balled it. Stir fry until the onion is cooked through. Stir in the beaten eggs, stir frying until the eggs are done. They will not and should not look like scrambled eggs you eat for breakfast.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the vegetables and stir fry until they are hot through.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken back in to the skillet, along with the rice. Throw in some more soy sauce until it looks good to you.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chenin Blanc, Gewurztraminer, and Riesling are great choices for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try Tanian et Vincent Careme Terre Brulee Chenin Blanc. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 1296, u'instructions': u'Cook the rice. In a hot skillet add the oil and stir fry the meat if it’s not cooked. I sprinkled some soy sauce on the chicken before I stir fried it. Remove the meat from the skillet and add the garlic, onion, salt, pepper, sugar and soy sauce. I didn’t measure any of this, just eye-balled it. Stir fry until the onion is cooked through. Stir in the beaten eggs, stir frying until the eggs are done. They will not and should not look like scrambled eggs you eat for breakfast. Add the vegetables and stir fry until they are hot through. Add the chicken back in to the skillet, along with the rice. Throw in some more soy sauce until it looks good to you.', u'spoonacularSourceUrl': u'https://spoonacular.com/vietnam-fried-rice-504223', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}