{u'recipes': [{u'sourceName': u'Laa Loosh', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/820753-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 820753, u'veryPopular': True, u'lowFodmap': False, u'title': u'Baked Chicken Egg Roll – 2 Point Total', u'diets': [u'dairy free'], u'pricePerServing': 55.03, u'creditText': u'Laa Loosh', u'extendedIngredients': [{u'originalString': u'– 1/4 tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'– 1 cup packaged coleslaw mix', u'aisle': u'Produce', u'name': u'coleslaw mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011109, u'unit': u'cup'}, {u'originalString': u'– 8 egg roll wrappers', u'aisle': u'Ethnic Foods', u'name': u'egg roll wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 18368, u'unit': u''}, {u'originalString': u'– 2 tsp minced, fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'– 1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'– 1/4 cup chopped green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'– 1/8 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'– 2 tbsp rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tbsp'}, {u'originalString': u'– 1/4 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'– 1 medium shallot, minced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'minced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'– 6 oz boneless, skinless chicken breast, shredded', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'shredded', u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'oz'}, {u'originalString': u'– 1/2 cup of Kikkoman Sweet & Sour Sauce (for dipping)', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'sweet', u'sour', u'(for dipping)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'– 1 tsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}, {u'originalString': u'– 1/3 cup Kikkoman Low Sodium Teriyaki Sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'teriyaki sauce', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 6112, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.laaloosh.com/2010/05/08/baked-chicken-egg-roll-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add shallot and garlic and cook over medium heat for 30 seconds; add chicken to skillet. Brown chicken, stirring frequently with a wooden spoon to break chicken into small pieces, about 5 minutes; drain off all liquid. Stir in teriyaki sauce, vinegar, sugar, ginger, salt, pepper, and cumin; simmer for 3 minutes to blend flavors. Toss in packaged coleslaw mix and diced onions and saute for about 1 minute.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6112, u'name': u'teriyaki sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw.png', u'id': 10011109, u'name': u'coleslaw mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place an egg roll wrapper on a flat work surface with the corners set vertically (pointing up and down like a diamond shape). Arrange 4 full tablespoons of filling down the center of wrapper, leaving 1/2 inch at the bottom and top.Fold the bottom of the wrapper to the center, over the filling. Gently, but firmly, fold the left side of the wrapper to the center and then fold in the right side. Fold the top of the wrapper down to cover filling and seal any loose ends with water; repeat with remaining ingredients.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place filled wrappers on prepared baking sheet; lightly spray surface of wrappers with non fat cooking spray.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until wrappers are golden brown, flipping once, about 16 minutes.', u'length': {u'number': 16, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 2027, u'instructions': u'Directions:Preheat oven to 400F.Coat a nonstick wok or large skillet with  non fat cooking spray. Add shallot and garlic and cook over medium heat for 30 seconds; add chicken to skillet. Brown chicken, stirring frequently with a wooden spoon to break chicken into small pieces, about 5 minutes; drain off all liquid. Stir in teriyaki sauce, vinegar, sugar, ginger, salt, pepper, and cumin; simmer for 3 minutes to blend flavors. Toss in packaged coleslaw mix and diced onions and saute for about 1 minute.Place an egg roll wrapper on a flat work surface with the corners set vertically (pointing up and down like a diamond shape). Arrange 4 full tablespoons of filling down the center of wrapper, leaving 1/2 inch at the bottom and top.Fold the bottom of the wrapper to the center, over the filling. Gently, but firmly, fold the left side of the wrapper to the center and then fold in the right side. Fold the top of the wrapper down to cover filling and seal any loose ends with water; repeat with remaining ingredients.Place filled wrappers on prepared baking sheet; lightly spray surface of wrappers with non fat cooking spray. Bake until wrappers are golden brown, flipping once, about 16 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-chicken-egg-roll-2-point-total-820753', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}