{u'recipes': [{u'sourceName': u'Bright Eyed Baker', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/615728-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 615728, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fluffy Buttermilk Scones', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 19.86, u'creditText': u'Bright Eyed Baker', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3 ounces (6 tablespoons) salted butter, frozen and cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'salted', u'frozen', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'8 1/2 ounces (1 cup) buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'1 egg, beaten, for brushing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten', u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 tablespoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.brighteyedbaker.com/2014/09/30/fluffy-buttermilk-scones/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Line a baking sheet with parchment paper and dust with flour.In a large bowl, whisk together the flour, sugar, baking powder, baking soda, and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}], u'step': u'Cut in the butter with a pastry cutter until the pieces are small and the mixture is coarse.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the buttermilk in two parts, folding just until no liquid remains isolated in the bowl, but the dough has not yet fully come together. Turn the mixture out onto the parchment-lined baking sheet and lightly knead into a soft dough, being careful not to overwork.* Pat into a 1" thick round and freeze for 1 hour. Preheat oven to 425F. Use the parchment to lift the dough from the baking sheet, and line baking sheet with a clean piece of parchment. Use a 2 1/2" round biscuit/cookie cutter to cut the dough into individual rounds. Lightly knead together remaining scraps, pat into a 1" thick circle again, and cut remaining scones. Use the last bit of scraps to form the final scone. Space scones apart on the prepared baking sheet and brush tops with egg.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Bake in the preheated oven for 12-15 minutes, until a toothpick inserted into the center of one comes out clean. These, like most scones, are best served warm the day they're made (especially with butter and jam), but any leftovers can be stored in a zip-top bag or airtight container and kept at room temperature for a few days. Scones can be reheated in the microwave for 15-20 seconds before serving.", u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Scone works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Line a baking sheet with parchment paper and dust with flour.In a large bowl, whisk together the flour, sugar, baking powder, baking soda, and salt. Cut in the butter with a pastry cutter until the pieces are small and the mixture is coarse. Add the buttermilk in two parts, folding just until no liquid remains isolated in the bowl, but the dough has not yet fully come together. Turn the mixture out onto the parchment-lined baking sheet and lightly knead into a soft dough, being careful not to overwork.* Pat into a 1" thick round and freeze for 1 hour. Preheat oven to 425F. Use the parchment to lift the dough from the baking sheet, and line baking sheet with a clean piece of parchment. Use a 2 1/2" round biscuit/cookie cutter to cut the dough into individual rounds. Lightly knead together remaining scraps, pat into a 1" thick circle again, and cut remaining scones. Use the last bit of scraps to form the final scone. Space scones apart on the prepared baking sheet and brush tops with egg. Bake in the preheated oven for 12-15 minutes, until a toothpick inserted into the center of one comes out clean. These, like most scones, are best served warm the day they\'re made (especially with butter and jam), but any leftovers can be stored in a zip-top bag or airtight container and kept at room temperature for a few days. Scones can be reheated in the microwave for 15-20 seconds before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/fluffy-buttermilk-scones-615728', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 12, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}