{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/597451-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 180, u'id': 597451, u'veryPopular': False, u'lowFodmap': False, u'title': u'Rabbit Confit', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'preparationMinutes': 30, u'pricePerServing': 414.83, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'15 to 20 whole black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'whole', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 1022030, u'unit': u''}, {u'originalString': u'6 cardamom pods', u'aisle': u'Spices and Seasonings', u'name': u'cardamom pods', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1002006, u'unit': u''}, {u'originalString': u'3 fresh bay leaves or 6 dried', u'aisle': u'Produce', u'name': u'fresh bay leaves', u'metaInformation': [u'dried', u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1002004, u'unit': u''}, {u'originalString': u'4 sprigs fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2063, u'unit': u'sprigs'}, {u'originalString': u'10 sprigs fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 10.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'10 cloves garlic, peeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 10.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Kosher salt and cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Lemon wedges, for squeezing', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'for squeezing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'1 whole rabbit, skinned and cut into 8 pieces', u'aisle': u'Meat', u'name': u'rabbit', u'metaInformation': [u'whole', u'cut into 8 pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rabbit.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 17180, u'unit': u''}, {u'originalString': u'1 shallot, peeled', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'8 star anise pods', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}, {u'originalString': u'1 teaspoon mustard seeds (yellow or brown)', u'aisle': u'Spices and Seasonings', u'name': u'yellow mustard seeds', u'metaInformation': [u'yellow', u'( or brown)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'teaspoon'}, {u'originalString': u'About 3 to 6 cups or so oil (I usually use a blend of 90 percent canola and 10 percent extra-virgin olive, although you can change that to 50 percent canola and 50 percent olive oil.)', u'aisle': u'?', u'name': u'so oil', u'metaInformation': [u'extra-virgin', u'canned', u'(I usually use a blend of 90 percent canola and 10 percent olive, although you can change that to 50 percent canola and 50 percent olive oil.)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'unit': u'cups'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://leitesculinaria.com/73052/recipes-rabbit-confit.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 300\xb0F (148\xb0 C). Rinse the rabbit under cold running water and pat dry with paper towels.2. In a heavy lidded 4-quart or larger pot or a large Dutch oven, combine the rabbit with the shallot, garlic cloves, bay leaves, cloves, peppercorns, star anise pods, juniper berries, cardamom pods, thyme, rosemary, mustard seeds, and 1 tablespoon of kosher salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'id': 1002006, u'name': u'cardamom pods'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rabbit.jpg', u'id': 17180, u'name': u'rabbit'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Add enough oil to cover the meat by about half an inch.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place a piece of parchment paper cut to fit your pot on the surface of the oil. Cover the pot with its lid and transfer to the oven. Check the contents of the pot occasionally—the oil should never come to a full simmer. You may need to reduce the heat. Cook until the meat is tender but not falling apart, about 3 hours.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the pot from the oven. (To make the confit in advance, you can cool the rabbit to room temperature and refrigerate overnight or up to 3 days. You must slowly heat the pieces in confit oil in a warm oven before grilling or searing, otherwise the center will be cold.)3. Preheat a charcoal or gas grill or ridged cast-iron grill pan until hot but not smoking. Lift the pieces out of the confit oil and season with pepper. Reserve the oil until serving time. Lightly sear the meat just long enough to warm it and imbue it with a smoky char flavor (remember, the rabbit is already cooked, you just want to warm it through).4.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rabbit.jpg', u'id': 17180, u'name': u'rabbit'}]}, {u'equipment': [], u'step': u'Drizzle the meat with a little of the confit oil and squeeze a wedge of lemon over it.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}], u'name': u''}], u'aggregateLikes': 101, u'instructions': u'1. Preheat the oven to 300\xb0F (148\xb0 C). Rinse the rabbit under cold running water and pat dry with paper towels.2. In a heavy lidded 4-quart or larger pot or a large Dutch oven, combine the rabbit with the shallot, garlic cloves, bay leaves, cloves, peppercorns, star anise pods, juniper berries, cardamom pods, thyme, rosemary, mustard seeds, and 1 tablespoon of kosher salt. Add enough oil to cover the meat by about half an inch. Place a piece of parchment paper cut to fit your pot on the surface of the oil. Cover the pot with its lid and transfer to the oven. Check the contents of the pot occasionally—the oil should never come to a full simmer. You may need to reduce the heat. Cook until the meat is tender but not falling apart, about 3 hours. Remove the pot from the oven. (To make the confit in advance, you can cool the rabbit to room temperature and refrigerate overnight or up to 3 days. You must slowly heat the pieces in confit oil in a warm oven before grilling or searing, otherwise the center will be cold.)3. Preheat a charcoal or gas grill or ridged cast-iron grill pan until hot but not smoking. Lift the pieces out of the confit oil and season with pepper. Reserve the oil until serving time. Lightly sear the meat just long enough to warm it and imbue it with a smoky char flavor (remember, the rabbit is already cooked, you just want to warm it through).4. Drizzle the meat with a little of the confit oil and squeeze a wedge of lemon over it.', u'spoonacularSourceUrl': u'https://spoonacular.com/rabbit-confit-597451', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 210, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}