{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/611707-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 611707, u'veryPopular': False, u'lowFodmap': False, u'title': u'Babe Ruth Bars', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 38.46, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1/2 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1 cup white corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19350, u'unit': u'cup'}, {u'originalString': u'6 cups cornflakes cereal', u'aisle': u'Cereal', u'name': u'cornflakes cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornflakes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 8020, u'unit': u'cups'}, {u'originalString': u'1 cup peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16098, u'unit': u'cup'}, {u'originalString': u'2/3 cup peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 16091, u'unit': u'cup'}, {u'originalString': u'1 cup semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'1/2 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Babe-Ruth-Bars/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan over medium heat, combine the peanut butter, corn syrup, brown sugar and white sugar. Cook stirring occasionally until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 262, u'instructions': u'In a large saucepan over medium heat, combine the peanut butter, corn syrup, brown sugar and white sugar. Cook stirring occasionally until smooth. Remove from heat and quickly mix in the cornflakes, chocolate chips and peanuts until evenly coated.Press the entire mixture gently into a buttered 9x13 inch baking dish. Allow to cool completely before cutting into bars.Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/babe-ruth-bars-611707', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 18, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}