{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599576-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 599576, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oven Fried Cinnamon Honey Chicken', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 284.01, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1/3 cup Dried bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1/4 cup melted Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'3 pounds Chicken cut in 8 pieces', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'cut in 8 pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'pounds'}, {u'originalString': u'3/4 teaspoon Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 Egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 cup Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1 tablespoon fresh Lemon Juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon Pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'1/4 teaspoon Turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.copykat.com/2009/05/10/oven-fried-cinnamon-honey-chicken-chicken-doesnt-need-to-be-boring-you-can-make-a-oven-fried-chicken-new-again-with-this-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine flour with all spices. Beat egg and milk. Coat chicken pieces with flour.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Combine breadcrumbs with egg mixture to form a soft moist mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}], u'step': u'Roll floured chicken pieces in moist crumb mixture and arrange skin side up in roasting pan. Sprinkle with the oil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Bake about 40 minutes or crisp and brown. The last 15 minutes pour over the combined melted butter, honey and lemon.This recipe works well with skin removed.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'pineapple , guava , apricot', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 178, u'instructions': u'Preheat oven to 350 degrees. Combine flour with all spices. Beat egg and milk. Coat chicken pieces with flour. Combine breadcrumbs with egg mixture to form a soft moist mixture. Roll floured chicken pieces in moist crumb mixture and arrange skin side up in roasting pan. Sprinkle with the oil. Bake about 40 minutes or crisp and brown. The last 15 minutes pour over the combined melted butter, honey and lemon.This recipe works well with skin removed.', u'spoonacularSourceUrl': u'https://spoonacular.com/oven-fried-cinnamon-honey-chicken-599576', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}