{u'recipes': [{u'sourceName': u"Jul's Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556488-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 4, u'id': 556488, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fried zucchini flowers', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 438.68, u'creditText': u"Jul's Kitchen", u'extendedIngredients': [{u'originalString': u'4 heaping tablespoons of all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'5 anchovy fillets', u'aisle': u'Seafood', u'name': u'anchovy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 5.0, u'consistency': u'solid', u'id': 15001, u'unit': u'fillet'}, {u'originalString': u'Basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'leaves'}, {u'originalString': u'50 ml of beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 50.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'ml'}, {u'originalString': u'200 g of buffalo mozzarella', u'aisle': u'Cheese', u'name': u'buffalo mozzarella', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 98870, u'unit': u'g'}, {u'originalString': u'Extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'1 pinch of ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1 pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'100 ml of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'ml'}, {u'originalString': u'10 zucchini flowers', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 56.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://en.julskitchen.com/tuscany/fried-zucchini-flowers', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the batter.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in a bowl flour, salt and pepper, then add slowly beer and water.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [], u'step': u'Add the liquid little by little in order to avoid lumps.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Let the batter rest in the fridge while stuffing the flowers.Wash the zucchini flowers and dry them gently, remove the pistil and fill them with a piece of buffalo mozzarella, half anchovy fillet and a basil leaf. Close them gently on themselves.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 98870, u'name': u'buffalo mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/anchovies.jpg', u'id': 15001, u'name': u'anchovy fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Heat two inches of olive oil in a large skillet, dip the stuffed flowers into the batter and remove the excess. When the olive oil is hot, lay the flowers well spaced into the skillet and let them fry for two minutes per side, until crisp and golden. Fry the flowers in batches, so they won't stick together.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove the flowers from the olive oil, lay them in a plate with a few sheets of paper towel to absorb the excess olive oil and sprinkle with sea salt and freshly ground black pepper. Enjoy!', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 39, u'instructions': u"Make the batter. Mix in a bowl flour, salt and pepper, then add slowly beer and water. Add the liquid little by little in order to avoid lumps. Let the batter rest in the fridge while stuffing the flowers.Wash the zucchini flowers and dry them gently, remove the pistil and fill them with a piece of buffalo mozzarella, half anchovy fillet and a basil leaf. Close them gently on themselves.Heat two inches of olive oil in a large skillet, dip the stuffed flowers into the batter and remove the excess. When the olive oil is hot, lay the flowers well spaced into the skillet and let them fry for two minutes per side, until crisp and golden. Fry the flowers in batches, so they won't stick together.Remove the flowers from the olive oil, lay them in a plate with a few sheets of paper towel to absorb the excess olive oil and sprinkle with sea salt and freshly ground black pepper. Enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/fried-zucchini-flowers-556488', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 14, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}