{u'recipes': [{u'sourceName': u'Healthy Green Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/552392-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 552392, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sweet Pickled Cherry Tomatoes', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 448.94, u'creditText': u'Healthy Green Kitchen', u'extendedIngredients': [{u'originalString': u'*2 1/2 teaspoons black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoons'}, {u'originalString': u'*4 cups of Champagne vinegar (I used apple cider vinegar instead)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'champagne vinegar', u'metaInformation': [u'(I used apple cider vinegar instead)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'cups'}, {u'originalString': u'*8 cups cherry tomatoes, hulled and pricked with a sterilized needle', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'with a sterilized needle', u'hulled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cups'}, {u'originalString': u"*5 teaspoons dill seeds (I didn't have dill so used cumin instead)", u'aisle': u'Spices and Seasonings', u'name': u'dill seeds', u'metaInformation': [u"(I didn't have dill so used cumin instead)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 5.0, u'consistency': u'solid', u'id': 2016, u'unit': u'teaspoons'}, {u'originalString': u'*10 dill sprigs', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dill', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 2045, u'unit': u''}, {u'originalString': u'*5 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'*1 tablespoon Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'*3/4 cups sugar (I used organic sugar)', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'organic', u'(I used sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'*1 1/4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://www.healthygreenkitchen.com/pickled-cherry-tomatoes.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Scald 5 pint jars in a large pot of simmering water fitted with a rack—you will use this pot to process the jars. Right before filling, put the jars on the counter. In a dry saut\xe9 pan over medium heat, toast the dill seeds and peppercorns. Divide the spices among the jars, using about 11/2 teaspoons per jar, then add 2 sprigs dill and 1 garlic clove to each jar. Pack the tomatoes evenly among the jars. Meanwhile, soak the lids in a pan of hot water to soften the rubber seal.In a pot, bring the vinegar, water, sugar, and salt to a boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'id': 2016, u'name': u'dill seed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Transfer the brine to a heat-proof pitcher and pour over the tomatoes, leaving a 1/2-inch space from the rim of the jar. Check the jars for air pockets, adding more brine if necessary to fill in gaps. Wipe the rims with a clean towel, seal with the lids, then screw on the bands until snug but not tight.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-timer.jpg', u'id': 404695, u'name': u'kitchen timer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the jars in the pot with the rack and add enough water to cover the jars by about 1 inch. Bring the water to a boil and process the jars for 15 minutes (start the timer when the water reaches a boil). Turn off the heat and leave the jars in the water for a few minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove the jars from the water and let cool completely.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 977, u'instructions': u'Scald 5 pint jars in a large pot of simmering water fitted with a rack—you will use this pot to process the jars. Right before filling, put the jars on the counter. In a dry saut\xe9 pan over medium heat, toast the dill seeds and peppercorns. Divide the spices among the jars, using about 11/2 teaspoons per jar, then add 2 sprigs dill and 1 garlic clove to each jar. Pack the tomatoes evenly among the jars. Meanwhile, soak the lids in a pan of hot water to soften the rubber seal.In a pot, bring the vinegar, water, sugar, and salt to a boil. Transfer the brine to a heat-proof pitcher and pour over the tomatoes, leaving a 1/2-inch space from the rim of the jar. Check the jars for air pockets, adding more brine if necessary to fill in gaps. Wipe the rims with a clean towel, seal with the lids, then screw on the bands until snug but not tight.Place the jars in the pot with the rack and add enough water to cover the jars by about 1 inch. Bring the water to a boil and process the jars for 15 minutes (start the timer when the water reaches a boil). Turn off the heat and leave the jars in the water for a few minutes. Remove the jars from the water and let cool completely.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-pickled-cherry-tomatoes-552392', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}