{u'recipes': [{u'sourceName': u'Whats Cooking Love', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/601832-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 601832, u'veryPopular': False, u'lowFodmap': False, u'title': u'Butterfinger Cheesecake Pudding Cookies', u'diets': [], u'pricePerServing': 43.14, u'creditText': u'Whats Cooking Love', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3/4 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'8 fun size Butterfinger bars, chopped', u'aisle': u'Sweet Snacks', u'name': u'butterfinger', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butterfinger.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 19069, u'unit': u''}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 1/4 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 box (3.4 ounces) instant cheesecake pudding, dry', u'aisle': u'Baking', u'name': u'instant cheesecake pudding mix', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.4, u'consistency': u'solid', u'id': 99192, u'unit': u'ounces'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'png', u'spoonacularScore': 11.0, u'sourceUrl': u'http://whatscookinglove.com/2013/12/butterfinger-cheesecake-pudding-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees. In a large bowl, cream the butter, sugar, and brown sugar together.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the cheesecake pudding mix and beat until incorporated.Beat in the eggs and vanilla until combined. In a small bowl combine the flour and baking soda.  Slowly add this mixture to the wet ingredients until all ingredients are well incorporated.Stir in the chopped Butterfinger bars until they are all mixed into the dough.', u'number': 2, u'ingredients': [{u'image': None, u'id': 99192, u'name': u'instant cheesecake pudding mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butterfinger.png', u'id': 19069, u'name': u'butterfinger candy bar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll the dough into rounded teaspoonfuls and place on an ungreased cookie sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 8-10 minutes or until the cookies are golden brown. Makes about 2 dozen cookies', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Preheat the oven to 350 degrees. In a large bowl, cream the butter, sugar, and brown sugar together.  Add the cheesecake pudding mix and beat until incorporated.Beat in the eggs and vanilla until combined. In a small bowl combine the flour and baking soda.  Slowly add this mixture to the wet ingredients until all ingredients are well incorporated.Stir in the chopped Butterfinger bars until they are all mixed into the dough.Roll the dough into rounded teaspoonfuls and place on an ungreased cookie sheet. Bake for 8-10 minutes or until the cookies are golden brown. Makes about 2 dozen cookies', u'spoonacularSourceUrl': u'https://spoonacular.com/butterfinger-cheesecake-pudding-cookies-601832', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}