{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/175919-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 175919, u'veryPopular': True, u'lowFodmap': False, u'title': u'Impossibly Easy Mini Pumpkin Pies', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 33.7, u'extendedIngredients': [{u'originalString': u'1 cup canned pumpkin (not pumpkin pie mix)', u'aisle': u'Baking', u'name': u'canned pumpkin', u'metaInformation': [u'canned', u'(not pumpkin pie mix)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup evaporated milk', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1214, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup Cool frozen whipped topping, thawed, if desired', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 42135, u'unit': u'cup'}, {u'originalString': u'1/2 cup Original mix', u'aisle': u'?', u'name': u'original mix', u'metaInformation': [], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.BettyCrocker.com/recipes/impossibly-easy-mini-pumpkin-pies/29854cdf-9068-4bf2-bacc-0696cd74887e', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 375F. Spray 12 regular-size muffin cups with cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In medium bowl, stir all ingredients except whipped topping until blended.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}]}, {u'equipment': [], u'step': u'Pour 1/4 cup of mixture into each muffin cup.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake about 30 minutes or until muffin tops are golden brown and edges are starting to pull away from sides of pan. Cool 10 minutes. With thin knife, loosen sides of pies from pan; remove from pan and place top sides up on cooling rack. Cool 10 minutes longer, and serve with 1 generous tablespoonful whipped topping.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pumpkin Pie works really well with Ice Wine, Moscato, and Vin Santo. Vin santo is typically sweet with notes of baking spices and nuts, so it pairs really well with pumpkin spiced desserts. A good sparkling Moscato would work too, and if you feel like splurging, an ice wine. The Castel Grisch Riesling Ice Wine with a 5 out of 5 star rating seems like a good match. It costs about 42 dollars per bottle.', u'pairedWines': [u'ice wine', u'moscato', u'vin santo'], u'productMatches': [{u'description': u'Brimming with flavors of luscious stone fruit marked by a cool strike of lemon lime. Silken and creamy. Sweet', u'title': u'Castel Grisch Riesling Ice Wine', u'price': u'$42.0', u'id': 431601, u'link': u'https://www.amazon.com/Castel-Grisch-Riesling-Wine-375ml/dp/B01MR06QVV', u'imageUrl': u'https://spoonacular.com/productImages/431601-312x231.jpg'}]}, u'aggregateLikes': 8025, u'instructions': u'1                               Heat oven to 375F. Spray 12 regular-size muffin cups with cooking spray.                                                           2                               In medium bowl, stir all ingredients except whipped topping until blended. Pour 1/4 cup of mixture into each muffin cup.                                                          3                               Bake about 30 minutes or until muffin tops are golden brown and edges are starting to pull away from sides of pan. Cool 10 minutes. With thin knife, loosen sides of pies from pan; remove from pan and place top sides up on cooling rack. Cool 10 minutes longer, and serve with 1 generous tablespoonful whipped topping.', u'spoonacularSourceUrl': u'https://spoonacular.com/impossibly-easy-mini-pumpkin-pies-175919', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}