{u'recipes': [{u'sourceName': u'The Lemon Bowl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/779509-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 779509, u'veryPopular': True, u'lowFodmap': False, u'title': u'Orange Chicken Lettuce Cups', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 169.64, u'creditText': u'The Lemon Bowl', u'extendedIngredients': [{u'originalString': u'bibb lettuce cups - to serve', u'aisle': u'Produce', u'name': u'bibb lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Butter-or-Boston-Bibb-lettuce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11250, u'unit': u'cups'}, {u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon chili paste', u'aisle': u'Ethnic Foods', u'name': u'chili paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6973, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'2 cloves garlic - grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons minced ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoons'}, {u'originalString': u'juice and zest of 1 orange', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9206, u'unit': u''}, {u'originalString': u'\xbd teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons Nakano Natural Rice Vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoons'}, {u'originalString': u'scallions and black roasted sesame seeds - optional garnish', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 12023, u'unit': u'servings'}, {u'originalString': u'1 pound boneless, skinless chicken breasts - cubed', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'2 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://thelemonbowl.com/2016/06/orange-chicken-lettuce-cups.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat oil in a wok or deep skillet over high heat.Sprinkle chicken cubes with salt and pepper then add to the hot pan. Stir-fry until golden brown on all sides, about 6-7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove chicken from pan and set aside.To the hot pan, add ginger, garlic and chili paste. Stir-fry for 30 seconds or until aromatic.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'id': 6973, u'name': u'chili paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add orange juice and zest to the pan. Use a wooden spoon to deglaze the pan, scraping up any browned bits.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Pour in rice vinegar, soy sauce and corn starch and whisk until smooth. Bring to a boil then reduce to a simmer until sauce begins to thicken, about 3-4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken back to the pan and stir to coat with orange sauce.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with sesame oil and stir once more.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}]}, {u'equipment': [], u'step': u'Serve chicken in lettuce cups and garnish with scallions and black roasted sesame seeds.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}], u'name': u''}], u'aggregateLikes': 385, u'instructions': u'Heat oil in a wok or deep skillet over high heat.Sprinkle chicken cubes with salt and pepper then add to the hot pan. Stir-fry until golden brown on all sides, about 6-7 minutes. Remove chicken from pan and set aside.To the hot pan, add ginger, garlic and chili paste. Stir-fry for 30 seconds or until aromatic.Add orange juice and zest to the pan. Use a wooden spoon to deglaze the pan, scraping up any browned bits.Pour in rice vinegar, soy sauce and corn starch and whisk until smooth. Bring to a boil then reduce to a simmer until sauce begins to thicken, about 3-4 minutes.Add chicken back to the pan and stir to coat with orange sauce. Drizzle with sesame oil and stir once more.Serve chicken in lettuce cups and garnish with scallions and black roasted sesame seeds.', u'spoonacularSourceUrl': u'https://spoonacular.com/orange-chicken-lettuce-cups-779509', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 17, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}