{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/222108-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 85, u'id': 222108, u'veryPopular': False, u'lowFodmap': False, u'title': u'Date & ginger malt loaf', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 66.22, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'2 tsp bicarbonate of soda', u'aisle': u'Baking', u'name': u'bicarbonate of soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'200g butter, cut into cubes, plus extra for greasing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for greasing', u'cut into cubes, plus extra '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'100g soft dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'g'}, {u'originalString': u'140g stoned dates, chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 9087, u'unit': u'g'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'410ml can evaporated milk', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 410.0, u'consistency': u'solid', u'id': 1214, u'unit': u'ml'}, {u'originalString': u'5 tbsp ginger syrup (from the stem ginger jar)', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'(from the stem ginger jar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tbsp'}, {u'originalString': u'50g stem ginger, chopped', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 11216, u'unit': u'g'}, {u'originalString': u'2 tsp ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'5 tbsp icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 19336, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp malted milk powder (we used Horlicks)', u'aisle': u'Tea and Coffee', u'name': u'malted milk powder', u'metaInformation': [u'(we used Horlicks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 14311, u'unit': u'tbsp'}, {u'originalString': u'225g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 225.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 29.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2970684/date-and-ginger-malt-loaf', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 160C/140C fan/gas 3.Grease and line a 900g/2lb loaf tinwith baking parchment.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Put the dates,evaporated milk and sugar in a smallsaucepan, bring to the boil and cook for5 mins until the dates are soft and thesugar has dissolved. Leave to cool.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1214, u'name': u'evaporated milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Put the flour, malted milk powder,ground ginger, stem ginger, bicarband butter into a food processor,and blitz until the mixture resemblesbreadcrumbs.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'id': 14311, u'name': u'malted milk powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 2021, u'name': u'ginger powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Pour in the cooled datemixture and the eggs, and pulse brieflyuntil the mixture is combined. Tip intoyour prepared tin and bake for 1 hr 15 minsuntil a skewer inserted comes out clean.Leave to cool for 10 mins in the tin, thentransfer to a wire rack.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}], u'step': u'Combine all theingredients for the drizzle and spoon overthe cake. Leave to set before serving.This cake is delicious if eaten on the dayit is made, but will improve after a dayor 2 in the cake tin.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 57, u'instructions': u'Heat oven to 160C/140C fan/gas 3.Grease and line a 900g/2lb loaf tinwith baking parchment. Put the dates,evaporated milk and sugar in a smallsaucepan, bring to the boil and cook for5 mins until the dates are soft and thesugar has dissolved. Leave to cool.Put the flour, malted milk powder,ground ginger, stem ginger, bicarband butter into a food processor,and blitz until the mixture resemblesbreadcrumbs. Pour in the cooled datemixture and the eggs, and pulse brieflyuntil the mixture is combined. Tip intoyour prepared tin and bake for 1 hr 15 minsuntil a skewer inserted comes out clean.Leave to cool for 10 mins in the tin, thentransfer to a wire rack. Combine all theingredients for the drizzle and spoon overthe cake. Leave to set before serving.This cake is delicious if eaten on the dayit is made, but will improve after a dayor 2 in the cake tin.', u'spoonacularSourceUrl': u'https://spoonacular.com/date-ginger-malt-loaf-222108', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}