{u'recipes': [{u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/667457-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 667457, u'veryPopular': True, u'lowFodmap': False, u'title': u'Smothered Sweet Pork Burritos', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 192.65, u'extendedIngredients': [{u'originalString': u'15 ounce black beans ( rinsed and drained )', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'( and )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16015, u'unit': u'ounce'}, {u'originalString': u'1/4 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon chili powder ( )', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoon cilantro ( chopped )', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u"1/4 teaspoon ground cumin Directions Servings 6 From Tastes Better From Scratch Adapted from Mel's Kitchen Cafe", u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 limes ( juice and zest )', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [u'( juice and zest )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'1 1/2 teaspoon liquid smoke ( )', u'aisle': u'Spices and Seasonings;Condiments', u'name': u'liquid smoke', u'metaInformation': [u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 93627, u'unit': u'teaspoon'}, {u'originalString': u'8 ounces monterey jack cheese ( or mozzarella cheese )', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'( or mozzarella cheese )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup Sugar, brown, packed', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'6 tortilla ( large )', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortilla', u'metaInformation': [u'large', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}, {u'originalString': u'1 cup long grain rice ( white )', u'aisle': u'Pasta and Rice', u'name': u'white rice', u'metaInformation': [u'long grain', u'white', u'( )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://myrecipemagic.com/recipe/recipedetail/smothered-sweet-pork-burritos', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Trim fat from the pork roast.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the pork into 2-3 large pieces and season each', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'piece with salt and', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'pepper on all sides', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Heat oil in a larg', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'e skillet over high', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'heat.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Add all the pi', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Sparkling ros\xe9, and Riesling are great choices for Burrito. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Mark West Black Label Monterey County Pinot Noir. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'pinot noir', u'sparkling rose', u'riesling'], u'productMatches': [{u'description': u"The deepest, darkest, smoothest Pinot in Mark West's collection, with notes of black cherries, plums, mocha, vanilla, and caramel.Pairs perfectly with grilled lamb chops, gourmet flatbread pizza, and pulled pork sandwiches. View More", u'title': u'Mark West Black Label Monterey County Pinot Noir', u'price': u'$12.99', u'id': 437001, u'link': u'https://www.wine.com/product/mark-west-black-label-monterey-county-pinot-noir-2016/235737', u'imageUrl': u'https://spoonacular.com/productImages/437001-312x231.jpg'}]}, u'aggregateLikes': 1412, u'instructions': u'Trim fat from the pork roast. Cut the pork into 2-3 large pieces and season each                                                   piece with salt and                                                   pepper on all sides                                                  .Heat oil in a larg                                                  e skillet over high                                                   heat. Add all the pi', u'spoonacularSourceUrl': u'https://spoonacular.com/smothered-sweet-pork-burritos-667457', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}