{u'recipes': [{u'sourceName': u'Food.com', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/112962-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 112962, u'veryPopular': False, u'lowFodmap': False, u'title': u"Gordon Ramsay's Malaysian Chicken Curry", u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 253.55, u'creditText': u'Food.com', u'extendedIngredients': [{u'originalString': u'100 ml chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 100.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'ml'}, {u'originalString': u'800 g chicken thighs, cut into bite sized pieces', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [u'cut into bite sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 800.0, u'consistency': u'solid', u'id': 5091, u'unit': u'g'}, {u'originalString': u'4 -5 long red chilies, trimmed', u'aisle': u'Produce', u'name': u'chilies', u'metaInformation': [u'red', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'coriander leaves, roughly torn', u'aisle': u'Spices and Seasonings', u'name': u'dried coriander leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'leaves'}, {u'originalString': u'2 tablespoons fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoons'}, {u'originalString': u'5 garlic cloves, peeled', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'5 cm piece fresh gingerroot, peeled and chopped', u'aisle': u'Produce', u'name': u'gingerroot', u'metaInformation': [u'fresh', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11216, u'unit': u''}, {u'originalString': u'400 g green beans, trimmed', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 11052, u'unit': u'g'}, {u'originalString': u'1 teaspoon ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'4 kaffir lime leaves', u'aisle': u'Ethnic Foods', u'name': u'kaffir lime leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 93633, u'unit': u''}, {u'originalString': u'2 lemongrass, stalks trimmed, outer leaves removed and sliced', u'aisle': u'Produce;Ethnic Foods', u'name': u'lemongrass', u'metaInformation': [u'trimmed', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11972, u'unit': u''}, {u'originalString': u'400 ml light coconut milk', u'aisle': u'Canned and Jarred', u'name': u'light coconut milk', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 400.0, u'consistency': u'liquid', u'id': 99009, u'unit': u'ml'}, {u'originalString': u'2 tablespoons light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'2 onions, peeled and thinly sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 teaspoon palm sugar (or soft brown sugar)', u'aisle': u'Baking', u'name': u'palm sugar', u'metaInformation': [u'soft', u'(or brown sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93831, u'unit': u'teaspoon'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 shallots, peeled and chopped', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'3 star anise', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.food.com/recipe/gordon-ramsays-malaysian-chicken-curry-254495', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'To make the curry paste.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the garlic, chillies, lemon grass, ginger and shallots in a food processor to form a paste. (Or you can use a pestle and mortar).Next, heat the oil in a large heavy-based pan. Tip in the curry paste with 1 tsp ground turmeric and stir over a medium heat for a few minutes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'id': 11972, u'name': u'lemon grass'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the onions and cook, stirring for 5 minutes.Season the chicken pieces with salt and pepper and add to the pan, stirring to coat in the paste.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the lime leaves, cinnamon stick, star anise, coconut milk, stock, sugar, soy and fish sauces and bring to the boil. Reduce the heat to a simmer and cook gently for half an hour to an hour until the chicken is tender.Skim off any excess oil on the surface of the curry. Taste add salt and pepper if you think its needs.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-leaves.jpg', u'id': 93633, u'name': u'lime leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the beans and cover for another few minutes until the beans are tender.To serve, scatter the coriander leaves over the curry and serve with rice and roti.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is CalNaturale Chardonnay Lodi. It has 4.1 out of 5 stars and a bottle costs about 11 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 61, u'instructions': u'To make the curry paste. Put the garlic, chillies, lemon grass, ginger and shallots in a food processor to form a paste. (Or you can use a pestle and mortar).Next, heat the oil in a large heavy-based pan. Tip in the curry paste with 1 tsp ground turmeric and stir over a medium heat for a few minutes. Add the onions and cook, stirring for 5 minutes.Season the chicken pieces with salt and pepper and add to the pan, stirring to coat in the paste. Add the lime leaves, cinnamon stick, star anise, coconut milk, stock, sugar, soy and fish sauces and bring to the boil. Reduce the heat to a simmer and cook gently for half an hour to an hour until the chicken is tender.Skim off any excess oil on the surface of the curry. Taste add salt and pepper if you think its needs. Add the beans and cover for another few minutes until the beans are tender.To serve, scatter the coriander leaves over the curry and serve with rice and roti.', u'spoonacularSourceUrl': u'https://spoonacular.com/gordon-ramsays-malaysian-chicken-curry-112962', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 26, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}