{u'recipes': [{u'sourceName': u'Skinny Taste', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/899558-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 899558, u'veryPopular': False, u'lowFodmap': False, u'title': u'King Crab Cauliflower Fried Rice', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 134.95, u'creditText': u'Skinny Taste', u'extendedIngredients': [{u'originalString': u'24 oz riced cauliflower', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 11135, u'unit': u'oz'}, {u'originalString': u'1 lb (2 frozen) King crab legs', u'aisle': u'Seafood', u'name': u'crab', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 15136, u'unit': u''}, {u'originalString': u'2 large eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 small onion, diced fine', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'small', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'5 scallions, diced, whites and greens separated', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'diced', u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tbsp sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp soy sauce or gf soy sauce (use Liquid Aminos for W30, Paleo)', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'for w30, paleo)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.skinnytaste.com/king-crab-cauliflower-fried-rice/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'If making the rice yourself, place a few florets at a time in a food processor and pulse until the cauliflower is small and has the texture of rice or couscous  dont over process or it will get mushy. Set aside and repeat with the remaining cauliflower in a few batches. In a large pot, add about 2 inches of water and bring to a boil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [], u'step': u'Add the crab leg and cook, covered until heated through, about 10 minutes. When cooked, remove the crab from the shell and lightly flake. Season eggs with salt.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 15136, u'name': u'crab'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Heat a large saute pan or wok over medium heat and spray with oil.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the eggs and cook, turning a few times until set; set aside. Reduce heat to medium-low, add the sesame oil and saute onions, scallion whites, and garlic about 3 to 4 minutes, or until soft. Raise the heat to medium-high.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the cauliflower rice to the saute pan along with soy sauce.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10111135, u'name': u'cauliflower rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}, {u'equipment': [], u'step': u'Mix, cover and cook approximately 5 to 6 minutes, stirring occasionally, until the cauliflower is slightly crispy on the outside but tender on the inside.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [], u'step': u'Add the egg and crab, remove from heat and mix in scallion greens.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 15136, u'name': u'crab'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Luna Nuda Pinot Grigio with a 4.4 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste.', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 250, u'instructions': u'If making the rice yourself, place a few florets at a time in a food processor and pulse until the cauliflower is small and has the texture of rice or couscous  dont over process or it will get mushy. Set aside and repeat with the remaining cauliflower in a few batches. In a large pot, add about 2 inches of water and bring to a boil. Add the crab leg and cook, covered until heated through, about 10 minutes. When cooked, remove the crab from the shell and lightly flake. Season eggs with salt. Heat a large saute pan or wok over medium heat and spray with oil. Add the eggs and cook, turning a few times until set; set aside. Reduce heat to medium-low, add the sesame oil and saute onions, scallion whites, and garlic about 3 to 4 minutes, or until soft. Raise the heat to medium-high. Add the cauliflower rice to the saute pan along with soy sauce. Mix, cover and cook approximately 5 to 6 minutes, stirring occasionally, until the cauliflower is slightly crispy on the outside but tender on the inside. Add the egg and crab, remove from heat and mix in scallion greens.', u'spoonacularSourceUrl': u'https://spoonacular.com/king-crab-cauliflower-fried-rice-899558', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}