{u'recipes': [{u'sourceName': u'The Cookie Rookie', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/615994-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 615994, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hard Apple Cider Pulled BBQ Chicken Sandwiches with Almond Apple Slaw', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 236.89, u'creditText': u'The Cookie Rookie', u'extendedIngredients': [{u'originalString': u'1 bottle Hard Apple Cider (I used Angry Orchard)', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [u'hard', u'(I used Angry Orchard)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'solid', u'id': 1009016, u'unit': u'bottle'}, {u'originalString': u'2 tablespoons apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoons'}, {u'originalString': u'2 apples, diced', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 bottle KC Masterpiece Bourbon BBQ Sauce (or your favorite brand)', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'your favorite', u'(or brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'bottle'}, {u'originalString': u'14 ounce coleslaw mix', u'aisle': u'Produce', u'name': u'coleslaw mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011109, u'unit': u'ounce'}, {u'originalString': u'\xbd teaspoon garlic and herb seasoning salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'6 hamburger buns', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'1 cup plain greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 large boneless skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'\xbc cup slivered almonds', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10012061, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'png', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.thecookierookie.com/hard-apple-cider-pulled-bbq-chicken/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"In a large crockpot, pour BBQ sauce and cider over chicken breasts and cook on high for 4 hours (or on medium for 6 hours)After four hours, shred chicken using two forks. You can continue warming the chicken on low or medium until you're ready to eat.In a medium bowl, combine slaw, appls, almonds, yogurt, honey, onion, and spices. Stir until all of the ingredients are well combined. Refrigerate until ready to use.To serve, top chicken with slaw and serve on a hamburger bun. Enjoy!", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'id': 18350, u'name': u'hamburger bun'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 203, u'instructions': u"In a large crockpot, pour BBQ sauce and cider over chicken breasts and cook on high for 4 hours (or on medium for 6 hours)After four hours, shred chicken using two forks. You can continue warming the chicken on low or medium until you're ready to eat.In a medium bowl, combine slaw, appls, almonds, yogurt, honey, onion, and spices. Stir until all of the ingredients are well combined. Refrigerate until ready to use.To serve, top chicken with slaw and serve on a hamburger bun. Enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/hard-apple-cider-pulled-bbq-chicken-sandwiches-with-almond-apple-slaw-615994', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 255, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}