{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537530-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 537530, u'veryPopular': False, u'lowFodmap': False, u'title': u'Best Friend Chorizo Queso', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 166.39, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'1/2 cup light lager beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14006, u'unit': u'cup'}, {u'originalString': u'1 3.5 ounce can green chilis', u'aisle': u'Canned and Jarred', u'name': u'canned green chilis', u'metaInformation': [u'green', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-jalapenos.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.5, u'consistency': u'solid', u'id': 11980, u'unit': u'ounce'}, {u'originalString': u'1/4 pound spicy chorizo sausage', u'aisle': u'Meat', u'name': u'chorizo sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 7019, u'unit': u'pound'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'Fresh cilantro, garnish', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11165, u'unit': u'servings'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'8 ounces grated cheddar and/or monterey jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'ounces'}, {u'originalString': u'1/4 cup diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'Tortilla chips, for serving', u'aisle': u'Savory Snacks', u'name': u'tortilla chips', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19056, u'unit': u'servings'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://www.macheesmo.com/2014/03/chorizo-queso/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a medium cast iron skillet over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add chorizo sausage and cook until browned. Break up the sausage as it cooks.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}]}, {u'equipment': [], u'step': u'Add onion and a pinch of salt and continue to cook until onions are soft. Scoop out a few tablespoons of the chorizo mixture for a topping.2)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add green chilis to the pan and stir to heat through. 3) Stir in flour to the mixture and cook for a minute or two to cook out the flour taste.4) Stir in beer and it should start to thicken. Once beer is incorporated, add grated cheese and stir to melt the cheese. If queso is too thick, add another splash of beer.5)', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [], u'step': u'Garnish dip with reserved chorizo and fresh cilantro.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}]}, {u'equipment': [], u'step': u'Serve immediately with tortilla chips!', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortilla-chips.jpg', u'id': 19056, u'name': u'tortilla chips'}]}], u'name': u''}], u'aggregateLikes': 132, u'instructions': u'Directions1) Place a medium cast iron skillet over medium heat. Add chorizo sausage and cook until browned. Break up the sausage as it cooks. Add onion and a pinch of salt and continue to cook until onions are soft. Scoop out a few tablespoons of the chorizo mixture for a topping.2) Add green chilis to the pan and stir to heat through. 3) Stir in flour to the mixture and cook for a minute or two to cook out the flour taste.4) Stir in beer and it should start to thicken. Once beer is incorporated, add grated cheese and stir to melt the cheese. If queso is too thick, add another splash of beer.5) Garnish dip with reserved chorizo and fresh cilantro. Serve immediately with tortilla chips!', u'spoonacularSourceUrl': u'https://spoonacular.com/best-friend-chorizo-queso-537530', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}