{u'recipes': [{u'sourceName': u'Dessert Now Dinner Later', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/620237-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 620237, u'veryPopular': True, u'lowFodmap': False, u'title': u'Christmas Tree OREO Cookie Balls', u'diets': [], u'pricePerServing': 23.95, u'creditText': u'Dessert Now Dinner Later', u'extendedIngredients': [{u'originalString': u'1 pkg (8 oz.) brick cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'Green decorating gel (You will need 2 or more (0.67oz) tubes depending on how many balls you make; I only decorated 24 balls.)', u'aisle': u'Meat', u'name': u'meat balls', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meatballs.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.34, u'consistency': u'solid', u'id': 10110219, u'unit': u'oz'}, {u'originalString': u'36 OREO Cookies, finely crushed (about 3 cups)', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'crushed', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u'cups'}, {u'originalString': u'Red candy coated chocolate pieces or cinnamon candy', u'aisle': u'Sweet Snacks', u'name': u'red cinnamon candy', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cinnamon-candies.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93737, u'unit': u'pieces'}, {u'originalString': u'4 pkg. (4 oz. each) semi-sweet baking chocolate, melted', u'aisle': u'Baking', u'name': u'Semi-Sweet Chocolate Baking Chips', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'oz'}, {u'originalString': u'Substitute semi-sweet baking chocolate with 1 (12oz) bag of quality white chocolate chips, melted with 1 to 2 tsp of coconut oil or shortening for thinning', u'aisle': u'Baking', u'name': u'Semi-Sweet Chocolate Baking Chips', u'metaInformation': [u'with 1 (12oz) bag of quality white chocolate chips, melted with 1 to 2 tsp of coconut oil or shortening for thinning'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 48.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'servings'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.dessertnowdinnerlater.com/2014/11/christmas-tree-oreo-cookie-balls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'MIX cream cheese and cookie crumbs until blended.SHAPE into 48 (1-inch) balls. Freeze 10 min. Dip balls in melted chocolate; place in single layer in shallow waxed paper-lined pan.CUSTOMIZE it with your own ingredient additions or decorative skills.REFRIGERATE 1 hour or until firm.Share and enjoy!Pipe a tree with the green decorating gel. Press a red candy coated chocolate piece or cinnamon candy into the gel at the top.Keep refrigerated, in an air-tight container, unstacked. Dont put plastic wrap on top because it will rub off the gel.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 3716, u'instructions': u'MIX cream cheese and cookie crumbs until blended.SHAPE into 48 (1-inch) balls. Freeze 10 min. Dip balls in melted chocolate; place in single layer in shallow waxed paper-lined pan.CUSTOMIZE it with your own ingredient additions or decorative skills.REFRIGERATE 1 hour or until firm.Share and enjoy!Pipe a tree with the green decorating gel. Press a red candy coated chocolate piece or cinnamon candy into the gel at the top.Keep refrigerated, in an air-tight container, unstacked. Dont put plastic wrap on top because it will rub off the gel.', u'spoonacularSourceUrl': u'https://spoonacular.com/christmas-tree-oreo-cookie-balls-620237', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}