{u'recipes': [{u'sourceName': u'The Gracious Pantry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/705203-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 705203, u'veryPopular': False, u'lowFodmap': False, u'title': u'Clean Eating Red Lentil Vegetable Stew', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 89.4, u'creditText': u'The Gracious Pantry', u'extendedIngredients': [{u'originalString': u'1 cup peeled and sliced thin carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'peeled', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 cup finely diced celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 tbsp. garlic powder (OR 6 cloves finely chopped garlic)', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [u'finely chopped', u'(OR 6 cloves garlic)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tbsp'}, {u'originalString': u'1 tsp. ground cardamom', u'aisle': u'Spices and Seasonings', u'name': u'ground cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2006, u'unit': u'tsp'}, {u'originalString': u'2 tsp. ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'1 tbsp. ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp. oil (I used coconut oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'(I used coconut oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'2 cups small, split, red lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red lentils', u'metaInformation': [u'split', u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-red.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10016069, u'unit': u'cups'}, {u'originalString': u'Salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 cup chopped, fresh tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}, {u'originalString': u'6 cups chicken or vegetable broth/stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'5 small white potatoes, diced into 1/2 inch cubes or smaller', u'aisle': u'Produce', u'name': u'white potatoes', u'metaInformation': [u'diced', u'white', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 10111362, u'unit': u''}, {u'originalString': u'1 small, yellow onion, chopped fine', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'small', u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.thegraciouspantry.com/clean-eating-red-lentil-vegetable-stew-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the chicken or veggie stock into a large soup pot with the chopped tomatoes and set it aside.Prepare your onion, celery and carrots, and saut them over low to medium heat using the oil until the onions are nicely caramelized. This can take a little time, so be patient.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the celery and onion mix along with the potatoes to the soup pot and stir in the spices.Bring to a boil and cook for 20 minutes over high heat.Stir in the lentils and continue to cook, reducing the heat just slightly. Watch the pot as the lentils can burn on the bottom of the pot if you dont stir them often.Cool a bit and serve, adding salt to taste.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'id': 16069, u'name': u'lentils'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Stew works really well with Cabernet Sauvignon, Chablis, and Malbec. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. You could try Groth Cabernet Sauvignon. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 59 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'The 2006 Cabernet Sauvignon is big and lush with huge gobs of fruit in the aroma and flavor. The texture of the wine is soft and supple, typical of Cabernet Sauvignons grown in our area of the Oakville AVA. Patience during bottle aging will reward the "steward" with an outstanding bottle over the next 10 to 15 years.Try this Cabernet with a lamb loin marinated in olive oil and garden herbs with lemon mashed Yukon Gold potatoes and Swiss chard. View More', u'title': u'Groth Cabernet Sauvignon', u'price': u'$58.99', u'id': 442462, u'link': u'https://www.wine.com/product/groth-cabernet-sauvignon-2006/98801', u'imageUrl': u'https://spoonacular.com/productImages/442462-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'Pour the chicken or veggie stock into a large soup pot with the chopped tomatoes and set it aside.Prepare your onion, celery and carrots, and saut them over low to medium heat using the oil until the onions are nicely caramelized. This can take a little time, so be patient.Add the celery and onion mix along with the potatoes to the soup pot and stir in the spices.Bring to a boil and cook for 20 minutes over high heat.Stir in the lentils and continue to cook, reducing the heat just slightly. Watch the pot as the lentils can burn on the bottom of the pot if you dont stir them often.Cool a bit and serve, adding salt to taste.', u'spoonacularSourceUrl': u'https://spoonacular.com/clean-eating-red-lentil-vegetable-stew-705203', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}