{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/212038-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 212038, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roast fillet of sea bass with parsnip pur\xe9e & caramelised garlic', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 35, u'pricePerServing': 909.72, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'\xbd tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'40g button mushrooms, sliced', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 11260, u'unit': u'g'}, {u'originalString': u'10 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'60ml milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 60.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'oil for deep-frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for deep-frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'\xbd parsnip', u'aisle': u'Produce', u'name': u'parsnip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'2\xbd parsnips', u'aisle': u'Produce', u'name': u'parsnips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.5, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'1 whole sea bass, about 300g', u'aisle': u'Seafood', u'name': u'sea bass', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sea-bass.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10015004, u'unit': u''}, {u'originalString': u'4 small shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'200ml veal stock', u'aisle': u'Canned and Jarred', u'name': u'veal stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'ml'}, {u'originalString': u'\xbd tbsp white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1002068, u'unit': u'tbsp'}], u'healthScore': 75.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1039653/roast-fillet-of-sea-bass-with-parsnip-pure-and-car', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'For the crisps, peel parsnips and slicelengthways, using a mandolin to slice asthinly as possible. Deep-fry in hot oil untilcrisp.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}], u'step': u'Drain on kitchen towels to absorbany excess fat and set aside ina dry place. Can be made up to 1 dayahead and kept in an airtight container.For the caramelised garlic, peel theshallots and garlic. Blanch the shallots inboiling salted water for 10 mins or untiltender.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Cut them in half if large and drainwell.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put the garlic in a small saucepan ofboiling salted water, bring to the boil for2 mins, then drain and change the water.Repeat 4 times and drain well.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heata little olive oil in a frying pan over amedium heat, add the shallots and garlicand cook until caramelised, shaking thepan so they don’t stick. Can be made inthe morning and reheated.For the pur\xe9e, peel the parsnips andcut them into big chunks. Cook in boilingsalted water until tender. Bring the milkto the boil and set aside.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scale.jpg', u'id': 404705, u'name': u'kitchen scale'}], u'step': u'Drain theparsnips well, then put in a blenderwith the butter and some of the boiledmilk and blend until totally smooth:the pur\xe9e should be the consistencyof double cream, so add more milk ifnecessary. Season and keep warm ormake ahead and reheat.Scale and fillet the fish.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove anypin bones (or ask your fishmonger todo this, but keep the bones for thesauce). Rinse under cold water andpat dry with kitchen paper. Score theskin of the fish several times witha sharp knife to help prevent it fromcurling during cooking. Leave the bones(but not the heads) to soak in cold water.To make the sauce, heat a little olive oilin a pan and cook the shallots for about5 mins until golden and soft.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Add themushrooms and continue to cook for10 mins, stirring occasionally.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain thefish bones, add to the pan and cook for5-6 mins.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the vinegar and let it cometo the boil for 3 mins, then add the stock,season lightly and simmer for 30 mins,skimming at regular intervals. Passthrough a fine sieve into a clean pan,bring back to the boil and whisk in thebutter to thicken and gloss the sauce.', u'length': {u'number': 33, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Heat a non-stick frying pan until smokinghot, add a few drops of oil, then add thefish, skin side down. Season with salt andpepper and press the fish down with apalette knife if it begins to curl up. Oncethe skin is well browned, turn the filletsover and cook the other side; the wholeprocess should take no more than 5-6mins, depending on the thickness of thefish. To serve, spoon the pur\xe9e on towarmed plates, make a hollow in thecentre, and fill with the caramelisedgarlic and shallots.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Pour the saucearound the pur\xe9e, place the fish on topand add a few parsnip crisps for garnish.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Santa Cristina by Antinori Pinot Grigio with a 4.1 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish.', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 91, u'instructions': u'For the crisps, peel parsnips and slicelengthways, using a mandolin to slice asthinly as possible. Deep-fry in hot oil untilcrisp. Drain on kitchen towels to absorbany excess fat and set aside ina dry place. Can be made up to 1 dayahead and kept in an airtight container.For the caramelised garlic, peel theshallots and garlic. Blanch the shallots inboiling salted water for 10 mins or untiltender. Cut them in half if large and drainwell. Put the garlic in a small saucepan ofboiling salted water, bring to the boil for2 mins, then drain and change the water.Repeat 4 times and drain well. Heata little olive oil in a frying pan over amedium heat, add the shallots and garlicand cook until caramelised, shaking thepan so they don’t stick. Can be made inthe morning and reheated.For the pur\xe9e, peel the parsnips andcut them into big chunks. Cook in boilingsalted water until tender. Bring the milkto the boil and set aside. Drain theparsnips well, then put in a blenderwith the butter and some of the boiledmilk and blend until totally smooth:the pur\xe9e should be the consistencyof double cream, so add more milk ifnecessary. Season and keep warm ormake ahead and reheat.Scale and fillet the fish. Remove anypin bones (or ask your fishmonger todo this, but keep the bones for thesauce). Rinse under cold water andpat dry with kitchen paper. Score theskin of the fish several times witha sharp knife to help prevent it fromcurling during cooking. Leave the bones(but not the heads) to soak in cold water.To make the sauce, heat a little olive oilin a pan and cook the shallots for about5 mins until golden and soft. Add themushrooms and continue to cook for10 mins, stirring occasionally. Drain thefish bones, add to the pan and cook for5-6 mins. Add the vinegar and let it cometo the boil for 3 mins, then add the stock,season lightly and simmer for 30 mins,skimming at regular intervals. Passthrough a fine sieve into a clean pan,bring back to the boil and whisk in thebutter to thicken and gloss the sauce.Heat a non-stick frying pan until smokinghot, add a few drops of oil, then add thefish, skin side down. Season with salt andpepper and press the fish down with apalette knife if it begins to curl up. Oncethe skin is well browned, turn the filletsover and cook the other side; the wholeprocess should take no more than 5-6mins, depending on the thickness of thefish. To serve, spoon the pur\xe9e on towarmed plates, make a hollow in thecentre, and fill with the caramelisedgarlic and shallots. Pour the saucearound the pur\xe9e, place the fish on topand add a few parsnip crisps for garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/roast-fillet-of-sea-bass-with-parsnip-pure-caramelised-garlic-212038', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}