{u'recipes': [{u'sourceName': u'Moms Dish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511615-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 511615, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cuban Pork Sandwich', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 354.05, u'creditText': u'Moms Dish', u'extendedIngredients': [{u'originalString': u'2 Baguette', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'1 tablespoon Parsley; garlic sauce', u'aisle': u'Ethnic Foods', u'name': u'chile garlic sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 93749, u'unit': u'tablespoon'}, {u'originalString': u'3 pressed Garlic Cloves; garlic sauce', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'6 Garlic Cloves: diced; for marinade', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'diced', u'for marinade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 cup Mayonnaise; garlic sauce', u'aisle': u'Gourmet;Condiments', u'name': u'garlic mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/aioli.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 93758, u'unit': u'cup'}, {u'originalString': u'3 Lime; for marinade', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'for marinade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1 medium Onion: diced; for marinade', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium', u'for marinade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 medium Onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 cups Orange Juice; for marinade', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'for marinade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9206, u'unit': u'cups'}, {u'originalString': u'2 tablespoons Parsley; for marinad', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'for marinad'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1/2 tablespoons Pepper; for marinade', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'for marinade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tablespoons'}, {u'originalString': u'1 cup diced Pepperoncinis', u'aisle': u'Canned and Jarred', u'name': u'pepperoncinis', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11976, u'unit': u'cup'}, {u'originalString': u'4 pounds Pork', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 10010219, u'unit': u'pounds'}, {u'originalString': u'1 tablespoon Salt; for marinade', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'for marinade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tablespoon'}, {u'originalString': u'8 slices Swiss Cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1040, u'unit': u'slices'}], u'healthScore': 43.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://momsdish.com/recipe/353/cuban-pork-sandwich', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place pork in a deep dish with orange juice, juice form limes, garlic, onion, parsley and season it with salt and pepper. Leave meat marinating for 12-24 hours. The longer it marinates the better.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}]}, {u'equipment': [], u'step': u'Remove chunks of onion and garlic from the marinate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Cut onion into 2 inch pieces, saute on a skillet until golden brown.Using a small bowl, combine mayonnaise together with parsley and pressed garlic. Slice baguette lengthwise, apply mayonnaise to one of the sides, followed by Swiss cheese. On the other side, place pepperoncinis, followed by pork (with the juice) and sauteed onions. Press both sides together and serve. If you plan on serving later, you can warm it up in the oven.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoncini.jpg', u'id': 11976, u'name': u'peperoncini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'id': 1040, u'name': u'swiss cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}]}], u'name': u'Place pork with marinate in an iron cast oven, bake at 250F for 3 hours. You can also use a slow cooker, cook on high for 5 hours. Pull pork off the bone into tiny pieces, leave it resting in its juices. Once the pork is cooked, prepare ingredients for the sandwich'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 364, u'instructions': u'Place pork in a deep dish with orange juice, juice form limes, garlic, onion, parsley and season it with salt and pepper. Leave meat marinating for 12-24 hours. The longer it marinates the better. Remove chunks of onion and garlic from the marinate. Place pork with marinate in an iron cast oven, bake at 250F for 3 hours. You can also use a slow cooker, cook on high for 5 hours. Pull pork off the bone into tiny pieces, leave it resting in its juices. Once the pork is cooked, prepare ingredients for the sandwich: Cut onion into 2 inch pieces, saute on a skillet until golden brown.Using a small bowl, combine mayonnaise together with parsley and pressed garlic. Slice baguette lengthwise, apply mayonnaise to one of the sides, followed by Swiss cheese. On the other side, place pepperoncinis, followed by pork (with the juice) and sauteed onions. Press both sides together and serve. If you plan on serving later, you can warm it up in the oven.', u'spoonacularSourceUrl': u'https://spoonacular.com/cuban-pork-sandwich-511615', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 270, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}