{u'recipes': [{u'sourceName': u'Simply Quinoa', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/793084-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 793084, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegetable Cauliflower Rice + Quinoa Sushi', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 136.02, u'creditText': u'Simply Quinoa', u'extendedIngredients': [{u'originalString': u'1 avocado, sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'2 teaspoons brown rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'brown rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup shredded cabbage', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11109, u'unit': u'cup'}, {u'originalString': u'1 small carrot, julienned', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'small', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 medium head cauliflower', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'\xbd medium cucumber, julienned', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'medium', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'\xbd teaspoon ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'Bamboo rolling mat, optional', u'aisle': u'Pasta and Rice', u'name': u'mat bean', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/moth-beans-matki.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 99144, u'unit': u'servings'}, {u'originalString': u'4 - 6 nori sheets', u'aisle': u'Ethnic Foods', u'name': u'nori', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 4.0, u'consistency': u'liquid', u'id': 11446, u'unit': u'sheets'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup uncooked quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'\xbd red pepper, julienned', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 teaspoon wheat-free tamari', u'aisle': u'Ethnic Foods', u'name': u'tamari', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10116124, u'unit': u'teaspoon'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 97.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.simplyquinoa.com/vegetable-cauliflower-rice-quinoa-sushi/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425F. Line a baking sheet with parchment paper and set it aside.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Remove the stem from the cauliflower, then chop it into florets. In batches, add the florets to a food processor and process until a "rice" texture is formed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer the cauliflower rice to the baking sheet and repeat with the remaining florets.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10111135, u'name': u'cauliflower rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Drizzle the rice with 1 tablespoon of olive oil, then roast in the oven for about 30 minutes, stirring every ten minutes.When there is about 10 minutes left in the cooking, add the quinoa and water to a small saucepan. Bring the water to a boil, cover and reduce to simmer until the water has been absorbed and the quinoa is fluffy.While both the cauliflower and quinoa are still hot, transfer them to a large mixing bowl.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the tamari, vinegar and ginger. Stir vigorously, almost squishing the mixture together, until it becomes sticky.When ready to assemble the sushi, place one nori sheet onto a flat surface.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 10116124, u'name': u'tamari'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}]}, {u'equipment': [], u'step': u'Add  cup of the rice mixture to the sheet and spread it onto the sheet, leaving about " space at the end farthest from you.Lay the the veggies down first, then top with sliced avocado. Lift the edge of the nori (or mat if using) that is closest to you with your thumbs, holding the filling ingredients in place with your middle fingers.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}]}, {u'equipment': [], u'step': u'Roll the nori over the ingredients, pulling back and tightening it after each rollover. Wet the uncovered edge and roll through. Gently squeeze the sushi roll (or rolled mat) to secure all the ingredients.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place the rolls in the fridge while you assemble the rest of your sushi.When ready to serve, remove them from the fridge and slice each roll into 8 pieces, using a sharp, wet knife.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with gluten-free soy sauce and red pepper flakes.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 19, u'instructions': u'Preheat the oven to 425F. Line a baking sheet with parchment paper and set it aside.Remove the stem from the cauliflower, then chop it into florets. In batches, add the florets to a food processor and process until a "rice" texture is formed. Transfer the cauliflower rice to the baking sheet and repeat with the remaining florets.Drizzle the rice with 1 tablespoon of olive oil, then roast in the oven for about 30 minutes, stirring every ten minutes.When there is about 10 minutes left in the cooking, add the quinoa and water to a small saucepan. Bring the water to a boil, cover and reduce to simmer until the water has been absorbed and the quinoa is fluffy.While both the cauliflower and quinoa are still hot, transfer them to a large mixing bowl. Add the tamari, vinegar and ginger. Stir vigorously, almost squishing the mixture together, until it becomes sticky.When ready to assemble the sushi, place one nori sheet onto a flat surface. Add  cup of the rice mixture to the sheet and spread it onto the sheet, leaving about " space at the end farthest from you.Lay the the veggies down first, then top with sliced avocado. Lift the edge of the nori (or mat if using) that is closest to you with your thumbs, holding the filling ingredients in place with your middle fingers.Roll the nori over the ingredients, pulling back and tightening it after each rollover. Wet the uncovered edge and roll through. Gently squeeze the sushi roll (or rolled mat) to secure all the ingredients.Place the rolls in the fridge while you assemble the rest of your sushi.When ready to serve, remove them from the fridge and slice each roll into 8 pieces, using a sharp, wet knife.Serve with gluten-free soy sauce and red pepper flakes.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetable-cauliflower-rice-+-quinoa-sushi-793084', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}