{u'recipes': [{u'sourceName': u'Dinners Dishes and Desserts', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/490039-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 490039, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chili Lime Spiced Almonds', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 5, u'pricePerServing': 95.71, u'creditText': u'Dinners Dishes and Desserts', u'extendedIngredients': [{u'originalString': u'3 cups almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cups'}, {u'originalString': u'\xbd tsp cayenne', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2031, u'unit': u'tsp'}, {u'originalString': u'2 Tbs chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tbs'}, {u'originalString': u'\xbc cup lime juice (about 2 limes)', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'( 2 limes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'2 Tbs olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'Tbs'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://dinnersdishesanddesserts.com/chili-lime-spiced-almonds/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spread Almonds on a large baking sheet.In a small bowl mix together everything but the almonds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Pour mixture over the nuts, and stir evenly to coat. Make sure the nuts are in a single layer on the baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 15-20 minutes. Cool completely, then store in an air tight container.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. One wine you could try is Campo Viejo Cava Brut ros\xe9. It has 4.4 out of 5 stars and a bottle costs about 12 dollars.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'A bright sparkling pink color. Pleasant and powerful on the nose with a strong presence of ripe red berries.With has a rounded, pleasant feel in the mouth. View More', u'title': u'Campo Viejo Cava Brut Rose', u'price': u'$11.99', u'id': 468840, u'link': u'https://www.wine.com/product/campo-viejo-cava-brut-rose/132863', u'imageUrl': u'https://spoonacular.com/productImages/468840-312x231.jpg'}]}, u'aggregateLikes': 384, u'instructions': u'Preheat oven to 350 degrees. Spread Almonds on a large baking sheet.In a small bowl mix together everything but the almonds. Pour mixture over the nuts, and stir evenly to coat. Make sure the nuts are in a single layer on the baking sheet. Bake for 15-20 minutes. Cool completely, then store in an air tight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/chili-lime-spiced-almonds-490039', u'dishTypes': [u'soup'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}