{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/742343-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 742343, u'veryPopular': True, u'lowFodmap': False, u'title': u'French Onion Tart', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 101.75, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/3 cup good quality beef stock', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 6170, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 sheet frozen puff pastry, thawed in refrigerator', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheet'}, {u'originalString': u'4 thyme sprigs, plus more for garnish', u'aisle': u'Produce', u'name': u'thyme sprigs', u'metaInformation': [u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'3 large Vidalia onions or other sweet variety, thinly sliced', u'aisle': u'Produce', u'name': u'vidalia onions', u'metaInformation': [u'sweet', u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpeg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/claire-robinson/french-onion-tart-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F. Line a baking sheet with parchment paper.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'On a work surface, roll the puff pastry into a roughly 10 by 16-inch rectangle. With a sharp knife, trim uneven edges to make a perfect rectangle. Evenly cut off the outer 1 inch of each side of the rectangle in strips; put the puff sheet on the baking sheet. Dip your finger in water and run around the top edges of the rectangle and replace the removed strips of pastry along the edges of the sheet, pressing lightly to adhere. With a fork, pierce the interior of the tart shell to prevent rising; do not pierce the adhered edges.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [], u'step': u'Bake until the outer edges have puffed and are golden in color; about 15 minutes. Set aside.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tablespoons olive oil in a large skillet over medium-low heat.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onions and thyme sprigs and season well with salt and pepper, to taste. Cook, stirring occasionally, until the onions begin to brown.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the stock, a tablespoon at a time, as the pan gets dry, scraping and stirring the brown bits that are stuck to the bottom oft the pan. When the onions are caramelized to a dark golden color, remove from the heat and discard the leafless thyme sprigs (the leaves fall off while cooking).', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'When ready to serve, preheat the oven to 350 degrees F. Evenly spread the caramelized onions on the cooked pastry shell and heat in the oven until warmed through, 5 to 7 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven, to a cutting board and cut into wedges. Arrange on a serving platter and garnish each wedge with a sprig of fresh thyme.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}]}, {u'equipment': [], u'step': u'Serve immediately and enjoy!', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Onion Tart works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 735, u'instructions': u'Watch how to make this recipe.                    Preheat the oven to 400 degrees F. Line a baking sheet with parchment paper.                          On a work surface, roll the puff pastry into a roughly 10 by 16-inch rectangle. With a sharp knife, trim uneven edges to make a perfect rectangle. Evenly cut off the outer 1 inch of each side of the rectangle in strips; put the puff sheet on the baking sheet. Dip your finger in water and run around the top edges of the rectangle and replace the removed strips of pastry along the edges of the sheet, pressing lightly to adhere. With a fork, pierce the interior of the tart shell to prevent rising; do not pierce the adhered edges. Bake until the outer edges have puffed and are golden in color; about 15 minutes. Set aside.                          Heat 2 tablespoons olive oil in a large skillet over medium-low heat. Add onions and thyme sprigs and season well with salt and pepper, to taste. Cook, stirring occasionally, until the onions begin to brown. Add the stock, a tablespoon at a time, as the pan gets dry, scraping and stirring the brown bits that are stuck to the bottom oft the pan. When the onions are caramelized to a dark golden color, remove from the heat and discard the leafless thyme sprigs (the leaves fall off while cooking).                          When ready to serve, preheat the oven to 350 degrees F. Evenly spread the caramelized onions on the cooked pastry shell and heat in the oven until warmed through, 5 to 7 minutes. Remove from oven, to a cutting board and cut into wedges. Arrange on a serving platter and garnish each wedge with a sprig of fresh thyme. Serve immediately and enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/french-onion-tart-742343', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}