{u'recipes': [{u'sourceName': u'Smells Like Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/618940-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 618940, u'veryPopular': False, u'lowFodmap': False, u'title': u'Garlic Bread Spicy Meatball Parm Subs', u'diets': [], u'pricePerServing': 2083.69, u'creditText': u'Smells Like Home', u'extendedIngredients': [{u'originalString': u'2 tbsp chopped fresh parsley or basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'1 \xbd tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 cup marinara sauce', u'aisle': u'Pasta and Rice', u'name': u'marinara sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111549, u'unit': u'cup'}, {u'originalString': u'2 \xbd tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'8 oz provolone or mozzarella cheese (or a combination), shredded, divided', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'divided', u'(or a combination)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'oz'}, {u'originalString': u'4 6-inch sub, grinder, hero, or hoagie rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'8 spicy turkey meatballs (about 1 \xbd" in diameter), sliced into halves', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'sliced into halves', u'( 1 \xbd" in diameter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 5165, u'unit': u''}, {u'originalString': u'4 tbsp unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.smells-like-home.com/2014/10/garlic-bread-spicy-meatball-parm-subs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 150, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 475.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 475 F.  Slice the rolls open lengthwise, hollow out some of the bread if desired, spread the softened butter over each piece of bread, sprinkle the garlic powder and oregano over the bread, dividing relatively evenly between each piece, and top each with about 1 tablespoon of provolone.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Bake on a large baking sheet until the bread is nicely toasted the cheese is melted, about 5-7 minutes.  Turn the broiler on and move the rack to the second from the top position.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread a little marinara on the bottom half of each roll, top each with four meatball halves, layer on more marinara, and sprinkle with the remaining cheese.  Broil until the cheese is melted.  Sprinkle some parsley or basil over the cheese and top with the second half of the roll.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Serve while still hot.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 102, u'instructions': u'Preheat oven to 475 F.  Slice the rolls open lengthwise, hollow out some of the bread if desired, spread the softened butter over each piece of bread, sprinkle the garlic powder and oregano over the bread, dividing relatively evenly between each piece, and top each with about 1 tablespoon of provolone.  Bake on a large baking sheet until the bread is nicely toasted the cheese is melted, about 5-7 minutes.  Turn the broiler on and move the rack to the second from the top position.Spread a little marinara on the bottom half of each roll, top each with four meatball halves, layer on more marinara, and sprinkle with the remaining cheese.  Broil until the cheese is melted.  Sprinkle some parsley or basil over the cheese and top with the second half of the roll.  Serve while still hot.', u'spoonacularSourceUrl': u'https://spoonacular.com/garlic-bread-spicy-meatball-parm-subs-618940', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}