{u'recipes': [{u'sourceName': u'This Gal Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542553-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 542553, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Steak Fiesta Salad', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 620.32, u'creditText': u'This Gal Cooks', u'extendedIngredients': [{u'originalString': u'1/4 tsp allspice', u'aisle': u'Spices and Seasonings', u'name': u'allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'Black Beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 16015, u'unit': u'servings'}, {u'originalString': u'1 chipotle pepper in adobo sauce, seeded and chopped', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle pepper in adobo', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'1 tsp cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tsp'}, {u'originalString': u'Corn', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11168, u'unit': u'servings'}, {u'originalString': u'Crushed red pepper', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'servings'}, {u'originalString': u'1/4 tsp cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 tsp dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tsp'}, {u'originalString': u'2 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 tsp ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tbsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'Juice from 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'Lettuce, chopped', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11252, u'unit': u'servings'}, {u'originalString': u'Shredded Mexican Cheese', u'aisle': u'Cheese', u'name': u'mexican cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1251, u'unit': u'servings'}, {u'originalString': u'Dressing (I used Chipotle Ranch Dressing)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'slaw dressing', u'metaInformation': [u'(I used Chipotle Ranch Dressing)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 43016, u'unit': u'servings'}, {u'originalString': u'2 steaks (total of about 1lb. I used top round but would recommend a different cut as they were quite chewy - but hey, they were on sale!)', u'aisle': u'Meat', u'name': u'steaks', u'metaInformation': [u'(total of 1lb. I used top round but would recommend a different cut as they were quite chewy - but hey, they were on sale!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 23232, u'unit': u''}], u'healthScore': 63.0, u'imageType': u'png', u'spoonacularScore': 90.0, u'sourceUrl': u'http://www.thisgalcooks.com/2013/04/03/recipe-grilled-steak-fiesta-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the honey, chipotle in adobo, dijon mustard, lime juice, minced garlic, cumin, cilantro, allspice and pepper in a bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'canned chipotle chiles in adobo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the steaks to the bowl and generously coat with the marinade. Cover and let marinate for 30 minutes to 1 hour, tossing a few times during the marinate process.    Meanwhile, combine the corn and black beans. Season with desired amount of crushed red pepper.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11168, u'name': u'corn'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat your grill to medium heat and grill until your desired doneness is reached.    Slice the steak across the grain.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place lettuce in large serving bowls or plates and top with black bean/corn mixture, shredded cheese and sliced steak. Top with your desired dressing or enjoy plain.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'id': 11168, u'name': u'corn'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak can be paired with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. You could try Rombauer Merlot. Reviewers quite like it with a 4.8 out of 5 star rating and a price of about 26 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Enticing and lively red color; beautifully aromatic with black cherry and ripe plum. On the palate a purity of blackcurrant, cedar and mint flavors blend together seamlessly. Soft and supple, this wine has a medium-bodied mouth-feel with plush tannins that integrate with the generous finish.Our favorite pairings for this wine include chicken parmesan, cedar-planked salmon over wild rice, and mushroom pizza.  View More', u'title': u'Rombauer Merlot', u'price': u'$25.59', u'id': 447938, u'link': u'https://www.wine.com/product/rombauer-merlot-2008/116883', u'imageUrl': u'https://spoonacular.com/productImages/447938-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Whisk together the honey, chipotle in adobo, dijon mustard, lime juice, minced garlic, cumin, cilantro, allspice and pepper in a bowl.    Add the steaks to the bowl and generously coat with the marinade. Cover and let marinate for 30 minutes to 1 hour, tossing a few times during the marinate process.    Meanwhile, combine the corn and black beans. Season with desired amount of crushed red pepper.    Heat your grill to medium heat and grill until your desired doneness is reached.    Slice the steak across the grain.    Place lettuce in large serving bowls or plates and top with black bean/corn mixture, shredded cheese and sliced steak. Top with your desired dressing or enjoy plain.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-steak-fiesta-salad-542553', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}