{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/599480-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 599480, u'veryPopular': False, u'lowFodmap': False, u'title': u'Orange Cupcakes with Orange Cream Cheese Frosting', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 40, u'pricePerServing': 35.67, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u"2 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1 8-ounce package cold cream cheese, cut into chunks', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cold', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'2 teaspoons pure orange extract', u'aisle': u'Baking', u'name': u'orange extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 12511111, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons grated orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3 cups unbleached all-purpose flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10020081, u'unit': u'cups'}, {u'originalString': u'14 tablespoons unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 14.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://leitesculinaria.com/3085/recipes-orange-cupcakes-cream-cheese-frosting.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Make the cupcakes1. Put a rack in the center of the oven and preheat the oven to 350\xb0F (175\xb0C). Line 24 muffin cups with foil or paper cupcake liners.2.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together the flour, baking powder, and salt in a medium bowl.3. In a large bowl, beat the butter and sugar with an electric mixer on medium speed until light and fluffy, 2 to 3 minutes. Scrape down the sides of the bowl.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u'Add the eggs one at a time, beating well after each addition. Beat in the orange extract and zest. On low speed, beat in the flour in three additions, alternating with the milk in two additions and beating just until incorporated.4. Spoon the batter into the muffin cups, filling each cup about two-thirds full.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'id': 12511111, u'name': u'orange extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 17 to 19 minutes, or until a toothpick inserted in the center of a cupcake comes out clean.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let the cupcakes cool in the pans for 10 minutes, then carefully transfer them to a wire rack to cool completely. (The cupcakes can be baked up to 1 day ahead and stored in an airtight container at room temperature.)Make the frosting5. In a large bowl, beat the cream cheese and butter with an electric mixer on medium speed until light and creamy. Beat in the orange zest and extract. On low speed beat in the confectioners’ sugar in two additions, beating until smooth.6.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Spread the frosting generously over the cupcakes. Or, transfer the frosting to a pastry bag fitted with a large star tip and pipe a generous swirl of frosting onto each cupcake. (The frosted cupcakes can be stored in an airtight container in the refrigerator for up to 2 days; bring to room temperature before serving.)', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u'Make the cupcakes1. Put a rack in the center of the oven and preheat the oven to 350\xb0F (175\xb0C). Line 24 muffin cups with foil or paper cupcake liners.2. Whisk together the flour, baking powder, and salt in a medium bowl.3. In a large bowl, beat the butter and sugar with an electric mixer on medium speed until light and fluffy, 2 to 3 minutes. Scrape down the sides of the bowl. Add the eggs one at a time, beating well after each addition. Beat in the orange extract and zest. On low speed, beat in the flour in three additions, alternating with the milk in two additions and beating just until incorporated.4. Spoon the batter into the muffin cups, filling each cup about two-thirds full. Bake for 17 to 19 minutes, or until a toothpick inserted in the center of a cupcake comes out clean. Let the cupcakes cool in the pans for 10 minutes, then carefully transfer them to a wire rack to cool completely. (The cupcakes can be baked up to 1 day ahead and stored in an airtight container at room temperature.)Make the frosting5. In a large bowl, beat the cream cheese and butter with an electric mixer on medium speed until light and creamy. Beat in the orange zest and extract. On low speed beat in the confectioners’ sugar in two additions, beating until smooth.6. Spread the frosting generously over the cupcakes. Or, transfer the frosting to a pastry bag fitted with a large star tip and pipe a generous swirl of frosting onto each cupcake. (The frosted cupcakes can be stored in an airtight container in the refrigerator for up to 2 days; bring to room temperature before serving.)', u'spoonacularSourceUrl': u'https://spoonacular.com/orange-cupcakes-with-orange-cream-cheese-frosting-599480', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}