{u'recipes': [{u'sourceName': u'Tidy Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/185105-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 185105, u'veryPopular': True, u'lowFodmap': False, u'title': u'Lemon-Blueberry Bread Pudding in a Jar', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 0, u'pricePerServing': 82.12, u'creditText': u'Tidy Mom', u'extendedIngredients': [{u'originalString': u'2 teaspoons agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'teaspoons'}, {u'originalString': u'1\xbd cups blueberries, fresh or frozen', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9050, u'unit': u'cups'}, {u'originalString': u'3 tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup cream cheese (or mascarpone cheese)', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'(or mascarpone cheese)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1017, u'unit': u'cup'}, {u'originalString': u'4 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbe cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'zest of 1 lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1 pound rustic artisan bread, crusts included (preferably stale)', u'aisle': u'Bakery/Bread', u'name': u'rustic bread', u'metaInformation': [u'stale', u'(preferably )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-bread.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10028033, u'unit': u'pound'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'3 cups whole milk (I used 2%)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'2%', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://tidymom.net/2012/lemon-blueberry-bread-pudding/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 350\xb0.  Grease twelve 8-ounce jars.  cut the bread into 1\xbd inch cubes, place in a large bowl, and set aside.In a large bowl, beat the eggs and mix in the sugar and cheese.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the milk, vanilla, lemon zest, and lemon juice and beat until evenly combined.  Stir in the melted butter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour the milk and egg mixture over the bread cubes and stir until all the pieces of bread are completely soaked.  Allow the bread to sit for 20 minutes.Stir the blueberries into the pudding mixture and immediately spoon into the jars, filling each only half full.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the jars on a large baking sheet 2 inches apart.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 30 to 35 minutes, until the tops of the puddings are evenly browned.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven, set on a clean, dry towel, and let rest 15-20 minutes.  Just before serving, pour the cream and agave nectar into a lidded jar and shake to combine.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Drizzle over the top of the bread puddings and serve.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1639, u'instructions': u'Heat oven to 350\xb0.  Grease twelve 8-ounce jars.  cut the bread into 1\xbd inch cubes, place in a large bowl, and set aside.In a large bowl, beat the eggs and mix in the sugar and cheese.  Add the milk, vanilla, lemon zest, and lemon juice and beat until evenly combined.  Stir in the melted butter.Pour the milk and egg mixture over the bread cubes and stir until all the pieces of bread are completely soaked.  Allow the bread to sit for 20 minutes.Stir the blueberries into the pudding mixture and immediately spoon into the jars, filling each only half full. Place the jars on a large baking sheet 2 inches apart.  Bake for 30 to 35 minutes, until the tops of the puddings are evenly browned.  Remove from the oven, set on a clean, dry towel, and let rest 15-20 minutes.  Just before serving, pour the cream and agave nectar into a lidded jar and shake to combine.  Drizzle over the top of the bread puddings and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-blueberry-bread-pudding-in-a-jar-185105', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}