{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/517122-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 517122, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beef and Bean Chili', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 284.06, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'3 whole bay leaves', u'aisle': u'Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'4 cups chicken or beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cups'}, {u'originalString': u'1 tablespoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tablespoon'}, {u'originalString': u'1 15-ounce can black beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounce'}, {u'originalString': u'1 15-ounce can kidney beans, rinsed and drained', u'aisle': u'Canned and Jarred', u'name': u'canned kidney beans', u'metaInformation': [u'rinsed', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16034, u'unit': u'ounce'}, {u'originalString': u'1 28-ounce can chopped tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1/4 cup chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2009, u'unit': u'cup'}, {u'originalString': u'2 teaspoons dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons extra- virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra-virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'4 medium cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 pounds ground sirloin', u'aisle': u'Meat', u'name': u'ground sirloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 10023567, u'unit': u'pounds'}, {u'originalString': u'4 small jalape\xf1o peppers, cored, seeded & minced finely', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'minced', u'cored', u'small', u'seeded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'2 large red bell peppers, cored, seeded & diced', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'diced', u'red', u'cored', u'large', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tablespoon'}, {u'originalString': u'2 large sweet onions, diced', u'aisle': u'Produce', u'name': u'sweet onions', u'metaInformation': [u'diced', u'sweet', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 6971, u'unit': u'cup'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.recipegirl.com/2006/09/18/beef-and-bean-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the olive oil in a large saucepan over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onions, reduce the heat to low and cook, stirring occasionally, until they have softened and become lightly browned (about 15 minutes).', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the bell peppers and jalapeos and cook, stirring occasionally, about 5 minutes longer.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}]}, {u'equipment': [], u'step': u'Add the garlic and cook, stirring constantly, for about 1 minute, being careful not to let it brown. Increase the heat to medium-high.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the ground sirloin, chili powder, basil, and cumin; cook until the beef is brown all over (5 to 7 minutes). Break the beef into small pieces as it cooks.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023567, u'name': u'ground sirloin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Drain off excess fat. Stir in the worcestershire sauce, tomatoes and their juices, tomato paste, broth, beans, bay leaves, salt, pepper and crushed red pepper; bring to a low boil. Reduce the heat to low; simmer for 45 to 1 hour so that the flavors meld and the liquid reduces a bit and thickens slightly.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve warm. Top with shredded cheese and sour cream, if desired.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 35, u'instructions': u'Heat the olive oil in a large saucepan over medium heat. Add the onions, reduce the heat to low and cook, stirring occasionally, until they have softened and become lightly browned (about 15 minutes). Add the bell peppers and jalapeos and cook, stirring occasionally, about 5 minutes longer. Add the garlic and cook, stirring constantly, for about 1 minute, being careful not to let it brown. Increase the heat to medium-high. Add the ground sirloin, chili powder, basil, and cumin; cook until the beef is brown all over (5 to 7 minutes). Break the beef into small pieces as it cooks. Drain off excess fat. Stir in the worcestershire sauce, tomatoes and their juices, tomato paste, broth, beans, bay leaves, salt, pepper and crushed red pepper; bring to a low boil. Reduce the heat to low; simmer for 45 to 1 hour so that the flavors meld and the liquid reduces a bit and thickens slightly. Serve warm. Top with shredded cheese and sour cream, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/beef-and-bean-chili-517122', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}