{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220975-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 570, u'id': 220975, u'veryPopular': True, u'lowFodmap': True, u'title': u'Slow cooker ribs', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 601.54, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 bottle barbecue sauce (350g approx)', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [u'(350g approx)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'bottle'}, {u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 tsp coriander seed', u'aisle': u'Spices and Seasonings', u'name': u'coriander seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2013, u'unit': u'tsp'}, {u'originalString': u'1 tsp mustard seed', u'aisle': u'Spices and Seasonings', u'name': u'mustard seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'tsp'}, {u'originalString': u'1 tsp peppercorn', u'aisle': u'Spices and Seasonings', u'name': u'peppercorn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'tsp'}, {u'originalString': u'1\xbd kg meaty pork ribs', u'aisle': u'Meat', u'name': u'pork ribs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-ribs.jpg', u'unitLong': u'kgs', u'unitShort': u'kg', u'amount': 1.5, u'consistency': u'solid', u'id': 10204, u'unit': u'kg'}, {u'originalString': u'2 pork stock cubes', u'aisle': u'Canned and Jarred', u'name': u'pork stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 6170, u'unit': u''}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2991682/slow-cooker-ribs', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Put 4 tbsp of barbecue sauce along with the rest of the ingredients into your slow cooker. Top up with enough water to cover (roughly 1.5l). Slow cook on Low for  8 - 9  hours until very tender but not completely falling off the bone.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat the oven to 220C/ 200C fan/ gas mark 7.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the ribs from the slow cooker using a slotted spoon or tongs. Handle them carefully as the meat will be very tender and may start to fall off. Baste with the remaining barbecue sauce and lay on a foil-lined oven tray. Cook for 20 – 30 mins until starting to crisp on outside. Alternatively, cook on the barbecue, turning from time to time until piping hot throughout.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 417, u'instructions': u'Put 4 tbsp of barbecue sauce along with the rest of the ingredients into your slow cooker. Top up with enough water to cover (roughly 1.5l). Slow cook on Low for  8 - 9  hours until very tender but not completely falling off the bone.  Heat the oven to 220C/ 200C fan/ gas mark 7. Remove the ribs from the slow cooker using a slotted spoon or tongs. Handle them carefully as the meat will be very tender and may start to fall off. Baste with the remaining barbecue sauce and lay on a foil-lined oven tray. Cook for 20 – 30 mins until starting to crisp on outside. Alternatively, cook on the barbecue, turning from time to time until piping hot throughout.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-ribs-220975', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 570, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}