{u'recipes': [{u'sourceName': u'Chocolate Covered Katie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/631193-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 631193, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Chip Zucchini Muffins', u'diets': [u'dairy free'], u'pricePerServing': 24.71, u'creditText': u'Chocolate Covered Katie', u'extendedIngredients': [{u'originalString': u'1 tsp white or apple cider vinegar (5g)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 5.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'g'}, {u'originalString': u'1/2 cup applesauce (120g)', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 120.0, u'consistency': u'solid', u'id': 9019, u'unit': u'g'}, {u'originalString': u'1/2 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'optional: 1/2 cup chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'optional: 1/2 tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/3 cup xylitol, or sugar, or evaporated cane juice (65g)', u'aisle': u'Health Foods;Baking', u'name': u'evaporated cane juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-cane-juice.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 65.0, u'consistency': u'solid', u'id': 93625, u'unit': u'g'}, {u'originalString': u"1 1/2 cups spelt or all-purpose or Bob's gf flour (180g)", u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 180.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'3/4 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1/16 tsp pure stevia, or 2 tbsp more sugar', u'aisle': u'Baking', u'name': u'stevia', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.0625, u'consistency': u'solid', u'id': 93628, u'unit': u'tsp'}, {u'originalString': u'1 1/2 tsp pure vanilla extract (6g)', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 6.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'g'}, {u'originalString': u'1 cup grated zucchini', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u'cup'}, {u'originalString': u"1/3 cup coconut or veg oil (Replace with more applesauce only if you don't mind the gummy texture of fat-free baked goods.) (70g)", u'aisle': u'?', u'name': u'veg oil', u'metaInformation': [u'fat-free', u"with more applesauce only if you don't mind the gummy texture of  baked goods.) (70g)"], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://chocolatecoveredkatie.com/2013/04/25/chocolate-chip-zucchini-bread-muffins/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Zucchini Muffins Recipe: Preheat oven to 350F and place 10-12 cupcake liners in a muffin tin.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Combine all dry ingredients in a mixing bowl, then set aside. In a large measuring cup, combine all liquid ingredients (including zucchini).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Mix wet into dry, and immediately portion into the baking cups and place in the oven.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 19 minutes, then allow the zucchini muffins to cool before removing from the tray. These vegan zucchini muffins are soy-free and can also be gluten-free and sugar-free.View Zucchini Muffins Nutrition Facts', u'length': {u'number': 19, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 3002, u'instructions': u'Zucchini Muffins Recipe: Preheat oven to 350F and place 10-12 cupcake liners in a muffin tin. Combine all dry ingredients in a mixing bowl, then set aside. In a large measuring cup, combine all liquid ingredients (including zucchini). Mix wet into dry, and immediately portion into the baking cups and place in the oven. Bake 19 minutes, then allow the zucchini muffins to cool before removing from the tray. These vegan zucchini muffins are soy-free and can also be gluten-free and sugar-free.View Zucchini Muffins Nutrition Facts', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-chip-zucchini-muffins-631193', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}