{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/792566-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 792566, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Cheesecake Pudding Dessert', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 45.2, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, 1 stick', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 8 ounce package cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'2 cups crushed graham crackers, about 15 crackers, plus more for garnish', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [u'crushed', u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 18617, u'unit': u'cups'}, {u'originalString': u'2 3.4 ounce boxes instant chocolate pudding mix', u'aisle': u'Baking', u'name': u'instant chocolate pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.8, u'consistency': u'solid', u'id': 19184, u'unit': u'ounce'}, {u'originalString': u'3 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'1 8-ounce container whipped topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounce'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.foodfanatic.com/2016/07/chocolate-cheesecake-pudding-dessert/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Crush the graham crackers in a resealable bag with a rolling pin, or in a food processor, if not already crushed.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Transfer to a medium mixing bowl and set aside.In a small microwave safe dish, melt the butter and sugar together. Stir to dissolve completely.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour over the graham cracker crumbs and combine thoroughly. Firmly press the crumbs into a 13x9-inch pan.In a stand mixer or with a hand-held blender, beat the cream cheese, pudding mix, and milk until well combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour onto prepared crust and smooth into an even layer.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the whipped topping in an even layer and garnish with additional graham cracker crumbs. Refrigerate for at least 4 hours or until set.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6, u'instructions': u'Crush the graham crackers in a resealable bag with a rolling pin, or in a food processor, if not already crushed. Transfer to a medium mixing bowl and set aside.In a small microwave safe dish, melt the butter and sugar together. Stir to dissolve completely. Pour over the graham cracker crumbs and combine thoroughly. Firmly press the crumbs into a 13x9-inch pan.In a stand mixer or with a hand-held blender, beat the cream cheese, pudding mix, and milk until well combined. Pour onto prepared crust and smooth into an even layer.Add the whipped topping in an even layer and garnish with additional graham cracker crumbs. Refrigerate for at least 4 hours or until set.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-cheesecake-pudding-dessert-792566', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}