{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/759144-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 759144, u'veryPopular': True, u'lowFodmap': False, u'title': u'Fresh Berry Tart with Toasted Nut Crust', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 84.36, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbc cup each almonds, pecans, and hazelnuts', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1 cup blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'6 Tbs. chilled unsalted butter, diced', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'diced', u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbs'}, {u'originalString': u'1 large egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 Tbs. light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'Tbs'}, {u'originalString': u'\xbd cup nonfat plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1001256, u'unit': u'cup'}, {u'originalString': u'1 Tbs. orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 9206, u'unit': u'Tbs'}, {u'originalString': u'\xbc tsp. grated orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 9216, u'unit': u'tsp'}, {u'originalString': u'1 cup raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbd cup light sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'light', u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'\xbc cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'\xbe cup whole-wheat flour', u'aisle': u'Baking', u'name': u'whole-wheat flour', u'metaInformation': [u'whole-wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20080, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/fresh-berry-tart-with-toasted-nut-crust/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To make Crust: Preheat oven to 350\xb0F. Coat 9-inch tart pan with cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread nuts on baking sheet, and toast in oven 12 to 15 minutes, or until browned.2. Pulse nuts, flour, sugar, and salt in food processor until nuts are ground to powder.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add butter, and pulse until mixture resembles coarse meal.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add egg yolk, and pulse until moist clumps form. Press dough into bottom and sides of prepared pan, about 1/4-inch thick, and pierce with fork. Freeze 30 minutes.3. Adjust oven temperature to 400\xb0F.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bake Crust 12 to 14 minutes, or until golden. Cool.4. To make Filling: whisk together sour cream, yogurt, brown sugar, vanilla, and orange zest in small bowl. Toss berries with orange juice in separate bowl. 5.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Spread sour cream mixture in Crust with spatula. Spoon berries over top a little at a time, until sour cream mixture is evenly covered. Refrigerate 30 to 60 minutes before serving.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}], u'name': u''}], u'aggregateLikes': 489, u'instructions': u'1. To make Crust: Preheat oven to 350\xb0F. Coat 9-inch tart pan with cooking spray. Spread nuts on baking sheet, and toast in oven 12 to 15 minutes, or until browned.2. Pulse nuts, flour, sugar, and salt in food processor until nuts are ground to powder. Add butter, and pulse until mixture resembles coarse meal. Add egg yolk, and pulse until moist clumps form. Press dough into bottom and sides of prepared pan, about 1/4-inch thick, and pierce with fork. Freeze 30 minutes.3. Adjust oven temperature to 400\xb0F. Bake Crust 12 to 14 minutes, or until golden. Cool.4. To make Filling: whisk together sour cream, yogurt, brown sugar, vanilla, and orange zest in small bowl. Toss berries with orange juice in separate bowl. 5. Spread sour cream mixture in Crust with spatula. Spoon berries over top a little at a time, until sour cream mixture is evenly covered. Refrigerate 30 to 60 minutes before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/fresh-berry-tart-with-toasted-nut-crust-759144', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}