{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [u'asian', u'vietnames'], u'image': u'https://spoonacular.com/recipeImages/536691-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 536691, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rainbow Spring Rolls', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 44.17, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'1 avocado, sliced thin', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 teaspoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'teaspoon'}, {u'originalString': u'2 carrots, grated', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1/2 teaspoon Sriracha chili sauce', u'aisle': u'Ethnic Foods', u'name': u'chili sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 6972, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10116098, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 tablespoon Hoisin sauce', u'aisle': u'Ethnic Foods', u'name': u'hoisin sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6175, u'unit': u'tablespoon'}, {u'originalString': u'1/2 small purple cabbage, sliced thin', u'aisle': u'Produce', u'name': u'purple cabbage', u'metaInformation': [u'small', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11112, u'unit': u''}, {u'originalString': u'1 red pepper, sliced thin', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/4-1/2 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Rice paper wrappers', u'aisle': u'Ethnic Foods', u'name': u'rice paper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 10118368, u'unit': u'servings'}, {u'originalString': u'1 teaspoon sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 yellow pepper, sliced thin', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 54.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.macheesmo.com/2013/06/rainbow-spring-rolls/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Let it sit for 5-10 seconds and flip it. Once it has loosened, but isn't completely soggy, move it to a clean surface.4)", u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u"Add veggies in any order you like to one half of the wrapper. Leave about an inch around the edges to make rolling easier.5) Tuck the sides of the wrapper over and start rolling it away from you. As you roll, keep tension on the wrapper so the roll stays nice and tight. Once your roll is done, slice it in half and put it on a plate. If you mess one up, don't worry about it. Just start over.", u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the rolls with the spicy peanut sauce which is good warm or at room temperature.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are great choices for Spring Rolls. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 660, u'instructions': u"Directions1) For peanut sauce, combine all ingredients in a small saucepan over medium heat. Bring to a simmer and stir until mixture thickens and is a single consistency. If the sauce is very thick, add more water. If it's too thin, let it cook down a bit more.2) Wash all the veggies and slice then very thin. For the carrots, use a grater to shred them or just buy shredded carrots. For the cabbage, buy a small one and cut it into quarters, then cut out the center stem and slice it into thin strips.3) To make a roll, get a plate of warm water ready and add a single wrapper to the plate. Let it sit for 5-10 seconds and flip it. Once it has loosened, but isn't completely soggy, move it to a clean surface.4) Add veggies in any order you like to one half of the wrapper. Leave about an inch around the edges to make rolling easier.5) Tuck the sides of the wrapper over and start rolling it away from you. As you roll, keep tension on the wrapper so the roll stays nice and tight. Once your roll is done, slice it in half and put it on a plate. If you mess one up, don't worry about it. Just start over.Serve the rolls with the spicy peanut sauce which is good warm or at room temperature.", u'spoonacularSourceUrl': u'https://spoonacular.com/rainbow-spring-rolls-536691', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [u'spring', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}