{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/459633-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 459633, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Raspberry Cheesecake', u'diets': [], u'pricePerServing': 99.79, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 (14 ounce) can EAGLE BRAND\xae Sweetened Condensed Milk (NOT evaporated milk)', u'aisle': u'Baking', u'name': u'condensed milk', u'metaInformation': [u'sweetened', u'canned', u'(NOT evaporated milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounce'}, {u'originalString': u'2 (3 ounce) packages cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 (6 ounce) packaged graham cracker pie crust', u'aisle': u'Baking', u'name': u'graham cracker pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust-graham-cracker.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 18942, u'unit': u'ounce'}, {u'originalString': u'3 tablespoons lemon juice from concentrate', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1 cup fresh or frozen raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'2 (1 ounce) squares semisweet chocolate', u'aisle': u'Sweet Snacks', u'name': u'semisweet chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19903, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Chocolate-Raspberry-Cheesecake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven at 350 degrees F. With mixer, beat cream cheese until fluffy. Gradually beat in Eagle Brand\xae until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add egg, lemon juice, and vanilla; mix well.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Arrange raspberries on bottom of crust. Slowly pour cheese mixture over fruit.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}, {u'equipment': [], u'step': u'Bake 30 to 35 minutes or until center is almost set. Cool', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Chocolate Glaze: In small saucepan, over low heat, melt semi-sweet chocolate with whipping cream. Cook and stir until thickened and smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'id': 19903, u'name': u'semisweet chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}]}, {u'equipment': [], u'step': u'Remove from heat. Top cheesecake with Chocolate Glaze; chill.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish as desired.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 25, u'instructions': u'Heat oven at 350 degrees F. With mixer, beat cream cheese until fluffy. Gradually beat in Eagle Brand\xae until smooth. Add egg, lemon juice, and vanilla; mix well.                            Arrange raspberries on bottom of crust. Slowly pour cheese mixture over fruit.                            Bake 30 to 35 minutes or until center is almost set. Cool                            Chocolate Glaze: In small saucepan, over low heat, melt semi-sweet chocolate with whipping cream. Cook and stir until thickened and smooth. Remove from heat. Top cheesecake with Chocolate Glaze; chill. Garnish as desired.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-raspberry-cheesecake-459633', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}