{u'recipes': [{u'sourceName': u'Chocolate Moosey', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/554414-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 554414, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry Shortcake Cupcakes', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 63.33, u'creditText': u'Chocolate Moosey', u'extendedIngredients': [{u'originalString': u'3/4 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1/3 cup strawberry curd or jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'lime curd', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 98902, u'unit': u'cup'}, {u'originalString': u'1/4 cup butter, melted and cooled slightly', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3/4 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/3 cup heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/4 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 Tbsp powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'Tbsp'}, {u'originalString': u'1/8 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'6 small strawberries, for garnish', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'small', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 24.0, u'sourceUrl': u'http://www.chocolatemoosey.com/2012/06/06/strawberry-shortcake-cupcakes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the cupcakes: Preheat the oven to 350F. Prepare a cupcake pan for 6 cupcakes. In a small bowl, whisk together the flour, baking powder, and salt.In a large bowl, whisk together the sugar, butter, egg and vanilla until smooth. Alternately whisk in the flour mixture and milk, making three additions of flour and two additions of milk. Beat until smooth.Scoop batter into prepared pan and bake for 20 minutes or until golden brown and tops of cupcakes spring back when lightly touched.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let cool in pan for 10 minutes before removing.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Cut each cupcake in half horizontally. For each cupcake, spoon and spread some of the curd/jam onto one half. Spoon and spread some of the whipped cream. Top with the remaining cupcake half. Spoon and spread some more curd/jam on the top half then top with some more whipped cream. Repeat with the remaining cupcakes.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with a strawberry. Chill until ready to serve.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}], u'name': u'Let cool completely.For the whipped cream in a medium bowl, beat the heavy cream, sugar, and vanilla until stiff peaks form.To assemble'}], u'winePairing': {u'pairingText': u"Cupcakes can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 4558, u'instructions': u'For the cupcakes: Preheat the oven to 350F. Prepare a cupcake pan for 6 cupcakes. In a small bowl, whisk together the flour, baking powder, and salt.In a large bowl, whisk together the sugar, butter, egg and vanilla until smooth. Alternately whisk in the flour mixture and milk, making three additions of flour and two additions of milk. Beat until smooth.Scoop batter into prepared pan and bake for 20 minutes or until golden brown and tops of cupcakes spring back when lightly touched. Let cool in pan for 10 minutes before removing. Let cool completely.For the whipped cream: in a medium bowl, beat the heavy cream, sugar, and vanilla until stiff peaks form.To assemble: Cut each cupcake in half horizontally. For each cupcake, spoon and spread some of the curd/jam onto one half. Spoon and spread some of the whipped cream. Top with the remaining cupcake half. Spoon and spread some more curd/jam on the top half then top with some more whipped cream. Repeat with the remaining cupcakes. Garnish with a strawberry. Chill until ready to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-shortcake-cupcakes-554414', u'dishTypes': [u'dessert'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}