{u'recipes': [{u'sourceName': u'The Culinary Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/574694-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 574694, u'veryPopular': True, u'lowFodmap': False, u'title': u'It’s Five O’clock Somewhere: The Perfect Chocolate Martini', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 33.96, u'creditText': u'The Culinary Life', u'extendedIngredients': [{u'originalString': u'1 chocolate garnish', u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19081, u'unit': u''}, {u'originalString': u'1 30ml chocolate syrup', u'aisle': u'Frozen;Baking;Condiments', u'name': u'chocolate syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-syrup.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'solid', u'id': 14181, u'unit': u'ml'}, {u'originalString': u'1 30ml half ‘n half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'consistency': u'solid', u'id': 1049, u'unit': u'ml'}, {u'originalString': u'1.5 parts vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.5, u'consistency': u'liquid', u'id': 14051, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.theculinarylife.com/2010/perfect-chocolate-martini-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Place your glass and shaker in the freezer for at least ten minutes for the coldest possible drink.Fill your shaker at least one third full with fresh ice.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}], u'step': u'Add the liquid ingredients to the shaker in the order listed above. If you use a measuring cup, add the chocolate syrup last. You can measure it by displacement.Shake vigorously.Strain into your chilled cocktail glass, garnish with your toothpicked chocolate, and serve immediately.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-syrup.jpg', u'id': 14181, u'name': u'chocolate syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 422, u'instructions': u'Place your glass and shaker in the freezer for at least ten minutes for the coldest possible drink.Fill your shaker at least one third full with fresh ice. Add the liquid ingredients to the shaker in the order listed above. If you use a measuring cup, add the chocolate syrup last. You can measure it by displacement.Shake vigorously.Strain into your chilled cocktail glass, garnish with your toothpicked chocolate, and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/its-five-oclock-somewhere-the-perfect-chocolate-martini-574694', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}