{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/697126-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 697126, u'veryPopular': False, u'lowFodmap': False, u'title': u'Curried Butternut Squash Bisque', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 109.65, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1 cup apple cider', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009016, u'unit': u'cup'}, {u'originalString': u'2 pounds butternut squash, peeled, seeded and cubed (about 6 cups)', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'cubed', u'peeled', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'2 teaspoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon curry powder', u'aisle': u'Spices and Seasonings', u'name': u'curry powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/curry-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2015, u'unit': u'tablespoon'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'6 cups reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'2 tablespoons nonfat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'tablespoons'}, {u'originalString': u'2 onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Freshly ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 cup nonfat plain yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain nonfat yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1118, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup white rice', u'aisle': u'Pasta and Rice', u'name': u'white rice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/curried_butternut_squash_bisque.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat oil in a Dutch oven or heavy soup pot over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add onions and garlic; cook, stirring, until slightly softened, 2 to 3 minutes. Stir in curry and cumin and cook for 1 minute.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [], u'step': u'Add broth, cider, rice and squash; bring to a boil. Reduce heat to low, cover and simmer until the squash is tender, 30 to 40 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the mixture through a strainer set over a large bowl. Puree the solids in a food processor or blender until very smooth. (Use caution when pureeing hot liquids.) Return the puree and liquid to the pot.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Heat the soup gently and season with salt and pepper.To serve, stir yogurt and milk in a small bowl. Ladle the soup into bowls and add a dollop of the yogurt mixture. Draw the tip of a knife or a toothpick through the yogurt to make decorative swirls.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'aggregateLikes': 81, u'instructions': u'Heat oil in a Dutch oven or heavy soup pot over medium heat. Add onions and garlic; cook, stirring, until slightly softened, 2 to 3 minutes. Stir in curry and cumin and cook for 1 minute. Add broth, cider, rice and squash; bring to a boil. Reduce heat to low, cover and simmer until the squash is tender, 30 to 40 minutes.Pour the mixture through a strainer set over a large bowl. Puree the solids in a food processor or blender until very smooth. (Use caution when pureeing hot liquids.) Return the puree and liquid to the pot. Heat the soup gently and season with salt and pepper.To serve, stir yogurt and milk in a small bowl. Ladle the soup into bowls and add a dollop of the yogurt mixture. Draw the tip of a knife or a toothpick through the yogurt to make decorative swirls.', u'spoonacularSourceUrl': u'https://spoonacular.com/curried-butternut-squash-bisque-697126', u'dishTypes': [u'soup'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}