{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/377148-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 377148, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tex-Mex Tomato Soup and Grilled Cheese', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 40, u'pricePerServing': 286.57, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter, plus some butter at room temperature for the sandwiches', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for the sandwiches', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 32-ounce can San Marzano tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 chipotle pepper in adobo, seeded and chopped, plus 1 round tablespoon adobo sauce', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle pepper in adobo', u'metaInformation': [u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'1/4 cup chives, finely chopped, to garnish', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11156, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fresh thyme leaves, chopped', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoons'}, {u'originalString': u'4 cloves garlic, sliced or chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'8 slices pepper Jack cheese', u'aisle': u'Cheese', u'name': u'pepper jack cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1025, u'unit': u'slices'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/3 to 1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'3 cups chicken or vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'8 slices white or whole wheat bread', u'aisle': u'Bakery/Bread', u'name': u'white bread', u'metaInformation': [u'whole wheat', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slices'}], u'healthScore': 19.0, u'imageType': u'jpeg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/rachael-ray/tex-mex-tomato-soup-and-grilled-cheese.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat a griddle pan for the grilled cheese over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a medium soup pot over medium-high heat, add the olive oil and melt 2 tablespoons butter into the oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the garlic, onions, chipotle, adobo sauce and some salt and pepper. Partially cover the pot and cook to soften, 10 minutes or so. Stir in the tomato paste and cook until fragrant, 2 minutes, then deglaze the pan with 2 cups of the chicken stock and transfer to a food processor.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the tomatoes and process until smooth.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the soup back into pot and add the remainder of stock. Simmer at a low bubble while you make the grilled cheese.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Lightly butter 1 side of the bread slices. Make the cheese sandwiches with, and grill until crispy and the cheese melts.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Stir the sour cream into the tomato soup and serve in shallow bowls with chives to garnish, and grilled cheese on the side for dipping.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 95, u'instructions': u'Preheat a griddle pan for the grilled cheese over medium heat.                          Heat a medium soup pot over medium-high heat, add the olive oil and melt 2 tablespoons butter into the oil. Add the garlic, onions, chipotle, adobo sauce and some salt and pepper. Partially cover the pot and cook to soften, 10 minutes or so. Stir in the tomato paste and cook until fragrant, 2 minutes, then deglaze the pan with 2 cups of the chicken stock and transfer to a food processor. Add the tomatoes and process until smooth. Pour the soup back into pot and add the remainder of stock. Simmer at a low bubble while you make the grilled cheese.                          Lightly butter 1 side of the bread slices. Make the cheese sandwiches with, and grill until crispy and the cheese melts.                          Stir the sour cream into the tomato soup and serve in shallow bowls with chives to garnish, and grilled cheese on the side for dipping.', u'spoonacularSourceUrl': u'https://spoonacular.com/tex-mex-tomato-soup-and-grilled-cheese-377148', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u"father's day", u'winter', u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}