{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/751865-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 751865, u'veryPopular': False, u'lowFodmap': False, u'title': u'Road Trip Sandwiches', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 122.4, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 slices Cheddar', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1009, u'unit': u'slices'}, {u'originalString': u'2 tablespoons chopped chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup whipped cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1017, u'unit': u'cup'}, {u'originalString': u'6 ounces thinly sliced deli ham', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10010151, u'unit': u'ounces'}, {u'originalString': u'1/2 English cucumber, thinly sliced', u'aisle': u'Produce', u'name': u'english cucumber', u'metaInformation': [u'english', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10111205, u'unit': u''}, {u'originalString': u'2 1/2 tablespoons minced fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 2045, u'unit': u'tablespoons'}, {u'originalString': u'Zest and juice of 1/2 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'6 ounces thinly sliced roast beef', u'aisle': u'Meat', u'name': u'roast beef', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roast-beef-slices.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'liquid', u'id': 93713, u'unit': u'ounces'}, {u'originalString': u'1 stick (8 tablespoons) unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'8 thin slices white bread, such as Pepperidge Farm', u'aisle': u'Bakery/Bread', u'name': u'white bread', u'metaInformation': [u'white', u' such as pepperidge farm', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slices'}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/daphne-brogdon/road-trip-sandwiches.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Combine the cream cheese, chives and lemon zest and juice in a medium mixing bowl. Season with salt and pepper, mixing together to blend.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}, {u'equipment': [], u'step': u'Spread 1 tablespoon of the chive cream cheese onto each slice of bread. Top 4 of the bread slices with a thin layer of cucumber, 2 slices of roast beef and another slice of bread (making 4 sandwiches).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roast-beef-slices.jpg', u'id': 93713, u'name': u'roast beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u'For the roast beef with cucumber and chive cream cheese'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Combine the butter and dill in a medium mixing bowl. Season with salt and pepper, mixing together to blend.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}]}, {u'equipment': [], u'step': u'Spread 1 tablespoon of the dill butter onto each slice of bread. Top 4 of the bread slices with 2 slices of ham, 1 slice of cheese and another slice of bread (making 4 sandwiches).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}], u'name': u'For the ham and cheddar with dill butter'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 325, u'instructions': u'For the roast beef with cucumber and chive cream cheese: Combine the cream cheese, chives and lemon zest and juice in a medium mixing bowl. Season with salt and pepper, mixing together to blend.                          Spread 1 tablespoon of the chive cream cheese onto each slice of bread. Top 4 of the bread slices with a thin layer of cucumber, 2 slices of roast beef and another slice of bread (making 4 sandwiches).                          For the ham and cheddar with dill butter: Combine the butter and dill in a medium mixing bowl. Season with salt and pepper, mixing together to blend.                          Spread 1 tablespoon of the dill butter onto each slice of bread. Top 4 of the bread slices with 2 slices of ham, 1 slice of cheese and another slice of bread (making 4 sandwiches).', u'spoonacularSourceUrl': u'https://spoonacular.com/road-trip-sandwiches-751865', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}