{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/599577-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 599577, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Sweet and Sour Chicken you can make at home, save the calories, but don’t sacrifice any flavor', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 46.37, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 Chicken, cut up into serving pieces', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1025006, u'unit': u''}, {u'originalString': u'1 chicken Bouillon Cube', u'aisle': u'Canned and Jarred', u'name': u'chicken bouillon cube', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-cube-isolated.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 6080, u'unit': u''}, {u'originalString': u'3/4 cup Cider Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'1 tablespoon Cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon Ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'1 large Green Pepper, cut into strips', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'large', u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 (13 1/2 ounce) can Pineapple Chunks', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.5, u'consistency': u'liquid', u'id': 1029354, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon Soy Sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}, {u'originalString': u'Sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}, {u'originalString': u'1 cup Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.copykat.com/2009/05/06/sweet-and-sour-chicken/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash chicken dry, and coat with flour.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Heat oil and brown the chicken. Sprinkle with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Drain pineapple and add enough water to the drained liquid to make 1 1/4 cups.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mix sauce ingredients and boil for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Pour this over the chicken.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Add pineapple and green pepper.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}]}, {u'equipment': [], u'step': u'Bake until tender, about 30 to 40 minutes at 350 degrees.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sweet and Sour Chicken works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Tanian et Vincent Careme Terre Brulee Chenin Blanc with a 4.1 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Terre Brulee Chenin Blanc is a decadent Chenin for any occasion. This luxurious bottling offers notes of honeysuckle and citrus which are balanced by a bright, seamless acidity. Made with 100% Chenin Blanc.', u'title': u'Tania et Vincent Careme Terre Brulee Chenin Blanc', u'price': u'$15.99', u'id': 455542, u'link': u'https://www.wine.com/product/tania-et-vincent-careme-terre-brulee-chenin-blanc-2015/155207', u'imageUrl': u'https://spoonacular.com/productImages/455542-312x231.jpg'}]}, u'aggregateLikes': 167, u'instructions': u'Wash chicken dry, and coat with flour. Heat oil and brown the chicken. Sprinkle with salt and pepper. Drain pineapple and add enough water to the drained liquid to make 1 1/4 cups. Mix sauce ingredients and boil for 2 minutes. Pour this over the chicken. Add pineapple and green pepper. Bake until tender, about 30 to 40 minutes at 350 degrees.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-sweet-and-sour-chicken-you-can-make-at-home-save-the-calories-but-dont-sacrifice-any-flavor-599577', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}