{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/758145-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758145, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pineapple-Blueberry Pizza', u'diets': [u'dairy free'], u'pricePerServing': 150.54, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'\xbe cup fresh blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u"\xbc cup confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'6 oz. light cream cheese or silken firm or extra-firm tofu, drained', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [u'light', u'firm', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10016162, u'unit': u'oz'}, {u'originalString': u'2 tsp. canola or grapeseed oil for brushing pineapple', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [u'for brushing pineapple'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. grated orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9216, u'unit': u'tsp'}, {u'originalString': u'\xbd fresh peeled and cored pineapple, sliced into rounds', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'fresh', u'cored', u'peeled', u'sliced into rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9266, u'unit': u''}, {u'originalString': u'1 Par-Baked Pizza Crust', u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93770, u'unit': u''}, {u'originalString': u'\xbc cup chopped unsalted pistachios', u'aisle': u'Nuts;Savory Snacks', u'name': u'unsalted pistachios', u'metaInformation': [u'unsalted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12152, u'unit': u'cup'}, {u'originalString': u'1 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/pineapple-blueberry-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Blend cream cheese and confectioners’ sugar in food processor 3 minutes, or until smooth.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add vanilla and orange zest, and pulse until combined.2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush grill grate well with oil, and preheat grill to medium.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush pineapple with oil, and grill 5 minutes on each side, or until both sides have grill marks. Cool until easy to handle, then slice each round into quarters.3.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [], u'step': u'Spread cream cheese mixture over crust, and top with pineapple, blueberries, and pistachios.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place pizza on grill, close lid, and grill 5 minutes, or until cream cheese is warmed through and crust is crispy.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 453, u'instructions': u'1. Blend cream cheese and confectioners’ sugar in food processor 3 minutes, or until smooth. Add vanilla and orange zest, and pulse until combined.2. Brush grill grate well with oil, and preheat grill to medium. Brush pineapple with oil, and grill 5 minutes on each side, or until both sides have grill marks. Cool until easy to handle, then slice each round into quarters.3. Spread cream cheese mixture over crust, and top with pineapple, blueberries, and pistachios. Place pizza on grill, close lid, and grill 5 minutes, or until cream cheese is warmed through and crust is crispy.', u'spoonacularSourceUrl': u'https://spoonacular.com/pineapple-blueberry-pizza-758145', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}