{u'recipes': [{u'sourceName': u'Cuopon Clipping Cook', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/479059-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479059, u'veryPopular': False, u'lowFodmap': False, u'title': u'BBQ Lime Chicken Salad', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 260.54, u'creditText': u'Cuopon Clipping Cook', u'extendedIngredients': [{u'originalString': u'\xbd cup shredded carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'\xbc cup kernels of corn', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11172, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'\xbd of a head of iceberg lettuce', u'aisle': u'Produce', u'name': u'iceberg lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11252, u'unit': u''}, {u'originalString': u'1 whole lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbc cup diced red bell pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'\xbd cup chopped red cabbage', u'aisle': u'Produce', u'name': u'red cabbage', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11112, u'unit': u'cup'}, {u'originalString': u'\xbc of a medium size red onion – sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium size', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'\xbc teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'2 boneless skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 \xbd teaspoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoons'}, {u'originalString': u'2 cups chopped fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'\xbd teaspoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoon'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.couponclippingcook.com/bbq-lime-chicken-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the Chicken:  In a medium size bowl, add the juice from the lime, and all of the other chicken marinade ingredients (except for the chicken).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the marinade ingredients together.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the chicken breasts in half. Then, just for the thickest half of the breasts, slice them in half lengthwise (as though you were going to butterfly the chicken only cut it all the way through).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Put the six pieces of chicken in the marinade.  Marinate the chicken for about 20 minutes.While the chicken is marinating, heat up the barbeque grill (or skillet if you prefer).  Grill the chicken for about 3 to 5 minutes on each side.  Discard the leftover marinade.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove the grilled chicken from the grill, put on a plate and cover it with foil.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let it rest while you’re making the salad.For the Salad:  Chop the lettuce and add it to each serving bowl or plate.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}]}, {u'equipment': [], u'step': u'Add the spinach and red cabbage.  Then, add the carrots, corn, red bell pepper, and onions.  Slice the chicken in a diagonal cut so that the pieces are about \xbd thick.  Lay the chicken on top of the salad ingredients and serve with your favorite dressing.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'id': 11112, u'name': u'red cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is CalNaturale Chardonnay Lodi. It has 4.1 out of 5 stars and a bottle costs about 11 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 189, u'instructions': u'For the Chicken:  In a medium size bowl, add the juice from the lime, and all of the other chicken marinade ingredients (except for the chicken).  Whisk the marinade ingredients together.  Cut the chicken breasts in half. Then, just for the thickest half of the breasts, slice them in half lengthwise (as though you were going to butterfly the chicken only cut it all the way through).  Put the six pieces of chicken in the marinade.  Marinate the chicken for about 20 minutes.While the chicken is marinating, heat up the barbeque grill (or skillet if you prefer).  Grill the chicken for about 3 to 5 minutes on each side.  Discard the leftover marinade.  Remove the grilled chicken from the grill, put on a plate and cover it with foil.  Let it rest while you’re making the salad.For the Salad:  Chop the lettuce and add it to each serving bowl or plate.  Add the spinach and red cabbage.  Then, add the carrots, corn, red bell pepper, and onions.  Slice the chicken in a diagonal cut so that the pieces are about \xbd thick.  Lay the chicken on top of the salad ingredients and serve with your favorite dressing.', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-lime-chicken-salad-479059', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}