{u'recipes': [{u'sourceName': u'Garnish with Lemon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/590574-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 590574, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mascarpone Tarts with Fresh Berries', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 123.59, u'creditText': u'Garnish with Lemon', u'extendedIngredients': [{u'originalString': u'1 box blackberries', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 9042, u'unit': u'box'}, {u'originalString': u'3 T melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'T'}, {u'originalString': u'8 oz. package of Mascarpone cheese', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93820, u'unit': u'oz'}, {u'originalString': u'1\xbd cups Oreo crumbs', u'aisle': u'Sweet Snacks', u'name': u'oreo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 10018166, u'unit': u'cups'}, {u'originalString': u'1 box raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'box'}, {u'originalString': u'\xbd cup Seedless Raspberry Jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'raspberry jam', u'metaInformation': [u'seedless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberry-jam.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10719297, u'unit': u'cup'}, {u'originalString': u'1 \xbd t. vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u't'}, {u'originalString': u'\xbd cup whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1001053, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.garnishwithlemon.com/mascarpone-tarts-with-fresh-berries/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix together 1\xbd cups Oreo crumbs with 3 T of melted butter. Divide mixture equally among six mini cheesecake pans and press into bottom of pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u'Preheat oven to 350.For the Crust'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix the Mascarpone cheese, whipping cream, powdered sugar and vanilla together until stiff peaks form and divid equally among the cooled Oreo crusts.Clean berries and dry them on a paper towel. When they are dry, place the berries in concentric circles on top of filling. Melt \xbd c. of seedless raspberry jam in a small pan and brush over the top of the berries. Chill for at least 3 hours to set.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberry-jam.jpg', u'id': 10719297, u'name': u'raspberry jam'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}], u'name': u'Bake in preheated oven for 5 minutes and remove. Cool completely before adding the cheese mixture.For the filling'}], u'aggregateLikes': 42, u'instructions': u'Preheat oven to 350.For the Crust:Mix together 1\xbd cups Oreo crumbs with 3 T of melted butter. Divide mixture equally among six mini cheesecake pans and press into bottom of pan. Bake in preheated oven for 5 minutes and remove. Cool completely before adding the cheese mixture.For the filling:Mix the Mascarpone cheese, whipping cream, powdered sugar and vanilla together until stiff peaks form and divid equally among the cooled Oreo crusts.Clean berries and dry them on a paper towel. When they are dry, place the berries in concentric circles on top of filling. Melt \xbd c. of seedless raspberry jam in a small pan and brush over the top of the berries. Chill for at least 3 hours to set.', u'spoonacularSourceUrl': u'https://spoonacular.com/mascarpone-tarts-with-fresh-berries-590574', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}