{u'recipes': [{u'sourceName': u'My Baking Heart', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508593-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 508593, u'veryPopular': False, u'lowFodmap': False, u'title': u'Banana Nut Bread', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 41.36, u'creditText': u'My Baking Heart', u'extendedIngredients': [{u'originalString': u'1-1/4 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1-1/4 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'5 md bananas, mashed', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'2/3 c buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1230, u'unit': u'c'}, {u'originalString': u'4 lg eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2-1/4 c all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'1-2/3 c granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'1/4 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/4 tsp ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1 c pecans, chopped', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'c'}, {u'originalString': u'1 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1/2 c vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4513, u'unit': u'c'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://mybakingheart.com/2011/04/19/banana-nut-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine dry ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix eggs, oil, bananas and vanilla.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add to dry ingredients along with milk. Fold in nuts, but do not overbeat batter.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Bake at 350 degrees F in two (3"x8") greased loaf pans or paper-lined muffin tins... 20 minutes for mini muffins and small muffins, 30 minutes for large muffins and 45 minutes to 1 hour for loaf pans.Source: Momma G and my Grandmother Grace', u'length': {u'number': 95, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Port, Moscato d'Asti, and Cream Sherry are great choices for Banana Nut Bread. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port.", u'pairedWines': [u'port', u'moscato dasti', u'cream sherry'], u'productMatches': [{u'imageUrl': u'https://spoonacular.com/productImages/430931-312x231.jpg', u'description': u'A deep ruby red color that sparkles in the glass describes this Zinfandel port. The aromas are a complex mixture of licorice, blackberry, and a whisper of vanilla. The rich jammy taste has hints of licorice, herbs, spice and currants with a lingering finish of almond and anise. Some recommended food pairings are crab cakes, Gorgonzola cheese, Ch\xe8vre, figs and chocolate, or a good cigar.', u'link': u'https://www.amazon.com/2001-St-Barthelemy-Cellars-Zinfandel/dp/B00EGF5XWU', u'id': 430931, u'title': u'St. Barthelemy Cellars Zinfandel Port'}]}, u'aggregateLikes': 28, u'instructions': u'Combine dry ingredients. Mix eggs, oil, bananas and vanilla. Add to dry ingredients along with milk. Fold in nuts, but do not overbeat batter. Bake at 350 degrees F in two (3"x8") greased loaf pans or paper-lined muffin tins... 20 minutes for mini muffins and small muffins, 30 minutes for large muffins and 45 minutes to 1 hour for loaf pans.Source: Momma G and my Grandmother Grace', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-nut-bread-508593', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}