{u'recipes': [{u'sourceName': u'Foodista', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/639749-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 639749, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coconut Cream Pie Vegan Milkshake', u'diets': [u'dairy free'], u'pricePerServing': 153.97, u'creditText': u'Foodista.com – The Cooking Encyclopedia Everyone Can Edit', u'extendedIngredients': [{u'originalString': u'1 ripe frozen banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'frozen', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 tablespoon toasted coconut flakes', u'aisle': u'Baking', u'name': u'coconut flakes', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12108, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons graham cracker crumbs (check label to ensure it is vegan)', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [u'(check label to ensure it is vegan)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'tablespoons'}, {u'originalString': u'ice cubes', u'aisle': u'Frozen', u'name': u'ice cubes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'servings'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1 cup light coconut milk', u'aisle': u'Canned and Jarred', u'name': u'light coconut milk', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 99009, u'unit': u'cup'}, {u'originalString': u'1 cup fresh or frozen coconut meat', u'name': u'meat', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1065062, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.foodista.com/recipe/LF26X6K8/coconut-cream-pie-vegan-milkshake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'dishTypes': [u'beverage', u'drink'], u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine coconut meat, lemon juice, coconut oil, coconut milk, banana, vanilla, agave nectar (optional) and graham cracker crumbs in a blender; pulse until smooth.Top with soy or dairy based whip cream, sprinkle with additional graham crackers and garnish with toasted coconut flakes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flakes.jpg', u'id': 12108, u'name': u'coconut flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Serves 2-3', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Milkshake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'<ol><li>Combine coconut meat, lemon juice, coconut oil, coconut milk, banana, vanilla, agave nectar (optional) and graham cracker crumbs in a blender; pulse until smooth.</li><li>Top with soy or dairy based whip cream, sprinkle with additional graham crackers and garnish with toasted coconut flakes.</li><li>Serves 2-3</li></ol>', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-cream-pie-vegan-milkshake-639749', u'license': u'CC BY 3.0', u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}