{u'recipes': [{u'sourceName': u'A Girl Worth saving', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542012-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 542012, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Ice Cream', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 90, u'pricePerServing': 96.96, u'creditText': u'A Girl Worth saving', u'extendedIngredients': [{u'originalString': u'\xbc tsp of cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 13.5oz jar of coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 13.5, u'consistency': u'liquid', u'id': 12118, u'unit': u'oz'}, {u'originalString': u'\xbd lb of dates', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 9087, u'unit': u'lb'}, {u'originalString': u'\xbe cup of pumpkin', u'aisle': u'Produce', u'name': u'pumpkin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11422, u'unit': u'cup'}, {u'originalString': u'1\xbd tsp of pumpkin spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin spice mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp of vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'2 cups of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.agirlworthsaving.net/2013/10/pumpkin-ice-cream.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To make the date paste, combine the dates, cinnamon and water in a medium pan and bring to a boil.Once it boils, lower the heat and simmer for 1 hour. You might have to add more water during this process.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Remove from the stove and let cool.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all the dates and remaining liquid (there should be a small amount) in your blender or food processor and blend until you have a paste.In the blender add the remaining ingredients and mix thoroughly.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ice-cream-machine.jpg', u'id': 404791, u'name': u'ice cream machine'}], u'step': u'Add the ice cream mix to your ice cream maker and churn for 20 minutes.Enjoy!', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are great choices for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 232, u'instructions': u'To make the date paste, combine the dates, cinnamon and water in a medium pan and bring to a boil.Once it boils, lower the heat and simmer for 1 hour. You might have to add more water during this process.Remove from the stove and let cool. Place all the dates and remaining liquid (there should be a small amount) in your blender or food processor and blend until you have a paste.In the blender add the remaining ingredients and mix thoroughly.Add the ice cream mix to your ice cream maker and churn for 20 minutes.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-ice-cream-542012', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}