{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/549458-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 549458, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crispy Kale Salad with Coucous, Grilled Chicken and Pomegranates', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 783.02, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'1 avocado, chopped', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 large cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'4 ounces goat cheese, crumbled', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'1 1/2 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1 large bunch of kale, torn from stems and torn into pieces', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11233, u'unit': u'bunch'}, {u'originalString': u'3 tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon pepper, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup toasted pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12147, u'unit': u'cup'}, {u'originalString': u'1/2 cup pomegranate seeds (arils)', u'aisle': u'Produce', u'name': u'pomegranate seeds', u'metaInformation': [u'(arils)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9286, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 boneless skinless chicken breast (about 1 pound)', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'slaw dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 43016, u'unit': u'servings'}, {u'originalString': u'1 tablespoon tahini', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12698, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups uncooked coucous', u'aisle': u'?', u'name': u'coucous', u'metaInformation': [u'uncooked'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'unit': u'cups'}], u'healthScore': 83.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.halfbakedharvest.com/crispy-kale-salad-with-coucous-grilled-chicken-and-pomegranates/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 32, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.Preheat grill to medium-high heat. Rub the chicken with olive oil salt and pepper. Grill for 7-8 minutes on both sides or until cooked through.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool five minutes and then dice into bite size pieces. Set a side and keep warm.While the chicken cooks start on the kale. In a glass measuring cup or small bowl, mix all the dressing ingredients, whisk to combine and then season with salt and pepper. Taste and if needed add more salt and pepper. Grease a baking sheet and spread kale on the baking sheet. To the kale add 2-3 tablespoon of the dressing (just enough to coat the kale, reserve the rest) massage the kale with the dressing and spread out evenly on the baking sheet.and roast for 10 minutes. Toss well and roast for 5-10 minutes more, until slightly crispy but not golden.While kale is roasting bring the water to a boil. Once the water boils, remove from the heat and add the coucous, stir and cover for 10 minutes or until ready to use. When ready to use fluff with a fork.Once the chicken, kale, and couscous are all done combine them in a large bowl.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Add the toasted pine nuts, pomegranate seeds, avocado and goat cheese. Toss to combine and then add the remaining dressing and toss one more time.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'id': 9286, u'name': u'pomegranate seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 4154, u'instructions': u'Preheat oven to 350 degrees.Preheat grill to medium-high heat. Rub the chicken with olive oil salt and pepper. Grill for 7-8 minutes on both sides or until cooked through. Let cool five minutes and then dice into bite size pieces. Set a side and keep warm.While the chicken cooks start on the kale. In a glass measuring cup or small bowl, mix all the dressing ingredients, whisk to combine and then season with salt and pepper. Taste and if needed add more salt and pepper. Grease a baking sheet and spread kale on the baking sheet. To the kale add 2-3 tablespoon of the dressing (just enough to coat the kale, reserve the rest) massage the kale with the dressing and spread out evenly on the baking sheet.and roast for 10 minutes. Toss well and roast for 5-10 minutes more, until slightly crispy but not golden.While kale is roasting bring the water to a boil. Once the water boils, remove from the heat and add the coucous, stir and cover for 10 minutes or until ready to use. When ready to use fluff with a fork.Once the chicken, kale, and couscous are all done combine them in a large bowl. Add the toasted pine nuts, pomegranate seeds, avocado and goat cheese. Toss to combine and then add the remaining dressing and toss one more time.Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-kale-salad-with-coucous-grilled-chicken-and-pomegranates-549458', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}