{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598899-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 65, u'id': 598899, u'veryPopular': True, u'lowFodmap': False, u'title': u'Roast Chicken with Pancetta and Olives', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal'], u'preparationMinutes': 25, u'pricePerServing': 356.07, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'24 black olives, pitted if desired', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 1059195, u'unit': u''}, {u'originalString': u'1 teaspoon black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 chickens or rabbits (about 3 1/2 pounds each), cut into 10 to 12 pieces (see note above)', u'aisle': u'Meat', u'name': u'chickens', u'metaInformation': [u'cut into 10 to 12 pieces (see note above)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 7.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'pounds'}, {u'originalString': u'1 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 tablespoons chopped fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoons'}, {u'originalString': u'10 garlic cloves, peeled', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 thick slices pancetta or bacon, cut into 1/2- to 1-inch pieces (about 1/4-inch-thick slices or 4 ounces total)', u'aisle': u'Meat', u'name': u'pancetta', u'metaInformation': [u'thick', u'cut into 1/2- to 1-inch pieces ( 1/4-inch-thick slices)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 10410123, u'unit': u'slices'}, {u'originalString': u'1/2 to 1 teaspoon hot red pepper flakes (optional)', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 to 2 teaspoons fine sea salt (or less if using particularly salty olives)', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine', u'(or less if using particularly salty olives)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoons'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://leitesculinaria.com/81989/recipes-roast-chicken-pancetta-olives.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 450\xb0F (232\xb0C) and adjust the oven rack to the center position.2. In a large bowl, toss the chicken with the oil, thyme, rosemary, sea salt, red pepper flakes, if using, and black pepper, rubbing the mixture all over the chicken.3. Arrange the chicken pieces, skin side up, in a single layer on a large rimmed baking sheet. Scatter the garlic and pancetta or bacon around the chicken on the baking sheet. Roast until the chicken begins to brown, about 20 minutes. Dribble the wine over the chicken and roast for 8 minutes more. Scatter the olives around the chicken and roast until the skin is golden brown and crisp and the meat is cooked and tender, 15 to 20 minutes more. (If the chicken pieces are particularly large, allow a few extra minutes.)', u'length': {u'number': 43, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-parts.jpg', u'id': 1005006, u'name': u'chicken pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pancetta.jpg', u'id': 10410123, u'name': u'pancetta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let the chicken rest on the baking sheet for 10 minutes before serving. If desired, spoon some of the pan juices over the chicken. And if using unpitted olives, you may wish to offer a word of warning to guests.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Roasted Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 520, u'instructions': u'1. Preheat the oven to 450\xb0F (232\xb0C) and adjust the oven rack to the center position.2. In a large bowl, toss the chicken with the oil, thyme, rosemary, sea salt, red pepper flakes, if using, and black pepper, rubbing the mixture all over the chicken.3. Arrange the chicken pieces, skin side up, in a single layer on a large rimmed baking sheet. Scatter the garlic and pancetta or bacon around the chicken on the baking sheet. Roast until the chicken begins to brown, about 20 minutes. Dribble the wine over the chicken and roast for 8 minutes more. Scatter the olives around the chicken and roast until the skin is golden brown and crisp and the meat is cooked and tender, 15 to 20 minutes more. (If the chicken pieces are particularly large, allow a few extra minutes.) Let the chicken rest on the baking sheet for 10 minutes before serving. If desired, spoon some of the pan juices over the chicken. And if using unpitted olives, you may wish to offer a word of warning to guests.', u'spoonacularSourceUrl': u'https://spoonacular.com/roast-chicken-with-pancetta-and-olives-598899', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}