{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/604386-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 604386, u'veryPopular': False, u'lowFodmap': False, u'title': u'Clam Bake for Your Summer Kitchen', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 458.6, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1 1/2 pounds chorizo sausage, cut into 1" slices', u'aisle': u'Meat', u'name': u'chorizo sausage', u'metaInformation': [u'cut into 1" slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 7019, u'unit': u'pounds'}, {u'originalString': u'6 corn on the cobs, husked and broken in half', u'aisle': u'Produce', u'name': u'cobs corn', u'metaInformation': [u'husked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'16 ounces dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'ounces'}, {u'originalString': u'1 bunch flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'bunch'}, {u'originalString': u'lemon wedge', u'aisle': u'Produce', u'name': u'lemon wedge', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'2 lemons, sliced into rounds', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [u'sliced into rounds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'24 little neck clams', u'aisle': u'Seafood', u'name': u'little neck clams', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/littleneck-clams.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 10015157, u'unit': u''}, {u'originalString': u'1 medium lobster, 1-2 pounds', u'aisle': u'Seafood', u'name': u'lobster', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 15147, u'unit': u''}, {u'originalString': u'24 live mussels, cleaned and debearded (optional)', u'aisle': u'Seafood', u'name': u'mussels', u'metaInformation': [u'cleaned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 15164, u'unit': u''}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds red potato, small', u'aisle': u'Produce', u'name': u'red potato', u'metaInformation': [u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10011355, u'unit': u'pounds'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 pounds shrimp, large, peeled and deveined with tails on', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'with tails on', u'large', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pounds'}, {u'originalString': u'16 ounces water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'ounces'}, {u'originalString': u'2 large yellow onions, roughly chopped', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'yellow', u'large', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.foodfanatic.com/2014/07/clam-bake-for-your-summer-kitchen/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat oil and melt butter in a 16-20 quart pot over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add onions and cook, stirring until softened, 5 minutes.Layer parsley and lemon slices on top of onions. Top first with potatoes, season with salt and pepper, then layer sausage slices, clams, mussels and shrimp.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour over wine and water. Cover the pot and cook for 10 minutes until steam begins to escape.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the corn and place lobster on top. Cover pot and cook another 15 minutes. Ensure the potatoes are soft, clams and mussels have opened and the lobster has turned bright red.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lobster.jpg', u'id': 15147, u'name': u'lobster'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/clams.jpg', u'id': 15157, u'name': u'clams'}]}, {u'equipment': [], u'step': u'Remove all seafood, sausage and potatoes.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Pour broth through a strainer. Taste broth and season with salt and pepper as needed.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve with lemon wedges, broth and butter.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'id': 9150, u'name': u'lemon wedge'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 13, u'instructions': u'Heat oil and melt butter in a 16-20 quart pot over medium heat. Add onions and cook, stirring until softened, 5 minutes.Layer parsley and lemon slices on top of onions. Top first with potatoes, season with salt and pepper, then layer sausage slices, clams, mussels and shrimp.Pour over wine and water. Cover the pot and cook for 10 minutes until steam begins to escape.Add the corn and place lobster on top. Cover pot and cook another 15 minutes. Ensure the potatoes are soft, clams and mussels have opened and the lobster has turned bright red.Remove all seafood, sausage and potatoes. Pour broth through a strainer. Taste broth and season with salt and pepper as needed.Serve with lemon wedges, broth and butter.', u'spoonacularSourceUrl': u'https://spoonacular.com/clam-bake-for-your-summer-kitchen-604386', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}