{u'recipes': [{u'sourceName': u'Cook Eat Paleo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/563403-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 563403, u'veryPopular': True, u'lowFodmap': False, u'title': u'Paleo Peach Coconut Smoothie', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 136.95, u'creditText': u'Cook Eat Paleo', u'extendedIngredients': [{u'originalString': u'1 cup full fat coconut milk, chilled', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1 cup ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'cup'}, {u'originalString': u'fresh lemon zest, to taste', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'fresh', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u'servings'}, {u'originalString': u'2 large fresh peaches, peeled and cut into chunks', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'fresh', u'large', u'peeled', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://cookeatpaleo.com/paleo-peach-coconut-smoothie/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microplane.jpg', u'id': 405906, u'name': u'microplane'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add coconut milk, ice and peaches to Vitamix or blender. Using a microplane, add a few gratings of fresh lemon zest. Blend on high speed until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 26922, u'instructions': u'Add coconut milk, ice and peaches to Vitamix or blender. Using a microplane, add a few gratings of fresh lemon zest. Blend on high speed until smooth.', u'spoonacularSourceUrl': u'https://spoonacular.com/paleo-peach-coconut-smoothie-563403', u'dishTypes': [u'morning meal', u'brunch', u'beverage', u'breakfast', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}