{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/195880-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 195880, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilling: Roasted Corn Relish', u'diets': [u'gluten free'], u'pricePerServing': 185.06, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'3 ears of corn, husked', u'aisle': u'Produce', u'name': u'ears of corn', u'metaInformation': [u'husked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'Type of fire: Direct', u'aisle': u'Canned and Jarred', u'name': u'fire-roasted tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 98849, u'unit': u'servings'}, {u'originalString': u'1/4 cup finely chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'6 green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'Grill heat: high', u'aisle': u'Cheese', u'name': u'grill cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10093624, u'unit': u'servings'}, {u'originalString': u'1 jalapeno', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon lime zest', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'teaspoon'}, {u'originalString': u'1 medium red pepper', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/2 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/06/grilling-roasted-corn-relish.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Light one chimney full of charcoal. While the charcoal is lighting, lightly butter each ear of corn, then season with salt and pepper. Wrap each ear in aluminum foil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'id': 11167, u'name': u'corn on the cob'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the corn, red pepper, and jalapeno on the grill and cover. Grill red pepper and jalapeno until they start to blister, but not blacken, on each side. Grill corn until it’s lightly charred all over.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Remove pepper, jalapeno, and corn to a cutting board as they are done.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush green onions lightly with oil and place on the grill. Cook until softened and lightly browned on both sides.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Remove to cutting board.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl, cut kernels off each ear of corn. Seed jalapeno and red pepper, then dice and add into bowl with corn. Thinly slice green onions and add into bowl with corn and peppers along with cilantro, lime juice, lime zest, sugar, chili powder, and cumin. Stir to combine. Season with salt and pepper to taste.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'id': 11167, u'name': u'corn on the cob'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Serve immediately or store in an airtight container in the refrigerator.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 51, u'instructions': u'Procedures                                                                              1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Light one chimney full of charcoal. While the charcoal is lighting, lightly butter each ear of corn, then season with salt and pepper. Wrap each ear in aluminum foil.                                                                                                                            2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Set cooking grate in place, cover gill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Place the corn, red pepper, and jalapeno on the grill and cover. Grill red pepper and jalapeno until they start to blister, but not blacken, on each side. Grill corn until it’s lightly charred all over. Remove pepper, jalapeno, and corn to a cutting board as they are done.                                                                                                                            3                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 Brush green onions lightly with oil and place on the grill. Cook until softened and lightly browned on both sides. Remove to cutting board.                                                                                                                            4                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 In a medium bowl, cut kernels off each ear of corn. Seed jalapeno and red pepper, then dice and add into bowl with corn. Thinly slice green onions and add into bowl with corn and peppers along with cilantro, lime juice, lime zest, sugar, chili powder, and cumin. Stir to combine. Season with salt and pepper to taste. Serve immediately or store in an airtight container in the refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilling-roasted-corn-relish-195880', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}