{u'recipes': [{u'sourceName': u'Half Baked Harvest', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/703499-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 703499, u'veryPopular': False, u'lowFodmap': False, u'title': u'4-Ingredient Dark Chocolate Covered Peanut Butter Stuffed Dates', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 25, u'pricePerServing': 70.69, u'creditText': u'Half Baked Harvest', u'extendedIngredients': [{u'originalString': u'1 tablespoon coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoon'}, {u'originalString': u'16 tablespoons creamy peanut butter OR other nut/seed butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 16.0, u'consistency': u'solid', u'id': 10116098, u'unit': u'tablespoons'}, {u'originalString': u'16 plump medjool dates', u'aisle': u'Dried Fruits;Produce', u'name': u'medjool dates', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'liquid', u'id': 9421, u'unit': u''}, {u'originalString': u'8 ounces dark chocolate or vegan chocolate chips', u'aisle': u'Health Foods;Baking', u'name': u'vegan chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 98848, u'unit': u'ounces'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.halfbakedharvest.com/4-ingredient-dark-chocolate-covered-peanut-butter-stuffed-dates/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Line a baking sheet with wax or parchment paper.Slice the dates in half lengthwise, being careful not to slice the date all the way in half.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Remove the pits of the date. Stuff each date with 1 tablespoon of peanut butter and place on the prepared baking sheet. Repeat with the remaining dates.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Place the dates in the freezer and freeze for 15 minutes.Meanwhile, melt together the dark chocolate and coconut oil in a double broiler or in the microwave stirring every 30 seconds until melted and smooth.Once the dates are well chilled, dip in the chocolate using a fork. Allow any excess chocolate to drip off the dates and then place the date back on the baking sheet and sprinkle with your desired topping. Repeat with the remaining dates. Chill the dates in the fridge for 30 minutes or until the chocolate is set.Keep stored in an airtight container in the fridge. Enjoy...preferably with cold milk! :)', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are my top picks for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Viva Diva Moscato Colada. Reviewers quite like it with a 4.9 out of 5 star rating and a price of about 11 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Sweet Moscato wine infused with natural coconut & pineapple flavor. Light orange in color. Fruity, typical of coconut & pineapple with light hints of Moscato. Excellent as an aperitif or mixing with cocktails.', u'title': u'Viva Diva Moscato Colada', u'price': u'$10.99', u'id': 465263, u'link': u'https://www.wine.com/product/viva-diva-moscato-colada/138557', u'imageUrl': u'https://spoonacular.com/productImages/465263-312x231.jpg'}]}, u'aggregateLikes': 124, u'instructions': u'InstructionsLine a baking sheet with wax or parchment paper.Slice the dates in half lengthwise, being careful not to slice the date all the way in half. Remove the pits of the date. Stuff each date with 1 tablespoon of peanut butter and place on the prepared baking sheet. Repeat with the remaining dates. Place the dates in the freezer and freeze for 15 minutes.Meanwhile, melt together the dark chocolate and coconut oil in a double broiler or in the microwave stirring every 30 seconds until melted and smooth.Once the dates are well chilled, dip in the chocolate using a fork. Allow any excess chocolate to drip off the dates and then place the date back on the baking sheet and sprinkle with your desired topping. Repeat with the remaining dates. Chill the dates in the fridge for 30 minutes or until the chocolate is set.Keep stored in an airtight container in the fridge. Enjoy...preferably with cold milk! :)', u'spoonacularSourceUrl': u'https://spoonacular.com/4-ingredient-dark-chocolate-covered-peanut-butter-stuffed-dates-703499', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}