{u'recipes': [{u'sourceName': u'Onion Rings And Things', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/799860-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 799860, u'veryPopular': False, u'lowFodmap': False, u'title': u'No-Churn Cookies and Cream Ice Cream', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 102.77, u'creditText': u'Onion Rings And Things', u'extendedIngredients': [{u'originalString': u'2 cups heavy cream, very cold', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [u'very cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'24 Oreo cookies, crushed', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'1 (14 ounces) can sweetened condensed milk, very cold', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'very cold', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.onionringsandthings.com/2016/08/no-churn-cookies-cream-ice-cream/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine heavy cream, condensed milk, and vanilla extract. Using a hand mixer on low speed, beat until mixture begins to thicken. Increase speed to medium and continue to beat until stiff peaks form.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'Add crushed Oreos in thirds and gently fold in, making sure not to deflate cream.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/loaf-pan.png', u'id': 404715, u'name': u'loaf pan'}], u'step': u'Transfer mixture into a metal 9 x 5 loaf pan. Cover with plastic film, lightly pressing plastic film against the surface of cream mixture (this is to prevent ice crystals from forming). Refrigerate for at least 6 hours or overnight.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve frozen.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Frozen Dessert works really well with Cream Sherry, Port, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 83, u'instructions': u'In a large bowl, combine heavy cream, condensed milk, and vanilla extract. Using a hand mixer on low speed, beat until mixture begins to thicken. Increase speed to medium and continue to beat until stiff peaks form.Add crushed Oreos in thirds and gently fold in, making sure not to deflate cream.Transfer mixture into a metal 9 x 5 loaf pan. Cover with plastic film, lightly pressing plastic film against the surface of cream mixture (this is to prevent ice crystals from forming). Refrigerate for at least 6 hours or overnight. Serve frozen.', u'spoonacularSourceUrl': u'https://spoonacular.com/no-churn-cookies-and-cream-ice-cream-799860', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}