{u'recipes': [{u'sourceName': u'Eat Good 4 Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/553253-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 553253, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peanut butter and chocolate parfaits', u'diets': [], u'pricePerServing': 134.03, u'creditText': u'Eat Good 4 Life', u'extendedIngredients': [{u'originalString': u'1/2 cup confectioners sugar', u'aisle': u'Baking', u'name': u'confectioners sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 cup organic creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'1 tablespoon dark chocolate chips, optional', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'tablespoon'}, {u'originalString': u'Chocolate fudge sauce', u'aisle': u'Frozen', u'name': u'chocolate sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-glaze.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10019348, u'unit': u'servings'}, {u'originalString': u'1/2 cup heavy cream plus 2 tablespoons confectioners sugar.', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'6-8 lady fingers, chopped', u'aisle': u'Sweet Snacks', u'name': u'lady fingers', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18423, u'unit': u''}, {u'originalString': u"1/3 cup cacao liquor, if using cookies you don't need the liquor, next time I will just use coffee, I didn't like the liquor flavor too much", u'aisle': u'Alcoholic Beverages', u'name': u'liquor', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14037, u'unit': u'cup'}, {u'originalString': u'4 oz 1/3 less fat cream cheese, softened, Using Greek yogurt may be a healthier option', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 43274, u'unit': u'oz'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.eatgood4life.com/peanut-butter-and-chocolate-parfaits/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, I used an electronic hand mixer, beat cream cheese, peanut butter, and sugar until combined.In another bowl whipped the heavy cream and the 2 tablespoons of additional sugar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [], u'step': u'Place some lady fingers into the bottom of each mini parfait glass. Pipe or spoon a layer of peanut butter mousse onto the each glass followed by a layer of chocolate fudge sauce. Repeat layers.Top with whipped cream and finish with chocolate chips, chopped cookies etc.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'id': 18423, u'name': u'ladyfingers'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Parfait can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 47, u'instructions': u'In a bowl, I used an electronic hand mixer, beat cream cheese, peanut butter, and sugar until combined.In another bowl whipped the heavy cream and the 2 tablespoons of additional sugar.Place some lady fingers into the bottom of each mini parfait glass. Pipe or spoon a layer of peanut butter mousse onto the each glass followed by a layer of chocolate fudge sauce. Repeat layers.Top with whipped cream and finish with chocolate chips, chopped cookies etc.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-and-chocolate-parfaits-553253', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}