{u'recipes': [{u'sourceName': u'cdkitchen', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/823564-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 823564, u'veryPopular': False, u'lowFodmap': False, u'title': u'Potato-Rosemary Pizza', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 203.92, u'creditText': u'cdkitchen', u'extendedIngredients': [{u'originalString': u'1 teaspoon active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 35137, u'unit': u'cup'}, {u'originalString': u'2 tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 cup all-purpose flour, plus more for work surface', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'plus more for work surface'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tablespoon chopped fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon flake sea salt or kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup grated parmesan or mozzarella cheese (optional)', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1026, u'unit': u'cup'}, {u'originalString': u'1 tablespoon extra-virgin olive oil, plus more for bowl', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for bowl'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 pinch sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pinch'}, {u'originalString': u'1 small sweet onion, thinly sliced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'small', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1/2 cup warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'2 medium Yukon gold potatoes, peeled and very sliced thinly', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'medium', u'peeled', u'very sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10211362, u'unit': u''}], u'healthScore': 60.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.cdkitchen.com/recipes/recs/16/potato-pizza151517.shtml', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Dough: In a small bowl, sprinkle the yeast and sugar over the warm water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Let stand until yeast is dissolved and mixture is foamy, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine flour and salt in a large bowl. Make a well in the center, and add the yeast mixture and oil. Slowly stir ingredients with a wooden spoon just until dough starts to come together.  Turn out dough on a lightly floured work surface, and knead until smooth and elastic, 7 to 10 minutes.  Divide dough into two equal sized balls.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place balls in a shallow oiled bowl, turning to coat with oil; cover with plastic wrap, and let rise 1 hour at room temperature or overnight in the refrigerator.  Pizza: Preheat oven to 450 degrees F.  Sprinkle cornmeal on pizza peel or two baking sheets; set aside.  On a lightly floured surface, roll out each piece of dough into a 7-inch disk about 1/4 inch thick.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer disks to baking sheets or pizza peel.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle dough with olive oil, top each disk with sliced potatoes and onions in a decorative pattern, and sprinkle lightly with salt and pepper.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-stone.jpg', u'id': 406907, u'name': u'pizza stone'}], u'step': u'Bake on pizza stone or baking sheets until crusts are golden, and potatoes are browned about 8-12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Cecchi Sangiovese di Toscana with a 4.1 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'The red wine is made according to traditional methods, along with the help of modern technology and with much care. It has a ruby red colour with purple lights, and a delicate fruity bouquet reminiscent of violets and irises. Its good structure, well combined with a moderate acidity, can be distinguished on the palate. Although lacking in sharp tannins, the generous taste of the Sangiovese guarantees a wine that ages well. This wine is pleasant with cold and hot meat dishes and when young should be served at a temperature of 16 \xb0C.', u'title': u'Cecchi Sangiovese di Toscana', u'price': u'$9.49', u'id': 439017, u'link': u'https://www.wine.com/product/cecchi-sangiovese-di-toscana-2000/48873', u'imageUrl': u'https://spoonacular.com/productImages/439017-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Dough: In a small bowl, sprinkle the yeast and sugar over the warm water. Let stand until yeast is dissolved and mixture is foamy, about 10 minutes.  Combine flour and salt in a large bowl. Make a well in the center, and add the yeast mixture and oil. Slowly stir ingredients with a wooden spoon just until dough starts to come together.  Turn out dough on a lightly floured work surface, and knead until smooth and elastic, 7 to 10 minutes.  Divide dough into two equal sized balls. Place balls in a shallow oiled bowl, turning to coat with oil; cover with plastic wrap, and let rise 1 hour at room temperature or overnight in the refrigerator.  Pizza: Preheat oven to 450 degrees F.  Sprinkle cornmeal on pizza peel or two baking sheets; set aside.  On a lightly floured surface, roll out each piece of dough into a 7-inch disk about 1/4 inch thick.  Transfer disks to baking sheets or pizza peel. Drizzle dough with olive oil, top each disk with sliced potatoes and onions in a decorative pattern, and sprinkle lightly with salt and pepper.  Bake on pizza stone or baking sheets until crusts are golden, and potatoes are browned about 8-12 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/potato-rosemary-pizza-823564', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}