{u'recipes': [{u'sourceName': u'Will Cook for Smiles', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/553904-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 553904, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pasta Primavera Skillet', u'diets': [], u'pricePerServing': 160.62, u'creditText': u'Will Cook for Smiles', u'extendedIngredients': [{u'originalString': u'1 cup broccoli florets, chopped', u'aisle': u'Produce', u'name': u'broccoli florets', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011090, u'unit': u'cup'}, {u'originalString': u'1/2 cup shredded carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 cup cauliflower florets, chopped', u'aisle': u'Produce', u'name': u'cauliflower florets', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011135, u'unit': u'cup'}, {u'originalString': u'2 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 green bell pepper, sliced', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 1/2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'5-6 medium mushrooms, chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11260, u'unit': u''}, {u'originalString': u'1 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'1/2 cup fresh grated Parmesan cheese (+ a little more for topping)', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'fresh', u'grated', u'for topping)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'8 oz uncooked penne pasta', u'aisle': u'Pasta and Rice', u'name': u'penne pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'oz'}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 large shallot', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 cup vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://willcookforsmiles.com/2014/04/pasta-primavera-skillet.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook penne until almost done and set aside.Rub the bottom and sides of your skillet with olive oil (make sure your skillet is seasoned first) and preheat it over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'id': 11120420, u'name': u'penne'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut your veggies and add them to the hot skillet.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add some salt and pepper. Cook until veggies are softened. Preheat your oven to 375.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add cooked penne to the skillet and mix until veggies and pasta are incorporated.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk heavy cream, stock, salt and pepper and slowly pour it into the pasta. Slowly and carefully stir everything together.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add fresh grated Parmesan cheese and stir until well incorporated. Sprinkle more Parmesan on top and place the skillet in the oven for 15-20 minutes. Carefully take it out and serve!', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pasta Primavera can be paired with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Tiamo Chianti. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 10 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Intense ruby red with garnet tones. Intense, fruity with persistent aromas of spices and licorice. Full with good acidity and balanced tannins.Tiamo is bottled at Chianti DOCG, and certified as made with 100% organic grapes.', u'title': u'Tiamo Chianti', u'price': u'$9.95', u'id': 441645, u'link': u'https://www.wine.com/product/tiamo-chianti-2009/107710', u'imageUrl': u'https://spoonacular.com/productImages/441645-312x231.jpg'}]}, u'aggregateLikes': 1624, u'instructions': u'Cook penne until almost done and set aside.Rub the bottom and sides of your skillet with olive oil (make sure your skillet is seasoned first) and preheat it over medium heat. Cut your veggies and add them to the hot skillet. Add some salt and pepper. Cook until veggies are softened. Preheat your oven to 375. Add cooked penne to the skillet and mix until veggies and pasta are incorporated. Whisk heavy cream, stock, salt and pepper and slowly pour it into the pasta. Slowly and carefully stir everything together. Add fresh grated Parmesan cheese and stir until well incorporated. Sprinkle more Parmesan on top and place the skillet in the oven for 15-20 minutes. Carefully take it out and serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-primavera-skillet-553904', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}