{u'recipes': [{u'sourceName': u'Gluten Free Recipe Box', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/562707-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 562707, u'veryPopular': True, u'lowFodmap': False, u'title': u'Gluten Free Apple Coffee Cake', u'diets': [u'gluten free'], u'pricePerServing': 63.02, u'creditText': u'Gluten Free Recipe Box', u'extendedIngredients': [{u'originalString': u'1/2 can (21 oz.) can Comstock More Fruit Apple Pie Filling or Topping (or flavor)', u'aisle': u'Baking', u'name': u'apple pie filling', u'metaInformation': [u'canned', u'(or flavor)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-pie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 19312, u'unit': u'oz'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1/2 Tablespoons warm milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 Tablespoon unsalted butter or buttery spread, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy buttery spread', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/light-buttery-spread.png', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 4673, u'unit': u'Tablespoon'}, {u'originalString': u'1/3 cup sugar (or evaporated cane juice which is less refined than regular sugar)', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'(or evaporated cane juice which is less refined than regular sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://glutenfreerecipebox.com/gluten-free-apple-coffee-cake', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 350\xb0F. Oil a 7, 8 or 9-inch round cake or pie pan.In the large bowl of your mixer, mix together eggs and sugar on medium-low, or whisk by hand.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add butter in a little bit at a time, as to not cook eggs; add vanilla and milk; mix again on medium-low.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add flour blend and beat until smooth.Reserve about 2/3 cup of batter.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread just enough batter/dough to cover the bottom of the prepared pan.Drop 1/2 tablespoons of jam over batter and spread as much as possible. Drop the remaining batter by heaping tablespoonfuls onto the top of the filling and spread a bit for some of the spoonfuls to meet, leaving a bit of apple showing.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake 45 minutes or until toothpick clean in the center. Cover with foil if it becomes too brown.While the cake is baking, add powdered sugar to a cup; add melted butter and stir until sugar is melted and well mixed.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add milk and vanilla and stir well. Baste over warm coffee cake.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Serve warm. Store leftovers covered. Refrigerate if not using right away within a couple of days.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 552, u'instructions': u'Heat oven to 350\xb0F. Oil a 7, 8 or 9-inch round cake or pie pan.In the large bowl of your mixer, mix together eggs and sugar on medium-low, or whisk by hand.Add butter in a little bit at a time, as to not cook eggs; add vanilla and milk; mix again on medium-low.Add flour blend and beat until smooth.Reserve about 2/3 cup of batter. Spread just enough batter/dough to cover the bottom of the prepared pan.Drop 1/2 tablespoons of jam over batter and spread as much as possible. Drop the remaining batter by heaping tablespoonfuls onto the top of the filling and spread a bit for some of the spoonfuls to meet, leaving a bit of apple showing.Bake 45 minutes or until toothpick clean in the center. Cover with foil if it becomes too brown.While the cake is baking, add powdered sugar to a cup; add melted butter and stir until sugar is melted and well mixed. Add milk and vanilla and stir well. Baste over warm coffee cake.Serve warm. Store leftovers covered. Refrigerate if not using right away within a couple of days.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-apple-coffee-cake-562707', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}