{u'recipes': [{u'sourceName': u'A Cedar Spoon', u'cuisines': [u'spanish', u'european'], u'image': u'https://spoonacular.com/recipeImages/536416-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 536416, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mussels with Smoked Spanish Paprika', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 202.9, u'creditText': u'A Cedar Spoon', u'extendedIngredients': [{u'originalString': u'1 28 oz. can of diced tomatoes with liquid', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'with liquid', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'Crusty bread to soak it all up', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10018029, u'unit': u'servings'}, {u'originalString': u'3 garlic cloves, chopped', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 lbs. fresh mussels', u'aisle': u'Seafood', u'name': u'mussels', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 15164, u'unit': u'lbs'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tsp. smoked Spanish paprika (or just paprika)', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [u'smoked', u'spanish', u'(or just paprika)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'1 cup white wine (or red, chicken broth or beer)', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'white', u'red', u'(or , chicken broth or beer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}], u'healthScore': 72.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.acedarspoon.com/mussels-smoked-spanish-paprika/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Soak mussels for 20 minutes in cold water to get grit out.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u"Drain and pick through your mussels and discard any that are broken, shells are cracked or have a hole and any that don't open when tapped (they should be open meaning they are alive).Take the mussels that are alive and set them aside.Using a dutch oven or pot heat the olive oil over medium heat and add onion and garlic. Saut until translucent.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in the can of diced tomatoes, white wine (or red wine, chicken broth or beer) and the Spanish smoked paprika and let boil for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 1012028, u'name': u'smoked paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the mussels in the pot or dutch oven, cover with a lid and continue to boil for 5-8 minutes. Check the mussels at 5 minutes to see if they are all open.As soon as most of the mussels are open turn off the heat and portion into bowls with crusty bread a clean bowl for the shells. Throw out any mussels that are not open.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 10018029, u'name': u'crusty bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mussels.jpg', u'id': 15164, u'name': u'mussels'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Miranda Lambert Kerosene Pinot Grigio Wine with a 5 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'light , pear , apple', u'title': u'Miranda Lambert Kerosene Pinot Grigio Wine', u'price': u'$26.0', u'id': 428324, u'link': u'https://www.amazon.com/Miranda-Lambert-Kerosene-Pinot-Grigio/dp/B0184UHJRO', u'imageUrl': u'https://spoonacular.com/productImages/428324-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u"Soak mussels for 20 minutes in cold water to get grit out.Drain and pick through your mussels and discard any that are broken, shells are cracked or have a hole and any that don't open when tapped (they should be open meaning they are alive).Take the mussels that are alive and set them aside.Using a dutch oven or pot heat the olive oil over medium heat and add onion and garlic. Saut until translucent.Add in the can of diced tomatoes, white wine (or red wine, chicken broth or beer) and the Spanish smoked paprika and let boil for 2 minutes.Put the mussels in the pot or dutch oven, cover with a lid and continue to boil for 5-8 minutes. Check the mussels at 5 minutes to see if they are all open.As soon as most of the mussels are open turn off the heat and portion into bowls with crusty bread a clean bowl for the shells. Throw out any mussels that are not open.", u'spoonacularSourceUrl': u'https://spoonacular.com/mussels-with-smoked-spanish-paprika-536416', u'dishTypes': [u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 38, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}