{u'recipes': [{u'sourceName': u'Love and Olive Oil', u'cuisines': [u'german', u'european'], u'image': u'https://spoonacular.com/recipeImages/763278-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 763278, u'veryPopular': True, u'lowFodmap': False, u'title': u'German Pancakes', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 70.21, u'creditText': u'Love and Olive Oil', u'extendedIngredients': [{u'originalString': u'6 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'6 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.loveandoliveoil.com/2016/05/german-pancakes.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Combine milk, flour, eggs, vanilla, and salt in a blender and mix on low speed until smooth (you can also mix by hand with a whisk until mostly smooth, a few small lumps may remain but that's ok). Spray a 13x9 inch baking pan with cooking spray. Position oven rack in bottom 1/3 of oven and preheat to 450 degrees F. When oven is almost preheated, place butter in prepared baking pan and place in oven until butter is hot and sizzling. Carefully pour the batter into the hot pan (one reason I love making the batter in the blender: easy pouring. Otherwise, it may be easier to remove the pan from the oven, pour in the batter, then put it back in the oven).", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake for 25 minutes, or until golden brown and fluffy. Slice and serve hot with maple syrup and powdered sugar.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'German can be paired with Dornfelder and Riesling. Beer might seem like the natural pick for German food, but German riesling pairs wonderfully with seafood and schnitzel, while a German red like Dornfelder goes well with beef and game meat.', u'pairedWines': [u'dornfelder', u'riesling'], u'productMatches': [{u'description': None, u'title': u'King Frosch Dornfelder Dry All Natural German', u'price': u'$19.95', u'id': 432076, u'link': u'https://www.amazon.com/King-Frosch-Dornfelder-Natural-German/dp/B00F29YBGI', u'imageUrl': u'https://spoonacular.com/productImages/432076-312x231.jpg'}]}, u'aggregateLikes': 549, u'instructions': u"Combine milk, flour, eggs, vanilla, and salt in a blender and mix on low speed until smooth (you can also mix by hand with a whisk until mostly smooth, a few small lumps may remain but that's ok). Spray a 13x9 inch baking pan with cooking spray. Position oven rack in bottom 1/3 of oven and preheat to 450 degrees F. When oven is almost preheated, place butter in prepared baking pan and place in oven until butter is hot and sizzling. Carefully pour the batter into the hot pan (one reason I love making the batter in the blender: easy pouring. Otherwise, it may be easier to remove the pan from the oven, pour in the batter, then put it back in the oven). Bake for 25 minutes, or until golden brown and fluffy. Slice and serve hot with maple syrup and powdered sugar.", u'spoonacularSourceUrl': u'https://spoonacular.com/german-pancakes-763278', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}