{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/780358-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 780358, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fruit Cocktail Salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 63.75, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'2 medium firm bananas. sliced', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'firm', u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 (11 ounce) can mandarin oranges, drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'canned mandarin oranges', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 9218, u'unit': u'ounce'}, {u'originalString': u'2 (15.25 ounce) cans fruit cocktail in juice', u'aisle': u'Canned and Jarred', u'name': u'fruit cocktail', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fruit-cocktail.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 30.5, u'consistency': u'liquid', u'id': 9099, u'unit': u'ounce'}, {u'originalString': u'1 (1 ounce) package instant sugar-free vanilla pudding mix', u'aisle': u'Baking', u'name': u'instant vanilla pudding mix', u'metaInformation': [u'sugar-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 19206, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1 (20 ounce) can unsweetened pineapple tidbits, drained', u'aisle': u'Canned and Jarred', u'name': u'pineapple tidbits', u'metaInformation': [u'unsweetened', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 1039354, u'unit': u'ounce'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Fruit-Cocktail-Salad/Detail.aspx', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, combine the fruit and lemon juice. Sprinkle with pudding mix. Stir gently for 1 minute or until mixture is thickened. Fold in bananas. Refrigerate until serving.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cocktail Salad works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 91, u'instructions': u'In a bowl, combine the fruit and lemon juice. Sprinkle with pudding mix. Stir gently for 1 minute or until mixture is thickened. Fold in bananas. Refrigerate until serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/fruit-cocktail-salad-780358', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}