{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [u'european', u'irish'], u'image': u'https://spoonacular.com/recipeImages/245126-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 245126, u'veryPopular': True, u'lowFodmap': False, u'title': u'Irish Soda Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 40.98, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'4 Tbsp butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'1 3/4 cups buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 1230, u'unit': u'cups'}, {u'originalString': u'1 large egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 to 4 1/2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 Tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/irish_soda_bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'1 Preheat oven to 425\xb0.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-cutter.jpg', u'id': 406916, u'name': u'pastry cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together 4 cups of flour, the sugar, salt, and baking soda into a large mixing bowl.2 Using your (clean) fingers (or two knives or a pastry cutter), work the butter into the flour mixture until it resembles coarse meal, then add in the raisins.  3 Make a well in the center of the flour mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add beaten egg and buttermilk to well and mix in with a wooden spoon until dough is too stiff to stir. Dust hands with a little flour, then gently knead dough in the bowl just long enough to form a rough ball. If the dough is too sticky to work with, add in a little more flour. Do not over-knead!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Transfer dough to a lightly floured surface and shape into a round loaf. Note that the dough will be a little sticky, and quite shaggy (a little like a shortcake biscuit dough). You want to work it just enough so that the flour is just moistened and the dough just barely comes together. Shaggy is good. If you over-knead, the bread will end up tough. 4', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer dough to a large, lightly greased cast-iron skillet or a baking sheet (it will flatten out a bit in the pan or on the baking sheet). Using a serrated knife, score top of dough about an inch and a half deep in an "X" shape. The purpose of the scoring is to help heat get into the center of the dough while it cooks.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pot-holder.jpg', u'id': 221447, u'name': u'pot holder'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Transfer to oven and bake until bread is golden and bottom sounds hollow when tapped, about 35-45 minutes. (If you use a cast iron pan, it may take a little longer as it takes longer for the pan to heat up than a baking sheet.) Check for doneness also by inserting a long, thin skewer into the center. If it comes out clean, it's done.Hint 1: If the top is getting too dark while baking, tent the bread with some aluminum foil.Hint 2: If you use a cast iron skillet to cook the bread in the oven, be very careful when you take the pan out. It's easy to forget that the handle is extremely hot. Cool the handle with an ice cube, or put a pot holder over it.", u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan or sheet from oven, let bread sit in the pan or on the sheet for 5-10 minutes, then remove to a rack to cool briefly.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve bread warm, at room temperature, or sliced and toasted. Best when eaten warm and just baked.', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 3210, u'instructions': u'1 Preheat oven to 425\xb0. Whisk together 4 cups of flour, the sugar, salt, and baking soda into a large mixing bowl.2 Using your (clean) fingers (or two knives or a pastry cutter), work the butter into the flour mixture until it resembles coarse meal, then add in the raisins.  3 Make a well in the center of the flour mixture. Add beaten egg and buttermilk to well and mix in with a wooden spoon until dough is too stiff to stir. Dust hands with a little flour, then gently knead dough in the bowl just long enough to form a rough ball. If the dough is too sticky to work with, add in a little more flour. Do not over-knead! Transfer dough to a lightly floured surface and shape into a round loaf. Note that the dough will be a little sticky, and quite shaggy (a little like a shortcake biscuit dough). You want to work it just enough so that the flour is just moistened and the dough just barely comes together. Shaggy is good. If you over-knead, the bread will end up tough. 4 Transfer dough to a large, lightly greased cast-iron skillet or a baking sheet (it will flatten out a bit in the pan or on the baking sheet). Using a serrated knife, score top of dough about an inch and a half deep in an "X" shape. The purpose of the scoring is to help heat get into the center of the dough while it cooks. Transfer to oven and bake until bread is golden and bottom sounds hollow when tapped, about 35-45 minutes. (If you use a cast iron pan, it may take a little longer as it takes longer for the pan to heat up than a baking sheet.) Check for doneness also by inserting a long, thin skewer into the center. If it comes out clean, it\'s done.Hint 1: If the top is getting too dark while baking, tent the bread with some aluminum foil.Hint 2: If you use a cast iron skillet to cook the bread in the oven, be very careful when you take the pan out. It\'s easy to forget that the handle is extremely hot. Cool the handle with an ice cube, or put a pot holder over it.Remove pan or sheet from oven, let bread sit in the pan or on the sheet for 5-10 minutes, then remove to a rack to cool briefly. Serve bread warm, at room temperature, or sliced and toasted. Best when eaten warm and just baked.', u'spoonacularSourceUrl': u'https://spoonacular.com/irish-soda-bread-245126', u'dishTypes': [u'dessert', u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'st patricks day'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}