{u'recipes': [{u'sourceName': u'Moms Dish', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511516-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 511516, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cream Mushroom Potatoes', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 83.44, u'creditText': u'Moms Dish', u'extendedIngredients': [{u'originalString': u'2 medium Carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'10 ounces Fresh or Canned Mushrooms', u'aisle': u'Produce', u'name': u'fresh mushrooms', u'metaInformation': [u'fresh', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'1/2 quarts Heavy Whipping Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'quarts'}, {u'originalString': u'2 tablespoons Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 medium Onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'12 medium Potatoes', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'Salt & Pepper; to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://momsdish.com/recipe/32/cream-mushroom-potatoes', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Peel potatoes and cut them into 6 pieces. Boil potatoes in salty water. Once potatoes are cooked, place them into an oven safe dish.In a frying pan, saute mushrooms until golden, add onions, carrots and season. Cook until they soften.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add whipping cream to the ingredients, and bring it to a boil.Cover cooked potatoes with a creamy mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1001053, u'name': u'whipping cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place it in the oven at 200F for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 50, u'instructions': u'Peel potatoes and cut them into 6 pieces. Boil potatoes in salty water. Once potatoes are cooked, place them into an oven safe dish.In a frying pan, saute mushrooms until golden, add onions, carrots and season. Cook until they soften. Add whipping cream to the ingredients, and bring it to a boil.Cover cooked potatoes with a creamy mixture. Place it in the oven at 200F for 15 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/cream-mushroom-potatoes-511516', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}