{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/206364-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 206364, u'veryPopular': True, u'lowFodmap': False, u'title': u'Drinking in Season: Blackberry Margarita', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 63.49, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 1/2 ounce 100% agave tequila', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave', u'metaInformation': [u'100%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.5, u'consistency': u'liquid', u'id': 19912, u'unit': u'ounce'}, {u'originalString': u'1/8 to 1/4 ounce agave nectar (to taste)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'to taste', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.125, u'consistency': u'liquid', u'id': 19912, u'unit': u'ounce'}, {u'originalString': u'Garnish: 2 blackberries, wooden skewer', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9042, u'unit': u''}, {u'originalString': u'5 ripe blackberries', u'aisle': u'Produce', u'name': u'blackberries', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9042, u'unit': u''}, {u'originalString': u'Ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'serving'}, {u'originalString': u'2 tablespoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoons'}, {u'originalString': u'Small slice of lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'slice', u'unitShort': u'slice', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'slice'}, {u'originalString': u'3/4 ounce freshly squeezed lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.75, u'consistency': u'liquid', u'id': 9160, u'unit': u'ounce'}, {u'originalString': u'1/2 ounce Cointreau', u'aisle': u'?', u'name': u'cointreau', u'metaInformation': [], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.5, u'unit': u'ounce'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/08/drinking-in-season-blackberry-margarita-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the salt onto a plate in an even layer. Rub a slice of lime around the outside rim of the glass, then rotate the edge of the glass in the salt until the entire rim is covered in salt. Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'In the bottom of a cocktail shaker, muddle the blackberries until completely mashed.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}]}, {u'equipment': [], u'step': u'Add lime juice, tequila, Contreau, and agave nectar to taste. Fill shaker with ice and shake well for about 10 seconds.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Add 1 large ice cube to salt-rimmed serving glass. Using a mini fine-mesh strainer in addition to a cocktail strainer, pour the margarita into serving glass.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice cubes'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Garnish with a few blackberries on a skewer.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blackberries.jpg', u'id': 9042, u'name': u'blackberries'}]}], u'name': u''}], u'aggregateLikes': 589, u'instructions': u'Procedures                                                                              1                                                                            Pour the salt onto a plate in an even layer. Rub a slice of lime around the outside rim of the glass, then rotate the edge of the glass in the salt until the entire rim is covered in salt. Set aside.                                                                                                                            2                                                                            In the bottom of a cocktail shaker, muddle the blackberries until completely mashed. Add lime juice, tequila, Contreau, and agave nectar to taste. Fill shaker with ice and shake well for about 10 seconds.                                                                                                                            3                                                                            Add 1 large ice cube to salt-rimmed serving glass. Using a mini fine-mesh strainer in addition to a cocktail strainer, pour the margarita into serving glass. Garnish with a few blackberries on a skewer.', u'spoonacularSourceUrl': u'https://spoonacular.com/drinking-in-season-blackberry-margarita-206364', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}