{u'recipes': [{u'sourceName': u'Soup Addict', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/557777-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 557777, u'veryPopular': False, u'lowFodmap': False, u'title': u'Wild Mushroom, Chestnut & Sausage Stuffing', u'diets': [u'dairy free'], u'preparationMinutes': 120, u'pricePerServing': 233.08, u'creditText': u'Soup Addict', u'extendedIngredients': [{u'originalString': u'2 celery stalks, diced', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'1 1/2 cups roasted chestnuts, peeled and roughly chopped* (or substitute with prepared jarred)', u'aisle': u'Produce', u'name': u'chestnuts', u'metaInformation': [u'with prepared jarred)', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chestnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12098, u'unit': u'cups'}, {u'originalString': u'1 pound loaf French bread, cut into 1/2-inch cubes', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 18029, u'unit': u'pound'}, {u'originalString': u'3 tablespoons chopped fresh flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoons chopped fresh sage', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'tablespoons'}, {u'originalString': u'3 cups low-sodium chicken stock', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken stock', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 1006970, u'unit': u'cups'}, {u'originalString': u'1 ounce dried wild mushrooms (porcinis and morels are delicious)', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'wild', u'dried', u'(porcinis and morels are delicious)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounce'}, {u'originalString': u'3 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 portobello mushroom, stem and gills removed, chopped', u'aisle': u'Produce', u'name': u'portobello mushroom cap', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11265, u'unit': u''}, {u'originalString': u'Salt and freshly ground pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'12 ounces mild fresh Italian sausage, casings removed', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'fresh', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1017063, u'unit': u'ounces'}, {u'originalString': u'1 cup very hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 sweet yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'sweet', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://soupaddict.com/2011/11/wild-mushroom-chestnut-sausage-stuffing/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, combine the dried mushrooms and hot water and soak for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Drain the mushrooms, reserving the liquid. Roughly chop the mushrooms and set aside. Preheat an oven to 375\xb0F. In a bowl, combine the bread cubes and 1 tablespoon olive oil and stir to coat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Spread out the bread cubes on a baking sheet and toast in the oven until golden and crunchy, 15 to 20 minutes, stirring halfway through.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat the chicken stock and reserved mushroom stock in a small sauce pan over medium-low.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a 4 to 5 quart dutch oven or large oven proof saute pan over medium.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add sausage and cook thoroughly, breaking up any clumps with a spoon or spatula.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Remove to a paper-towel lined plate.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add 2 tablespoons olive oil and heat until shimmering.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion, celery and portobello mushrooms,  and saute, stirring often, until onions are soft and translucent and mushroom give off their liquid.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'id': 11265, u'name': u'portobello mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the reconstituted mushrooms, chestnuts and sausage and cook for 2 minutes more (just to reheat).', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chestnuts.jpg', u'id': 12098, u'name': u'chestnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the bread cubes to the pan and turn everything over with a spatula several times to mix.  Begin adding the warmed stock in half cup amounts, gently turning the mixture over with each addition.  You want the bread cubes to be moist, but not soggy, and there should be standing liquid in the bottom of the pan (you might not use all of the liquid).  Season well with salt and pepper.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake until crispy and golden, about 1 hour.  Check periodically, and cover the dish with aluminum foil if the bread pieces on top get too dark.  You’ll want to cook for the full hour, though, to make sure the stuffing is not soggy.Make-ahead tip: Assemble the dressing up to 1 day in advance, but do not bake. Cover and refrigerate.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the refrigerator 1 hour before baking.', u'number': 13, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 31, u'instructions': u'In a bowl, combine the dried mushrooms and hot water and soak for 20 minutes.  Drain the mushrooms, reserving the liquid. Roughly chop the mushrooms and set aside. Preheat an oven to 375\xb0F. In a bowl, combine the bread cubes and 1 tablespoon olive oil and stir to coat. Spread out the bread cubes on a baking sheet and toast in the oven until golden and crunchy, 15 to 20 minutes, stirring halfway through.Heat the chicken stock and reserved mushroom stock in a small sauce pan over medium-low.Heat a 4 to 5 quart dutch oven or large oven proof saute pan over medium.  Add sausage and cook thoroughly, breaking up any clumps with a spoon or spatula.  Remove to a paper-towel lined plate.  Add 2 tablespoons olive oil and heat until shimmering. Add the onion, celery and portobello mushrooms,  and saute, stirring often, until onions are soft and translucent and mushroom give off their liquid.  Add the reconstituted mushrooms, chestnuts and sausage and cook for 2 minutes more (just to reheat).Add the bread cubes to the pan and turn everything over with a spatula several times to mix.  Begin adding the warmed stock in half cup amounts, gently turning the mixture over with each addition.  You want the bread cubes to be moist, but not soggy, and there should be standing liquid in the bottom of the pan (you might not use all of the liquid).  Season well with salt and pepper.Bake until crispy and golden, about 1 hour.  Check periodically, and cover the dish with aluminum foil if the bread pieces on top get too dark.  You’ll want to cook for the full hour, though, to make sure the stuffing is not soggy.Make-ahead tip: Assemble the dressing up to 1 day in advance, but do not bake. Cover and refrigerate. Remove from the refrigerator 1 hour before baking.', u'spoonacularSourceUrl': u'https://spoonacular.com/wild-mushroom-chestnut-sausage-stuffing-557777', u'dishTypes': [u'side dish'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}