{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/328034-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 328034, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Vegetables', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 401.95, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 bunch (1-pound) asparagus, trimmed', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'pound'}, {u'originalString': u'3 tablespoons balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoons'}, {u'originalString': u'12 cremini mushrooms', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11266, u'unit': u''}, {u'originalString': u'1 teaspoon chopped fresh basil leaves', u'aisle': u'Produce', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon finely chopped fresh rosemary leaves', u'aisle': u'Produce', u'name': u'fresh rosemary leaves', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'12 green onions, roots cut off', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'3 Japanese eggplant (12 ounces total), sliced lengthwise into 1/2-inch-thick rectangles', u'aisle': u'Produce', u'name': u'japanese eggplant', u'metaInformation': [u'sliced lengthwise into 1/2-inch-thick rectangles', u'(12 ounces total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10011209, u'unit': u''}, {u'originalString': u'1/4 cup plus 2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon chopped fresh Italian parsley leaves', u'aisle': u'Produce', u'name': u'parsley leaves', u'metaInformation': [u'fresh', u'italian', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'teaspoon'}, {u'originalString': u'3 red bell peppers, seeded and halved', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red', u'halved', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3 yellow squash (about 1 pound total), sliced lengthwise into 1/2-inch-thick rectangles', u'aisle': u'Produce', u'name': u'yellow squash', u'metaInformation': [u'yellow', u'sliced lengthwise into 1/2-inch-thick rectangles', u'( 1 pound total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11641, u'unit': u''}, {u'originalString': u'3 zucchini (about 12 ounces total), sliced lengthwise into 1/2-inch-thick rectangles', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'sliced lengthwise into 1/2-inch-thick rectangles', u'( 12 ounces total)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpeg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/grilled-vegetables-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}], u'step': u'Place a grill pan over medium-high heat or prepare the barbecue (medium-high heat).', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Brush the vegetables with 1/4 cup of the oil to coat lightly. Sprinkle the vegetables with salt and pepper. Working in batches, grill the vegetables until tender and lightly charred all over, about 8 to 10 minutes for the bell peppers; 7 minutes for the yellow squash, zucchini, eggplant, and mushrooms; 4 minutes for the asparagus and green onions. Arrange the vegetables on a platter. The key to getting those great grill marks is to not shift the vegetables too frequently once they've been placed on the hot grill.", u'length': {u'number': 19, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'id': 11641, u'name': u'yellow squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Meanwhile, whisk the remaining 2 tablespoons of oil, balsamic vinegar, garlic, parsley, basil, and rosemary in a small bowl to blend.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}, {u'equipment': [], u'step': u'Add salt and pepper to taste.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Drizzle the herb mixture over the vegetables.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the vegetables, warm or at room temperature.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 34, u'instructions': u"Watch how to make this recipe.                    Place a grill pan over medium-high heat or prepare the barbecue (medium-high heat). Brush the vegetables with 1/4 cup of the oil to coat lightly. Sprinkle the vegetables with salt and pepper. Working in batches, grill the vegetables until tender and lightly charred all over, about 8 to 10 minutes for the bell peppers; 7 minutes for the yellow squash, zucchini, eggplant, and mushrooms; 4 minutes for the asparagus and green onions. Arrange the vegetables on a platter. The key to getting those great grill marks is to not shift the vegetables too frequently once they've been placed on the hot grill.                          Meanwhile, whisk the remaining 2 tablespoons of oil, balsamic vinegar, garlic, parsley, basil, and rosemary in a small bowl to blend. Add salt and pepper to taste. Drizzle the herb mixture over the vegetables. Serve the vegetables, warm or at room temperature.", u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-vegetables-328034', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}