{u'recipes': [{u'sourceName': u'Mangia Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/496008-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 496008, u'veryPopular': False, u'lowFodmap': True, u'title': u'Broken Oven', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 19.93, u'creditText': u'Mangia Blog', u'extendedIngredients': [{u'originalString': u'\xbc c. cocoa nibs, optional', u'aisle': u'Health Foods;Gourmet', u'name': u'cocoa nibs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cacao-nibs.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 98846, u'unit': u'c'}, {u'originalString': u'1 t. coconut nectar', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u't'}, {u'originalString': u'\xbc c. coconut flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93747, u'unit': u'c'}, {u'originalString': u'\xbc c. ground flaxseed meal', u'aisle': u'Health Foods;Baking', u'name': u'flaxseed meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12220, u'unit': u'c'}, {u'originalString': u'2 T. pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'T'}, {u'originalString': u'\xbd t. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u't'}, {u'originalString': u'\xbc c. +1 t. unsalted, raw almond butter', u'aisle': u'?', u'name': u't.', u'metaInformation': [u'raw', u'unsalted'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'unit': u'c'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://mangiablog.com/2013/09/24/broken-oven/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Place all of the ingredients in a large mixing bowl and stir using a spatula until thoroughly mixed.Refrigerate the dough for 1 hour to firm.Once chilled, roll the dough into small balls.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Serve.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 250, u'instructions': u'Place all of the ingredients in a large mixing bowl and stir using a spatula until thoroughly mixed.Refrigerate the dough for 1 hour to firm.Once chilled, roll the dough into small balls.Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/broken-oven-496008', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 14, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}