{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/517715-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 517715, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mango, Black Bean & Goat Cheese Quesadilla', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 88.97, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'4 ounces canned black beans, drained & rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'canned', u'rinsed', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounces'}, {u'originalString': u'2 medium fat-free flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'fat-free', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10218364, u'unit': u''}, {u'originalString': u'2 ounces goat cheese, crumbled', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'1 mango, peeled & sliced into small pieces', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'small', u'peeled', u'sliced into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.recipegirl.com/2007/05/29/mango-black-bean-and-goat-cheese-quesadilla/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Coat both sides of tortillas with cooking spray.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place tortilla in hot skillet to brown. Flip tortilla and add cheese, mango and beans on half of the tortilla. Cook until tortilla browns. Fold over tortilla to cover ingredients, flip and cook the other side; remove tortilla to a cutting board.  Repeat with second tortilla.3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}, {u'equipment': [], u'step': u'Cut each tortilla into 4 wedges and serve immediately.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}], u'name': u''}], u'aggregateLikes': 217, u'instructions': u'1.  Coat both sides of tortillas with cooking spray. Place tortilla in hot skillet to brown. Flip tortilla and add cheese, mango and beans on half of the tortilla. Cook until tortilla browns. Fold over tortilla to cover ingredients, flip and cook the other side; remove tortilla to a cutting board.  Repeat with second tortilla.3.  Cut each tortilla into 4 wedges and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-black-bean-goat-cheese-quesadilla-517715', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}