{u'recipes': [{u'sourceName': u'Healthy Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/484008-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 484008, u'veryPopular': False, u'lowFodmap': True, u'title': u'Low Carb Microwave “Bread”', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'preparationMinutes': 1, u'pricePerServing': 47.21, u'creditText': u'Healthy Recipes', u'extendedIngredients': [{u'originalString': u'\xbc teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon coconut flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'coconut flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93747, u'unit': u'tablespoon'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tablespoon salted butter, melted and slightly cooled', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'salted butter', u'metaInformation': [u'salted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001001, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://healthyrecipesblogs.com/2014/04/17/low-carb-microwave-bread/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl, use a fork to mix the ingredients until very smooth.Using a spatula, transfer to a small pyrex bowl (mine measures 2 inches on the bottom and 4 inches at the top).Microwave on high for 90 seconds. Bread will puff up while "baking," then deflate. When done, it will look like a muffin. Make sure it appears set, otherwise microwave 30 more seconds (but 90 seconds should be enough, and overcooking can dry it up).Gently, with a small knife, loosen the bread edges and remove from the bowl onto a plate. Slice into two slices and top with your favorite toppings.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 148, u'instructions': u'In a medium bowl, use a fork to mix the ingredients until very smooth.Using a spatula, transfer to a small pyrex bowl (mine measures 2 inches on the bottom and 4 inches at the top).Microwave on high for 90 seconds. Bread will puff up while "baking," then deflate. When done, it will look like a muffin. Make sure it appears set, otherwise microwave 30 more seconds (but 90 seconds should be enough, and overcooking can dry it up).Gently, with a small knife, loosen the bread edges and remove from the bowl onto a plate. Slice into two slices and top with your favorite toppings.', u'spoonacularSourceUrl': u'https://spoonacular.com/low-carb-microwave-bread-484008', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 3, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}