{u'recipes': [{u'sourceName': u'Paleo Grubs', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/630963-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 630963, u'veryPopular': True, u'lowFodmap': False, u'title': u'Addictive & Healthy Paleo Nachos', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 408.0, u'creditText': u'Paleo Grubs', u'extendedIngredients': [{u'originalString': u'12 oz. canned diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned diced tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11531, u'unit': u'oz'}, {u'originalString': u'1 tbsp coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp fresh cilantro, chopped', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 green chili, diced', u'aisle': u'Produce', u'name': u'green chili', u'metaInformation': [u'diced', u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'2 tbsp green onions, chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tbsp'}, {u'originalString': u'1 lb. ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'1/2 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'2 cups guacamole', u'aisle': u'Refrigerated', u'name': u'guacamole', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1009037, u'unit': u'cups'}, {u'originalString': u'1-2 tbsp lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tbsp'}, {u'originalString': u'1/2 tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tsp smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'tsp'}, {u'originalString': u'3 large sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'1 tbsp tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tbsp'}, {u'originalString': u'2 medium tomatoes, diced and seeded', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'diced', u'medium', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 medium yellow onion, finely diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'medium', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://paleogrubs.com/nacho-recipe', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To make the sweet potato chips, preheat the oven to 375 degrees F. Peel the sweet potatoes and slice thinly, using either a mandolin or sharp knife. In a large bowl, toss them with coconut oil and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the chips in a single layer on a rimmed baking sheet covered with parchment paper.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the oven for 10 minutes, then flip the chips over and bake for another 10 minutes. For the last ten minutes, watch the chips closely and pull off any chips that start to brown, until all of the chips are cooked.While the potato chips are baking, start preparing the beef. Melt the coconut oil in a large skillet over medium heat.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the onion and chili to the pan and saut for 3-4 minutes until softened.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the ground beef and cook for 4-5 minutes, stirring regularly.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}]}, {u'equipment': [], u'step': u'Add the garlic, diced tomatoes, tomato paste, and remaining spices and stir well to combine. Bring the mixture to a simmer and then turn the heat down to medium-low. Cook, covered, for 20-25 minutes, stirring regularly.Stir the chopped tomatoes, lime juice, and cilantro into the beef mixture. Adjust salt and pepper to taste.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Remove from heat.To assemble the nachos, form a large circle with the sweet potato chips on a platter.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add the beef mixture into the middle of the circle, and then top with guacamole and green onions.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}], u'name': u''}], u'aggregateLikes': 13243, u'instructions': u'To make the sweet potato chips, preheat the oven to 375 degrees F. Peel the sweet potatoes and slice thinly, using either a mandolin or sharp knife. In a large bowl, toss them with coconut oil and salt. Place the chips in a single layer on a rimmed baking sheet covered with parchment paper. Bake in the oven for 10 minutes, then flip the chips over and bake for another 10 minutes. For the last ten minutes, watch the chips closely and pull off any chips that start to brown, until all of the chips are cooked.While the potato chips are baking, start preparing the beef. Melt the coconut oil in a large skillet over medium heat. Add the onion and chili to the pan and saut for 3-4 minutes until softened. Add the ground beef and cook for 4-5 minutes, stirring regularly. Add the garlic, diced tomatoes, tomato paste, and remaining spices and stir well to combine. Bring the mixture to a simmer and then turn the heat down to medium-low. Cook, covered, for 20-25 minutes, stirring regularly.Stir the chopped tomatoes, lime juice, and cilantro into the beef mixture. Adjust salt and pepper to taste. Remove from heat.To assemble the nachos, form a large circle with the sweet potato chips on a platter. Add the beef mixture into the middle of the circle, and then top with guacamole and green onions.', u'spoonacularSourceUrl': u'https://spoonacular.com/addictive-healthy-paleo-nachos-630963', u'dishTypes': [u'fingerfood', u'antipasti', u'lunch', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u"hor d'oeuvre", u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}