{u'recipes': [{u'sourceName': u'Inspiralized', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/563824-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 563824, u'veryPopular': False, u'lowFodmap': False, u'title': u'Miso-Ponzu Zucchini Noodles with Tofu & Veggies', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 222.31, u'creditText': u'Inspiralized', u'extendedIngredients': [{u'originalString': u'1/2 tsp canola oil (optional)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'tsp'}, {u'originalString': u'1 carrot, peeled and julienned', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'julienned', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'cilantro leaves, to garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'leaves'}, {u'originalString': u'2 cups cubed extra-firm tofu', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'extra firm tofu', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10016162, u'unit': u'cups'}, {u'originalString': u'2 tsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tsp'}, {u'originalString': u'1 tbsp miso paste', u'aisle': u'Ethnic Foods', u'name': u'Miso Soybean Paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16112, u'unit': u'tbsp'}, {u'originalString': u'1/3 cup ponzu sauce', u'aisle': u'Ethnic Foods', u'name': u'ponzu sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93729, u'unit': u'cup'}, {u'originalString': u'1 large red bell peppers, thinly sliced', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red', u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 tbsp rice wine vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice wine vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tbsp'}, {u'originalString': u'16 snow peas, thinly sliced in thirds', u'aisle': u'Produce', u'name': u'snow peas', u'metaInformation': [u'sliced in thirds'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 16.0, u'consistency': u'solid', u'id': 11300, u'unit': u''}, {u'originalString': u'soy sauce to drizzle', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'servings'}, {u'originalString': u'1 tsp white sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'white sesame seeds', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tsp'}, {u'originalString': u'4 zucchinis, peeled, Blade C', u'aisle': u'Produce', u'name': u'zucchinis', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 25.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.inspiralized.com/2014/01/21/miso-ponzu-zucchini-noodles-with-tofu-veggies/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 375 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the cubed tofu in a bowl and pour soy sauce on top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Mix together and then lay out the cubes on a baking tray coated with cooking spray.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Bake for 10 minutes, flip over and bake another 10 minutes. When done, take out and set aside.While the tofu is baking, prepare all of your veggies. Throw all of the veggies and the zucchini noodles into a bowl and toss to combine. When the tofu is ready, add in the tofu, toss to combine and serve in four bowls garnished with sesame seeds and cilantro leaves.If you aren't serving immediately, save in a container with garnishes and place in the refrigerator. It tastes best as a cold noodle salad!", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zoodles.jpg', u'id': 10111477, u'name': u'zucchini noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 271, u'instructions': u"Preheat the oven to 375 degrees. Place the cubed tofu in a bowl and pour soy sauce on top. Mix together and then lay out the cubes on a baking tray coated with cooking spray. Bake for 10 minutes, flip over and bake another 10 minutes. When done, take out and set aside.While the tofu is baking, prepare all of your veggies. Throw all of the veggies and the zucchini noodles into a bowl and toss to combine. When the tofu is ready, add in the tofu, toss to combine and serve in four bowls garnished with sesame seeds and cilantro leaves.If you aren't serving immediately, save in a container with garnishes and place in the refrigerator. It tastes best as a cold noodle salad!", u'spoonacularSourceUrl': u'https://spoonacular.com/miso-ponzu-zucchini-noodles-with-tofu-veggies-563824', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}