{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/207165-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 207165, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dinner Tonight: Pan-Roasted Whole Fish with Olives', u'diets': [u'dairy free', u'pescatarian'], u'pricePerServing': 838.63, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 cup black olives (preferably Gaeta), pitted and coarsely chopped', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'pitted', u'coarsely chopped', u'(preferably Gaeta)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'cup'}, {u'originalString': u'3 tablespoons capers, preferably salt-packed and rinsed if so', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'rinsed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoons'}, {u'originalString': u'1 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1/4 cup minced flat-leaf parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'flat-leaf parsley', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'flour for dredging', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'for dredging'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'servings'}, {u'originalString': u'5 lemons, 3 of them zested and segmented', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'6 tablespoons olive oil, plus more for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'plus more for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'flaky sea salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 3-4 pound whole fish, such as snapper, scored with a sharp knife three times on each side', u'aisle': u'Seafood', u'name': u'whole fish', u'metaInformation': [u'whole', u' such as snapper, scored with a sharp knife three times on each side'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 10115261, u'unit': u'pound'}], u'healthScore': 55.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/02/pan-roasted-whole-fish-with-olives-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 450 degreed Fahrenheit.  Dredge fish in flour on both sides and shake off excess.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a heavy, oven-proof skillet large enough to hold the fish over medium-high heat until just smoking.  Lay fish carefully in the pan and cook without touching until golden brown.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Turn fish over carefully and add olives, capers, lemon zest and segments, juice from remaining lemons, and wine.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Transfer skillet to oven. Roast fish until fish is just cooked through, 10-15 minutes depending on thickness.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to rest at least 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve whole fish tableside or fillet onto plates.  Top with parsley, flaky salt, and a drizzle of olive oil.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Proverb Pinot Grigio Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Luminous pear and apple notes animated with aromas of lime and lemon.', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 30, u'instructions': u'Procedures                                                                              1                                                                            Preheat oven to 450 degreed Fahrenheit.  Dredge fish in flour on both sides and shake off excess.  Heat olive oil in a heavy, oven-proof skillet large enough to hold the fish over medium-high heat until just smoking.  Lay fish carefully in the pan and cook without touching until golden brown.                                                                                                                             2                                                                            Turn fish over carefully and add olives, capers, lemon zest and segments, juice from remaining lemons, and wine.                                                                                                                             3                                                                            Transfer skillet to oven. Roast fish until fish is just cooked through, 10-15 minutes depending on thickness.  Remove from oven and allow to rest at least 5 minutes.                                                                                                                            4                                                                            Serve whole fish tableside or fillet onto plates.  Top with parsley, flaky salt, and a drizzle of olive oil.  Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-tonight-pan-roasted-whole-fish-with-olives-207165', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}