{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/929259-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 929259, u'veryPopular': True, u'lowFodmap': False, u'title': u'Corn and Cheese Chowder', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 120.01, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 tablespoons (1/2 stick) butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'(1/2 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 whole onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'whole', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 slices bacon, cut into pieces', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 3.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'3 whole bell peppers, finely diced (red, yellow, orange)', u'aisle': u'Produce', u'name': u'yellow bell peppers', u'metaInformation': [u'diced', u'whole', u'red', u'yellow', u'finely', u'(, , orange)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}, {u'originalString': u'5 ears corn, kernels sliced off', u'aisle': u'Produce', u'name': u'ears corn', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'1/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'3 cups chicken stock or broth', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'2 cups half-and-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'1 heaping cup grated Monterey Jack', u'aisle': u'Cheese', u'name': u'monterey jack', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'1 heaping cup grated pepper Jack', u'aisle': u'Cheese', u'name': u'pepper jack', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper-jack-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1025, u'unit': u'cup'}, {u'originalString': u'1/3 cup sliced green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'serving'}, {u'originalString': u'12 bread bowls, hollowed out', u'aisle': u'Bread', u'name': u'bread bowls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-bowl.png', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 99169, u'unit': u''}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/corn-and-cheese-chowder-recipe-2042574', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a large pot, melt the butter over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the onions and cook for a couple of minutes.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the bacon and cook for another minute or so, and then add the bell peppers and cook for a couple of minutes. Finally, add the corn and cook for a minute.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Sprinkle the flour evenly over the top and stir to combine.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Pour in the chicken stock and stir well. Allow this to thicken for 3 or 4 minutes, and then reduce the heat to low. Stir in the half-and-half, and then cover and allow to simmer and thicken for 15 minutes or so.', u'length': {u'number': 19, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [], u'step': u'Stir in the cheeses and green onions. When the cheese is melted and the soup is hot, check seasonings.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add salt and pepper as needed. Ladle into the bread bowls and serve immediately.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bread-bowl.png', u'id': 99169, u'name': u'bread bowls'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Riesling, and Sauvignon Blanc are great choices for Chowder. Chowder can benefit from a crisp white to cut through the rich, creamy broth - or you can go big or go home with a rich, buttery chardonnay. The District 7 Estate Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'riesling', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 775, u'instructions': u'Watch how to make this recipe.                    In a large pot, melt the butter over medium-high heat. Add the onions and cook for a couple of minutes. Add the bacon and cook for another minute or so, and then add the bell peppers and cook for a couple of minutes. Finally, add the corn and cook for a minute.                          Sprinkle the flour evenly over the top and stir to combine. Pour in the chicken stock and stir well. Allow this to thicken for 3 or 4 minutes, and then reduce the heat to low. Stir in the half-and-half, and then cover and allow to simmer and thicken for 15 minutes or so.                          Stir in the cheeses and green onions. When the cheese is melted and the soup is hot, check seasonings. Add salt and pepper as needed. Ladle into the bread bowls and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/corn-and-cheese-chowder-929259', u'dishTypes': [u'soup'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}