{u'recipes': [{u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/608333-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 608333, u'veryPopular': False, u'lowFodmap': False, u'title': u'Meatball Pizza', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 144.15, u'extendedIngredients': [{u'originalString': u'1 tablespoon freshly chopped basil (optional)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'tablespoon'}, {u'originalString': u'2 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'3 1/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'4 cups freshly shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 1026, u'unit': u'cups'}, {u'originalString': u'2 tablespoon olive oil plus additional for coating the bowl', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for coating the bowl'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 cup pizza sauce (homemade or your favorite store bought brand)', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'homemade', u'store bought', u'your favorite', u'( or brand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'1 teaspoon teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'3/4 pound store bought frozen beef or turkey meatballs thawed or homemade, sliced in half', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'frozen', u'homemade', u'thawed', u'store bought', u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 5165, u'unit': u'pound'}, {u'originalString': u'1 cup warm water (make sure it is not hot.)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(make sure it is not hot.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'2 teaspoons yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.MotherThyme.com/2014/08/meatball-pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a large mixing bowl combine warm water, yeast and sugar.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Let sit for about 5-10 minutes until yeast proofs (it will be nice and bubbly).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add oil, flour,and salt. Using a dough hook attachment, mix ingredients on medium speed for about 5 or 6 minutes until dough comes together and forms a ball.Lightly oil a large bowl.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add the dough and coat with olive oil.  Cover bowl with plastic wrap and let dough rise (double in size) for an hour.  After dough has doubled in size either freeze ball or if ready to use, punch dough down and roll out.Preheat oven at 400 degrees.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Roll dough out on a clean surface using a rolling pin until dough is even.  Spray 16-inch pizza pan with cooking spray.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place on pan.  In a small bowl mix cream cheese, mayonnaise and Italian seasoning.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [], u'step': u'Spread on top of crust. Top with pizza sauce, cheese and meatballs.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 18 minutes or until cheese is melted and crust is golden brown.Sprinkle with basil and let sit for 4 minutes and serve.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Story Winery, Sangiovese, Estate, Shenandoah Valley with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Aromas of raspberry, cherry, pie crust, tobacco and oak greet the nose. Dark cherries and raspberry predominate the palate with mild tannins and nice acidity. The finish is gentle and lasting Enjoy!', u'title': u'Story Winery, Sangiovese, Estate, Shenandoah Valley', u'price': u'$19.0', u'id': 469504, u'link': u'https://www.amazon.com/Story-Winery-Sangiovese-California-Shenandoah/dp/B00NMXHFNC', u'imageUrl': u'https://spoonacular.com/productImages/469504-312x231.jpg'}]}, u'aggregateLikes': 94, u'instructions': u'In a large mixing bowl combine warm water, yeast and sugar.  Let sit for about 5-10 minutes until yeast proofs (it will be nice and bubbly).  Add oil, flour,and salt. Using a dough hook attachment, mix ingredients on medium speed for about 5 or 6 minutes until dough comes together and forms a ball.Lightly oil a large bowl.  Add the dough and coat with olive oil.  Cover bowl with plastic wrap and let dough rise (double in size) for an hour.  After dough has doubled in size either freeze ball or if ready to use, punch dough down and roll out.Preheat oven at 400 degrees.Roll dough out on a clean surface using a rolling pin until dough is even.  Spray 16-inch pizza pan with cooking spray.  Place on pan.  In a small bowl mix cream cheese, mayonnaise and Italian seasoning.  Spread on top of crust. Top with pizza sauce, cheese and meatballs.      Bake in preheated oven for 18 minutes or until cheese is melted and crust is golden brown.Sprinkle with basil and let sit for 4 minutes and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatball-pizza-608333', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 93, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}