{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/552906-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 552906, u'veryPopular': False, u'lowFodmap': False, u'title': u'{Not Quite} Chichi’s Seafood Enchiladas', u'diets': [u'pescatarian'], u'preparationMinutes': 30, u'pricePerServing': 87.23, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'3 Tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'1 teaspoon powdered Chimayo chiles (or cayenne, more or less to taste)', u'aisle': u'Produce', u'name': u'chiles', u'metaInformation': [u'to taste', u'(or cayenne, more or less )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u'teaspoon'}, {u'originalString': u'2 Tablespoons fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'Tablespoons'}, {u'originalString': u'1/2 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'10 small (6-inch) flour tortillas, warmed', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'warmed', u'small', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'6-inchs', u'unitShort': u'6-inch', u'amount': 10.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'6-inch'}, {u'originalString': u'3 1/2 cups low-fat milk (I used 1%)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'1%', u'low-fat', u'(I used )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'liquid', u'id': 1174, u'unit': u'cups'}, {u'originalString': u'12 - 15 oz. mixed chopped cooked seafood (or leftover crab & spinach stuffed fish fillets)', u'aisle': u'Canned and Jarred', u'name': u'seafood stock', u'metaInformation': [u'mixed', u'leftover', u'cooked', u'chopped', u'(or crab & spinach stuffed fish fillets)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 6963, u'unit': u'oz'}, {u'originalString': u'1/2 cup of the sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'6 oz. shredded Italian blend of cheeses', u'aisle': u'Spices and Seasonings', u'name': u'spice blend', u'metaInformation': [u'shredded', u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1032027, u'unit': u'oz'}, {u'originalString': u'1 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/not-quite-chichis-seafood-enchiladas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425 F. Spray a casserole pan with cooking spray.Melt the butter in a medium saucepan over medium heat, then add the flour. Stir and cook for about 5 minutes or until the mixture smells nutty and starts to brown a bit.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the powdered chili and fish sauce and stir to mix. Slowly add the milk, then the wine, stirring while adding. Cook and stir until the sauce is thickened, about 5 - 10 minutes.Chop up the seafood and mix it with 1/2 cup of the sauce. Take a tortilla and spoon a good amount of this mixture down the center, then fold it over the seafood and place in the prepared pan. Repeat with the rest of the tortillas until you run out of filling or tortillas.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [], u'step': u'Pour the rest of the sauce over the enchiladas, then top with the shredded cheese.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 425 for 12 - 15 minutes or until the cheese is melted and the sauce is hot and bubbly.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish and serve immediately while still hot. (Although they do reheat very nicely.)', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Enchilada. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Siduri Sta. Rita Hills Pinot Noir with a 4.2 out of 5 star rating seems like a good match. It costs about 33 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The 2014 Sta. Rita Hills Pinot Noir is a blend of fruit from the John Sebastiano, Clos Pepe, Cargasacchi, and Lindley Vineyards. The actual blend is 64% John Sebastiano Vineyard Pinot Noir, 22% Clos Pepe, 9% Lindley, and 6% Cargasacchi. Clonally, this wine is a blend of 8 different clones which also provides for a wide range of flavors within one wine. The 2014 Pinot Noir Sta. Rita Hills should be a classic expression of the region, showing lots of spice, red fruit and dried soils aromas and flavors. Balanced, polished and elegant with plenty of fruit, it should certainly be an outstanding wine, and at the price, is an excellent value in Pinot Noir.', u'title': u'Siduri Sta. Rita Hills Pinot Noir', u'price': u'$32.99', u'id': 454206, u'link': u'https://www.wine.com/product/siduri-sta-rita-hills-pinot-noir-2014/168102', u'imageUrl': u'https://spoonacular.com/productImages/454206-312x231.jpg'}]}, u'aggregateLikes': 260, u'instructions': u'Preheat the oven to 425 F. Spray a casserole pan with cooking spray.Melt the butter in a medium saucepan over medium heat, then add the flour. Stir and cook for about 5 minutes or until the mixture smells nutty and starts to brown a bit. Add the powdered chili and fish sauce and stir to mix. Slowly add the milk, then the wine, stirring while adding. Cook and stir until the sauce is thickened, about 5 - 10 minutes.Chop up the seafood and mix it with 1/2 cup of the sauce. Take a tortilla and spoon a good amount of this mixture down the center, then fold it over the seafood and place in the prepared pan. Repeat with the rest of the tortillas until you run out of filling or tortillas.Pour the rest of the sauce over the enchiladas, then top with the shredded cheese. Bake at 425 for 12 - 15 minutes or until the cheese is melted and the sauce is hot and bubbly.Garnish and serve immediately while still hot. (Although they do reheat very nicely.)', u'spoonacularSourceUrl': u'https://spoonacular.com/not-quite-chichis-seafood-enchiladas-552906', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}