{u'recipes': [{u'sourceName': u'Dinner Mom', u'cuisines': [u'spanish', u'european'], u'image': u'https://spoonacular.com/recipeImages/593820-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 593820, u'veryPopular': True, u'lowFodmap': False, u'title': u'Couscous Paella with Shrimp for #WeekdaySupper', u'diets': [u'dairy free'], u'pricePerServing': 476.99, u'creditText': u'Dinner Mom', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup Chicken Broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'1 box (7-10 ounces) Couscous', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'couscous', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 20028, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon Dried Thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'3 Garlic Cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon Ground Turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'1 Tablespoon Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoon'}, {u'originalString': u'1 cup Onion, diced (about 1 medium onion)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium', u'( 1 onion)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 box (10 ounces) frozen Peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11304, u'unit': u'ounces'}, {u'originalString': u'1 Sweet Red Pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'sweet', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/2 teaspoon Red Pepper Flakes (if you want some extra heat!)', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'(if you want some extra heat!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 pounds medium Shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 15152, u'unit': u'pounds'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 Sweet Yellow Pepper, diced', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'diced', u'sweet', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.dinner-mom.com/one-dish-couscous-paella-with-shrimp/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Heat oil over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add onion, peppers and garlic to pan and saute for about 5-8 minutes or until the vegetables are tender.Stir in remaining ingredients, except for couscous.Raise heat and bring mixture to a very low boil.Reduce to medium-low heat and simmer for 8-10 minutes until shrimp turn pink, stirring occasionally.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Remove from heat and stir in uncooked couscous. Cover with lid or aluminum foil and let stand for 5 minutes. Fluff with fork.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Tempranillo, Albarino, and Grenache are great choices for Paella. When pairing wine with Spanish dishes, why not follow the rule 'what grows together goes together'? We recommend albari\xf1o for white wine and garnachan and tempranillo for red. One wine you could try is Orgasmic Wine Company Oh! Orgasmic , Tempranillo. It has 5 out of 5 stars and a bottle costs about 80 dollars.", u'pairedWines': [u'tempranillo', u'albarino', u'grenache'], u'productMatches': [{u'description': u'Hints of tobacco and shows off subtle earthiness. Dark cherry on the nose invites the first taste of this popular varietal. Spice and the suggestion of leather give this a grip that leads you to appreciate the medium tannins and lingering finish. At Naked Winery, we are on a mission to cut the divorce rate by encouraging couples to share a glass of wine nightly. We "Aim to Tease" with labels are just a bit risqu\xe9 because we believe the experience surrounding wine should be fun. Set the mood for fun and romance with premium wines, exotic brands and provocative back labels. Get Uncorked\xae and enjoy what life unexpectedly brings you.', u'title': u'Orgasmic Wine Company Oh! Orgasmic , Tempranillo', u'price': u'$80.0', u'id': 429968, u'link': u'https://www.amazon.com/Orgasmic-Wine-Company-Washington-Tempranillo/dp/B013KDWX7G', u'imageUrl': u'https://spoonacular.com/productImages/429968-312x231.jpg'}]}, u'aggregateLikes': 383, u'instructions': u'Heat oil over medium-high heat.Add onion, peppers and garlic to pan and saute for about 5-8 minutes or until the vegetables are tender.Stir in remaining ingredients, except for couscous.Raise heat and bring mixture to a very low boil.Reduce to medium-low heat and simmer for 8-10 minutes until shrimp turn pink, stirring occasionally.Remove from heat and stir in uncooked couscous. Cover with lid or aluminum foil and let stand for 5 minutes. Fluff with fork.', u'spoonacularSourceUrl': u'https://spoonacular.com/couscous-paella-with-shrimp-for-weekdaysupper-593820', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}