{u'recipes': [{u'sourceName': u'Simple Nourished Living', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/525164-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 525164, u'veryPopular': True, u'lowFodmap': False, u'title': u'Thai Peanut Noodles with Pork', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 130.8, u'creditText': u'Simple Nourished Living', u'extendedIngredients': [{u'originalString': u"1 cup Light Asian dressing (I used newman's own low fat sesame ginger)", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'asian toasted sesame dressing', u'metaInformation': [u'light', u'low fat', u"(I used newman's own sesame ginger)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-toasted-sesame-dressing.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4016, u'unit': u'cup'}, {u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'2 carrots, peeled and shredded', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'shredded', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'8 ounces angel hair pasta, cooked according to package directions and drained', u'aisle': u'Pasta and Rice', u'name': u'cooked angel hair pasta', u'metaInformation': [u'cooked', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angelhair.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10020421, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons fresh chopped cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 cup chopped green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'2 tablespoons peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 16098, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped peanuts, optional', u'aisle': u'Nuts;Savory Snacks', u'name': u'peanuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 16091, u'unit': u'tablespoons'}, {u'originalString': u'2 cooked pork chops, sliced into thin bite size pieces', u'aisle': u'Meat', u'name': u'pork chops', u'metaInformation': [u'cooked', u'sliced into thin bite size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10010062, u'unit': u''}, {u'originalString': u'1 red bell pepper, cut into thin strips', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'cut into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'\xbe teaspoon red pepper flakes (or to taste)', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'to taste', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoon'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://simple-nourished-living.com/2013/08/thai-peanut-noodles-with-pork/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the pieces of pork in a small bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add \xbd cup of the dressing and stir to coat the meat. Set aside.In another small bowl, whisk together the remaining \xbd cup of salad dressing, peanut butter, soy sauce and red pepper flakes until smooth. Set aside.In a large skillet, cook the carrot, green onions and red pepper in the oil about 5 minutes until the vegetables begin to soften.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the pork and cook, stirring occassionally until heated through. In a large serving bowl, toss together the angel hair, pork mixture, and peanut sauce until everything is well combined. Sprinkle with the cilantro and if desired, peanuts.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'id': 16091, u'name': u'peanuts'}]}], u'name': u''}], u'aggregateLikes': 475, u'instructions': u'Place the pieces of pork in a small bowl. Add \xbd cup of the dressing and stir to coat the meat. Set aside.In another small bowl, whisk together the remaining \xbd cup of salad dressing, peanut butter, soy sauce and red pepper flakes until smooth. Set aside.In a large skillet, cook the carrot, green onions and red pepper in the oil about 5 minutes until the vegetables begin to soften. Add the pork and cook, stirring occassionally until heated through. In a large serving bowl, toss together the angel hair, pork mixture, and peanut sauce until everything is well combined. Sprinkle with the cilantro and if desired, peanuts.', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-peanut-noodles-with-pork-525164', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}