{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/493863-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 493863, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Fresh Asparagus Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 20, u'pricePerServing': 213.34, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 pounds fresh asparagus, trimmed, peeled and coarsely chopped', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'fresh', u'trimmed', u'peeled', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11011, u'unit': u'pounds'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 carton (32 ounces) reduced-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon minced fresh tarragon', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh tarragon', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'1/2 teaspoon grated lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 large sweet onion, coarsely chopped (about 2 cups)', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'large', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/creamy-fresh-asparagus-soup', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a Dutch oven, heat butter over medium-high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add asparagus and onion; cook and stir 10-12 minutes or until asparagus is crisp-tender.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Add broth; bring to a boil. Reduce heat; simmer, covered, 6-8 minutes or until asparagus is tender.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}]}, {u'equipment': [], u'step': u'Remove soup from heat; cool slightly. Stir in lemon juice, tarragon, salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Process in batches in a blender until smooth.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with yogurt and lemon peel.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon peel'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 39, u'instructions': u'Directions                                                                                In a Dutch oven, heat butter over medium-high heat. Add asparagus and onion; cook and stir 10-12 minutes or until asparagus is crisp-tender.                                                                                           Add broth; bring to a boil. Reduce heat; simmer, covered, 6-8 minutes or until asparagus is tender. Remove soup from heat; cool slightly. Stir in lemon juice, tarragon, salt and pepper.                                                                                           Process in batches in a blender until smooth. Serve with yogurt and lemon peel.                                    Yield: 6 servings.                                                                                                                         Originally published as Creamy Fresh Asparagus Soup in  Taste of Home                                                                                                                                                                                                Nutritional Facts                                                                             1 cup with 2 teaspoons yogurt equals 91 calories, 5 g fat (3 g saturated fat), 13 mg cholesterol, 720 mg sodium, 9 g carbohydrate, 2 g fiber, 5 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-fresh-asparagus-soup-493863', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}