{u'recipes': [{u'sourceName': u'Macheesmo', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/537714-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 537714, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Hearty Granola', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 111.64, u'creditText': u'Macheesmo', u'extendedIngredients': [{u'originalString': u'1 Teaspoon Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Teaspoon'}, {u'originalString': u'1 cup dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1 cup golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9297, u'unit': u'cup'}, {u'originalString': u'1 cup honey.', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u"1 Teaspoon Ghirardelli's cocao powder", u'aisle': u'Spices and Seasonings', u'name': u'alum powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10118371, u'unit': u'Teaspoon'}, {u'originalString': u'6 cups rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'2 cups various nuts/seeds. I used 1/2 cup of each of the following: Sunflower seeds, flax seeds, chopped cashews, sliced almonds.', u'aisle': u'Savory Snacks', u'name': u'sunflower seeds', u'metaInformation': [u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12036, u'unit': u'cups'}], u'healthScore': 47.0, u'imageType': u'png', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.macheesmo.com/2008/12/homemade-hearty-granola/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Add all of your nuts and seeds to your rolled oats and mix it up really well. Some other options you could use include walnuts, pecans, peanuts, hazelnuts, Macadamias, pine nuts, pumpkin seeds, pistachios, and on and on and on.2) Then put in whatever spices you would like along with your sticky stuff. I chose cinnamon, coca powder, and honey. Again though, there are tons of options: anise, vanilla, allspice, nutmeg, poppy seed, maple syrup, or molasses just to name a few possibilities.3) Now for really the only hard part of this recipe: stirring. This stuff will be pretty thick and you want to make sure that all of your honey and spice is evenly distributed. Stir it for a few minutes to make sure it is well-combined. 4) Then pour out your mixture onto a baking sheet and spread it out to form one even layer. If you use the above recipe you will either need two baking sheets or to do it in batches. It's a lot.5)", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'rolled oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u"Bake granola at 350 degrees F. for somewhere between 25-30 minutes. STir it once halfway through and check it regularly after 20 minutes to make sure it doesn't burn.6) When it's done baking, stir in fruit and let cool completely. STore in an airtight container.", u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 30, u'instructions': u"Directions1) Add all of your nuts and seeds to your rolled oats and mix it up really well. Some other options you could use include walnuts, pecans, peanuts, hazelnuts, Macadamias, pine nuts, pumpkin seeds, pistachios, and on and on and on.2) Then put in whatever spices you would like along with your sticky stuff. I chose cinnamon, coca powder, and honey. Again though, there are tons of options: anise, vanilla, allspice, nutmeg, poppy seed, maple syrup, or molasses just to name a few possibilities.3) Now for really the only hard part of this recipe: stirring. This stuff will be pretty thick and you want to make sure that all of your honey and spice is evenly distributed. Stir it for a few minutes to make sure it is well-combined. 4) Then pour out your mixture onto a baking sheet and spread it out to form one even layer. If you use the above recipe you will either need two baking sheets or to do it in batches. It's a lot.5) Bake granola at 350 degrees F. for somewhere between 25-30 minutes. STir it once halfway through and check it regularly after 20 minutes to make sure it doesn't burn.6) When it's done baking, stir in fruit and let cool completely. STore in an airtight container.", u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-hearty-granola-537714', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}