{u'recipes': [{u'sourceName': u'Julies Eats and Treats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/519269-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 519269, u'veryPopular': True, u'lowFodmap': False, u'title': u'Peanut Butter Ritz Cookies', u'diets': [u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 20.21, u'creditText': u'Julies Eats and Treats', u'extendedIngredients': [{u'originalString': u'24 oz. chocolate/white almond bark', u'aisle': u'Baking', u'name': u'almond bark', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 98857, u'unit': u'oz'}, {u'originalString': u'100 round buttery salted crackers, such as Ritz', u'aisle': u'Savory Snacks', u'name': u'buttery round crackers', u'metaInformation': [u'salted', u' such as ritz'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 100.0, u'consistency': u'solid', u'id': 18621, u'unit': u''}, {u'originalString': u'1-1/2 c. creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10116098, u'unit': u'c'}], u'healthScore': 0.0, u'imageType': u'png', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.julieseatsandtreats.com/2012/12/peanut-butter-ritz-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Lay out wax paper to put finished cookies on. If you are in a hurry you can do this on cookie sheets so you can stick the cookies in the fridge/freezer to set up. Otherwise just lay the wax paper on your counter. It will only take about 20 minutes to set up on the counter.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u"Place about a 1/2 tablespoon of peanut butter on a cracker and spread out. Top with another cracker. Do this until all crackers are gone. Melt almond bark in a double boiler until all lumps are out. If you don't have a doubler boiler you can do this in the microwave, making sure to stir frequently so it doesn't scorch. It just doesn't harden up if you use the double boiler. Drop a sandwich cookie into the chocolate. Make sure it's covered, then remove with a fork. Drag fork along the edge of the double boiler to scrape of excess almond bark.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'id': 98857, u'name': u'almond bark'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 18621, u'name': u'crackers'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Place cookie on wax paper. Repeat until all cookies have been dipped.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place in container and store in air tight container. These also freeze great!', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}], u'step': u'Place wax paper between the layers of cookies.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 20487, u'instructions': u"Lay out wax paper to put finished cookies on. If you are in a hurry you can do this on cookie sheets so you can stick the cookies in the fridge/freezer to set up. Otherwise just lay the wax paper on your counter. It will only take about 20 minutes to set up on the counter. Place about a 1/2 tablespoon of peanut butter on a cracker and spread out. Top with another cracker. Do this until all crackers are gone. Melt almond bark in a double boiler until all lumps are out. If you don't have a doubler boiler you can do this in the microwave, making sure to stir frequently so it doesn't scorch. It just doesn't harden up if you use the double boiler. Drop a sandwich cookie into the chocolate. Make sure it's covered, then remove with a fork. Drag fork along the edge of the double boiler to scrape of excess almond bark. Place cookie on wax paper. Repeat until all cookies have been dipped. Place in container and store in air tight container. These also freeze great! Place wax paper between the layers of cookies.", u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-ritz-cookies-519269', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 50, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}