{u'recipes': [{u'sourceName': u'The Housewife in Training Files', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/556584-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 556584, u'veryPopular': False, u'lowFodmap': True, u'title': u'Caramelized Maple Butternut Squash and Prosciutto Crostini’s', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 79.79, u'creditText': u'The Housewife in Training Files', u'extendedIngredients': [{u'originalString': u'\xbd butternut squash', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'4 oz goat cheese', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'oz'}, {u'originalString': u'1-2 T maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'T'}, {u'originalString': u'3 oz prosciutto', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'oz'}, {u'originalString': u'Salt & Pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'10 slices, \xbd" thick, baguette', u'aisle': u'?', u'name': u'\xbd"', u'metaInformation': [u'thick'], u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 10.0, u'unit': u'slices'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://thehousewifeintrainingfiles.com/caramelized-maple-butternut-squash-prosciutto-crostinis/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees.To prepare butternut squash, peel skin and remove seeds from interior. Dice into \xbd inch cubes.Put squash onto pregreased, foil lined baking pan. Spray with olive oil spray and season with salt and pepper. Put into oven and roast for 25-30 minutes, or until soft and slightly charred.Meanwhile, take baguette slices and spray with olive oil.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place on foil lined baking dish and place in oven to crisp up. Once crisp on one side, flip and crisp on other. Keep an eye on them so they do not burn! They go quick!Lay prosciutto on foil lined baking dish; (I used the same pan when the bread was done) and place in oven to crisp up, 5 minuets about.In a blender, add cheese, cooked butternut squash and maple syrup. Puree and let blend for a few minutes to create a whipped texture. Taste and season with salt and pepper as desired. (Seasoning needed will depend on how heavily you seasoned the butternut squash.) To assemble, spread each crostini with the whipped butternut squash, then lay prosciutto crisp on top.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood can be paired with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Perrier-Jouet Belle Epoque. It has 4.4 out of 5 stars and a bottle costs about 129 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'The 1996 vintage was superb for the Champagne region, yielding ripe, balanced, clean fruit with excellent flavors. A blend of approximately half Chardonnay and half Pinot Noir this crystal bright, light-bodied Champagne is elegant and distinctive. Opening with aromas of fresh pineapple, lemon and white florals, warming into complex scents of pear. A rich bouquet of white fruits end in subtle notes of honey and vanilla. The bead is intense with brisk effervescence, swirling up into a generous and persistent mousse. It is a balanced, extremely refined wine that, if properly stored, should keep for years, especially if bottled in magnums or jeroboams.Beyond the toasts and ship launchings, Champagne has a place at every dinner table. The 1996 Fleur de Champagne pairs is the perfect wine to serve with smoked oysters, game hens, delicate Japanese fish dishes, Fettuccini Alfredo or risotto. After a patient search for a master glassmaker capable of reproducing a bottle with the 1902 Gall\xe9 design, Perrier Jou\xebt launched in 1969, its famous "flower bottle" with an arabesque design of anemones. The first bottles of Fleur de Champagne revealed a Champagne of vivacious delicacy, the epitome of the refined and engaging style of the Art Nouveau movement. Since then, it has been the signature Champagne of Perrier Jou\xebt and is considered one of the world\'s most celebrated Champagnes.', u'title': u'Perrier-Jouet Belle Epoque', u'price': u'$129.0', u'id': 433586, u'link': u'https://www.wine.com/product/perrier-jouet-belle-epoque-1996/7383', u'imageUrl': u'https://spoonacular.com/productImages/433586-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'Preheat oven to 350 degrees.To prepare butternut squash, peel skin and remove seeds from interior. Dice into \xbd inch cubes.Put squash onto pregreased, foil lined baking pan. Spray with olive oil spray and season with salt and pepper. Put into oven and roast for 25-30 minutes, or until soft and slightly charred.Meanwhile, take baguette slices and spray with olive oil. Place on foil lined baking dish and place in oven to crisp up. Once crisp on one side, flip and crisp on other. Keep an eye on them so they do not burn! They go quick!Lay prosciutto on foil lined baking dish; (I used the same pan when the bread was done) and place in oven to crisp up, 5 minuets about.In a blender, add cheese, cooked butternut squash and maple syrup. Puree and let blend for a few minutes to create a whipped texture. Taste and season with salt and pepper as desired. (Seasoning needed will depend on how heavily you seasoned the butternut squash.) To assemble, spread each crostini with the whipped butternut squash, then lay prosciutto crisp on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/caramelized-maple-butternut-squash-and-prosciutto-crostinis-556584', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}