{u'recipes': [{u'sourceName': u'Kitchen Confidante', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/496837-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 496837, u'veryPopular': True, u'lowFodmap': False, u'title': u'Custard Cake', u'diets': [], u'pricePerServing': 539.68, u'creditText': u'Kitchen Confidante', u'extendedIngredients': [{u'originalString': u'3 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'2 1/2 cups cake flour', u'aisle': u'Baking', u'name': u'cake flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 10020129, u'unit': u'cups'}, {u'originalString': u'1/2 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1 12-oz can condensed milk (fat free may be used)', u'aisle': u'Baking', u'name': u'condensed milk', u'metaInformation': [u'fat free', u'canned', u'( may be used)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}, {u'originalString': u'1/2 teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'Custard', u'aisle': u'Baking', u'name': u'custard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/custard.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 19170, u'unit': u'servings'}, {u'originalString': u'1 cup egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u'cup'}, {u'originalString': u'5 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 14-oz can evaporated milk', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1214, u'unit': u'oz'}, {u'originalString': u'1 cup granulated sugar (I prefer a fine baking sugar)', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'fine', u'(I prefer a baking sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 35.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://kitchenconfidante.com/turning-two-with-a-custard-cake-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 133, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat a clean, heavy duty small sauce pan over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add sugar and water, stir briefly\xa0justuntil sugar is dissolved, then allow to simmer (no more stirring!) until the sugar begins to caramelize and changes color to your desired shade of amber.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pour into baking pan, tilting so all sides get coated. Set aside.In a bowl, blend the egg yolks, eggs, evaporated and condensed milks and vanilla. Strain into the prepared baking pan and set side.Preheat the oven to 350\xb0F.Prepare the chiffon cake:Sift the flour, sugar, baking powder and salt into a mixing bowl. Make a well in the center and add, in order: oil, egg yolks and water. Beat with a spoon until smooth. In the bowl of an electric mixer, beat the egg whites and cream of tartar until they form stiff peaks.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the sugar and beat again. Power the egg yolk mixture in a thin stream over the egg whites, very gently folding with a spatula until the two are completely blended.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour the chiffon cake batter over the prepared custard and smooth the top with a spatula.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/custard.png', u'id': 19170, u'name': u'custard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for about one hour in a baine marie (water bath), until a toothpick inserted comes out clean when inserted in the center.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to sit for 15 minutes. Insert onto a serving dish/tray. Chill in the refrigerator and serve when nicely chilled.Enjoy, it is especially wonderful with a strong cup of coffee.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u'Prepare the custard'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Custard. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1797, u'instructions': u'Prepare the custard:Heat a clean, heavy duty small sauce pan over medium-high heat. Add sugar and water, stir briefly\xa0justuntil sugar is dissolved, then allow to simmer (no more stirring!) until the sugar begins to caramelize and changes color to your desired shade of amber. Pour into baking pan, tilting so all sides get coated. Set aside.In a bowl, blend the egg yolks, eggs, evaporated and condensed milks and vanilla. Strain into the prepared baking pan and set side.Preheat the oven to 350\xb0F.Prepare the chiffon cake:Sift the flour, sugar, baking powder and salt into a mixing bowl. Make a well in the center and add, in order: oil, egg yolks and water. Beat with a spoon until smooth. In the bowl of an electric mixer, beat the egg whites and cream of tartar until they form stiff peaks. Add the sugar and beat again. Power the egg yolk mixture in a thin stream over the egg whites, very gently folding with a spatula until the two are completely blended.Pour the chiffon cake batter over the prepared custard and smooth the top with a spatula.Bake for about one hour in a baine marie (water bath), until a toothpick inserted comes out clean when inserted in the center. Remove from oven and allow to sit for 15 minutes. Insert onto a serving dish/tray. Chill in the refrigerator and serve when nicely chilled.Enjoy, it is especially wonderful with a strong cup of coffee.', u'spoonacularSourceUrl': u'https://spoonacular.com/custard-cake-496837', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}