{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528834-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 528834, u'veryPopular': False, u'lowFodmap': False, u'title': u'30 Minute Rustic Tomato Sauce', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 34.17, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'5 leaves Sage, or 1 Tbsp Dried herb blend', u'aisle': u'Spices and Seasonings', u'name': u'dried sage', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage-dried.jpg', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 5.0, u'consistency': u'solid', u'id': 1002038, u'unit': u'leaves'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/4 cup Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1/2 large Onion, sliced very thinly', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'sliced very thinly'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Salt and Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 pound small tomatoes, cherry, heirloom, or grape', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'pound'}, {u'originalString': u'2 Tbsp Water, or Red or White Wine* if sauce needs thinning, or just because', u'aisle': u'?', u'name': u'just because', u'metaInformation': [u'white', u'red'], u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'unit': u'Tbsp'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://www.countrycleaver.com/2014/04/30-minute-rustic-tomato-sauce.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees. On a non-stick baking sheet, combine all ingredients.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle the olive oil over the top and toss to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in oven and bake for 15 minutes. Stir the vegetables half way through to ensure they cook evenly.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake an additional 10 minutes, or until the onions are golden brown and caramelized.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add 2/3 of the roasted vegetables to a food processor and pulse to combine until smooth. If the sauce is too thick, add in 2 Tbsp of water or red or white wine and pulse again until it reaches desired consistency.Stir in the other 1/3 of the roasted vegetables for added texture. If you prefer a less chunky sauce, add all the vegetables into the food processor for a smooth sauce.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately over your favorite prepared pasta or other vegetables.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 50, u'instructions': u'Preheat oven to 400 degrees. On a non-stick baking sheet, combine all ingredients. Drizzle the olive oil over the top and toss to combine. Place in oven and bake for 15 minutes. Stir the vegetables half way through to ensure they cook evenly. Bake an additional 10 minutes, or until the onions are golden brown and caramelized. Remove from the oven.Add 2/3 of the roasted vegetables to a food processor and pulse to combine until smooth. If the sauce is too thick, add in 2 Tbsp of water or red or white wine and pulse again until it reaches desired consistency.Stir in the other 1/3 of the roasted vegetables for added texture. If you prefer a less chunky sauce, add all the vegetables into the food processor for a smooth sauce.Serve immediately over your favorite prepared pasta or other vegetables.', u'spoonacularSourceUrl': u'https://spoonacular.com/30-minute-rustic-tomato-sauce-528834', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}