{u'recipes': [{u'sourceName': u'Jeanettes Healthy Living', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/763709-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 1, u'id': 763709, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rainbow Vegetable Wraps with Peanut Sauce', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 83.25, u'creditText': u'Jeanettes Healthy Living', u'extendedIngredients': [{u'originalString': u'6 large collard green leaves', u'aisle': u'Produce', u'name': u'collard leaves', u'metaInformation': [u'green', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/collard-greens.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11161, u'unit': u''}, {u'originalString': u'3 carrots, julienned', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'\xbd cup creamy peanut butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10116098, u'unit': u'cup'}, {u'originalString': u'\xbd English hot house cucumber, cut into thin strips', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'english', u'hot', u'cut into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'6 eight-inch whole grain or gluten-free tortillas', u'aisle': u'Pasta and Rice', u'name': u'grain blend', u'metaInformation': [u'gluten-free', u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-wild-uncooked.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10020088, u'unit': u''}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'1 mango, cut into strips', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'cut into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'24 mint leaves or 1 bunch cilantro (leaves only)', u'aisle': u'Produce', u'name': u'mint leaves', u'metaInformation': [u'(leaves only)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 2064, u'unit': u''}, {u'originalString': u'1 red bell pepper, julienned', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1\xbd cups shredded red cabbage', u'aisle': u'Produce', u'name': u'red cabbage', u'metaInformation': [u'shredded', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11112, u'unit': u'cups'}, {u'originalString': u'1 teaspoon rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon sriracha', u'aisle': u'Condiments', u'name': u'sriracha', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'1 yellow bell pepper, julienned', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'yellow', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 53.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://jeanetteshealthyliving.com/rainbow-vegetable-wraps-with-peanut-sauce/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Place peanut butter, soy sauce, sesame oil, rice vinegar, honey and sriracha in food processor and process until combined; drizzle in water and continue processing until smooth.Blanch collard green leaves in boiling water for 15 seconds; remove and place in ice water for a few minutes to cool. Dry leaves by placing on clean dish cloth or paper towels.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Cut out stems.Lay a tortilla on a flat surface.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place one blanched, trimmed collard green leaf on top.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Spread 2 tablespoons of peanut sauce on top. Lay strips of red and yellow bell peppers, carrots, cucumber, and mango down center of tortilla. Sprinkle  cup shredded red cabbage on top and lay 4 mint leaves or cilantro leaves on top. Tightly roll up wrap to enclose all the vegetables. Use a few toothpicks to secure the wrap. Repeat with remaining tortillas.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'id': 11951, u'name': u'yellow pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'id': 11112, u'name': u'red cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}, {u'equipment': [], u'step': u'Cut in half to serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 863, u'instructions': u'Place peanut butter, soy sauce, sesame oil, rice vinegar, honey and sriracha in food processor and process until combined; drizzle in water and continue processing until smooth.Blanch collard green leaves in boiling water for 15 seconds; remove and place in ice water for a few minutes to cool. Dry leaves by placing on clean dish cloth or paper towels. Cut out stems.Lay a tortilla on a flat surface. Place one blanched, trimmed collard green leaf on top. Spread 2 tablespoons of peanut sauce on top. Lay strips of red and yellow bell peppers, carrots, cucumber, and mango down center of tortilla. Sprinkle  cup shredded red cabbage on top and lay 4 mint leaves or cilantro leaves on top. Tightly roll up wrap to enclose all the vegetables. Use a few toothpicks to secure the wrap. Repeat with remaining tortillas. Cut in half to serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/rainbow-vegetable-wraps-with-peanut-sauce-763709', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 31, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}