{u'recipes': [{u'sourceName': u'Food Fanatic', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/830582-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 830582, u'veryPopular': False, u'lowFodmap': False, u'title': u'Thanksgiving Leftover Bites', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 82.03, u'creditText': u'Food Fanatic', u'extendedIngredients': [{u'originalString': u'1 avocado, peeled, pitted, and chopped', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'pitted', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'fresh chives, for garnish', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11156, u'unit': u'servings'}, {u'originalString': u'1 jalape\xf1o, seeded and diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 cup mashed potatoes, warm', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u'cup'}, {u'originalString': u'1/4 cup red wine, such as merlot', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red', u' such as merlot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14096, u'unit': u'cup'}, {u'originalString': u'1/2 pound shredded cooked turkey', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 5165, u'unit': u'pound'}, {u'originalString': u'1 cup cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole cranberry sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9081, u'unit': u'cup'}, {u'originalString': u'1/2 package wonton wrappers, trimmed into squares, 2 per sheet', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [u'trimmed', u'per sheet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'packages', u'unitShort': u'pkg', u'amount': 0.5, u'consistency': u'solid', u'id': 10018368, u'unit': u'package'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.foodfanatic.com/2016/11/thanksgiving-leftover-bites/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add the cut wonton wrappers to a baking sheet and spray with cooking spray.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wonton-wrappers.jpg', u'id': 10018368, u'name': u'wonton wrappers'}]}, {u'equipment': [], u'step': u'Bake for 5 to 7 minutes, until golden brown and crispy. Set aside.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add cranberry sauce to a small saucepan over medium-high heat, stirring occasionally to break the sauce up. After a few moments, add red wine to the saucepan and stir to combine. Once the sauce is smooth, remove from heat.To assemble the bites, spread 1 teaspoon of mashed potatoes onto each wontop chip. Top with a few pieces of roasted turkey.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [], u'step': u'Add avocado and diced jalapeno to the top of each. Finish with 1 teaspoon of cranberry sauce and garnish with a 1 to 1 1/2-inch piece of chive.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 18, u'instructions': u'Preheat oven to 350F.Add the cut wonton wrappers to a baking sheet and spray with cooking spray. Bake for 5 to 7 minutes, until golden brown and crispy. Set aside.Add cranberry sauce to a small saucepan over medium-high heat, stirring occasionally to break the sauce up. After a few moments, add red wine to the saucepan and stir to combine. Once the sauce is smooth, remove from heat.To assemble the bites, spread 1 teaspoon of mashed potatoes onto each wontop chip. Top with a few pieces of roasted turkey. Add avocado and diced jalapeno to the top of each. Finish with 1 teaspoon of cranberry sauce and garnish with a 1 to 1 1/2-inch piece of chive.', u'spoonacularSourceUrl': u'https://spoonacular.com/thanksgiving-leftover-bites-830582', u'dishTypes': [u'side dish'], u'occasions': [u'thanksgiving'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}