{u'recipes': [{u'sourceName': u"Can't Stay out of the Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/500166-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 500166, u'veryPopular': True, u'lowFodmap': False, u'title': u'Parmesan Crusted Chicken', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 187.15, u'creditText': u"Can't Stay out of the Kitchen", u'extendedIngredients': [{u'originalString': u'2 boneless chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1 tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1 tsp. lemon pepper', u'aisle': u'Spices and Seasonings', u'name': u'lemon pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012030, u'unit': u'tsp'}, {u'originalString': u'1 tsp. marjoram', u'aisle': u'Produce;Spices and Seasonings', u'name': u'marjoram', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2023, u'unit': u'tsp'}, {u'originalString': u'\xbe tsp. paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'1 tbsp. parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'\xbd cup Chobani Greek vanilla yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim vanilla greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 99033, u'unit': u'cup'}, {u'originalString': u'\xbd tsp. thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://cantstayoutofthekitchen.com/2013/09/16/parmesan-crusted-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/glass-baking-tray.jpg', u'id': 406921, u'name': u'glass baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Mix Greek yogurt, cheese and seasonings together in small mixing bowl.Spray a glass baking dish with olive oil cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place chicken breasts on the bottom of the dish.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Spread cheese mixture over top of the chicken breasts.Sprinkle bread crumbs evenly over top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}, {u'equipment': [], u'step': u'Bake at 425\xb0 for about 30-40 minutes until juices run clear when meat is pricked with a fork.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 989, u'instructions': u'Mix Greek yogurt, cheese and seasonings together in small mixing bowl.Spray a glass baking dish with olive oil cooking spray.Place chicken breasts on the bottom of the dish.Spread cheese mixture over top of the chicken breasts.Sprinkle bread crumbs evenly over top.Bake at 425\xb0 for about 30-40 minutes until juices run clear when meat is pricked with a fork.', u'spoonacularSourceUrl': u'https://spoonacular.com/parmesan-crusted-chicken-500166', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}