{u'recipes': [{u'sourceName': u'Foodie Crush', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532550-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532550, u'veryPopular': True, u'lowFodmap': False, u'title': u'Craving > Garlic Soba Noodles with Grilled Shrimp', u'diets': [u'dairy free', u'pescatarian'], u'pricePerServing': 289.79, u'creditText': u'Foodie Crush', u'extendedIngredients': [{u'originalString': u'8-10 brown mushrooms, sliced', u'aisle': u'Produce', u'name': u'brown mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11266, u'unit': u''}, {u'originalString': u'1/2 teaspoon dark sesame oil', u'aisle': u'Ethnic Foods', u'name': u'dark sesame oil', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1004058, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tablespoon ginger, chopped', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoon'}, {u'originalString': u'1 green onion, chopped for garnish', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/2 jalapeno, thinly sliced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'the juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 lime, quartered and sliced', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [u'sliced', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'1/4 cup ponzu sauce, found in the Asian aisle of most grocers', u'aisle': u'Ethnic Foods', u'name': u'ponzu sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93729, u'unit': u'cup'}, {u'originalString': u'1 shallot, thinly sliced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'3/4 pound medium shrimp, peeled and deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'medium', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'Garlic Soba Noodles with Grilled Shrimp', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'soba noodles', u'metaInformation': [u'with grilled shrimp'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 20114, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons grapeseed or vegetable oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup cliantro, chopped', u'aisle': u'?', u'name': u'cliantro', u'metaInformation': [u'chopped'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.foodiecrush.com/2012/03/craving-garlic-soba-noodles-with-grilled-shrimp/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a small bowl, combine all sauce ingredients and mix until sugar dissolves. Set aside.Fill a large pot 2/3 full of water and bring to a boil. Season water with 1 to 2 tablespoons of salt and add soba noodles. Cook for 5 minutes, stirring occasionally, until noodles are tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'id': 20114, u'name': u'soba noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}], u'step': u'Drain in colander, rinse well with cold water and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Heat 1 tablespoon oil in a skillet on medium-high heat until oil slithers about the pan and add garlic, shallots and ginger. Cook for 1-2 minutes, stirring frequently taking care that garlic doesn't burn. Reduce heat to medium, add mushrooms and cook for 5-7 minutes, stirring occasionally, until mushrooms are tender and shallots a bit crispy.", u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove from heat and let cool.Meanwhile, heat a skillet or grill over medium high heat and lightly coat with cooking spray.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Add remaining tablespoon of oil to shrimp, season with 1 teaspoon kosher salt and cook for 3 minutes on each side or until just opaque on the inside. Shrimp will continue to cook once taken off the heat so cook carefully or they'll become tough.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer noodles and mushroom mixture to a bowl, season with sauce mixture and combine. Plate noodles in mounds and top with grilled shrimp.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with cilantro, green onion and jalapeno slices.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 2069, u'instructions': u"In a small bowl, combine all sauce ingredients and mix until sugar dissolves. Set aside.Fill a large pot 2/3 full of water and bring to a boil. Season water with 1 to 2 tablespoons of salt and add soba noodles. Cook for 5 minutes, stirring occasionally, until noodles are tender. Drain in colander, rinse well with cold water and set aside.Heat 1 tablespoon oil in a skillet on medium-high heat until oil slithers about the pan and add garlic, shallots and ginger. Cook for 1-2 minutes, stirring frequently taking care that garlic doesn't burn. Reduce heat to medium, add mushrooms and cook for 5-7 minutes, stirring occasionally, until mushrooms are tender and shallots a bit crispy. Remove from heat and let cool.Meanwhile, heat a skillet or grill over medium high heat and lightly coat with cooking spray. Add remaining tablespoon of oil to shrimp, season with 1 teaspoon kosher salt and cook for 3 minutes on each side or until just opaque on the inside. Shrimp will continue to cook once taken off the heat so cook carefully or they'll become tough.Transfer noodles and mushroom mixture to a bowl, season with sauce mixture and combine. Plate noodles in mounds and top with grilled shrimp. Serve with cilantro, green onion and jalapeno slices.", u'spoonacularSourceUrl': u'https://spoonacular.com/craving-garlic-soba-noodles-with-grilled-shrimp-532550', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}