{u'recipes': [{u'sourceName': u'Steamy Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/602332-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 602332, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lamb Burgers with Brie and Quick Pickled Onions', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 371.51, u'creditText': u'Steamy Kitchen', u'extendedIngredients': [{u'originalString': u'8 ounces brie cheese, sliced', u'aisle': u'Cheese', u'name': u'brie cheese', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1006, u'unit': u'ounces'}, {u'originalString': u'4 burger buns', u'aisle': u'Bakery/Bread', u'name': u'burger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u''}, {u'originalString': u'1 1/2 pounds ground lamb', u'aisle': u'Meat', u'name': u'ground lamb', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 17224, u'unit': u'pounds'}, {u'originalString': u'1 red onion, very thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'very thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'4 slices of tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 11529, u'unit': u'slices'}, {u'originalString': u'1/4 cup vinegar (rice vinegar, cider vinegar white wine vinegar or red wine vinegar)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [u'white', u'red', u'(rice vinegar, cider vinegar wine vinegar or wine vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.steamykitchen.com/20818-lamb-burgers-recipe-brie-quick-pickled-red-onions-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Fill a small bowl with the vinegar, sugar plus 1/4 cup of water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add in the red onion slices and let sit at room temperature while you complete rest of recipe.2. Season the ground lamb with salt and pepper. Form into 4 equal sized patties.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'id': 17224, u'name': u'ground lamb'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat a grill pan over high heat. When hot, add in the patties. Grill for 2 minutes, then flip the patties. Turn the heat to medium and let cook for 5 minutes. Flip again and cook an additional 3-5 minutes, depending on doneness preference. During the last 30 seconds of cooking, add the brie cheese slices on top of each burger.  3.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brie.jpg', u'id': 1006, u'name': u'brie'}]}, {u'equipment': [], u'step': u'Serve the burgers with the quick pickled red onion, buns and tomato.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are great choices for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. The Ernesto Catena Padrillos Malbec with a 4.8 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'Ripe, concentrated dark fruit aromas with hints of chocolate, black cherry and red currant fruit flavors with notes of sweet spices, soft, supple tannins and balanced bright acidity.', u'title': u'Ernesto Catena Padrillos Malbec', u'price': u'$14.99', u'id': 438162, u'link': u'https://www.wine.com/product/ernesto-catena-padrillos-malbec-2013/134759', u'imageUrl': u'https://spoonacular.com/productImages/438162-312x231.jpg'}]}, u'aggregateLikes': 44, u'instructions': u'1. Fill a small bowl with the vinegar, sugar plus 1/4 cup of water. Add in the red onion slices and let sit at room temperature while you complete rest of recipe.2. Season the ground lamb with salt and pepper. Form into 4 equal sized patties. Heat a grill pan over high heat. When hot, add in the patties. Grill for 2 minutes, then flip the patties. Turn the heat to medium and let cook for 5 minutes. Flip again and cook an additional 3-5 minutes, depending on doneness preference. During the last 30 seconds of cooking, add the brie cheese slices on top of each burger.  3.  Serve the burgers with the quick pickled red onion, buns and tomato.', u'spoonacularSourceUrl': u'https://spoonacular.com/lamb-burgers-with-brie-and-quick-pickled-onions-602332', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}