{u'recipes': [{u'sourceName': u'Sweet Potato Chronicles', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/6736-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 6736, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fish Week: Easy & Delicious Tilapia', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 181.61, u'creditText': u'Sweet Potato Chronicles', u'extendedIngredients': [{u'originalString': u'1/2 tsp dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp dried tarragon', u'aisle': u'Produce', u'name': u'dried tarragon', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2041, u'unit': u'tsp'}, {u'originalString': u'4 farm-raised tilapia fillets', u'aisle': u'Seafood', u'name': u'farm raised catfish filet', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/catfish.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 15234, u'unit': u'fillet'}, {u'originalString': u'2 Tbsp of juice from one small lemon plus its zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsps low fat mayonnaise', u'aisle': u'Condiments', u'name': u'low fat mayonnaise', u'metaInformation': [u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4641, u'unit': u'Tbsps'}, {u'originalString': u'1/8 tsp onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'1/2 cup freshly grated Parmesan cheese, divided', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'divided', u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 Tbsps melted, unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'Tbsps'}, {u'originalString': u'2 Tbsps Greek-style yogurt or sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'sour', u'greek-style'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'Tbsps'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.sweetpotatochronicles.com/wordpress/2010/11/the-fastest-parmesan-tilapia/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Preheat broiler on low', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Combine1/4 cup parmesan cheese with the remaining ingredients. Coat fillets with mix and place in baking dish. Allow to marinate for 15 to 20 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Transfer fillets to foiled broiling tray. Spoon marinade over top of fillets and sprinkle with remaining parmesan cheese. Broil about 6 inches from heat until topping is lightly browned and fish easily flakes, about 5 to 8 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'aggregateLikes': 20, u'instructions': u'Preheat broiler on lowCombine1/4 cup parmesan cheese with the remaining ingredients. Coat fillets with mix and place in baking dish. Allow to marinate for 15 to 20 minutes. Transfer fillets to foiled broiling tray. Spoon marinade over top of fillets and sprinkle with remaining parmesan cheese. Broil about 6 inches from heat until topping is lightly browned and fish easily flakes, about 5 to 8 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/fish-week-easy-delicious-tilapia-6736', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 7, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}