{u'recipes': [{u'sourceName': u'Jo Cooks', u'cuisines': [u'european', u'eastern european'], u'image': u'https://spoonacular.com/recipeImages/559360-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 559360, u'veryPopular': True, u'lowFodmap': False, u'title': u'Romanian Meatball Soup (Ciorba de Perisoare)', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 83.79, u'creditText': u'Jo Cooks', u'extendedIngredients': [{u'originalString': u'1/4 cup of breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'2 carrots grated, or cut in very small pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated', u'small', u'cut in very  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 stalks of celery cut in very small pieces', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'small', u'cut in very  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 lb of ground meat (you can use chicken, pork, turkey, beef, whatever you prefer, you may even combine meat, such as beef and pork)', u'aisle': u'Meat', u'name': u'ground meat', u'metaInformation': [u' such as beef and pork)', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/4 cup of long grain rice', u'aisle': u'Pasta and Rice', u'name': u'long grain rice', u'metaInformation': [u'long grain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10220444, u'unit': u'cup'}, {u'originalString': u'2 tbsp of olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 small onion chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'parsley for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 tbsp of tomato paste or 1 cup of tomato juice', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tbsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://www.jocooks.com/soups/romanian-meatball-soup-ciorba-de-perisoare/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"To start this off it's very simple.", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Mix all the ingredients for the meatballs and start forming small meatballs about 1 inch in diameter, or even smaller, depends on how much patience you have. The smaller they are the cuter they look.In a big pot, heat the oil and then add the vegetables and fry until the onion is clear.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u"Add about 8 to 10 cups of water, you may even add beef or chicken broth to this, depending on the meat you're using. Wait for the soup to start boiling, then add the meatballs one at a time.Keep boiling, when the meatballs are done, they will rise to the top, add the the tomato juice or paste, lemon juice, salt and pepper and let the soup simmer on medium heat for about 20 minutes. Very slowly pour in the eggs in a steady stream. To make shreds, stir the egg rapidly in a clockwise direction for one minute. When the soup is done, add the parsley.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve this hot with a bit of sour cream.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 656, u'instructions': u"To start this off it's very simple. Mix all the ingredients for the meatballs and start forming small meatballs about 1 inch in diameter, or even smaller, depends on how much patience you have. The smaller they are the cuter they look.In a big pot, heat the oil and then add the vegetables and fry until the onion is clear.Add about 8 to 10 cups of water, you may even add beef or chicken broth to this, depending on the meat you're using. Wait for the soup to start boiling, then add the meatballs one at a time.Keep boiling, when the meatballs are done, they will rise to the top, add the the tomato juice or paste, lemon juice, salt and pepper and let the soup simmer on medium heat for about 20 minutes. Very slowly pour in the eggs in a steady stream. To make shreds, stir the egg rapidly in a clockwise direction for one minute. When the soup is done, add the parsley. Serve this hot with a bit of sour cream.", u'spoonacularSourceUrl': u'https://spoonacular.com/romanian-meatball-soup-ciorba-de-perisoare-559360', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}