{u'recipes': [{u'sourceName': u'Epicurious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/214385-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 214385, u'veryPopular': False, u'lowFodmap': False, u'title': u'Braised Endive with Ham and Gruy\xe8re', u'diets': [], u'pricePerServing': 493.84, u'creditText': u'Epicurious', u'extendedIngredients': [{u'originalString': u'8 large yellow Belgian endive, trimmed', u'aisle': u'Produce', u'name': u'belgian endive', u'metaInformation': [u'yellow', u'large', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicory.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11151, u'unit': u''}, {u'originalString': u'8 ounces thinly sliced Black Forest ham', u'aisle': u'Meat', u'name': u'black forest ham', u'metaInformation': [u'black', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-forest-ham.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 93756, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'8 ounces Gruy\xe8re cheese, shredded (1 2/3 cups)', u'aisle': u'Cheese', u'name': u'gruyere cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gruyere.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.6666666666666665, u'consistency': u'solid', u'id': 1023, u'unit': u'cups'}, {u'originalString': u'3 1/2 tablespoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon plus 1 teaspoon freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2/3 cup whole milk, warmed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole', u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.epicurious.com/recipes/food/views/Braised-Endive-with-Ham-and-Gruyere-368609', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'To cook the endive, combine the butter, sugar, salt, and 10 1/2 cups water in a large pot. Bring to a boil, then reduce the heat to maintain a steady simmer.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Add the endive, cover, and cook until very tender, about 45 minutes. A knife should be able to pierce through with no resistance. Use a slotted spoon to transfer the endive to paper towels. Reserve 1 1/4 cups cooking liquid. When cool enough to handle, squeeze out as much liquid as possible from the endive.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u"Wrap each endive with slices of ham. Arrange the endive in a shallow baking dish that holds them snugly; you don't want any space between the endive.", u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400\xb0F.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'To make the b\xe9chamel, melt the butter in a medium saucepan over medium-low heat until golden.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the flour and cook, whisking constantly, until the mixture smells nutty, about 2 minutes. Continue whisking and add the milk, then the reserved endive cooking liquid in a slow, steady stream. Bring the mixture to a boil while whisking. Continue whisking until thickened, about 5 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the nutmeg and pepper.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Pour the b\xe9chamel over the endive and spread to cover them evenly. Sprinkle the cheese evenly over the top. Set the dish on a rimmed baking sheet and bake until bubbly and golden brown on top, about 15 minutes. If you want the top more browned and crusty, broil for a minute or two after baking.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 58, u'instructions': u"Preparation                                                        To cook the endive, combine the butter, sugar, salt, and 10 1/2 cups water in a large pot. Bring to a boil, then reduce the heat to maintain a steady simmer. Add the endive, cover, and cook until very tender, about 45 minutes. A knife should be able to pierce through with no resistance. Use a slotted spoon to transfer the endive to paper towels. Reserve 1 1/4 cups cooking liquid. When cool enough to handle, squeeze out as much liquid as possible from the endive.                                                                 Wrap each endive with slices of ham. Arrange the endive in a shallow baking dish that holds them snugly; you don't want any space between the endive.                                                                Preheat the oven to 400\xb0F.                                                                To make the b\xe9chamel, melt the butter in a medium saucepan over medium-low heat until golden. Add the flour and cook, whisking constantly, until the mixture smells nutty, about 2 minutes. Continue whisking and add the milk, then the reserved endive cooking liquid in a slow, steady stream. Bring the mixture to a boil while whisking. Continue whisking until thickened, about 5 minutes. Whisk in the nutmeg and pepper.                                                                 Pour the b\xe9chamel over the endive and spread to cover them evenly. Sprinkle the cheese evenly over the top. Set the dish on a rimmed baking sheet and bake until bubbly and golden brown on top, about 15 minutes. If you want the top more browned and crusty, broil for a minute or two after baking. Serve hot.                                                                            Reprinted with permission from Home Cooking with Jean-Georges: My Favorite Simple Recipes by Jean-Georges Vongerichten with Genevieve Ko. Copyright \xa9 2011 by Jean-Georges Vongerichten; photographs copyright \xa9 2011 by John Kernick. Published by Clarkson Potter/Publishers, an imprint of the Crown Publishing Group. All Rights Reserved.Jean-Georges Vongerichten is one of the most influential chefs in the world, having single-handedly redefined haute French cuisine, lightening and refining it by adding select Asian accents. He is the chef-owner of dozens of restaurants in fourteen cities around the world. His flagship restaurant, Jean Georges, at New York's Columbus Circle, is one of six restaurants in the United States to have been awarded three coveted Michelin stars; it received four stars from the New York Times. The winner of multiple James Beard Foundation awards, he lives in New York City and Waccabuc, New York, with his family.Genevieve Ko is a cookbook author and the senior food editor at Good Housekeeping magazine. She has written for Martha Stewart Living, Gourmet, and Fine Cooking and lives in New York City with her family.", u'spoonacularSourceUrl': u'https://spoonacular.com/braised-endive-with-ham-and-gruyre-214385', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}