{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/246110-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 246110, u'veryPopular': True, u'lowFodmap': False, u'title': u'Beef Wellington', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 481.77, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1 lb beef tenderloin fillet', u'aisle': u'Meat', u'name': u'beef fillet', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-tenderloin.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 13926, u'unit': u'lb'}, {u'originalString': u'2 egg yolks, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'4 thin slices ham (Parma ham if you can get it) or prosciutto', u'aisle': u'Meat', u'name': u'ham', u'metaInformation': [u'thin', u'canned', u'(Parma ham if you can get it)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10151, u'unit': u'slices'}, {u'originalString': u'1 lb mushrooms (we used half cremini, half shiitake)', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'(we used half cremini, half shiitake)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'lb'}, {u'originalString': u"2 Tbsp yellow mustard (we used Coleman's Original English Mustard)", u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [u'yellow', u'english', u"(we used Coleman's Original Mustard)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'Tbsp'}, {u'originalString': u'Canola, grapeseed, or olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'7 ounces puff pastry (needs 3 hours to defrost in refrigerator if using frozen)', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'frozen', u'(needs 3 hours to defrost in refrigerator if using )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 18337, u'unit': u'ounces'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/beef_wellington/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'1 Preheat oven to 400\xb0F. 2', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a tablespoon or two of oil in a large pan on high heat.  Season the fillet generously with salt and pepper.  Sear the fillet in the pan on all sides until well browned (hint: do not move the fillet until it has had a chance to brown).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the fillet from the pan and let cool.  Once cooled, brush the fillet on all sides with mustard.3 Chop the mushrooms and put them into a food processor and pur\xe9e.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large saut\xe9 pan on medium high heat.  Scrape the mushroom pur\xe9e into the pan and let cook down, allowing the mushrooms to release their moisture.  When the moisture released by the mushrooms has boiled away, set aside the mushrooms to cool.  4', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Roll out a large piece of plastic wrap.  Lay out the slices of ham on the plastic wrap so that they overlap.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [], u'step': u'Spread the mushroom mixture over the ham.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Place the beef fillet in the middle, roll the mushroom and ham over the fillet, using the plastic wrap so that you do this tightly.  Wrap up the beef fillet into a tight barrel shape, twisting the ends of the plastic wrap to secure.  Refrigerate for 20 minutes. 5 On a lightly floured surface, roll out the puff pastry sheet to a size that will wrap around the beef fillet. Unwrap the fillet from the plastic wrap and place in the middle of the pastry dough.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-tenderloin.jpg', u'id': 13926, u'name': u'beef tenderloin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [], u'step': u'Brush the edges of the pastry with the beaten eggs. Fold the pastry around the fillet, cutting off any excess at the ends (pastry that is more than 2 layers thick will not cook all the way, try to limit the overlap).', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Place on a small plate, seam side down, and brush beaten egg yolks all over the top. Chill for 5-10 minutes.  6', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place the pastry-wrapped fillet on a baking pan.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Brush the exposed surface again with beaten eggs.  Score the top of the pastry with a sharp knife, not going all the way through the pastry.  Sprinkle the top with coarse salt.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'coarse salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Bake for 25-35 minutes.  The pastry should be nicely golden when done. (To ensure that your roast is medium rare, test with an instant read meat thermometer. Pull out at 125-130\xb0F for medium rare.)', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and let rest for 10 minutes before slicing.  Slice in 1-inch thick slices.Recipe adapted from this video for making Beef Wellington by Chef Gordon Ramsey.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 3632, u'instructions': u'1 Preheat oven to 400\xb0F. 2 Heat a tablespoon or two of oil in a large pan on high heat.  Season the fillet generously with salt and pepper.  Sear the fillet in the pan on all sides until well browned (hint: do not move the fillet until it has had a chance to brown).  Remove the fillet from the pan and let cool.  Once cooled, brush the fillet on all sides with mustard.3 Chop the mushrooms and put them into a food processor and pur\xe9e.  Heat a large saut\xe9 pan on medium high heat.  Scrape the mushroom pur\xe9e into the pan and let cook down, allowing the mushrooms to release their moisture.  When the moisture released by the mushrooms has boiled away, set aside the mushrooms to cool.  4 Roll out a large piece of plastic wrap.  Lay out the slices of ham on the plastic wrap so that they overlap.  Spread the mushroom mixture over the ham.  Place the beef fillet in the middle, roll the mushroom and ham over the fillet, using the plastic wrap so that you do this tightly.  Wrap up the beef fillet into a tight barrel shape, twisting the ends of the plastic wrap to secure.  Refrigerate for 20 minutes. 5 On a lightly floured surface, roll out the puff pastry sheet to a size that will wrap around the beef fillet. Unwrap the fillet from the plastic wrap and place in the middle of the pastry dough.  Brush the edges of the pastry with the beaten eggs. Fold the pastry around the fillet, cutting off any excess at the ends (pastry that is more than 2 layers thick will not cook all the way, try to limit the overlap). Place on a small plate, seam side down, and brush beaten egg yolks all over the top. Chill for 5-10 minutes.  6 Place the pastry-wrapped fillet on a baking pan.  Brush the exposed surface again with beaten eggs.  Score the top of the pastry with a sharp knife, not going all the way through the pastry.  Sprinkle the top with coarse salt.  Bake for 25-35 minutes.  The pastry should be nicely golden when done. (To ensure that your roast is medium rare, test with an instant read meat thermometer. Pull out at 125-130\xb0F for medium rare.) Remove from oven and let rest for 10 minutes before slicing.  Slice in 1-inch thick slices.Recipe adapted from this video for making Beef Wellington by Chef Gordon Ramsey.', u'spoonacularSourceUrl': u'https://spoonacular.com/beef-wellington-246110', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}