{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/627369-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 627369, u'veryPopular': False, u'lowFodmap': False, u'title': u'Caramel Apple Cheesecake', u'diets': [], u'pricePerServing': 340.12, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 (21 ounce) can apple pie filling', u'aisle': u'Baking', u'name': u'apple pie filling', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-pie.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 19312, u'unit': u'ounce'}, {u'originalString': u'1/4 cup caramel ice cream topping', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel ice cream topping', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19364, u'unit': u'cup'}, {u'originalString': u'2 (8 ounce) packages cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounce'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 (9 inch) prepared graham cracker crust', u'aisle': u'Baking', u'name': u'graham cracker crust', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust-graham-cracker.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 9.0, u'consistency': u'solid', u'id': 18942, u'unit': u'inch'}, {u'originalString': u'12 pecan halves', u'aisle': u'Nuts;Baking', u'name': u'pecan', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 12142, u'unit': u''}, {u'originalString': u'2/3 cup chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Caramel-Apple-Cheesecake/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 53, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F (175 degrees C). Reserve 3/4 cup of apple pie filling and set aside.Spoon remaining pie filling into crust. In a large bowl, combine cream cheese, sugar and vanilla. Beat until smooth then add eggs and mix well.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-pie.jpg', u'id': 19312, u'name': u'apple pie filling'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour over apple filling in crust.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350 degrees F (175 degrees C) for 35 minutes, or until center is set.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and cool to room temperature.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Mix reserved apple filling and caramel topping in a small saucepan.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}]}, {u'equipment': [], u'step': u'Heat for about 1 minute. Arrange apple slices around outside edge of cheesecake.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 324, u'instructions': u'Preheat oven to 350 degrees F (175 degrees C). Reserve 3/4 cup of apple pie filling and set aside.Spoon remaining pie filling into crust. In a large bowl, combine cream cheese, sugar and vanilla. Beat until smooth then add eggs and mix well. Pour over apple filling in crust.Bake at 350 degrees F (175 degrees C) for 35 minutes, or until center is set. Remove from oven and cool to room temperature.Mix reserved apple filling and caramel topping in a small saucepan. Heat for about 1 minute. Arrange apple slices around outside edge of cheesecake. Spread caramel sauce evenly over. Decorate with pecan halves around edge. Sprinkle with chopped pecans. Chill until ready to serve.Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/caramel-apple-cheesecake-627369', u'dishTypes': [], u'occasions': [u'halloween'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}