{u'recipes': [{u'sourceName': u'Cookie and Kate', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/580936-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 580936, u'veryPopular': False, u'lowFodmap': False, u'title': u'Breakfast Quesadillas with Scrambled Eggs, Spinach and Black Beans', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 297.06, u'creditText': u'Cookie and Kate', u'extendedIngredients': [{u'originalString': u'1 large avocado, diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'\xbc cup cooked black beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 16015, u'unit': u'cup'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 packed tablespoons fresh cilantro (about 1 small handful)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'packed', u'small', u'( 1 handful)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 small garlic clove, pressed or minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced', u'small', u'pressed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd teaspoon ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'Hot sauce, like Cholula', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'serving'}, {u'originalString': u'1 tablespoon fresh lime juice (about 1 small lime, juiced)', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'fresh', u'small', u'juiced', u'( 1 lime, )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'Sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'serving'}, {u'originalString': u'1 cup spinach, roughly chopped', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}, {u'originalString': u'2 tablespoons finely chopped white onion or radishes', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10611282, u'unit': u'tablespoons'}, {u'originalString': u'1 medium whole grain tortilla', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'whole grain tortilla', u'metaInformation': [u'whole', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortillas-whole-wheat.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93675, u'unit': u''}, {u'originalString': u'\xbd cup melty shredded cheese (like cheddar or Monterey Jack), divided', u'aisle': u'?', u'name': u'melty cheese', u'metaInformation': [u'shredded', u'divided', u'(like cheddar or Monterey Jack)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://cookieandkate.com/2014/breakfast-quesadillas-with-scrambled-eggs-spinach-and-black-beans/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [], u'name': u'To make the guacamole'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 teaspoon of olive oil in a medium-sized skillet (either well-seasoned cast iron or nonstick) over medium heat until shimmering.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chopped spinach and cook, stirring often, until wilted, about 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the black beans to the skillet.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'id': 16015, u'name': u'black beans'}]}, {u'equipment': [], u'step': u'Pour in the scrambled eggs and cook, stirring often, until the eggs are just set, about 1 to 3 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the mixture to a bowl to pause the cooking process (the eggs will finish cooking in the quesadilla).To cook the quesadilla (if desired, you can cook two quesadillas at once): In a large skillet (preferably cast iron, but nonstick also works), warm the tortilla over medium heat, flipping occasionally. Once the pan and tortilla are warm, sprinkle one half of the quesadilla with \xbc cup cheese. Top the cheese with scrambled eggs, then top the scrambled eggs with almost \xbc cup cheese, reserving about 1 tablespoon of cheese for later. Press the empty tortilla halve over the toppings.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Let the bottom side of the quesadilla cook for a minute, then carefully flip the quesadilla with a spatula. Immediately sprinkle the remaining tablespoon of cheese over the hot side of the quesadilla and let it melt as the other side cooks for a couple of minutes. Flip the quesadilla again, and let the cheese sizzle into the quesadilla for a couple of minutes. Use the spatula to get underneath the melty cheese side and flip again. Cook that side for a couple more minutes if necessary, until both sides are a nice, crisp golden brown.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Transfer the quesadilla to a cutting board to cool for a few minutes, then slice each quesadilla into 2 slices using a pizza cutter or a very sharp knife.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with guacamole.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guacamole.jpg', u'id': 1009037, u'name': u'guacamole'}]}], u'name': u'Combine the guacamole ingredients in a small bowl. Mash with a fork until the mixture is well combined and mostly smooth. Set aside.To prepare the eggs Scramble the eggs in a small bowl. Season with a couple dashes of hot sauce and a dash of salt.To cook the eggs'}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are my top picks for Quesadilla. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The SketchBook Pinot Noir Wine with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Sketchbook Pinot Noir is bright and juicy, with leather and earth on the nose and flavors of Bing cherry, crunchy red fruits, and a delicate, lingering finish.', u'title': u'SketchBook Pinot Noir Wine', u'price': u'$20.0', u'id': 428766, u'link': u'https://www.amazon.com/2014-SketchBook-Mendocino-County-Pinot/dp/B01FEFJBAU', u'imageUrl': u'https://spoonacular.com/productImages/428766-312x231.jpg'}]}, u'aggregateLikes': 66, u'instructions': u'To make the guacamole: Combine the guacamole ingredients in a small bowl. Mash with a fork until the mixture is well combined and mostly smooth. Set aside.To prepare the eggs: Scramble the eggs in a small bowl. Season with a couple dashes of hot sauce and a dash of salt.To cook the eggs: Heat 1 teaspoon of olive oil in a medium-sized skillet (either well-seasoned cast iron or nonstick) over medium heat until shimmering. Add the chopped spinach and cook, stirring often, until wilted, about 1 to 2 minutes. Add the black beans to the skillet. Pour in the scrambled eggs and cook, stirring often, until the eggs are just set, about 1 to 3 minutes. Transfer the mixture to a bowl to pause the cooking process (the eggs will finish cooking in the quesadilla).To cook the quesadilla (if desired, you can cook two quesadillas at once): In a large skillet (preferably cast iron, but nonstick also works), warm the tortilla over medium heat, flipping occasionally. Once the pan and tortilla are warm, sprinkle one half of the quesadilla with \xbc cup cheese. Top the cheese with scrambled eggs, then top the scrambled eggs with almost \xbc cup cheese, reserving about 1 tablespoon of cheese for later. Press the empty tortilla halve over the toppings.Let the bottom side of the quesadilla cook for a minute, then carefully flip the quesadilla with a spatula. Immediately sprinkle the remaining tablespoon of cheese over the hot side of the quesadilla and let it melt as the other side cooks for a couple of minutes. Flip the quesadilla again, and let the cheese sizzle into the quesadilla for a couple of minutes. Use the spatula to get underneath the melty cheese side and flip again. Cook that side for a couple more minutes if necessary, until both sides are a nice, crisp golden brown.Transfer the quesadilla to a cutting board to cool for a few minutes, then slice each quesadilla into 2 slices using a pizza cutter or a very sharp knife. Serve with guacamole.', u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-quesadillas-with-scrambled-eggs-spinach-and-black-beans-580936', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}