{u'recipes': [{u'sourceName': u'Sweet Happy Life', u'cuisines': [u'european', u'irish'], u'image': u'https://spoonacular.com/recipeImages/588864-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 588864, u'veryPopular': False, u'lowFodmap': False, u'title': u'Make-Ahead Irish Oatmeal with Agave Nectar', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 88.73, u'creditText': u'Sweet Happy Life', u'extendedIngredients': [{u'originalString': u'3-4 tablespoons agave nectar (to taste)', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [u'to taste', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoon'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup steel-cut oats', u'aisle': u'Cereal', u'name': u'steel cut oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/steel-cut-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93695, u'unit': u'cup'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'Toppings: toasted wheat germ, blueberries, strawberries, crushed cheerios, etc.', u'aisle': u'Cereal;Health Foods;Baking', u'name': u'wheat germ', u'metaInformation': [u'crushed', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wheat-germ.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 20078, u'unit': u'servings'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.sweethappylife.com/2012/easy-family-recipes/makeahead-irish-oatmeal-agave-nectar/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a medium pot over medium heat, combine the water, milk, salt and oats. Bring to a slow boil, stirring constantly. Reduce the heat to low and stir in the butter and agave nectar to taste. Cover and simmer for 20-25 minutes, stirring frequently until the mixture is creamy and the oats are soft. Turn off the heat, stir, then cover the pot again and let the oats sit for 5-10 minutes so that they can absorb any extra liquid.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Serve immediately topped with a sprinkle of toasted wheat germ and a handful of blueberries or other fresh fruit.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wheat-germ.jpg', u'id': 20078, u'name': u'wheat germ'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 261, u'instructions': u'In a medium pot over medium heat, combine the water, milk, salt and oats. Bring to a slow boil, stirring constantly. Reduce the heat to low and stir in the butter and agave nectar to taste. Cover and simmer for 20-25 minutes, stirring frequently until the mixture is creamy and the oats are soft. Turn off the heat, stir, then cover the pot again and let the oats sit for 5-10 minutes so that they can absorb any extra liquid.Serve immediately topped with a sprinkle of toasted wheat germ and a handful of blueberries or other fresh fruit.', u'spoonacularSourceUrl': u'https://spoonacular.com/make-ahead-irish-oatmeal-with-agave-nectar-588864', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'st patricks day'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}