{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/491018-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 491018, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skinny Banana Oatmeal Pancakes', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 49.82, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'2 ripe bananas', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'1 cup frozen blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 Tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'Tablespoons'}, {u'originalString': u'1 scoop protein powder (plain or vanilla)', u'aisle': u'Health Foods', u'name': u'protein powder', u'metaInformation': [u'plain', u'( or vanilla)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'scoop', u'unitShort': u'scoop', u'amount': 1.0, u'consistency': u'solid', u'id': 1223, u'unit': u'scoop'}, {u'originalString': u'1/2 cup rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://insidebrucrewlife.com/2014/02/skinny-banana-oatmeal-pancakes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine all the ingredients in a blender of food processor and blend. (you can also just use a bowl and a fork to whisk it.) Drop by 1/4 cup onto a hot, greased skillet. (I used coconut oil for my pan) Cook on each side until lightly brown on each side. Makes about 8-10 pancakes.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the frozen blueberries in a saucepan. Bring to a boil. Lower the heat and simmer for 3-4 minutes. Stir in the honey. Top your pancakes with a spoonful of blueberries.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Drizzle with more honey if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 23805, u'instructions': u'Combine all the ingredients in a blender of food processor and blend. (you can also just use a bowl and a fork to whisk it.) Drop by 1/4 cup onto a hot, greased skillet. (I used coconut oil for my pan) Cook on each side until lightly brown on each side. Makes about 8-10 pancakes.Place the frozen blueberries in a saucepan. Bring to a boil. Lower the heat and simmer for 3-4 minutes. Stir in the honey. Top your pancakes with a spoonful of blueberries. Drizzle with more honey if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-banana-oatmeal-pancakes-491018', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}