{u'recipes': [{u'sourceName': u'Gluten Free Gigi', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610455-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 6, u'id': 610455, u'veryPopular': False, u'lowFodmap': False, u'title': u'Simple Zucchini Salmon Cakes', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 192.34, u'creditText': u'Gluten Free Gigi', u'extendedIngredients': [{u'originalString': u'1 teaspoon capers, drained and minced', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'minced', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2054, u'unit': u'teaspoon'}, {u'originalString': u'2 eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd teaspoon dried dill (or use 1-2 teaspoons fresh dill, if you have some on hand)', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'dried', u'fresh', u'(or use 1-2 teaspoons dill, if you have some on hand)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2045, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon garlic powder (use \xbd - 1 teaspoon fresh minced garlic, if you prefer)', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [u'fresh', u'minced', u'(use \xbd - 1 teaspoon garlic, if you prefer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup gluten-free breadcrumbs (store bought or homemade will work)', u'aisle': u'Bakery/Bread;Pasta and Rice;Gluten Free', u'name': u'gluten-free breadcrumbs', u'metaInformation': [u'gluten-free', u'homemade', u'store bought', u'( or will work)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93694, u'unit': u'cup'}, {u'originalString': u'Lemon wedges and fresh parsley, optional garnish', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'\xbc teaspoon onion powder (add a couple tablespoons minced fresh onion, if you prefer)', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [u'fresh', u'minced', u'(add a couple tablespoons onion, if you prefer)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2026, u'unit': u'teaspoon'}, {u'originalString': u'1 (6-ounce) can wild caught Alaskan salmon, drained', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'wild caught', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 15076, u'unit': u'ounce'}, {u'originalString': u'Salt & Pepper, to taste (I like black sea salt and fresh ground pink peppercorns in this dish, but use whatever you like/have on hand.)', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'fresh', u'black', u'to taste', u'(I like sea salt and ground pink peppercorns in this dish, but use whatever you like/have on hand.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 cups shredded zucchini (peel on or off, I prefer off)', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'shredded', u'(peel on or off, I prefer off)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u'cups'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.glutenfreegigi.com/simple-zucchini-salmon-cakes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a mixing bowl, combine zucchini, eggs and breadcrumbs.Break salmon apart with a fork and add to the bowl, along with remaining ingredients.Stir to combine, making sure ingredients are well-mixed. (', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u"Mixture will look a bit liquid-y, but that's OK.)", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a skillet over medium-high heat and grease lightly.Once the skillet is hot (but not smoking), portion the mixture into about 6 equal patties by scooping with a measuring cup or large spoon, about a heaping  cup of the mixture for each patty is about right. (You can make these as small or large as you like, of course.)Cook patties 2-3 minutes per side until brown and crisp on the outside.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Luna Nuda Pinot Grigio. It has 4.4 out of 5 stars and a bottle costs about 14 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light green lustres run through the radiant straw-yellow color of this wine, whose aroma is rich in fruits, the most striking of which are pears and apples. An excellent balance gives this wine strength and structure. It is dry and smooth on the palate with a pleasant, mineral aftertaste.', u'title': u'Luna Nuda Pinot Grigio', u'price': u'$13.99', u'id': 436696, u'link': u'https://www.wine.com/product/luna-nuda-pinot-grigio-2013/134978', u'imageUrl': u'https://spoonacular.com/productImages/436696-312x231.jpg'}]}, u'aggregateLikes': 214, u'instructions': u"In a mixing bowl, combine zucchini, eggs and breadcrumbs.Break salmon apart with a fork and add to the bowl, along with remaining ingredients.Stir to combine, making sure ingredients are well-mixed. (Mixture will look a bit liquid-y, but that's OK.)Heat a skillet over medium-high heat and grease lightly.Once the skillet is hot (but not smoking), portion the mixture into about 6 equal patties by scooping with a measuring cup or large spoon, about a heaping  cup of the mixture for each patty is about right. (You can make these as small or large as you like, of course.)Cook patties 2-3 minutes per side until brown and crisp on the outside.Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/simple-zucchini-salmon-cakes-610455', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 16, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}