{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/202096-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 202096, u'veryPopular': True, u'lowFodmap': False, u'title': u"Turmeric Chicken with Sumac and Lime from 'The New Persian Kitchen", u'diets': [u'gluten free', u'dairy free', u'whole 30', u'ketogenic'], u'pricePerServing': 105.41, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 bone-in chicken thighs', u'aisle': u'Meat', u'name': u'bone-in chicken thighs', u'metaInformation': [u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1005091, u'unit': u''}, {u'originalString': u'4 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons grapeseed oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'grapeseed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4517, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'2 juicy limes, halved', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'juicy', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'Sea salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'Sumac, for garnish', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sumac', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sumac.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10211111, u'unit': u'servings'}, {u'originalString': u'3/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/04/turmeric-chicken-with-sumac-and-lime-from-the-new-persian-kitchen-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, mix the turmeric with 1 tablespoon salt and 2 teaspoons pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the chicken on a rimmed baking sheet and sprinkle with the spice mixture, turning to coat both sides.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium-high heat and add the oil. Brown the chicken well on both sides, about 7 minutes per side.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour in the water, then add the garlic, stirring it into the water. Bring the water to a boil, then turn down the heat to low and cover. Braise the chicken for 25 minutes, until the inside is opaque.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Transfer the chicken to a serving platter, turn up the heat to high, and reduce the cooking liquid for a few minutes, stirring occasionally until it’s slightly thickened. Season to taste with salt and pepper, and pour the sauce over the chicken.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Dust the chicken with sumac and pepper, garnish with lime halves, and serve.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sumac.png', u'id': 10211111, u'name': u'sumac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Vegetarian Option: Use whole portobello mushrooms in place of the chicken, or use 1 pound firm tofu, well drained and cut into slabs 1 inch thick. You will need a little extra oil for searing than what is called for in the recipe.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 535, u'instructions': u'Procedures                                                                              1                                                                            In a small bowl, mix the turmeric with 1 tablespoon salt and 2 teaspoons pepper. Place the chicken on a rimmed baking sheet and sprinkle with the spice mixture, turning to coat both sides.                                                                                                                             2                                                                            Heat a large skillet over medium-high heat and add the oil. Brown the chicken well on both sides, about 7 minutes per side. Pour in the water, then add the garlic, stirring it into the water. Bring the water to a boil, then turn down the heat to low and cover. Braise the chicken for 25 minutes, until the inside is opaque. Transfer the chicken to a serving platter, turn up the heat to high, and reduce the cooking liquid for a few minutes, stirring occasionally until it’s slightly thickened. Season to taste with salt and pepper, and pour the sauce over the chicken.                                                                                                                            3                                                                            Dust the chicken with sumac and pepper, garnish with lime halves, and serve.                                                                                                                             4                                                                            Vegetarian Option: Use whole portobello mushrooms in place of the chicken, or use 1 pound firm tofu, well drained and cut into slabs 1 inch thick. You will need a little extra oil for searing than what is called for in the recipe.', u'spoonacularSourceUrl': u'https://spoonacular.com/turmeric-chicken-with-sumac-and-lime-from-the-new-persian-kitchen-202096', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}