{u'recipes': [{u'sourceName': u'My Baking Heart', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/508563-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 508563, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sour Cream Coffeecake with Maple Walnut Streusel', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 99.79, u'creditText': u'My Baking Heart', u'extendedIngredients': [{u'originalString': u'1 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'1 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'2 lg eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 c all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'2 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1 c low-fat sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1179, u'unit': u'c'}, {u'originalString': u'1/2 c pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 19911, u'unit': u'c'}, {u'originalString': u'1/4 c + 2 tbsp Splenda for Baking', u'aisle': u'Baking', u'name': u'splenda', u'metaInformation': [u'for baking'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dropper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10019868, u'unit': u'c'}, {u'originalString': u'2 tbsp unsalted butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'1 tsp pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'1-1/4 c walnuts, coarsely chopped', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'c'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://mybakingheart.com/2012/08/10/sour-cream-coffeecake-with-maple-walnut-streusel/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F. Butter and flour a 9 to 10 cup Bundt pan. Tap out excess flour and set aside.To make the streusel: using a fork, mix flour, butter and cinnamon in a small bowl until crumbly. Stir in walnuts and maple syrup (this will be a liquid streusel).To make the cake: whisk together the flour, baking powder, baking soda and salt in a medium bowl. Using a stand mixer and paddle attachment, beat sugar and butter together in a large bowl until fluffy. Beat in eggs, one at a time.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix in vanilla extract. Beat in flour mixture in two additions, alternating with the sour cream, just until blended.Spoon half of batter into your prepared pan. Spoon about two-thirds of maple streusel over batter.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [], u'step': u'Spread remaining batter over filling and smooth the top. Dot with remaining streusel.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until a cake tester inserted near the center of the cake comes out clean, about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer pan to a rack and cool for 15 minutes. Run a knife around the edges of the pan to loosen the cake, then invert cake onto rack. Invert cake once more, streusel side up, onto a platter or stand to cool completely.Cake can be made up to 2 days ahead. Wrap in plastic and store at room temperature.Adapted from: Cooking.com', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 11, u'instructions': u'Preheat oven to 350 degrees F. Butter and flour a 9 to 10 cup Bundt pan. Tap out excess flour and set aside.To make the streusel: using a fork, mix flour, butter and cinnamon in a small bowl until crumbly. Stir in walnuts and maple syrup (this will be a liquid streusel).To make the cake: whisk together the flour, baking powder, baking soda and salt in a medium bowl. Using a stand mixer and paddle attachment, beat sugar and butter together in a large bowl until fluffy. Beat in eggs, one at a time. Mix in vanilla extract. Beat in flour mixture in two additions, alternating with the sour cream, just until blended.Spoon half of batter into your prepared pan. Spoon about two-thirds of maple streusel over batter. Spread remaining batter over filling and smooth the top. Dot with remaining streusel. Bake until a cake tester inserted near the center of the cake comes out clean, about 45 minutes. Transfer pan to a rack and cool for 15 minutes. Run a knife around the edges of the pan to loosen the cake, then invert cake onto rack. Invert cake once more, streusel side up, onto a platter or stand to cool completely.Cake can be made up to 2 days ahead. Wrap in plastic and store at room temperature.Adapted from: Cooking.com', u'spoonacularSourceUrl': u'https://spoonacular.com/sour-cream-coffeecake-with-maple-walnut-streusel-508563', u'dishTypes': [u'dessert', u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}