{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/446568-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 446568, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crunchy Corn Medley', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 91.68, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (8 ounces) water chestnuts, drained and chopped', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'canned water chestnuts', u'metaInformation': [u'drained', u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-chestnuts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11590, u'unit': u'ounces'}, {u'originalString': u'2 celery ribs, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'1 medium green pepper, chopped', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'8 green onions, thinly sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'2 cups frozen peas, thawed', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 jar (4 ounces) diced pimientos, drained', u'aisle': u'Produce', u'name': u'pimientos', u'metaInformation': [u'diced', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pimento.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11943, u'unit': u'ounces'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}, {u'originalString': u'2 cans (7 ounces each) white or shoepeg corn, drained', u'aisle': u'Canned and Jarred;Produce;Frozen', u'name': u'white shoepeg corn', u'metaInformation': [u'white', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-white.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 11901, u'unit': u'ounces'}, {u'originalString': u'1/2 cup white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 2053, u'unit': u'cup'}, {u'originalString': u'1 can (15-1/4 ounces) whole kernel corn, drained', u'aisle': u'Produce', u'name': u'whole kernel corn', u'metaInformation': [u'whole', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11172, u'unit': u'ounces'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/crunchy-corn-medley', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the first eight ingredients. In a small bowl, combine vinegar, sugar, oil, salt and pepper; whisk until sugar is dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}], u'step': u'Pour over corn mixture; toss to coat. Cover and refrigerate for at least 3 hours. Stir just before serving; serve with a slotted spoon.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 224, u'instructions': u'Directions                                                                                In a large bowl, combine the first eight ingredients. In a small bowl, combine vinegar, sugar, oil, salt and pepper; whisk until sugar is dissolved. Pour over corn mixture; toss to coat. Cover and refrigerate for at least 3 hours. Stir just before serving; serve with a slotted spoon.                                        Yield: 10 servings.                                                                                                                         Originally published as Crunchy Corn Medley in  Quick CookingJuly/August 2000, p29                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (3/4 cup) equals 197 calories, 6 g fat (1 g saturated fat), 0 cholesterol, 516 mg sodium, 33 g carbohydrate, 4 g fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/crunchy-corn-medley-446568', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}