{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/833731-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 833731, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Bacon Ranch Chicken Pasta', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 321.79, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'5 ounces fresh baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11457, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 cups half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1049, u'unit': u'cups'}, {u'originalString': u'\xbd teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd medium onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'2 teaspoons homemade ranch seasoning mix', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch mix', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano-dried.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93733, u'unit': u'teaspoons'}, {u'originalString': u'4 - 5 skinless, boneless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'1 (7-ounce) package spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'ounce'}, {u'originalString': u'4 slices thick-cut bacon, diced', u'aisle': u'Meat', u'name': u'thick-cut bacon', u'metaInformation': [u'diced', u'thick-cut'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10310123, u'unit': u'slices'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://addapinch.com/creamy-bacon-ranch-chicken-pasta-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook bacon in a medium skillet set over medium heat until the bacon is crispy and the onion is tender, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove to a plate and set aside. Sprinkle both sides of the chicken with ranch seasoning, and add to the skillet. Brown the chicken on each side, about 3 minutes each.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove chicken to plate with bacon and onions.Stir in the half and half, salt and pepper. Break the spaghetti noodles into bite sized pieces and add to the skillet. Stir to combine. Nestle the chicken into the spaghetti and top with the spinach. Reduce the heat to simmer, cover the skillet and cook until the sauce has thickened, the noodles are tender and the chicken has cooked through, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the skillet from the heat and top with freshly grated Parmesan cheese.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 111, u'instructions': u'Cook bacon in a medium skillet set over medium heat until the bacon is crispy and the onion is tender, about 3 minutes. Remove to a plate and set aside. Sprinkle both sides of the chicken with ranch seasoning, and add to the skillet. Brown the chicken on each side, about 3 minutes each. Remove chicken to plate with bacon and onions.Stir in the half and half, salt and pepper. Break the spaghetti noodles into bite sized pieces and add to the skillet. Stir to combine. Nestle the chicken into the spaghetti and top with the spinach. Reduce the heat to simmer, cover the skillet and cook until the sauce has thickened, the noodles are tender and the chicken has cooked through, about 20 minutes.Remove the skillet from the heat and top with freshly grated Parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-bacon-ranch-chicken-pasta-833731', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}