{u'recipes': [{u'sourceName': u'A Spicy Perspective', u'cuisines': [u'european', u'irish'], u'image': u'https://spoonacular.com/recipeImages/551621-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 551621, u'veryPopular': True, u'lowFodmap': False, u'title': u'Irish Potato Pie', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 75.38, u'creditText': u'A Spicy Perspective', u'extendedIngredients': [{u'originalString': u'7 thick sliced bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'thick', u'sliced', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'4 Tb. butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tb', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tb'}, {u'originalString': u'Chive for garnish', u'aisle': u'Produce', u'name': u'chive', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 11156, u'unit': u'servings'}, {u'originalString': u'1 Tb fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'Tb', u'unitShort': u'Tb', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'Tb'}, {u'originalString': u'1/2 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 onion, peeled and sliced thin', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'peeled', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'5 potatoes (4 large), peeled and sliced thin', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'(4 large)', u'peeled', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1 sheet frozen puff pastry, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheet'}, {u'originalString': u'Salt and Pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.aspicyperspective.com/2014/03/irish-potato-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}], u'step': u'Place the thawed puff pastry in a 8-9 inch tart pan and crimp the edges.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [], u'step': u'Remove the excess dough and piece it along the rim if needed to make the rim even in some places. Refrigerate the crust until ready to fill.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the butter and bacon in a large skillet over medium-high heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u"Saute until the bacon is crispy then toss in the onions, followed by the potatoes and dill. Season with 1/2 tsp. salt and 1/4 tsp. ground pepper. Gently stir 3-5 minutes,to mix the onions and potatoes and coat in fat. The potatoes don't need to be cooked through. Then spoon the mixture into the crust and drizzle with heavy cream.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake on the low rack for 35-45 minutes, until the potatoes are fork-tender and the crust is golden. Rest for 10 minutes, then sprinkle with chopped chive and cut.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is McFadden Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 18 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 10401, u'instructions': u"Preheat the oven to 350 degrees F. Place the thawed puff pastry in a 8-9 inch tart pan and crimp the edges. Remove the excess dough and piece it along the rim if needed to make the rim even in some places. Refrigerate the crust until ready to fill.Place the butter and bacon in a large skillet over medium-high heat. Saute until the bacon is crispy then toss in the onions, followed by the potatoes and dill. Season with 1/2 tsp. salt and 1/4 tsp. ground pepper. Gently stir 3-5 minutes,to mix the onions and potatoes and coat in fat. The potatoes don't need to be cooked through. Then spoon the mixture into the crust and drizzle with heavy cream.Bake on the low rack for 35-45 minutes, until the potatoes are fork-tender and the crust is golden. Rest for 10 minutes, then sprinkle with chopped chive and cut.", u'spoonacularSourceUrl': u'https://spoonacular.com/irish-potato-pie-551621', u'dishTypes': [], u'occasions': [u'st patricks day'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}