{u'recipes': [{u'sourceName': u'Two Peas and Their Pod', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/548133-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 548133, u'veryPopular': True, u'lowFodmap': False, u'title': u'Brussels Sprout Pomegranate Citrus Salad', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 209.58, u'creditText': u'Two Peas and Their Pod', u'extendedIngredients': [{u'originalString': u'1 large orange, peeled and chopped', u'aisle': u'Produce', u'name': u'orange', u'metaInformation': [u'large', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9200, u'unit': u''}, {u'originalString': u'1 large avocado, peeled, pitted, and chopped', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'pitted', u'large', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 pound brussels sprouts', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11098, u'unit': u'pound'}, {u'originalString': u'1 tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'Juice of 3 large oranges', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9206, u'unit': u''}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Zest of 1 large orange', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1 cup POM POMS Fresh Pomegranate Arils', u'aisle': u'Produce', u'name': u'pomegranate arils', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9286, u'unit': u'cup'}, {u'originalString': u'Salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 61.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.twopeasandtheirpod.com/brussels-sprout-pomegranate-citrus-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse brussels sprouts and remove any damaged or dirty outer leaves.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u"Place on a cutting board and slice off the hard root end. Using a sharp knife, thinly slice the brussels sprouts. When you're done, use your fingers to gently separate the leaves so that the shredded sprouts resemble a very fine slaw.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a large bowl and add the avocado, orange, and POM POMS. 2. In a small bowl, whisk together the orange juice, zest, olive oil, and honey. Season with salt and pepper, to taste.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange.jpg', u'id': 9200, u'name': u'orange'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Drizzle the citrus dressing over the salad and lightly toss.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately. Note-you can use agave instead of the honey to make a vegan salad.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}], u'name': u''}], u'aggregateLikes': 5461, u'instructions': u"1. Rinse brussels sprouts and remove any damaged or dirty outer leaves. Place on a cutting board and slice off the hard root end. Using a sharp knife, thinly slice the brussels sprouts. When you're done, use your fingers to gently separate the leaves so that the shredded sprouts resemble a very fine slaw. Place in a large bowl and add the avocado, orange, and POM POMS. 2. In a small bowl, whisk together the orange juice, zest, olive oil, and honey. Season with salt and pepper, to taste. Drizzle the citrus dressing over the salad and lightly toss. Serve immediately. Note-you can use agave instead of the honey to make a vegan salad.", u'spoonacularSourceUrl': u'https://spoonacular.com/brussels-sprout-pomegranate-citrus-salad-548133', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}