{u'recipes': [{u'sourceName': u'Norecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/603459-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 603459, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tuna Poke', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 499.27, u'creditText': u'Norecipes', u'extendedIngredients': [{u'originalString': u'380 grams Ahi tuna', u'aisle': u'Seafood', u'name': u'ahi tuna', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-steak-or-ahi-tuna.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 380.0, u'consistency': u'solid', u'id': 15117, u'unit': u'grams'}, {u'originalString': u'25 grams candlenuts', u'aisle': u'Ethnic Foods', u'name': u'candlenuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candlenut.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 98958, u'unit': u'grams'}, {u'originalString': u'1 teaspoon sugar - granulated', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon Alaea salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 scallion finely chopped', u'aisle': u'Produce', u'name': u'scallion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'50 grams seaweed', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'seaweed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kombu.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'liquid', u'id': 11445, u'unit': u'grams'}, {u'originalString': u'4 teaspoons toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoons'}, {u'originalString': u'5 grams sesame seeds 2 teaspoons', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 5.0, u'consistency': u'solid', u'id': 12023, u'unit': u'grams'}, {u'originalString': u'2 teaspoon soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoon'}, {u'originalString': u'40 grams sweet onion ( - 1/4 onion)', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'( - 1/4 onion)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 40.0, u'consistency': u'solid', u'id': 11294, u'unit': u'grams'}, {u'originalString': u'1/2 teaspoon sambal oelek or other Asian hot sauce', u'aisle': u'?', u'name': u'sambal oelek', u'metaInformation': [], u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'unit': u'teaspoon'}], u'healthScore': 64.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://norecipes.com/recipe/tuna-poke/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'To make the inamona, chop the candlenuts into small pebble sized pieces.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candlenut.jpg', u'id': 98958, u'name': u'candlenuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Put the chopped candlenuts and sesame seeds in a cast iron pan over medium high heat and toast them until they turn a medium brown color. You'll want to stir them constantly to make sure they brown evenly. When the nuts are brown, add the Alaea salt and stir to combine.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candlenut.jpg', u'id': 98958, u'name': u'candlenuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/salad-spinner.jpg', u'id': 404792, u'name': u'salad spinner'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u"Transfer the nuts onto a sheet of foil in a thin layer to let them cool.Slice the onions thinly and then soak them for at least 1 hour in a medium bowl of cold water with a teaspoon of baking soda. The baking soda neutralizes the volatile sulfur compounds that make raw onions so pungent, leaving you with crisp sweet onions without the tear inducing sting. When you're ready to use them, drain and rinse them well, and spin them in a salad spinner to remove the extra water. To make the Tuna Poke, whisk the sesame oil, soy sauce, sugar and hot sauce together.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'id': 11294, u'name': u'sweet onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the tuna, seaweed, and onions and stir to combine. Top the Poke with the chopped scallions, and inamona.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kombu.jpg', u'id': 11445, u'name': u'seaweed'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Maso Canali Pinot Grigio. It has 4.6 out of 5 stars and a bottle costs about 15 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal.', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 138, u'instructions': u"To make the inamona, chop the candlenuts into small pebble sized pieces. Put the chopped candlenuts and sesame seeds in a cast iron pan over medium high heat and toast them until they turn a medium brown color. You'll want to stir them constantly to make sure they brown evenly. When the nuts are brown, add the Alaea salt and stir to combine. Transfer the nuts onto a sheet of foil in a thin layer to let them cool.Slice the onions thinly and then soak them for at least 1 hour in a medium bowl of cold water with a teaspoon of baking soda. The baking soda neutralizes the volatile sulfur compounds that make raw onions so pungent, leaving you with crisp sweet onions without the tear inducing sting. When you're ready to use them, drain and rinse them well, and spin them in a salad spinner to remove the extra water. To make the Tuna Poke, whisk the sesame oil, soy sauce, sugar and hot sauce together. Add the tuna, seaweed, and onions and stir to combine. Top the Poke with the chopped scallions, and inamona.", u'spoonacularSourceUrl': u'https://spoonacular.com/tuna-poke-603459', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}