{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/475705-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 475705, u'veryPopular': True, u'lowFodmap': False, u'title': u'Toasted Balsamic Chicken Salad Sandwich', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 197.66, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'\xbc cup balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'\xbd cup chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6194, u'unit': u'cup'}, {u'originalString': u'4 ounces cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'6 large croissants, halved and toasted', u'aisle': u'Bakery/Bread', u'name': u'croissants', u'metaInformation': [u'large', u'toasted', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croissants.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18239, u'unit': u''}, {u'originalString': u'2 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 teaspoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'6 slices Monterrey Jack cheese', u'aisle': u'Cheese', u'name': u'jack cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'slices'}, {u'originalString': u'pinch red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'2-4 skinless, boneless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u''}, {u'originalString': u'2 teaspoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoons'}, {u'originalString': u'1 cup fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}, {u'originalString': u'2 teaspoons Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'teaspoons'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 68.0, u'sourceUrl': u'http://addapinch.com/cooking/2013/01/26/toasted-balsamic-chicken-salad-sandwich-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place all ingredients for the balsamic chicken (through garlic) into insert of slow cooker. Cook on high for 4 hours or low for 6 hours.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove chicken from insert and refrigerate balsamic sauce in an airtight container for another use.Preheat oven to 350\xba F.Break apart chicken into large chunks and mix together with cream cheese. Set aside.Layer spinach, prepared balsamic chicken salad, and cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into oven for 5 minutes or until cheese has begun to melt.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and top with other half of toasted croissant.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croissants.jpg', u'id': 18239, u'name': u'croissant'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 6346, u'instructions': u'Place all ingredients for the balsamic chicken (through garlic) into insert of slow cooker. Cook on high for 4 hours or low for 6 hours. Remove chicken from insert and refrigerate balsamic sauce in an airtight container for another use.Preheat oven to 350\xba F.Break apart chicken into large chunks and mix together with cream cheese. Set aside.Layer spinach, prepared balsamic chicken salad, and cheese. Place into oven for 5 minutes or until cheese has begun to melt. Remove from oven and top with other half of toasted croissant.', u'spoonacularSourceUrl': u'https://spoonacular.com/toasted-balsamic-chicken-salad-sandwich-475705', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}