{u'recipes': [{u'sourceName': u'Foxes Love Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511964-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 511964, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spring Vegetable and Chicken Primavera', u'diets': [], u'pricePerServing': 286.32, u'creditText': u'Foxes Love Lemons', u'extendedIngredients': [{u'originalString': u'1/2 bunch asparagus, cut into 2-inch pieces', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'cut into 2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 11011, u'unit': u'bunch'}, {u'originalString': u'1/4 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 medium carrots, thinly sliced diagonally', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 pound chicken tenderloins', u'aisle': u'Meat', u'name': u'chicken tenderloins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1015062, u'unit': u'pound'}, {u'originalString': u'1/4 cup chopped fresh basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 leek (white and light green parts only), halved lengthwise then cut crosswise into thin slices', u'aisle': u'Produce', u'name': u'leek', u'metaInformation': [u'light', u'white', u'green', u'halved lengthwise', u'thin', u'( and parts only)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u'slices'}, {u'originalString': u'2 tablespoons fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon grated lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'3/4 cup frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'12 ounces spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'ounces'}, {u'originalString': u'3/4 cup low-sodium chicken or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}], u'healthScore': 45.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://foxeslovelemons.com/spring-vegetable-and-chicken-primavera/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat large pot of salted water to boiling over high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add pasta and cook as label directs, adding asparagus and peas during last 2 minutes of cooking. Reserve 3/4 cup cooking water, then drain pasta and vegetables. Return pasta to saucepot and cover to keep warm. Meanwhile, heat oil in large skillet over medium-high heat.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Add chicken and cook 5 to 7 minutes or until lightly browned, turning occasionally.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer chicken to plate; cover to keep warm. Reduce heat to medium.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add garlic and leek to skillet and cook 1 minute, stirring frequently.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Add carrots and cook 2 minutes, stirring occasionally.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Add broth and 1/2 cup reserved cooking water; heat to boiling. Reduce heat to medium and simmer 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Add chicken and simmer 2 minutes longer or until sauce thickens slightly and chicken is cooked through. Stir in basil, lemon juice, salt, pepper and lemon zest.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour vegetable mixture over pasta and toss until well combined.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add more pasta cooking water if mixture seems too dry.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Serve sprinkled with Parmesan cheese.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Ghost Pines Sonoma County Napa County Monterey County Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u'Heat large pot of salted water to boiling over high heat. Add pasta and cook as label directs, adding asparagus and peas during last 2 minutes of cooking. Reserve 3/4 cup cooking water, then drain pasta and vegetables. Return pasta to saucepot and cover to keep warm. Meanwhile, heat oil in large skillet over medium-high heat. Add chicken and cook 5 to 7 minutes or until lightly browned, turning occasionally. Transfer chicken to plate; cover to keep warm. Reduce heat to medium. Add garlic and leek to skillet and cook 1 minute, stirring frequently. Add carrots and cook 2 minutes, stirring occasionally. Add broth and 1/2 cup reserved cooking water; heat to boiling. Reduce heat to medium and simmer 2 minutes. Add chicken and simmer 2 minutes longer or until sauce thickens slightly and chicken is cooked through. Stir in basil, lemon juice, salt, pepper and lemon zest. Pour vegetable mixture over pasta and toss until well combined. Add more pasta cooking water if mixture seems too dry. Serve sprinkled with Parmesan cheese.', u'spoonacularSourceUrl': u'https://spoonacular.com/spring-vegetable-and-chicken-primavera-511964', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'spring', u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}