{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/774060-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 774060, u'veryPopular': False, u'lowFodmap': False, u'title': u'Trick Foods', u'diets': [u'dairy free'], u'pricePerServing': 221.33, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Grapes (big plump grapes work best)', u'aisle': u'Produce', u'name': u'grapes', u'metaInformation': [u'(big plump grapes work best)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9132, u'unit': u'servings'}, {u'originalString': u'Olive oil (to touch)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'(to touch)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Olive oil, enough to cover grapes', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'to cover grapes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'A few dashes olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'dashes', u'unitShort': u'dashes', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'dashes'}, {u'originalString': u"Pumpkin seeds, dried (the smaller and flatter they are, the better. You can use the seeds from your jack o' lantern!)", u'aisle': u'Savory Snacks', u'name': u'pumpkin seeds', u'metaInformation': [u'dried', u"(the smaller and flatter they are, the better. You can use the seeds from your jack o' lantern!)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 12014, u'unit': u'can'}, {u'originalString': u'1 jar thick and chunky salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'jar'}, {u'originalString': u'1 pound spaghetti', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'pound'}, {u'originalString': u'1 block firm tofu', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'firm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 16162, u'unit': u''}, {u'originalString': u'1 can Vienna sausages', u'aisle': u'Canned and Jarred', u'name': u'vienna sausages', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 7083, u'unit': u'can'}], u'healthScore': 18.0, u'imageType': u'jpeg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/duff-goldman/trick-foods-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 25, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of water to a boil over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the spaghetti and cook for 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the pasta, and put it in a large bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the salsa and toss to coat the spaghetti.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Let come to room temperature and then refrigerate until cold.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cook\'s Note: Duff points out it doesn\'t look too bad, but when it\'s cold, it\'s going to feel like "blood and guts and snot and spit everywhere!"', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Peel the grapes and put them in a bowl.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [], u'step': u'Pour in enough olive oil to coat the grapes and toss. Yuck!', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [], u'step': u'Cook\'s Note: Tips for peeling a grape: Grapes have a "natural hole." Start at the hole and peel off 1 side. Go all the way around and try to remove the peel in 4 pieces. If you\'re lucky, you can get it in 3 pieces. The reason to peel the grapes is to make the texture smooth and blemishless. This will make them feel more gross when they\'re covered in oil. With the skin off, grapes feel just like the surface of your eyeball.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain the water from the tofu and put it into a bowl. Squeeze the tofu between your fingers to get it all mushy.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Pour a little olive oil on top "for that extra ick effect." Crack 2 eggs on top of the icky tofu mess. Squeeze your fingers through it to mix the eggs and tofu together.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Now it should totally gross people out!', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u"Cut the pumpkin seeds in half (Duff doesn't say which way, but he does say this is dangerous). MAKE SURE MOM OR DAD CUTS THE PUMPKIN SEEDS! THIS IS NOT A STEP FOR KIDS. Make a small slit at 1 end of each of the Vienna sausages. Stick a pumpkin seed into each slit so that it will feel like a fingernail.", u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 7083, u'name': u'vienna sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Arrange the severed fingers in a bowl. Spoon some slimy, gooey piping gel over the fingers.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Pour on a healthy dash of olive oil. Very gently, use your fingers to coat the sausages in the oil and the gel so it feels like they\'re floating in "gooey, congealed blood."', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.', u'number': 16, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 126, u'instructions': u'Bring a large pot of water to a boil over medium-high heat. Add the spaghetti and cook for 12 minutes.                          Drain the pasta, and put it in a large bowl. Add the salsa and toss to coat the spaghetti. Let come to room temperature and then refrigerate until cold.                          Cook\'s Note: Duff points out it doesn\'t look too bad, but when it\'s cold, it\'s going to feel like "blood and guts and snot and spit everywhere!"                          Peel the grapes and put them in a bowl. Pour in enough olive oil to coat the grapes and toss. Yuck!                          Cook\'s Note: Tips for peeling a grape: Grapes have a "natural hole." Start at the hole and peel off 1 side. Go all the way around and try to remove the peel in 4 pieces. If you\'re lucky, you can get it in 3 pieces. The reason to peel the grapes is to make the texture smooth and blemishless. This will make them feel more gross when they\'re covered in oil. With the skin off, grapes feel just like the surface of your eyeball.                          Drain the water from the tofu and put it into a bowl. Squeeze the tofu between your fingers to get it all mushy. Pour a little olive oil on top "for that extra ick effect." Crack 2 eggs on top of the icky tofu mess. Squeeze your fingers through it to mix the eggs and tofu together.                          Now it should totally gross people out!                          Cut the pumpkin seeds in half (Duff doesn\'t say which way, but he does say this is dangerous). MAKE SURE MOM OR DAD CUTS THE PUMPKIN SEEDS! THIS IS NOT A STEP FOR KIDS. Make a small slit at 1 end of each of the Vienna sausages. Stick a pumpkin seed into each slit so that it will feel like a fingernail.                          Arrange the severed fingers in a bowl. Spoon some slimy, gooey piping gel over the fingers. Pour on a healthy dash of olive oil. Very gently, use your fingers to coat the sausages in the oil and the gel so it feels like they\'re floating in "gooey, congealed blood."                          This recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.', u'spoonacularSourceUrl': u'https://spoonacular.com/trick-foods-774060', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}