{u'recipes': [{u'sourceName': u"Renee's Kitchen Adventures", u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/628962-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 628962, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Taco Pie', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 196.87, u'creditText': u"Renee's Kitchen Adventures", u'extendedIngredients': [{u'originalString': u'1/2 cup canned pinto beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned pinto beans', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16044, u'unit': u'cup'}, {u'originalString': u'1 - 15 oz. can of diced fire-roasted tomatoes (do not drain)', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned', u'(do not drain)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'1- 8 oz. can refrigerated reduced fat crescent rolls (such as Pillsbury)', u'aisle': u'Refrigerated', u'name': u'crescent rolls', u'metaInformation': [u'refrigerated', u'canned', u'(such as Pillsbury)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93618, u'unit': u'oz'}, {u'originalString': u'1.2 lb. lean ground turkey', u'aisle': u'Meat', u'name': u'lean ground turkey', u'metaInformation': [u'lean'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.2, u'consistency': u'solid', u'id': 5662, u'unit': u'lb'}, {u'originalString': u'1/4 cup finely diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 cup reduced-fat sharp shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded', u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cup'}, {u'originalString': u'1 packet of taco seasoning mix', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'packet', u'unitShort': u'packet', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'packet'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.reneeskitchenadventures.com/2015/02/turkey-taco-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F.  Unroll the crescent dough and separate into triangles.  Spray a deep dish 9" pie plate with cooking spray.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Place the triangles in the plate to form a crust.  Press triangles together and up the sides of the pie plate.  Set aside.', u'number': 2, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 73, u'instructions': u'Preheat oven to 375 degrees F.  Unroll the crescent dough and separate into triangles.  Spray a deep dish 9" pie plate with cooking spray.  Place the triangles in the plate to form a crust.  Press triangles together and up the sides of the pie plate.  Set aside.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-taco-pie-628962', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}