{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/750792-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 750792, u'veryPopular': True, u'lowFodmap': False, u'title': u'Love Birds - Chicken in Pastry', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 209.76, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 pieces skinless chicken breast, boned (about 8 ounces each)', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 5062, u'unit': u'ounces'}, {u'originalString': u'1 egg mixed with 1 tablespoon water, for egg wash', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'mixed', u'with 1 tablespoon water, for egg wash'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup fig preserves', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'fig preserves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fig-preserves.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11519297, u'unit': u'cup'}, {u'originalString': u'8 slices Italian fontina cheese, slices should be 2 to 3-inches square and 1/4 to 1/2-inch thick, cut in 1/2', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'italian', u'cut in 1/2'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 1020, u'unit': u'slices'}, {u'originalString': u'2 to 3 sprigs fresh finely chopped rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'sprigs'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 sheet puff pastry (11 by 17-inch), (recommended: Dufour)', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'(11 by 17-inch)', u'(recommended: Dufour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'sheet', u'unitShort': u'sheet', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'sheet'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 11.0, u'imageType': u'jpeg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/rachael-ray/love-birds-chicken-in-pastry-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Season the chicken with salt, pepper and rosemary.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Cut each piece of chicken in half across the breast giving you 8 equal portions.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a nonstick skillet over medium-high heat. Lightly brown the chicken on both sides, 5 minutes total.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from heat.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Line a baking sheet with parchment paper.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Cut pastry into 8 pieces.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Place a piece of cheese on each pastry square and top with spoonfuls of fig preserves and the chicken pieces. Pinch and seal the dough up and over the meat and cheese, seal with egg wash, flip the pastry packets over and brush the tops with remaining egg wash.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fig-preserves.jpg', u'id': 11519297, u'name': u'fig jam'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake 12 to15 minutes, until golden.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'For entree portions, simply leave chicken breast whole and cut the pastry into quarters. Trim off excess dough and use it to decorate the pastry with small cut outs such as heart shapes.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Ghost Pines Sonoma County Napa County Monterey County Chardonnay. It has 5 out of 5 stars and a bottle costs about 27 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 3309, u'instructions': u'Watch how to make this recipe.                    Preheat oven to 400 degrees F.                          Season the chicken with salt, pepper and rosemary. Cut each piece of chicken in half across the breast giving you 8 equal portions. Heat the oil in a nonstick skillet over medium-high heat. Lightly brown the chicken on both sides, 5 minutes total. Remove from heat.                          Line a baking sheet with parchment paper. Cut pastry into 8 pieces. Place a piece of cheese on each pastry square and top with spoonfuls of fig preserves and the chicken pieces. Pinch and seal the dough up and over the meat and cheese, seal with egg wash, flip the pastry packets over and brush the tops with remaining egg wash. Bake 12 to15 minutes, until golden.                          For entree portions, simply leave chicken breast whole and cut the pastry into quarters. Trim off excess dough and use it to decorate the pastry with small cut outs such as heart shapes.', u'spoonacularSourceUrl': u'https://spoonacular.com/love-birds-chicken-in-pastry-750792', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}