{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/599639-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 599639, u'veryPopular': False, u'lowFodmap': False, u'title': u'Commanders Palace Seafood Gumbo', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 730.14, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'3 Bay Leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1/4 cup chopped Bell Pepper', u'aisle': u'Produce', u'name': u'bell pepper', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10211821, u'unit': u'cup'}, {u'originalString': u'1 (8 ounces) can Tomato Sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'1/2 cup chopped Celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 pounds Claw Crabmeat', u'aisle': u'Seafood', u'name': u'crabmeat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10015136, u'unit': u'pounds'}, {u'originalString': u'6 tablespoon Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'6 cloves Garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 6.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 8 (ounce) package frozen Okra', u'aisle': u'Produce', u'name': u'okra', u'metaInformation': [u'frozen', u'(ounce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/okra.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 11278, u'unit': u'ounce'}, {u'originalString': u'1/2 cup diced Onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 pint Oysters with Juice', u'aisle': u'Seafood', u'name': u'oysters', u'metaInformation': [u'with juice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'unitLong': u'pints', u'unitShort': u'pts', u'amount': 0.5, u'consistency': u'solid', u'id': 15167, u'unit': u'pint'}, {u'originalString': u'1/4 bunch chopped Parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'bunch'}, {u'originalString': u'2 pounds peeled raw Shrimp', u'aisle': u'Seafood', u'name': u'raw shrimp', u'metaInformation': [u'raw', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pounds'}, {u'originalString': u'Salt and Pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 cup Shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon Thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'3 quarts Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'quarts'}], u'healthScore': 37.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.copykat.com/2009/03/28/commanders-seafood-gumbo/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make a roux with the flour and shortening.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add garlic and cook until golden brown.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add onion, bell pepper, and celery and cook until transparent.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add shrimp and tomato sauce, simmer 10 minutes, stir in water, and blend well.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add all other ingredients except okra and oysters. Cook 1 hour, add okra, and cook 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'id': 15167, u'name': u'oysters'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/okra.jpg', u'id': 11278, u'name': u'okra'}]}, {u'equipment': [], u'step': u'Add oysters and cook 10 minutes longer.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oysters.jpg', u'id': 15167, u'name': u'oysters'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve in a soup bowl over steamed rice.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Gumbo on the menu? Try pairing with Sauvignon Blanc, ros\xe9 Wine, and Albarino. These low-tannin, lower alcohol wines will complement the heat in spicy cajun dishes, instead of making your mouth burn more. One wine you could try is Matetic EQ Coastal Sauvignon Blanc. It has 4.3 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'sauvignon blanc', u'rose wine', u'albarino'], u'productMatches': [{u'description': u'This wine is a very pale yellow color, with green hues. The nose is complex and delicate, with aromas of mature tropical fruit such as mango, lychee and papaya with subtle notes of apple custard and lime peel, mixed in with herbal and floral notes. The mouth is concentrated, fruity and fresh, dominated by a persistent mineral overtone.This Sauvignon Blanc is ideally served with seafood such as salmon or bluefish, ceviche, sea urchin and oysters. It also pairs well with goat cheese and sharp, blue cheeses.', u'title': u'Matetic EQ Coastal Sauvignon Blanc', u'price': u'$15.99', u'id': 438910, u'link': u'https://www.wine.com/product/matetic-eq-coastal-sauvignon-blanc-2014/138531', u'imageUrl': u'https://spoonacular.com/productImages/438910-312x231.jpg'}]}, u'aggregateLikes': 303, u'instructions': u'Make a roux with the flour and shortening. Add garlic and cook until golden brown. Add onion, bell pepper, and celery and cook until transparent. Add shrimp and tomato sauce, simmer 10 minutes, stir in water, and blend well. Add all other ingredients except okra and oysters. Cook 1 hour, add okra, and cook 20 minutes. Add oysters and cook 10 minutes longer. Serve in a soup bowl over steamed rice.Yield: 1 gallon', u'spoonacularSourceUrl': u'https://spoonacular.com/commanders-palace-seafood-gumbo-599639', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}