{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/224423-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 22, u'id': 224423, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy mince pies with crunchy crumble tops', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 63.78, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'200g apricot jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19719, u'unit': u'g'}, {u'originalString': u'25ml brandy', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 25.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'ml'}, {u'originalString': u'50g butter, cut into cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'300g dried mixed fruit', u'aisle': u'Produce;Baking', u'name': u'dried fruit', u'metaInformation': [u'mixed', u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candied-orange.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 9426, u'unit': u'g'}, {u'originalString': u'1 egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'100g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'50g whole almonds, roughly chopped', u'aisle': u'Nuts', u'name': u'whole almonds', u'metaInformation': [u'whole', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12061, u'unit': u'g'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1837667/easy-mince-pies-with-crunchy-crumble-tops', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Put the dried fruit and jam in a smallpan, heat until melted together, thenstir in the brandy and cool.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-fruit-mixed.jpg', u'id': 9426, u'name': u'dried fruit'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat ovento 200C/180C fan/gas 6.For the pastry, set aside 2 tbsp flourand put the rest plus the butter in a foodprocessor. Whizz until there are nolumps of butter. Pulse in the egg yolk,followed by a tbsp of water at a time,until the dough comes together – you’llprobably need 2 tbsp. (If you don’t havea food processor, rub butter into the flourwith your fingers, then stir in the yolk andwater with a round-bladed knife.) Usethe reserved flour to roll out the pastryto just over the thickness of a \xa31 coin.Stamp circles with an 8cm cutter andpress into holes of a bun tin – you shouldget 15 from re-rolling the trimmings.Divide the fruit amongst the pies, thenbake for 5 mins while you rub together allthe crumble ingredients with your fingers.Top each pie with crumble, then returnto the oven for 15 mins until pastry andcrumble are golden. Eat warm or colddusted with icing sugar.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie can be paired with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 40, u'instructions': u'Put the dried fruit and jam in a smallpan, heat until melted together, thenstir in the brandy and cool. Heat ovento 200C/180C fan/gas 6.For the pastry, set aside 2 tbsp flourand put the rest plus the butter in a foodprocessor. Whizz until there are nolumps of butter. Pulse in the egg yolk,followed by a tbsp of water at a time,until the dough comes together – you’llprobably need 2 tbsp. (If you don’t havea food processor, rub butter into the flourwith your fingers, then stir in the yolk andwater with a round-bladed knife.) Usethe reserved flour to roll out the pastryto just over the thickness of a \xa31 coin.Stamp circles with an 8cm cutter andpress into holes of a bun tin – you shouldget 15 from re-rolling the trimmings.Divide the fruit amongst the pies, thenbake for 5 mins while you rub together allthe crumble ingredients with your fingers.Top each pie with crumble, then returnto the oven for 15 mins until pastry andcrumble are golden. Eat warm or colddusted with icing sugar.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-mince-pies-with-crunchy-crumble-tops-224423', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 47, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}