{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/514571-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 514571, u'veryPopular': False, u'lowFodmap': False, u'title': u'Couscous Antipasto Salad with Tomato Vinaigrette PLUS Antipasto Skewers', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 412.33, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'freshly ground black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'\xbc tsp. garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 c. grape tomatoes, halved', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10111529, u'unit': u'c'}, {u'originalString': u'\xbd tsp. Italian seasoning', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022027, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'6 oz. jar marinated artichoke hearts, drained and roughly chopped', u'aisle': u'Canned and Jarred', u'name': u'marinated artichoke hearts', u'metaInformation': [u'drained', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 93828, u'unit': u'oz'}, {u'originalString': u'3 oz. fresh mozzarella, diced into \xbe" cubes', u'aisle': u'Cheese', u'name': u'mozzarella', u'metaInformation': [u'fresh', u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1026, u'unit': u'oz'}, {u'originalString': u'1 c. marinated mushrooms (if unavailable, use fresh mushrooms), quartered', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'fresh', u'quartered', u'(if unavailable, use mushrooms)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'c'}, {u'originalString': u'2 tbsp. olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbc tsp. onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'6 oz. box plain pearl couscous', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'pearl couscous', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-israeli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10020028, u'unit': u'oz'}, {u'originalString': u'3 oz. salami, diced into bite-sized pieces', u'aisle': u'Meat', u'name': u'salami', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 7071, u'unit': u'oz'}, {u'originalString': u'seasoned salt (or salt and pepper)', u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [u'(or salt and pepper)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1042047, u'unit': u'servings'}, {u'originalString': u'1 tbsp. tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp. white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'tbsp'}, {u'originalString': u'1 small yellow squash, sliced into bite-sized pieces', u'aisle': u'Produce', u'name': u'yellow squash', u'metaInformation': [u'yellow', u'small', u'sliced into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11641, u'unit': u''}, {u'originalString': u'1 small zucchini, sliced into bite-sized pieces', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'small', u'sliced into bite-sized pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://wearychef.com/2013/08/15/pearl-couscous-antipasto-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toaster.jpg', u'id': 404674, u'name': u'toaster'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To prepare the dressing, whisk together tomato paste, olive oil, vinegar, Italian seasoning, and salt in a small bowl. Set aside.Cook couscous according to package directions. When done, remove lid and allow to cool for at least 10 minutes before mixing with other ingredients.Meanwhile, arrange squash and zucchini in a single layer on a baking sheet lined with aluminum foil and sprayed with cooking spray. If you are using fresh mushrooms, include them here as well. Lightly sprinkle vegetables with seasoned salt or salt and pepper, then broil or roast at 400 degrees F for 7-10 minutes. (I do this part in my toaster oven.)In a large serving bowl, stir together salami, artichoke hearts, tomatoes, cheese, mushrooms, and roasted vegetables.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'artichoke hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'fresh mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1042047, u'name': u'seasoned salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'id': 7071, u'name': u'salami'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add dressing and couscous, and gently stir together until well combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'id': 20028, u'name': u'couscous'}]}, {u'equipment': [], u'step': u'Serve immediately, or refrigerate until ready to enjoy.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 79, u'instructions': u'To prepare the dressing, whisk together tomato paste, olive oil, vinegar, Italian seasoning, and salt in a small bowl. Set aside.Cook couscous according to package directions. When done, remove lid and allow to cool for at least 10 minutes before mixing with other ingredients.Meanwhile, arrange squash and zucchini in a single layer on a baking sheet lined with aluminum foil and sprayed with cooking spray. If you are using fresh mushrooms, include them here as well. Lightly sprinkle vegetables with seasoned salt or salt and pepper, then broil or roast at 400 degrees F for 7-10 minutes. (I do this part in my toaster oven.)In a large serving bowl, stir together salami, artichoke hearts, tomatoes, cheese, mushrooms, and roasted vegetables. Add dressing and couscous, and gently stir together until well combined. Serve immediately, or refrigerate until ready to enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/couscous-antipasto-salad-with-tomato-vinaigrette-plus-antipasto-skewers-514571', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}