{u'recipes': [{u'sourceName': u'Simply Sugar and Gluten Free', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/539596-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 539596, u'veryPopular': True, u'lowFodmap': False, u'title': u'3 Tips for Making Perfect Frozen (Greek) Yogurt', u'diets': [u'gluten free'], u'pricePerServing': 164.34, u'creditText': u'Simply Sugar and Gluten Free', u'extendedIngredients': [{u'originalString': u'generous 1/3 cup agave nectar', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 19912, u'unit': u'cup'}, {u'originalString': u'1 tablespoon arrowroot', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20003, u'unit': u'tablespoon'}, {u'originalString': u'2 extra-large eggs, separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'extra-large', u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon unflavored gelatin', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [u'unflavored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19177, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1 cup 1% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'1%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 cups plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://simplysugarandglutenfree.com/3-tips-for-making-perfect-frozen-greek-yogurt/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put gelatin and arrowroot in separate bowls.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20003, u'name': u'arrowroot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}]}, {u'equipment': [], u'step': u'Add about 2 tablespoons of milk to each and stir well.  Set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together remaining milk and egg yolks in a small sauce pan and heat over medium low.  Stir in gelatin mixture, and heating and stirring until mixture has thickened and gelatin has dissolved.  Stir in arrowroot, heat for a minute more, and then remove from heat.  Take care not to boil this mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20003, u'name': u'arrowroot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl and let cool.In a separate bowl, whisk together greek yogurt, lemon juice, lemon zest, and agave.  Once egg yolk mixture has cooled, whisk it into yogurt mixture until thoroughly combined.  Cover and refrigerate for at least 3 hours or overnight.Just before stir-freezing, whip egg whites to soft peaks.  Stir yogurt mixture well.  Stir 1/4 of the egg whites into the frozen yogurt base.  Fold the remaining whites in.  Stir freeze according to manufacturer’s directions.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Yogurt works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1090, u'instructions': u'Put gelatin and arrowroot in separate bowls.  Add about 2 tablespoons of milk to each and stir well.  Set aside.Whisk together remaining milk and egg yolks in a small sauce pan and heat over medium low.  Stir in gelatin mixture, and heating and stirring until mixture has thickened and gelatin has dissolved.  Stir in arrowroot, heat for a minute more, and then remove from heat.  Take care not to boil this mixture.  Transfer to a bowl and let cool.In a separate bowl, whisk together greek yogurt, lemon juice, lemon zest, and agave.  Once egg yolk mixture has cooled, whisk it into yogurt mixture until thoroughly combined.  Cover and refrigerate for at least 3 hours or overnight.Just before stir-freezing, whip egg whites to soft peaks.  Stir yogurt mixture well.  Stir 1/4 of the egg whites into the frozen yogurt base.  Fold the remaining whites in.  Stir freeze according to manufacturer’s directions.', u'spoonacularSourceUrl': u'https://spoonacular.com/3-tips-for-making-perfect-frozen-greek-yogurt-539596', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}