{u'recipes': [{u'sourceName': u'Natashas Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/583005-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 583005, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Spinach Salad with Chicken and Baby Tomatoes', u'diets': [u'gluten free', u'dairy free', u'whole 30'], u'preparationMinutes': 20, u'pricePerServing': 109.86, u'creditText': u'Natashas Kitchen', u'extendedIngredients': [{u'originalString': u'6 strips bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}, {u'originalString': u'2 chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'1 to 1\xbd cups croutons', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'croutons', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18242, u'unit': u'cups'}, {u'originalString': u'2 Tbsp green onion/chives', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'Tbsp'}, {u'originalString': u'3 Tbsp mayo', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'Tbsp'}, {u'originalString': u'Salt and pepper for chicken', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'for chicken'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'6 oz bag of fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'oz'}, {u'originalString': u'10 oz (1\xbd cups) baby tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11529, u'unit': u'cups'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://natashaskitchen.com/2010/06/08/creamy-spinach-salad-with-chicken-and-baby-tomatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Use a food processor to mince the spinach.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Add mayo and lemon juice and mix until well combined and creamy.Season chicken with salt and pepper and saute until cooked through. Cool chicken\xa0to room temp. Dice into \xbd-inch chunks.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Saute bacon until crunchy. Dry/drain on paper towels . Chop bacon.Finely chop green onion or chives', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Cut the tomatoes in halves or quarters depending on tomato size.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [], u'step': u'Mix all the ingredients and dressing together just before serving.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 51, u'instructions': u'Use a food processor to mince the spinach. Add mayo and lemon juice and mix until well combined and creamy.Season chicken with salt and pepper and saute until cooked through. Cool chicken\xa0to room temp. Dice into \xbd-inch chunks.Saute bacon until crunchy. Dry/drain on paper towels . Chop bacon.Finely chop green onion or chivesCut the tomatoes in halves or quarters depending on tomato size.Mix all the ingredients and dressing together just before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-spinach-salad-with-chicken-and-baby-tomatoes-583005', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}