{u'recipes': [{u'sourceName': u'Picky Palate', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/249895-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 249895, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cap’n Crunch Macarons with Cap’n Crunch Cookie Dough Filling', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 27.47, u'creditText': u'Picky Palate', u'extendedIngredients': [{u'originalString': u'65 grams almond meal/flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond meal flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 65.0, u'consistency': u'solid', u'id': 93740, u'unit': u'grams'}, {u'originalString': u"1/2 cup crushed but not ground Cap'n Crunch Cereal", u'aisle': u'Cereal', u'name': u'captain crunch cereal', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/captain-crunch.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 99106, u'unit': u'cup'}, {u'originalString': u"45 grams finely ground up Cap'n Crunch Cereal", u'aisle': u'Cereal', u'name': u'captain crunch cereal', u'metaInformation': [u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/captain-crunch.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 45.0, u'consistency': u'solid', u'id': 99106, u'unit': u'grams'}, {u'originalString': u'95 grams egg whites (close to 3 large egg whites)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large', u'(close to 3 egg whites)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 95.0, u'consistency': u'solid', u'id': 1124, u'unit': u'grams'}, {u'originalString': u'3/4 cup Gold Medal all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'200 grams powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19336, u'unit': u'grams'}, {u'originalString': u'1 stick softened unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'stick', u'unitShort': u'stick', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'stick'}, {u'originalString': u'1/2 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://picky-palate.com/2013/07/01/capn-crunch-macarons/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scale.jpg', u'id': 404705, u'name': u'kitchen scale'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 280.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 280 degrees F. and line a large baking sheet with parchment paper. Weigh your egg whites, almond flour, powdered sugar, granulated sugar and ground Cap’n Crunch Cereal on your food scale.In a stand mixer with the whisk attachment add your weighed out egg whites, and sugar beating on medium speed. Beat on medium-high until stiff peaks form. Takes close to 5 minutes. See pictures for visuals. Set aside for a couple minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'id': 93740, u'name': u'almond flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Place the powdered sugar, almond flour and cereal into a large mixing bowl. Stir to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'id': 93740, u'name': u'almond flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sifter.jpg', u'id': 404708, u'name': u'sifter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Place in a sifter or fine sieve and sift until all dry ingredients have passed through. Gently fold in the egg whites to the dry ingredients, mixing only until just combined. See pictures for visuals', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place batter into a large pastry bag with a large round tip attached. Pipe rounds, about 1/2 inch apart onto a parchment lined baking sheet. Give a good tap or two of the pan to remove any bubbles.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake macarons for 22-25 minutes. You’ll see a shell on top with “feet” around the edges.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}], u'step': u'Let cool completely before removing. Once cooled, take an offset spatula to loosen from parchment. Pair the macarons close in size to each other to prepare for filling.To prepare eggless Cap’n Crunch Cookie Dough filling, beat softened butter and sugars until creamy and smooth. Stir in vanilla, flour, salt and cereal. If too thick, add a couple teaspoons of milk to loosen.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Place cookie dough into a large ziploc or pastry bag with a large round tip attached and pipe a dollop of frosting on the center of a macaron and top with a second macaron. Make sure your cookie dough is not too thick or it will not pipe out of the bag. I found it easiest to pipe it without a tip on the bag. I used my fingers to maneuver the dough evenly on the macaron.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve room temperature. Store any remaining macarons in the refrigerator.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Macarons. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 1486, u'instructions': u'Preheat oven to 280 degrees F. and line a large baking sheet with parchment paper. Weigh your egg whites, almond flour, powdered sugar, granulated sugar and ground Cap’n Crunch Cereal on your food scale.In a stand mixer with the whisk attachment add your weighed out egg whites, and sugar beating on medium speed. Beat on medium-high until stiff peaks form. Takes close to 5 minutes. See pictures for visuals. Set aside for a couple minutes.Place the powdered sugar, almond flour and cereal into a large mixing bowl. Stir to combine. Place in a sifter or fine sieve and sift until all dry ingredients have passed through. Gently fold in the egg whites to the dry ingredients, mixing only until just combined. See pictures for visualsPlace batter into a large pastry bag with a large round tip attached. Pipe rounds, about 1/2 inch apart onto a parchment lined baking sheet. Give a good tap or two of the pan to remove any bubbles.Bake macarons for 22-25 minutes. You’ll see a shell on top with “feet” around the edges. Let cool completely before removing. Once cooled, take an offset spatula to loosen from parchment. Pair the macarons close in size to each other to prepare for filling.To prepare eggless Cap’n Crunch Cookie Dough filling, beat softened butter and sugars until creamy and smooth. Stir in vanilla, flour, salt and cereal. If too thick, add a couple teaspoons of milk to loosen.Place cookie dough into a large ziploc or pastry bag with a large round tip attached and pipe a dollop of frosting on the center of a macaron and top with a second macaron. Make sure your cookie dough is not too thick or it will not pipe out of the bag. I found it easiest to pipe it without a tip on the bag. I used my fingers to maneuver the dough evenly on the macaron. Serve room temperature. Store any remaining macarons in the refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/capn-crunch-macarons-with-capn-crunch-cookie-dough-filling-249895', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 22, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}