{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/758703-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 758703, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spicy Asian Spinach Salad with Toasted Pumpkin Seeds', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30'], u'pricePerServing': 94.9, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'4 cups baby spinach leaves', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'1 cup bean sprouts', u'aisle': u'Produce;Ethnic Foods', u'name': u'bean sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11043, u'unit': u'cup'}, {u'originalString': u'1 Tbs. canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tbs'}, {u'originalString': u'1 cup grated carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'2 large eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc tsp. grated fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'\xbc cup thinly sliced fresh mint leaves', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'2 green onions, chopped (\xbc cup)', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 Tbs. lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'Tbs'}, {u'originalString': u'\xbd cup toasted unsalted pumpkin seeds or pepitas', u'aisle': u'Savory Snacks', u'name': u'pumpkin seeds', u'metaInformation': [u'unsalted', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12014, u'unit': u'cup'}, {u'originalString': u'\xbd tsp. sriracha chile sauce', u'aisle': u'Condiments', u'name': u'sriracha sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1016168, u'unit': u'tsp'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/spicy-asian-spinach-salad-with-toasted-pumpkin-seeds/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To make Salad: Coat small skillet with cooking spray, and heat over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour eggs in skillet, and cook 2 to 3 minutes, or until firmly set.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}], u'step': u'Transfer omelet to cutting board to cool.  2. Stack 5 or 6 spinach leaves, and roll stack lengthwise into tight cylinder.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Cut crosswise in fine slices. Repeat with remaining spinach leaves.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together \u2028all ingredients in small bowl. Season with salt and pepper, if desired.4. Chop omelet into 1/2-inch pieces.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add to spinach in bowl along with bean sprouts, carrots, pumpkin seeds, green onions, and mint leaves.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'id': 11043, u'name': u'bean sprouts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Add Dressing, and toss to coat.', u'number': 3, u'ingredients': []}], u'name': u'Transfer to large bowl, and set aside. 3. To make Dressing'}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 421, u'instructions': u'1. To make Salad: Coat small skillet with cooking spray, and heat over medium heat. Pour eggs in skillet, and cook 2 to 3 minutes, or until firmly set. Transfer omelet to cutting board to cool.  2. Stack 5 or 6 spinach leaves, and roll stack lengthwise into tight cylinder. Cut crosswise in fine slices. Repeat with remaining spinach leaves. Transfer to large bowl, and set aside. 3. To make Dressing: Whisk together \u2028all ingredients in small bowl. Season with salt and pepper, if desired.4. Chop omelet into 1/2-inch pieces. Add to spinach in bowl along with bean sprouts, carrots, pumpkin seeds, green onions, and mint leaves. Add Dressing, and toss to coat.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-asian-spinach-salad-with-toasted-pumpkin-seeds-758703', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}