{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/405716-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 405716, u'veryPopular': False, u'lowFodmap': False, u'title': u'Primavera With Prosciutto, Asparagus and Carrots', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 273.54, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 pound asparagus spears, stems trimmed, cut into 1 1/2-inch lengths', u'aisle': u'Produce', u'name': u'asparagus spears', u'metaInformation': [u'trimmed', u'cut into 1 1/2-inch lengths'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11011, u'unit': u'pound'}, {u'originalString': u'1 large carrot, cut into matchsticks', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'large', u'cut into matchsticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'3 tablespoons dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 cup chicken stock, preferably homemade or low-sodium store-bought', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken stock', u'metaInformation': [u'low-sodium', u'homemade', u'store-bought'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1006970, u'unit': u'cup'}, {u'originalString': u'1 tablespoon extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 pound penne or farfalle', u'aisle': u'Pasta and Rice', u'name': u'penne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'pound'}, {u'originalString': u'8 ounces sliced prosciutto, jamon iberico or other high-quality ham, diced', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [u'diced', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 large shallot, sliced 1/8 inch thick', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 cup snap peas', u'aisle': u'Produce', u'name': u'snap peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011300, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpeg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ted-allen/primavera-with-prosciutto-asparagus-and-carrots-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Bring a pot of water to a boil, salt it generously and cook the pasta for 8 minutes; add the asparagus, carrot and snap peas and cook for 3 minutes. Check the pasta and vegetables to make sure they're cooked through but still have texture, then drain.", u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'id': 10011300, u'name': u'sugar snap peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'While the pasta is cooking, heat the olive oil in a large saute pan, add the ham and shallot and cook until lightly browned, 3 minutes or so.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add the garlic and pepper flakes and cook until fragrant, 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the cream, stock and mustard and simmer for a minute or two, scraping up any brown bits.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the pasta and vegetables to the pan. Toss and cook for another 2 minutes, until cooked through and the pasta is coated. Taste for seasoning, add salt if necessary and serve immediately in warm bowls.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Photograph by Kat Teutsch', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 11, u'instructions': u"Bring a pot of water to a boil, salt it generously and cook the pasta for 8 minutes; add the asparagus, carrot and snap peas and cook for 3 minutes. Check the pasta and vegetables to make sure they're cooked through but still have texture, then drain.                          While the pasta is cooking, heat the olive oil in a large saute pan, add the ham and shallot and cook until lightly browned, 3 minutes or so. Add the garlic and pepper flakes and cook until fragrant, 1 minute. Add the cream, stock and mustard and simmer for a minute or two, scraping up any brown bits.                          Add the pasta and vegetables to the pan. Toss and cook for another 2 minutes, until cooked through and the pasta is coated. Taste for seasoning, add salt if necessary and serve immediately in warm bowls.                          Photograph by Kat Teutsch", u'spoonacularSourceUrl': u'https://spoonacular.com/primavera-with-prosciutto-asparagus-and-carrots-405716', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}