{u'recipes': [{u'sourceName': u'Persnickety Plates', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/694923-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 694923, u'veryPopular': True, u'lowFodmap': True, u'title': u'Slow Cooker Cinnamon Sugar Candied Almonds', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 368.05, u'creditText': u'Persnickety Plates', u'extendedIngredients': [{u'originalString': u'4.5 cups raw almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.5, u'consistency': u'solid', u'id': 12061, u'unit': u'cups'}, {u'originalString': u'3 Tablespoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2010, u'unit': u'Tablespoons'}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'1.5 cups light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cups'}, {u'originalString': u'⅛ teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1.5 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'2 teaspoons vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.persnicketyplates.com/slow-cooker-cinnamon-sugar-candied-almonds/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 64, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spray your slow cooker with non-stick spray and set aside.In a large bowl, add the sugar, brown sugar, cinnamon, and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk together.In another large bowl, add the egg white and vanilla and whisk until frothy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Pour the almonds in the egg mixture and toss them around to coat thoroughly.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [], u'step': u'Pour the coated almonds into the sugar mixture and toss to coat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Pour the entire mixture into the slow cooker and turn to low.Cook for 3-3.5 hours, stirring every 20 minutes. It will look like not much is happening for a long time but your house will smell good!After 3 hours, pour in the  cup of water and stir well. This is going to make the crunchy coating and things will start looking right. Leave in the slow cooker for another 20-30 minutes.Meanwhile, line a baking sheet with parchment paper.When done, pour the almonds onto the prepared baking sheet and separate any that stuck together.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Let them cool slightly to harden then enjoy!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Banfi Rosa Regale Brachetto ( half-bottle). Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"This sparkling red wine made from Brachetto d'Acqui in Piedmont, Italy is love at first sip and a perpetual crowd pleaser. The color is a festive cranberry. Aromatic with hints of raspberries, strawberries and rose petals. There is a taste of fresh raspberries, with crisp acidity, enticing the palate with an initial softness, graduating to a clean and dry finish. Perfect for any occasion. A unique and festive sparkling wine, seductive aperitif, and elegant dessert wine. Pairs well with seafood, cheeses, spicy fare and chocolate. Serve chilled.", u'title': u'Banfi Rosa Regale Brachetto ( half-bottle)', u'price': u'$12.99', u'id': 448167, u'link': u'https://www.wine.com/product/banfi-rosa-regale-brachetto-375ml-half-bottle-2012/130015', u'imageUrl': u'https://spoonacular.com/productImages/448167-312x231.jpg'}]}, u'aggregateLikes': 12414, u'instructions': u'Spray your slow cooker with non-stick spray and set aside.In a large bowl, add the sugar, brown sugar, cinnamon, and salt. Whisk together.In another large bowl, add the egg white and vanilla and whisk until frothy.Pour the almonds in the egg mixture and toss them around to coat thoroughly.Pour the coated almonds into the sugar mixture and toss to coat.Pour the entire mixture into the slow cooker and turn to low.Cook for 3-3.5 hours, stirring every 20 minutes. It will look like not much is happening for a long time but your house will smell good!After 3 hours, pour in the  cup of water and stir well. This is going to make the crunchy coating and things will start looking right. Leave in the slow cooker for another 20-30 minutes.Meanwhile, line a baking sheet with parchment paper.When done, pour the almonds onto the prepared baking sheet and separate any that stuck together. Let them cool slightly to harden then enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-cinnamon-sugar-candied-almonds-694923', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}