{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [u'asian', u'vietnames'], u'image': u'https://spoonacular.com/recipeImages/527305-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 527305, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vietnamese Pho Soup', u'diets': [u'dairy free'], u'pricePerServing': 383.73, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'Garnishes: bean sprouts, fresh cilantro, fresh ginger slices, lime wedges, thinly-chopped green onions, thinly-sliced jalapenos, Thai basil', u'aisle': u'Produce;Ethnic Foods', u'name': u'bean sprouts', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11043, u'unit': u'slices'}, {u'originalString': u'8 cups beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cups'}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'4 cloves of garlic, roughly minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 (3-inch) knob of ginger, sliced into coins', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'sliced into coins'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 3.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'1 package pho rice noodles (look for the word "pho" on the package)', u'aisle': u'Pasta and Rice;Gluten Free;Ethnic Foods', u'name': u'rice noodles', u'metaInformation': [u'for the word "pho" on the package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-noodles.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 20133, u'unit': u'package'}, {u'originalString': u'salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'12 ounces steak, very thinly sliced against the grain (I used flank steak)', u'aisle': u'Meat', u'name': u'steak', u'metaInformation': [u'very thinly sliced', u'(I used flank steak)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 23232, u'unit': u'ounces'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u"3 whole star anise (optional if you don't like the flavor)", u'aisle': u'Spices and Seasonings', u'name': u'whole star anise', u'metaInformation': [u'whole', u"(optional if you don't like the flavor)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}, {u'originalString': u'1 medium yellow onion, quartered', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.gimmesomeoven.com/vietnamese-pho-soup-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Stir together beef broth, water, onion, garlic, star anise, cloves, ginger, cinnamon stick (and fish sauce, if using) in a large stockpot, and bring to a boil over high heat. Cover, reduce heat to medium-low, and let simmer for at least 20 minutes.Meanwhile, cook the noodles according to package instructions. (If your package of noodles -- like mine -- did not have instructions, simply bring a large pot of water to a boil. Then cook the noodles until al dente, about 3 minutes.) Immediately drain the noodles, and rinse with cold water to stop the cooking.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 1002010, u'name': u'cinnamon stick'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Drain and set aside.When you are ready to serve the soup, fill the serving bowls about halfway full with noodles. Then cover with the hot broth, and immediately stir in the steak so that it cooks. Top with your desired garnishes. (*Most people stir the cilantro, ginger, lime, jalapenos and Thai basil into the broth to give it extra flavoring, but you don't necessarily need to actually eat those ingredients whole.)", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 481, u'instructions': u"Stir together beef broth, water, onion, garlic, star anise, cloves, ginger, cinnamon stick (and fish sauce, if using) in a large stockpot, and bring to a boil over high heat. Cover, reduce heat to medium-low, and let simmer for at least 20 minutes.Meanwhile, cook the noodles according to package instructions. (If your package of noodles -- like mine -- did not have instructions, simply bring a large pot of water to a boil. Then cook the noodles until al dente, about 3 minutes.) Immediately drain the noodles, and rinse with cold water to stop the cooking. Drain and set aside.When you are ready to serve the soup, fill the serving bowls about halfway full with noodles. Then cover with the hot broth, and immediately stir in the steak so that it cooks. Top with your desired garnishes. (*Most people stir the cilantro, ginger, lime, jalapenos and Thai basil into the broth to give it extra flavoring, but you don't necessarily need to actually eat those ingredients whole.)", u'spoonacularSourceUrl': u'https://spoonacular.com/vietnamese-pho-soup-527305', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}