{u'recipes': [{u'sourceName': u'Somethings Wanky', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598122-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 598122, u'veryPopular': True, u'lowFodmap': False, u'title': u'Homemade Reese’s Easter Eggs', u'diets': [u'gluten free'], u'pricePerServing': 56.31, u'creditText': u'Somethings Wanky', u'extendedIngredients': [{u'originalString': u'16 oz. Candiquik (or melting chocolate wafers)', u'aisle': u'Baking', u'name': u'candiquik', u'metaInformation': [u'(or melting chocolate wafers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 98857, u'unit': u'oz'}, {u'originalString': u"3/4 cups creamy peanut butter (use Reese's brand for the most authentic taste)", u'aisle': u'Nut butters, Jams, and Honey', u'name': u'creamy peanut butter', u'metaInformation': [u'for the most authentic taste)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10116098, u'unit': u'cups'}, {u'originalString': u'2 teaspoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'teaspoons'}, {u'originalString': u'1 1/2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.somethingswanky.com/homemade-reeses-easter-eggs/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'In a medium large bowl beat together the peanut butter, powdered sugar, vanilla, and milk until a smooth "dough" forms. Use a cookie scoop to portion out balls of the filling. Shape each ball into an egg-like shape and place it on a lined (parchment, foil, wax paper, silicone) baking sheet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'id': 16098, u'name': u'peanut butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wax-paper.jpg', u'id': 404739, u'name': u'wax paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u"Place sheet in the freezer for 10 minutes.Meanwhile, melt the chocolate according to manufacturer's directions. Prepare a counter top for placing the dipped eggs on by lining it with parchment, wax paper, foil, or a silicone mat.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove peanut butter eggs from the freezer. One at a time, drop them into the chocolate. Use a fork to cover the top in chocolate. Slip the fork underneath the egg and let excess chocolate drip off the fork. Slide the egg onto prepared counter top to cool and harden before eating.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 5221, u'instructions': u'In a medium large bowl beat together the peanut butter, powdered sugar, vanilla, and milk until a smooth "dough" forms. Use a cookie scoop to portion out balls of the filling. Shape each ball into an egg-like shape and place it on a lined (parchment, foil, wax paper, silicone) baking sheet. Place sheet in the freezer for 10 minutes.Meanwhile, melt the chocolate according to manufacturer\'s directions. Prepare a counter top for placing the dipped eggs on by lining it with parchment, wax paper, foil, or a silicone mat.Remove peanut butter eggs from the freezer. One at a time, drop them into the chocolate. Use a fork to cover the top in chocolate. Slip the fork underneath the egg and let excess chocolate drip off the fork. Slide the egg onto prepared counter top to cool and harden before eating.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-reeses-easter-eggs-598122', u'dishTypes': [u'side dish'], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}