{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/761058-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 761058, u'veryPopular': False, u'lowFodmap': False, u'title': u'Black Bean Burgers with Tempeh Crisps', u'diets': [u'dairy free'], u'pricePerServing': 186.51, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'3 cups cooked black beans', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'black beans', u'metaInformation': [u'black', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 16015, u'unit': u'cups'}, {u'originalString': u'\xbd tsp. black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 cup bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 Tbs. catsup', u'aisle': u'Condiments', u'name': u'catsup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'Tbs'}, {u'originalString': u'2 Tbs. chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 2009, u'unit': u'Tbs'}, {u'originalString': u'2 cups cooked brown rice', u'aisle': u'Pasta and Rice', u'name': u'cooked brown rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20041, u'unit': u'cups'}, {u'originalString': u'\xbd tsp. pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbc cup chopped scallions', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'12 oz. tempeh, sliced into thin strips', u'aisle': u'Refrigerated;Frozen', u'name': u'tempeh', u'metaInformation': [u'sliced into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tempeh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 16114, u'unit': u'oz'}, {u'originalString': u'\xbd to \xbe cup water, or as needed to process', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'or as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u''}, {u'originalString': u'6 whole wheat buns', u'aisle': u'Bakery/Bread', u'name': u'whole wheat buns', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-wheat-hamburger-buns.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18351, u'unit': u''}], u'healthScore': 87.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/black-bean-burgers-with-tempeh-crisps/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wine Suggestions', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Beer and burgers are a time-honored match, so why mess with a good thing? Grab a frosty mug, pour in some of San Francisco’s famous Anchor Steam Beer and go for the gusto!', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 26, u'instructions': u'Wine SuggestionsBeer and burgers are a time-honored match, so why mess with a good thing? Grab a frosty mug, pour in some of San Francisco’s famous Anchor Steam Beer and go for the gusto!', u'spoonacularSourceUrl': u'https://spoonacular.com/black-bean-burgers-with-tempeh-crisps-761058', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}