{u'recipes': [{u'sourceName': u'Fifteen Spatulas', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/558888-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 558888, u'veryPopular': True, u'lowFodmap': False, u'title': u'Blueberry Meyer Lemon Muffins with Streusel Crumb Topping', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 43.08, u'creditText': u'Fifteen Spatulas', u'extendedIngredients': [{u'originalString': u'8 oz all purpose flour (about 1.5 cups)', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'2 cups blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cups'}, {u'originalString': u'1/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 tsp cinnamon (cinnamon goes beautifully with blueberries)', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [u'with blueberries)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 extra large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'extra large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2.5 oz flour (1/2 cup)', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'Zest of 2 meyer lemons', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1/3 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'3/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/3 cup vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.fifteenspatulas.com/blueberry-meyer-lemon-muffins-with-streusel-crumb-topping/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk to combine the flour, sugar, salt, baking powder and meyer lemon zest.  Take a tbsp of the mixture and toss it with the blueberries.  This ensures that the blueberries stay suspended throughout the muffin, instead of falling to the bottom.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the vegetable oil, egg, and milk in a bowl, and whisk to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u"Add that to the flour mixture, and remember, leave lots of lumps.  If there aren't any lumps whenever you are using the muffin method of baking, you have overmixed and invited more gluten (and toughness) to the party than was welcome.  Don't worry, a few lumps will bake out.Dump in the blueberries, and fold them in gently.  Use a disher to portion them out into the muffin cups, and sprinkle the crumb topping all over the tops.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 20-22 minutes until a toothpick inserted into the center comes out with no wet batter.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let them cool, and enjoy!', u'number': 5, u'ingredients': []}], u'name': u'Preheat the oven to 400 degrees F.  Line a muffin tin with paper liners.In the meantime, make the streusel crumb topping. Dice up the butter into cubes, and work all of the ingredients together with your fingertips, until it forms a bunch of crumbs and clumps. Chill in the fridge until ready for use.Back to the muffins'}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2590, u'instructions': u"Preheat the oven to 400 degrees F.  Line a muffin tin with paper liners.In the meantime, make the streusel crumb topping. Dice up the butter into cubes, and work all of the ingredients together with your fingertips, until it forms a bunch of crumbs and clumps. Chill in the fridge until ready for use.Back to the muffins: Whisk to combine the flour, sugar, salt, baking powder and meyer lemon zest.  Take a tbsp of the mixture and toss it with the blueberries.  This ensures that the blueberries stay suspended throughout the muffin, instead of falling to the bottom.Place the vegetable oil, egg, and milk in a bowl, and whisk to combine.  Add that to the flour mixture, and remember, leave lots of lumps.  If there aren't any lumps whenever you are using the muffin method of baking, you have overmixed and invited more gluten (and toughness) to the party than was welcome.  Don't worry, a few lumps will bake out.Dump in the blueberries, and fold them in gently.  Use a disher to portion them out into the muffin cups, and sprinkle the crumb topping all over the tops. Bake for 20-22 minutes until a toothpick inserted into the center comes out with no wet batter.  Let them cool, and enjoy!", u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-meyer-lemon-muffins-with-streusel-crumb-topping-558888', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}