{u'recipes': [{u'sourceName': u'Inside BruCrew Life', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/628659-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 628659, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Enchilada Orzo Soup', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 154.48, u'creditText': u'Inside BruCrew Life', u'extendedIngredients': [{u'originalString': u'1 - 15 oz. can black beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 16018, u'unit': u'oz'}, {u'originalString': u'1 - 15 oz. can corn, drained', u'aisle': u'Canned and Jarred', u'name': u'canned corn', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 11177, u'unit': u'oz'}, {u'originalString': u'1 - 14.5 oz. can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'2 cups cooked, diced chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'cups'}, {u'originalString': u'8 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'1 - 10 oz. can mild enchilada sauce', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'enchilada sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 6599, u'unit': u'oz'}, {u'originalString': u'1 cup uncooked orzo pasta (8 oz.)', u'aisle': u'Pasta and Rice', u'name': u'orzo pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 10920420, u'unit': u'oz'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://insidebrucrewlife.com/2015/01/chicken-enchilada-orzo-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bring the chicken broth to a boil in a large sauce pan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [], u'step': u'Add the orzo and cook until al dente.Stir in the enchilada sauce, chicken, tomatoes, beans, and corn. Cook until warmed through.Season to taste with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orzo.jpg', u'id': 10920420, u'name': u'orzo'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 114, u'instructions': u'Bring the chicken broth to a boil in a large sauce pan. Add the orzo and cook until al dente.Stir in the enchilada sauce, chicken, tomatoes, beans, and corn. Cook until warmed through.Season to taste with salt and pepper. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-enchilada-orzo-soup-628659', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}