{u'recipes': [{u'sourceName': u'An Edible Mosaic', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/810112-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 105, u'id': 810112, u'veryPopular': True, u'lowFodmap': False, u'title': u'Vanilla-Scented Sweet Potato Casserole with Toasted Hazelnut Streusel Topping', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 77.2, u'creditText': u'An Edible Mosaic', u'extendedIngredients': [{u'originalString': u'2 tablespoons plain, unsweetened almond “milk” (or your milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'plain', u'unsweetened', u'(or your milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'tablespoons'}, {u'originalString': u'\xbc teaspoon coarse kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbe teaspoon coarse kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon melted coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons melted coconut oil, plus more to grease the dish (or clarified butter)', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted', u'plus more to grease the dish (or clarified butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons coconut sugar (see Note)', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93831, u'unit': u'tablespoons'}, {u'originalString': u'\xbc teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'⅛ teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'⅛ teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup (56 g) hazelnut meal', u'aisle': u'Gluten Free;Health Foods', u'name': u'hazelnut meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 56.0, u'consistency': u'solid', u'id': 93810, u'unit': u'g'}, {u'originalString': u'1/3 cup (50 g) toasted whole hazelnuts', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'whole', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12120, u'unit': u'g'}, {u'originalString': u'2\xbd lbs (1.1 kg) sweet potatoes (or yams)', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'(or yams)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'kgs', u'unitShort': u'kg', u'amount': 1.1, u'consistency': u'solid', u'id': 11507, u'unit': u'kg'}, {u'originalString': u'\xbc teaspoon vanilla bean paste', u'aisle': u'Gourmet', u'name': u'vanilla bean paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 93813, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.anediblemosaic.com/vanilla-scented-sweet-potato-casserole-with-toasted-hazelnut-streusel-topping-paleo/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400F; wash the sweet potatoes (or yams) and use a sharp paring knife to poke several holes in each.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the potatoes into the oven directly on a rack in the center.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake the potatoes until tender, about 1 hour 15 minutes if youre using 2 (1 lbs each) potatoes. To check for doneness, insert the tines of a fork into the center of the potatoes; the fork should easily slide in and out. Cool the potatoes until theyre not too hot to handle.While the potatoes bake, make the topping.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add the hazelnut meal, coconut sugar, cinnamon, and salt to a food processor and pulse a couple times to combine. With the motor running, drizzle in the melted coconut oil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': None, u'id': 93810, u'name': u'hazelnut meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add the whole hazelnuts and pulse a few times until theyre coarsely chopped. Set aside.Preheat the oven to 350F; grease a 1-quart casserole dish with coconut oil.Once the potatoes are cool, peel them and add the flesh to a food processor along with all other ingredients for the sweet potato puree; process until completely smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Spread the sweet potato puree into the prepared casserole dish; sprinkle on the hazelnut topping.Cover the dish with foil and bake until warm throughout, about 30 minutes; serve.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'id': 12120, u'name': u'hazelnuts'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 656, u'instructions': u'Preheat the oven to 400F; wash the sweet potatoes (or yams) and use a sharp paring knife to poke several holes in each. Place the potatoes into the oven directly on a rack in the center. Bake the potatoes until tender, about 1 hour 15 minutes if youre using 2 (1 lbs each) potatoes. To check for doneness, insert the tines of a fork into the center of the potatoes; the fork should easily slide in and out. Cool the potatoes until theyre not too hot to handle.While the potatoes bake, make the topping. Add the hazelnut meal, coconut sugar, cinnamon, and salt to a food processor and pulse a couple times to combine. With the motor running, drizzle in the melted coconut oil. Add the whole hazelnuts and pulse a few times until theyre coarsely chopped. Set aside.Preheat the oven to 350F; grease a 1-quart casserole dish with coconut oil.Once the potatoes are cool, peel them and add the flesh to a food processor along with all other ingredients for the sweet potato puree; process until completely smooth.Spread the sweet potato puree into the prepared casserole dish; sprinkle on the hazelnut topping.Cover the dish with foil and bake until warm throughout, about 30 minutes; serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/vanilla-scented-sweet-potato-casserole-with-toasted-hazelnut-streusel-topping-810112', u'dishTypes': [u'side dish'], u'occasions': [u'fall', u'thanksgiving', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}