{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/751486-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 751486, u'veryPopular': True, u'lowFodmap': False, u'title': u'Rice Noodle Salad with Shrimp', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 346.83, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 large carrots, grated (about 2 cups)', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'grated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cups'}, {u'originalString': u'1 red Thai bird or serrano chile pepper, thinly sliced', u'aisle': u'Produce', u'name': u'chile pepper', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1/2 English cucumber, halved lengthwise and thinly sliced', u'aisle': u'Produce', u'name': u'english cucumber', u'metaInformation': [u'english', u'halved lengthwise', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/english-cucumber.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10111205, u'unit': u''}, {u'originalString': u'1 tablespoon fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'tablespoon'}, {u'originalString': u'2 large cloves garlic, grated', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'grated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 head red leaf lettuce, thinly sliced', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 11252, u'unit': u'head'}, {u'originalString': u'1/3 cup fresh lime juice (from 4 limes), plus wedges for serving', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh', u'for serving', u'(from 4 limes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'1 cup roughly chopped fresh cilantro and/or mint', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'1 8.8-ounce package thin rice noodles', u'aisle': u'Pasta and Rice;Gluten Free;Ethnic Foods', u'name': u'rice noodles', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.8, u'consistency': u'solid', u'id': 20133, u'unit': u'ounce'}, {u'originalString': u'12 ounces large shrimp (about 16), peeled and deveined, tails intact', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large', u'deveined', u'peeled', u'( 16)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'ounces'}, {u'originalString': u'3 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}], u'healthScore': 22.0, u'imageType': u'jpeg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/rice-noodle-salad-with-shrimp.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a large pot of water to a boil. Meanwhile, combine the sugar and 2 tablespoons hot water in a large bowl and stir until dissolved. Stir in the lime juice, garlic, chile and fish sauce; transfer 2 tablespoons of the dressing to a medium bowl and whisk in the vegetable oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'id': 6179, u'name': u'fish sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add the shrimp and toss to coat; set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Add the rice noodles to the boiling water and cook as the label directs; drain, rinse with cold water and shake off the excess liquid.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-rice-noodles.jpg', u'id': 20133, u'name': u'rice noodles'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the noodles to the bowl with the remaining dressing; add the lettuce, carrots, cucumber and herbs and toss to coat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat a grill pan over medium-high heat. Grill the shrimp until charred and cooked through, 2 to 3 minutes per side. Arrange over the noodles; serve with lime wedges.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Photograph by Justin Walker', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are my top picks for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. The Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 35 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'pineapple , guava , apricot', u'title': u'Mercer Estates Zephyr Ridge Vineyard Reserve Chardonnay', u'price': u'$35.0', u'id': 432105, u'link': u'https://www.amazon.com/Mercer-Estates-Vineyard-Reserve-Chardonnay/dp/B01IFNU7ZG', u'imageUrl': u'https://spoonacular.com/productImages/432105-312x231.jpg'}]}, u'aggregateLikes': 404, u'instructions': u'Bring a large pot of water to a boil. Meanwhile, combine the sugar and 2 tablespoons hot water in a large bowl and stir until dissolved. Stir in the lime juice, garlic, chile and fish sauce; transfer 2 tablespoons of the dressing to a medium bowl and whisk in the vegetable oil. Add the shrimp and toss to coat; set aside.                          Add the rice noodles to the boiling water and cook as the label directs; drain, rinse with cold water and shake off the excess liquid. Add the noodles to the bowl with the remaining dressing; add the lettuce, carrots, cucumber and herbs and toss to coat.                          Heat a grill pan over medium-high heat. Grill the shrimp until charred and cooked through, 2 to 3 minutes per side. Arrange over the noodles; serve with lime wedges.                          Photograph by Justin Walker', u'spoonacularSourceUrl': u'https://spoonacular.com/rice-noodle-salad-with-shrimp-751486', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}