{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217100-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 18, u'id': 217100, u'veryPopular': False, u'lowFodmap': False, u'title': u'Little mince pie cakes', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 56.11, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'175g softened butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'100g light muscovado sugar', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'g'}, {u'originalString': u'2 tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'about 140g mincemeat', u'aisle': u'Baking', u'name': u'mincemeat', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mincemeat.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 93706, u'unit': u'g'}, {u'originalString': u'1 tsp mixed spice', u'aisle': u'Spices and Seasonings', u'name': u'mixed spice', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022035, u'unit': u'tsp'}, {u'originalString': u'175g self-raising flour', u'aisle': u'Baking', u'name': u'self-raising flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 20129, u'unit': u'g'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2795/little-mince-pie-cakes', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 190.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 190C/fan 170C/gas 5. Line 12 bun tins with paper cases.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Put the flour, sugar, spice, butter, eggs and milk into a mixing bowl and beat with an electric hand whisk or wooden spoon for 2-3 mins, until the mix is light and fluffy.Put a spoonful of cake mix in each case, then a rounded tsp of mincemeat. Cover the mincemeat with a spoonful of cake mix and smooth.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mincemeat.jpg', u'id': 93706, u'name': u'mincemeat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Bake for 15-18 mins until golden brown and firm. Dust with icing sugar and serve warm or cold.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 191, u'instructions': u'Heat oven to 190C/fan 170C/gas 5. Line 12 bun tins with paper cases. Put the flour, sugar, spice, butter, eggs and milk into a mixing bowl and beat with an electric hand whisk or wooden spoon for 2-3 mins, until the mix is light and fluffy.Put a spoonful of cake mix in each case, then a rounded tsp of mincemeat. Cover the mincemeat with a spoonful of cake mix and smooth.Bake for 15-18 mins until golden brown and firm. Dust with icing sugar and serve warm or cold.', u'spoonacularSourceUrl': u'https://spoonacular.com/little-mince-pie-cakes-217100', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 33, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}