{u'recipes': [{u'sourceName': u'Simply Sugar and Gluten Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/539803-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 539803, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Blueberry Breakfast Oatmeal Pudding', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 100.18, u'creditText': u'Simply Sugar and Gluten Free', u'extendedIngredients': [{u'originalString': u'1-1/4 cups (300 ml) unsweetened, plain or vanilla soy or almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [u'plain', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'ml'}, {u'originalString': u'3/4 cup (180 ml) unsweetened applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 180.0, u'consistency': u'solid', u'id': 9019, u'unit': u'ml'}, {u'originalString': u'1/2 cup (120 ml) fresh or frozen blueberries (do not thaw first if frozen)', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [u'fresh', u'frozen', u'thaw', u'(do not first if )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 120.0, u'consistency': u'solid', u'id': 9050, u'unit': u'ml'}, {u'originalString': u'1/2 cup (75 g) lightly toasted cashews', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [u'lightly toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 12087, u'unit': u'g'}, {u'originalString': u'1 Tbsp (15 ml) chia seeds, optional', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 15.0, u'consistency': u'solid', u'id': 12006, u'unit': u'ml'}, {u'originalString': u'2 tsp (10 ml) cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 10.0, u'consistency': u'solid', u'id': 2010, u'unit': u'ml'}, {u'originalString': u'1/2 cup (75 g) lightly toasted hazelnuts (filberts), with skin', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'with skin', u'lightly toasted', u'(filberts)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 12120, u'unit': u'g'}, {u'originalString': u'1/2 cup (60 g) old-fashioned rolled oats (not instant)', u'aisle': u'Cereal', u'name': u'old fashioned rolled oats', u'metaInformation': [u'(not instant)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'1/8 tsp (0.5 ml) fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'ml'}, {u'originalString': u'2 tsp (10 ml) pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 10.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'ml'}, {u'originalString': u'2 Tbsp (30 ml) agave nectar or maple syrup, 15-20 drops stevia liquid, or a combination of the two', u'aisle': u'?', u'name': u'a combination of the two', u'metaInformation': [], u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 30.0, u'unit': u'ml'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://simplysugarandglutenfree.com/baked-blueberry-breakfast-oatmeal-pudding/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350F (180C).  Grease a 4-6 cup (1-1.5 L) casserole dish.In the bowl of a high-speed blender*, place the nuts, oats, chia, applesauce, vanilla, agave, cinnamon and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'id': 9019, u'name': u'applesauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour the milk over all and blend for about a minute, until perfectly smooth and creamy.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Pour mixture into the casserole dish, then gently fold in the blueberries (scatter a few extra blueberries over the top if you like, as they won’t sink).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'id': 9050, u'name': u'blueberries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 40-50 minutes, rotating the casserole about halfway through, until the edges begin to puff and crack and the top appears dry.  Allow to cool somewhat before serving. May be served warm or cold.  Makes 4-6 servings.  Store, covered, up to 4 days in the refrigerator.  May be frozen.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 249, u'instructions': u'Preheat oven to 350F (180C).  Grease a 4-6 cup (1-1.5 L) casserole dish.In the bowl of a high-speed blender*, place the nuts, oats, chia, applesauce, vanilla, agave, cinnamon and salt.  Pour the milk over all and blend for about a minute, until perfectly smooth and creamy.  Pour mixture into the casserole dish, then gently fold in the blueberries (scatter a few extra blueberries over the top if you like, as they won’t sink).Bake in preheated oven for 40-50 minutes, rotating the casserole about halfway through, until the edges begin to puff and crack and the top appears dry.  Allow to cool somewhat before serving. May be served warm or cold.  Makes 4-6 servings.  Store, covered, up to 4 days in the refrigerator.  May be frozen.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-blueberry-breakfast-oatmeal-pudding-539803', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}