{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/205287-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 205287, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Sweet Cherry Pies', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'pricePerServing': 74.11, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 quart golden, blush, or red sweet cherries, halved and pitted', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'sweet', u'red', u'pitted', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'solid', u'id': 9070, u'unit': u'quart'}, {u'originalString': u'Egg wash (1 egg beaten with a pinch of salt)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'with a pinch of salt)', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Approximately 4 ounces granulated sugar (adjust to taste)', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'to taste', u'(adjust )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'ounces'}, {u'originalString': u'Sanding sugar or additional granulated sugar for sprinkling', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}, {u'originalString': u'2 tablespoons corn starch or tapioca starch', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93696, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/06/pie-of-the-week-mini-sweet-cherry-pies-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Remove the first sheet of chilled dough from the fridge and use a 5-inch circular cutter to cut out 12 circles of dough. Press the circles into the cavities of the muffin pan, allowing excess dough to hang over the edges. Chill the shaped bottoms for 1 hour.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'After the bottoms have chilled for 1 hour, place the pitted, halved cherries in large bowl.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together sugar and starch to combine, then toss with cherries until the pieces are evenly coated. Allow mixture to sit for five minutes, then distribute the filling evenly among the 12 pie shells.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the second sheet of dough from the fridge and cut tops or shapes out and place over the tops of the mini pies. Crimp the sides with the tines of a fork to seal, cut some slits in the top if your design does not already involve cutouts, and chill the mini pies for 30 minutes. When ready to bake, remove pie from oven, brush with egg wash, and sprinkle with raw sugar.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Adjust oven rack to lower position and preheat oven to 425\xb0F.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place the muffin pan in oven and bake for 20 minutes, turning halfway through, then turn oven down to 350\xb0F and bake until filling bubbles all over inside and crust is golden brown, approximately 10 additional minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and place the muffin pan on a rack to cool completely before removing the pies. When ready to serve, loosen the edges with an offset spatula, then carefully twist the pies to remove.', u'number': 10, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 114, u'instructions': u'Procedures                                                                              1                                                                            Remove the first sheet of chilled dough from the fridge and use a 5-inch circular cutter to cut out 12 circles of dough. Press the circles into the cavities of the muffin pan, allowing excess dough to hang over the edges. Chill the shaped bottoms for 1 hour.                                                                                                                             2                                                                            After the bottoms have chilled for 1 hour, place the pitted, halved cherries in large bowl. Whisk together sugar and starch to combine, then toss with cherries until the pieces are evenly coated. Allow mixture to sit for five minutes, then distribute the filling evenly among the 12 pie shells. Remove the second sheet of dough from the fridge and cut tops or shapes out and place over the tops of the mini pies. Crimp the sides with the tines of a fork to seal, cut some slits in the top if your design does not already involve cutouts, and chill the mini pies for 30 minutes. When ready to bake, remove pie from oven, brush with egg wash, and sprinkle with raw sugar.                                                                                                                            3                                                                            Adjust oven rack to lower position and preheat oven to 425\xb0F. Place the muffin pan in oven and bake for 20 minutes, turning halfway through, then turn oven down to 350\xb0F and bake until filling bubbles all over inside and crust is golden brown, approximately 10 additional minutes. Remove from oven and place the muffin pan on a rack to cool completely before removing the pies. When ready to serve, loosen the edges with an offset spatula, then carefully twist the pies to remove.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-sweet-cherry-pies-205287', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 360, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}