{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217512-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 217512, u'veryPopular': False, u'lowFodmap': False, u'title': u'Medal cookies', u'diets': [], u'preparationMinutes': 35, u'pricePerServing': 209.2, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tsp bicarbonate of soda', u'aisle': u'Baking', u'name': u'bicarbonate of soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'140g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'3 tbsp golden syrup', u'aisle': u'Baking', u'name': u'golden syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93829, u'unit': u'tbsp'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1kg pack ready-to-roll icing', u'aisle': u'Baking', u'name': u'icing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 10019230, u'unit': u'kg'}, {u'originalString': u'icing sugar', u'aisle': u'Baking', u'name': u'icing sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 15.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u'100g light soft brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'15 long colourful ribbons', u'aisle': u'Pasta and Rice', u'name': u'long pasta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 11420420, u'unit': u''}, {u'originalString': u'\xbd tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2365639/medal-cookies', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.Line 2 baking trays with baking parchment.Melt the butter, sugar and syrup in a smallsaucepan.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in the vanilla, remove fromthe heat and leave to cool for 10 mins.Sieve the flour and bicarbonate of sodainto a bowl.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [], u'step': u'Pour in the melted buttermixture and the egg, and stir together toform a stiff-ish dough. Pop the dough inthe fridge for 10 mins to chill and firm up.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}], u'step': u'Roll the dough out on a floured surfaceto 5mm thick, then stamp out 15 circlesusing a 7.5cm round cookie cutter; youmay need to re-roll the trimmings to get15 cookies. Make a hole at the top ofeach circle with the end of a pencil.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Place on the baking trays and bakefor 12 mins until golden, swapping thetrays around halfway through. Cool ona wire rack. Decorate the cookies (seebelow), making sure the hole is at thetop of each one. Will keep for 3 daysin an airtight container.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 19, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Line 2 baking trays with baking parchment.Melt the butter, sugar and syrup in a smallsaucepan. Mix in the vanilla, remove fromthe heat and leave to cool for 10 mins.Sieve the flour and bicarbonate of sodainto a bowl. Pour in the melted buttermixture and the egg, and stir together toform a stiff-ish dough. Pop the dough inthe fridge for 10 mins to chill and firm up.Roll the dough out on a floured surfaceto 5mm thick, then stamp out 15 circlesusing a 7.5cm round cookie cutter; youmay need to re-roll the trimmings to get15 cookies. Make a hole at the top ofeach circle with the end of a pencil.Place on the baking trays and bakefor 12 mins until golden, swapping thetrays around halfway through. Cool ona wire rack. Decorate the cookies (seebelow), making sure the hole is at thetop of each one. Will keep for 3 daysin an airtight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/medal-cookies-217512', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}