{u'recipes': [{u'sourceName': u'The Kitchen Magpie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570639-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 570639, u'veryPopular': False, u'lowFodmap': False, u'title': u'Date Squares', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 54.31, u'creditText': u'The Kitchen Magpie', u'extendedIngredients': [{u'originalString': u'1 tsp baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 cup of brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'\xbd lb of dates', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 9087, u'unit': u'lb'}, {u'originalString': u'1\xbc cups of flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 cup of margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 4073, u'unit': u'cup'}, {u'originalString': u'1\xbd cups of rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbd cup of sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.thekitchenmagpie.com/date-squares', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine the ingredients for the filling into a pot and start simmering, stirring often. You want to dissolve the dates and cook until it’s a more smooth mixture.Then we need to start the base and topping.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [], u'step': u'Combine the sugar and butter together.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add in the oats, flour, salt and baking soda.Press a large portion of the crust mix into the bottom of a 9\xd79 pan, saving some for the topping.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Pour the filling and spread it around evenly.Crumble the topping evenly across the filling.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350 degrees until it’s beautifully browned on top. Cool it and then cut into pieces.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 102, u'instructions': u'Combine the ingredients for the filling into a pot and start simmering, stirring often. You want to dissolve the dates and cook until it’s a more smooth mixture.Then we need to start the base and topping. Combine the sugar and butter together.Add in the oats, flour, salt and baking soda.Press a large portion of the crust mix into the bottom of a 9\xd79 pan, saving some for the topping. Pour the filling and spread it around evenly.Crumble the topping evenly across the filling.Bake at 350 degrees until it’s beautifully browned on top. Cool it and then cut into pieces.', u'spoonacularSourceUrl': u'https://spoonacular.com/date-squares-570639', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}