{u'recipes': [{u'sourceName': u'Vegetarian Times', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/759250-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 759250, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crunchy Burdock with Toasted Sesame Dressing', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 112.35, u'creditText': u'Vegetarian Times', u'extendedIngredients': [{u'originalString': u'5 medium burdock roots, peeled and cut into 2-inch sticks', u'aisle': u'Produce', u'name': u'beet roots', u'metaInformation': [u'medium', u'peeled', u'cut into 2-inch sticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11080, u'unit': u''}, {u'originalString': u'3 ribs celery, sliced (1 cup)', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'\xbd tsp. chile-garlic sauce', u'aisle': u'Ethnic Foods', u'name': u'chile garlic sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-garlic-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 93749, u'unit': u'tsp'}, {u'originalString': u'2 Tbs. low-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 16424, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'Tbs'}, {u'originalString': u'1 Tbs. toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'Tbs'}, {u'originalString': u'3 Tbs. toasted sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 3.0, u'consistency': u'solid', u'id': 12023, u'unit': u'Tbs'}, {u'originalString': u'2 Tbs. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbs'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.vegetariantimes.com/recipe/crunchy-burdock-with-toasted-sesame-dressing/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bring large saucepan of water to a boil over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add burdock, and cook 6 to 8 minutes, or until crisp-tender.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Drain and cool.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to medium bowl, and add celery.2. Grind sesame seeds and sugar together in coffee grinder or mortar and pestle until finely ground.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer mixture to small bowl and stir in soy sauce, vinegar, sesame oil, and chile-garlic sauce.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}]}, {u'equipment': [], u'step': u'Add dressing to burdock mixture, and toss to coat. Season with salt and pepper, if desired.\xa0', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 26, u'instructions': u'1. Bring large saucepan of water to a boil over medium-high heat. Add burdock, and cook 6 to 8 minutes, or until crisp-tender. Drain and cool. Transfer to medium bowl, and add celery.2. Grind sesame seeds and sugar together in coffee grinder or mortar and pestle until finely ground. Transfer mixture to small bowl and stir in soy sauce, vinegar, sesame oil, and chile-garlic sauce.Add dressing to burdock mixture, and toss to coat. Season with salt and pepper, if desired.\xa0', u'spoonacularSourceUrl': u'https://spoonacular.com/crunchy-burdock-with-toasted-sesame-dressing-759250', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}