{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600131-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 600131, u'veryPopular': True, u'lowFodmap': True, u'title': u'Kahlua Coffee Liqueur', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 1533.26, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 teaspoon vanilla flavoring (not extract)', u'aisle': u'Baking', u'name': u'artificial vanilla flavoring', u'metaInformation': [u'(not extract)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1012050, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon instant coffee', u'aisle': u'Tea and Coffee', u'name': u'instant coffee', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14214, u'unit': u'tablespoon'}, {u'originalString': u'2 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'2 1/4 cups vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'liquid', u'id': 14051, u'unit': u'cups'}, {u'originalString': u'2 cups hot water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://www.copykat.com/2009/01/03/kahlua-coffee-liqueur/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 133, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine sugar, coffee, vanilla, and water. Stir until sugar is dissolved completely. Set aside to cool. Allow this to cool. Otherwise, you will evaporate the alcohol.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add vodka; stir until well mixed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'id': 14051, u'name': u'vodka'}]}, {u'equipment': [], u'step': u'Pour over ice, and add your favorite ingredients. Sit back, relax, and enjoy. Life is good, and so is this Kahlua. This keeps well and gets better with age.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 465, u'instructions': u'Combine sugar, coffee, vanilla, and water. Stir until sugar is dissolved completely. Set aside to cool. Allow this to cool. Otherwise, you will evaporate the alcohol. Add vodka; stir until well mixed. Pour over ice, and add your favorite ingredients. Sit back, relax, and enjoy. Life is good, and so is this Kahlua. This keeps well and gets better with age.', u'spoonacularSourceUrl': u'https://spoonacular.com/kahlua-coffee-liqueur-600131', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}