{u'recipes': [{u'sourceName': u'White on Rice Couple', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/590007-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 590007, u'veryPopular': True, u'lowFodmap': True, u'title': u'Roasted Zucchini with Cheese and Herbs', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'pricePerServing': 194.28, u'creditText': u'White on Rice Couple', u'extendedIngredients': [{u'originalString': u'about 2 Tablespoons of fresh herbs, minced', u'aisle': u'Produce', u'name': u'fresh herbs', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012024, u'unit': u'Tablespoons'}, {u'originalString': u'olive oil to lightly coat the squash slices', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'slices'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'3/4 cup of shredded cheese', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1011026, u'unit': u'cup'}, {u'originalString': u'2 medium summer squash or zucchini', u'aisle': u'Produce', u'name': u'summer squash', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11641, u'unit': u''}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://whiteonricecouple.com/recipes/roasted-zucchini/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pre heat oven to 375 degrees.Trim ends of zucchini squash and slice lengthwise about 1/4" thick. Lightly brush or spray both sides of each slice with olive oil. For the herbs, lightly spray the leaves with oil so that they don\'t burn.On baking sheet lined with parchment paper, lay the slices in one layer. Sprinkle salt and pepper on top of each slice, to taste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add cheese and herbs on top of each slice.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake zucchini squash about 20 minutes in the oven, or until the zucchini is cooked and cheese is melted.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 922, u'instructions': u'Pre heat oven to 375 degrees.Trim ends of zucchini squash and slice lengthwise about 1/4" thick. Lightly brush or spray both sides of each slice with olive oil. For the herbs, lightly spray the leaves with oil so that they don\'t burn.On baking sheet lined with parchment paper, lay the slices in one layer. Sprinkle salt and pepper on top of each slice, to taste.Add cheese and herbs on top of each slice.Bake zucchini squash about 20 minutes in the oven, or until the zucchini is cooked and cheese is melted.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-zucchini-with-cheese-and-herbs-590007', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}