{u'recipes': [{u'sourceName': u'Dizzy Busy and Hungry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/556308-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 556308, u'veryPopular': True, u'lowFodmap': False, u'title': u'Shrimp with Couscous', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 264.21, u'creditText': u'Dizzy Busy and Hungry', u'extendedIngredients': [{u'originalString': u'2 cups chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 cup mushrooms, roughly chopped', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 cup onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 cup sweet peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup red bell pepper, chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups couscous (I use whole wheat)', u'aisle': u'Pasta and Rice', u'name': u'whole wheat couscous', u'metaInformation': [u'whole wheat', u'(I use )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/couscous-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 99024, u'unit': u'cups'}, {u'originalString': u'1 to 1 and \xbd pounds peeled, deveined, tail-off medium shrimp (can be frozen)', u'aisle': u'?', u'name': u'to and \xbd pounds', u'metaInformation': [u'frozen', u'medium', u'deveined', u'peeled', u'(can be )'], u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'unit': u''}], u'healthScore': 29.0, u'imageType': u'png', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.dizzybusyandhungry.com/2013/06/18/shrimp-with-couscous/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a large skillet over medium high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion, garlic, and red pepper, and cook until the onion and red pepper soften.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the chicken broth, salt, pepper, and cumin. Bring to a boil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the shrimp and simmer until the shrimp are almost cooked, about 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the peas and mushrooms and cook for another 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Add the couscous, remove from heat and cover.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Let stand for 5 minutes, then fluff with a fork and serve.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Maso Canali Pinot Grigio with a 4.6 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal. View More', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 448, u'instructions': u'Heat the olive oil in a large skillet over medium high heat.Add the onion, garlic, and red pepper, and cook until the onion and red pepper soften.Add the chicken broth, salt, pepper, and cumin. Bring to a boil.Add the shrimp and simmer until the shrimp are almost cooked, about 2-3 minutes.Add the peas and mushrooms and cook for another 1-2 minutes.Add the couscous, remove from heat and cover.Let stand for 5 minutes, then fluff with a fork and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-with-couscous-556308', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}