{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/599877-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 599877, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pizza Hut Cavatini', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 199.17, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 green pepper - sliced thin', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1/2 pound hamburger (browned)', u'aisle': u'Meat', u'name': u'hamburger meat', u'metaInformation': [u'(browned)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'1/2 pound Italian sausage (browned)', u'aisle': u'Meat', u'name': u'italian sausage', u'metaInformation': [u'italian', u'(browned)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 7036, u'unit': u'pound'}, {u'originalString': u'mushrooms ( optional )', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'( optional )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 11260, u'unit': u'servings'}, {u'originalString': u'1/4 pound wheel noodles', u'aisle': u'Pasta and Rice', u'name': u'noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.25, u'consistency': u'solid', u'id': 20420, u'unit': u'pound'}, {u'originalString': u'1 onion - sliced thin', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'8 ounces Parmesan cheese (shredded)', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1033, u'unit': u'ounces'}, {u'originalString': u'1/2 pound pepperoni - sliced thin', u'aisle': u'Meat', u'name': u'pepperoni', u'metaInformation': [u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 7057, u'unit': u'pound'}, {u'originalString': u'8 ounces mozzarella cheese (shredded)', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'ounces'}, {u'originalString': u'2 jars spaghetti sauce (32 ounces) your choice', u'aisle': u'Pasta and Rice', u'name': u'spaghetti sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'solid', u'id': 10011549, u'unit': u'ounces'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.copykat.com/2009/02/03/pizza-hut-cavatini/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook noodles according to box directions.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat sauce and combine with cooked hamburger and cooked sausage. In a 11 X 13 pan, sprayed with Pam cooking spray, layer noodles and sauce. Top layer with pepperoni, onions and green peppers, mushrooms and cheeses. Make about 3 layers and top with cheese.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'id': 7057, u'name': u'pepperoni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Bake at 350 degrees for about 45 minutes or until cheese is melted.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Selvapiana Chianti Rufina with a 4.3 out of 5 star rating seems like a good match. It costs about 14 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses. View More', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 466, u'instructions': u'Cook noodles according to box directions. Heat sauce and combine with cooked hamburger and cooked sausage. In a 11 X 13 pan, sprayed with Pam cooking spray, layer noodles and sauce. Top layer with pepperoni, onions and green peppers, mushrooms and cheeses. Make about 3 layers and top with cheese. Bake at 350 degrees for about 45 minutes or until cheese is melted.', u'spoonacularSourceUrl': u'https://spoonacular.com/pizza-hut-cavatini-599877', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}