{u'recipes': [{u'sourceName': u'Crazy for Crust', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/829023-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 829023, u'veryPopular': True, u'lowFodmap': False, u'title': u'Salted Caramel Pecan Chocolate Pie', u'diets': [], u'pricePerServing': 99.73, u'creditText': u'Crazy for Crust', u'extendedIngredients': [{u'originalString': u'8 ounces (about 30) caramel squares, unwrapped', u'aisle': u'Nut butters, Jams, and Honey;Sweet Snacks;Frozen;Baking', u'name': u'caramel', u'metaInformation': [u'( 30)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 19074, u'unit': u'ounces'}, {u'originalString': u'1 cup + 4 tablespoons heavy whipping cream, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/4-1/2 teaspoon kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'25 Oreo cookies, finely crushed', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'crushed', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'', u'unitShort': u'', u'amount': 25.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u''}, {u'originalString': u'1 cup chopped pecans, toasted (see note)', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'toasted', u'chopped', u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'Sea Salt (coarse) for finishing', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'for finishing', u'(coarse)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 cup dark or semi-sweet chocolate chips', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}, {u'originalString': u'5 tablespoons unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.crazyforcrust.com/2016/11/salted-caramel-pecan-chocolate-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}], u'step': u'Spray bottom and sides of a 9 springform pan with nonstick cooking spray. You can also use a 9 tart pan (with removable bottom) or a 9 pie plate.Stir Oreo crumbs and melted butter with a fork, then press into the bottom and 1 up the sides of the pan. (If using a tart pan or pie plate, press the crumbs all the way up the sides.) Chill until ready to fill.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place caramels and 4 tablespoons heavy whipping cream in a medium bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel candy'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat on high power for 2-3 minutes, stirring every 30 seconds, until the mixture is smooth. Stir in salt to taste, then pecans, then spread evenly in the bottom of the pan.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place chocolate chips and remaining 1 cup heavy whipping cream in a large bowl.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Heat on high power for about 1 minute 15 seconds, then whisk until the chocolate has melted and the mixture is smooth.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Spread evenly on top of the caramel layer.Sprinkle the top with coarse sea salt and chill until set, about 2 hours. Store in refrigerator.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'coarse sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soft-caramels.jpg', u'id': 19074, u'name': u'caramel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}], u'step': u"Let sit on the counter for 10 minutes before serving. If you're using a springform pan or tart pan with removable base, remove the base from the sides while the pie is cold.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie on the menu? Try pairing with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Vineyards Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 25 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'Pale yellow in color, the nose opens with aromas of fresh pineapple, juicy nectarine and citrus notes. The wine fully coats the palate expressing vibrant flavors of orange blossom, tart granny smith apple and honeycomb. A long finish displays the perfect balance of sweetness and mouth-watering acidity, inviting another sip.', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 1037, u'instructions': u"Spray bottom and sides of a 9 springform pan with nonstick cooking spray. You can also use a 9 tart pan (with removable bottom) or a 9 pie plate.Stir Oreo crumbs and melted butter with a fork, then press into the bottom and 1 up the sides of the pan. (If using a tart pan or pie plate, press the crumbs all the way up the sides.) Chill until ready to fill.Place caramels and 4 tablespoons heavy whipping cream in a medium bowl. Heat on high power for 2-3 minutes, stirring every 30 seconds, until the mixture is smooth. Stir in salt to taste, then pecans, then spread evenly in the bottom of the pan.Place chocolate chips and remaining 1 cup heavy whipping cream in a large bowl. Heat on high power for about 1 minute 15 seconds, then whisk until the chocolate has melted and the mixture is smooth. Spread evenly on top of the caramel layer.Sprinkle the top with coarse sea salt and chill until set, about 2 hours. Store in refrigerator. Let sit on the counter for 10 minutes before serving. If you're using a springform pan or tart pan with removable base, remove the base from the sides while the pie is cold.", u'spoonacularSourceUrl': u'https://spoonacular.com/salted-caramel-pecan-chocolate-pie-829023', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}