{u'recipes': [{u'sourceName': u'The Healthy Foodie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551351-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 551351, u'veryPopular': True, u'lowFodmap': False, u'title': u'Choco-Raspberry Instant Breakfast Cake | 3 Week Sugar Free Challenge', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 305.93, u'creditText': u'The Healthy Foodie', u'extendedIngredients': [{u'originalString': u'2 tbsp 0% fat Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'0% fat greek yogurt', u'metaInformation': [u'0%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1001256, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'\xbd banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'\xbc cup buckwheat flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'buckwheat flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buckwheat-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20011, u'unit': u'cup'}, {u'originalString': u'2 tbsp extra dark cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp unsweetened coconut shavings, toasted', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'unsweetened', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'tbsp'}, {u'originalString': u'\xbc cup unpasteurized egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1124, u'unit': u'cup'}, {u'originalString': u'\xbd tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 tbsp ground flaxseed', u'aisle': u'Health Foods;Baking', u'name': u'ground flaxseed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tbsp'}, {u'originalString': u'\xbd cup raspberries (fresh or frozen)', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9302, u'unit': u'cup'}, {u'originalString': u'Handful fresh raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'Handful', u'unitShort': u'Handful', u'amount': 1.0, u'consistency': u'solid', u'id': 9302, u'unit': u'Handful'}, {u'originalString': u'pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 scoop (35g) vanilla flavored whey protein powder', u'aisle': u'Health Foods', u'name': u'whey protein powder', u'metaInformation': [u'flavored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 35.0, u'consistency': u'solid', u'id': 1001223, u'unit': u'g'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://thehealthyfoodie.com/2012/08/01/choco-raspberry-instant-breakfast-bake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl mash the banana until very creamy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk in yogurt and egg whites. In a separate bowl, mix dry ingredients until well combined.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add banana mixture and mix well with a spatula until well incorporated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a microwave safe bowl, or dessert cup, cover with a paper towel and cook about 1 minute and 30 seconds - 2 minutes, depending on desired level of "doneness"While cake is cooking, mix plain yogurt together with whey protein powder to make vanilla custard. It might look like there is too much powder at first, but it will come together eventually. Same goes for the "lumpy" feeling. Just let the custard rest for about a minute and it will become nice and smooth.Top cake with vanilla "custard", raspberries and coconut.Dig in!', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-protein-powder.png', u'id': 1001223, u'name': u'whey protein powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 399, u'instructions': u'<p>In a bowl mash the banana until very creamy. Whisk in yogurt and egg whites. </p><p>In a separate bowl, mix dry ingredients until well combined. Add banana mixture and mix well with a spatula until well incorporated.</p><p>Transfer to a microwave safe bowl, or dessert cup, cover with a paper towel and cook about 1 minute and 30 seconds - 2 minutes, depending on desired level of "doneness"</p><p>While cake is cooking, mix plain yogurt together with whey protein powder to make vanilla custard. It might look like there is too much powder at first, but it will come together eventually. Same goes for the "lumpy" feeling. Just let the custard rest for about a minute and it will become nice and smooth.</p><p>Top cake with vanilla "custard", raspberries and coconut.</p><p>Dig in!</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/choco-raspberry-instant-breakfast-cake-3-week-sugar-free-challenge-551351', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}