{u'recipes': [{u'sourceName': u'Simple Nourished Living', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/612243-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 612243, u'veryPopular': False, u'lowFodmap': False, u'title': u'Weight Watchers Steak Fajitas', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 281.03, u'creditText': u'Simple Nourished Living', u'extendedIngredients': [{u'originalString': u'\xbc cup light beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14006, u'unit': u'cup'}, {u'originalString': u'1 pound lean flank steak, trimmed of all visible fat', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [u'lean', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'pound'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 large green pepper, seeded and cut into \xbd-inch-wide strips', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'large', u'seeded', u'cut into \xbd-inch-wide strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 medium jalape\xf1o pepper, seeded and finely chopped', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'medium', u'seeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'\xbc cup fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'2 teaspoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'2 large sweet red bell peppers, seeded and cut into \xbd- inch-wide strips', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'sweet', u'red', u'large', u'seeded', u'cut into \xbd- inch-wide strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 large red onion, sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 49.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://simple-nourished-living.com/2014/09/weight-watchers-steak-fajitas/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Combine the lime juice, beer, oil, garlic, jalapeno, cumin and  teaspoon of the salt in a plastic ziplock plastic bag.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Add the beef. Squeeze out the air and seal the bag, turning and squeezing to coat the beef. Refrigerate, turning the bag occasionally, at least 2 hours or up to 4 hours.Spray a grill rack with nonstick spray and preheat the grill. (If you prefer you could cook your fajitas in a grill pan or skillet. It's your call.)", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the red and green bell peppers and onion in a bowl. Lightly spray the vegetables with nonstick spray and sprinkle with the remaining  teaspoon salt; toss to coat. Grill the vegetables over medium heat, turning frequently, until tender, about 8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 11333, u'name': u'green pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a bowl andkeep warm.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Remove the flank steak from the plastic bag and discard the marinade.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23657, u'name': u'flank steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the steak on the grill rack and grill, turning once, until an instant-read thermometer inserted in the center of the steak, registers 145F for medium-rare, about 6 to 10 minutes per side.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the meat to a platelet rest for about 5 minutes.Thinly slice the flank steak on the diagonal. Toss it with the vegetables.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23657, u'name': u'flank steak'}]}, {u'equipment': [], u'step': u'Serve with your favorite garnishes.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak works really well with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is Clos Du Val Merlot. It has 4.1 out of 5 stars and a bottle costs about 30 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"A dense, inky color and rich aromas of intense black currant and blackberry pervade our 2002 Merlot. Hints of herbs, black olives and toast are also present in the nose, leading to a well-structured wine with an abundance of dark red and black fruit flavors, balanced with sweet toast and some spice. The wine's soft tannins, lingering finish, and rich, complex taste make this a delightful accompaniment to roast chicken, pork, or beef.", u'title': u'Clos Du Val Merlot', u'price': u'$29.99', u'id': 433037, u'link': u'https://www.wine.com/product/clos-du-val-merlot-2002/83430', u'imageUrl': u'https://spoonacular.com/productImages/433037-312x231.jpg'}]}, u'aggregateLikes': 175, u'instructions': u"Combine the lime juice, beer, oil, garlic, jalapeno, cumin and  teaspoon of the salt in a plastic ziplock plastic bag. Add the beef. Squeeze out the air and seal the bag, turning and squeezing to coat the beef. Refrigerate, turning the bag occasionally, at least 2 hours or up to 4 hours.Spray a grill rack with nonstick spray and preheat the grill. (If you prefer you could cook your fajitas in a grill pan or skillet. It's your call.)Put the red and green bell peppers and onion in a bowl. Lightly spray the vegetables with nonstick spray and sprinkle with the remaining  teaspoon salt; toss to coat. Grill the vegetables over medium heat, turning frequently, until tender, about 8 minutes. Transfer to a bowl andkeep warm.Remove the flank steak from the plastic bag and discard the marinade. Place the steak on the grill rack and grill, turning once, until an instant-read thermometer inserted in the center of the steak, registers 145F for medium-rare, about 6 to 10 minutes per side. Transfer the meat to a platelet rest for about 5 minutes.Thinly slice the flank steak on the diagonal. Toss it with the vegetables.Serve with your favorite garnishes.", u'spoonacularSourceUrl': u'https://spoonacular.com/weight-watchers-steak-fajitas-612243', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}