{u'recipes': [{u'sourceName': u'Confessions of an Over Worked Mom', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/482237-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 482237, u'veryPopular': False, u'lowFodmap': False, u'title': u'Maple French Toast', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 81.67, u'creditText': u'Confessions of an Over Worked Mom', u'extendedIngredients': [{u'originalString': u'4 slices good quality bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'pinch of ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'pinch'}, {u'originalString': u'3 tbsp pure maple syrup, more for serving', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tbsp'}, {u'originalString': u'3 tbsp unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tbsp'}, {u'originalString': u'\xbe cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 42.0, u'sourceUrl': u'http://www.confessionsofanover-workedmom.com/2012/07/maple-french-toast-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together milk, eggs, maple syrup and cinnamon in a shallow dish.Melt 1\xbd tbsp of the butter in a large, heavy skillet over medium to medium high heat. Dip 2 slices of bread into the egg mixture, letting excess drip off, and place in the pan. Cook until the undersides are crusty, golden brown, 2 to 3 minutes. Turn and cook until the bottom sides are firm and flecked with brown, about 2 minutes. Repeat with the remaining butter, bread, and egg mixture.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Serve hot with butter and maple syrup', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 110, u'instructions': u'Whisk together milk, eggs, maple syrup and cinnamon in a shallow dish.Melt 1\xbd tbsp of the butter in a large, heavy skillet over medium to medium high heat. Dip 2 slices of bread into the egg mixture, letting excess drip off, and place in the pan. Cook until the undersides are crusty, golden brown, 2 to 3 minutes. Turn and cook until the bottom sides are firm and flecked with brown, about 2 minutes. Repeat with the remaining butter, bread, and egg mixture.Serve hot with butter and maple syrup', u'spoonacularSourceUrl': u'https://spoonacular.com/maple-french-toast-482237', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}