{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/208471-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 208471, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dinner Tonight: Grilled Lamb Kebabs with Pistachio', u'diets': [u'gluten free'], u'pricePerServing': 231.16, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon cayenne', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'Extra virgin olive oil for drizzling', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [u'for drizzling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'Small bunch fresh flat-leaf parsley, leaves picked', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'leaves picked', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'bunch'}, {u'originalString': u'1/2 cup loosely packed fresh mint leaves', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [u'fresh', u'loosely packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'2 tablespoons fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoons'}, {u'originalString': u'1 level tablespoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u''}, {u'originalString': u'1 pound lamb shoulder, cut into chunks, or the same of ground lamb', u'aisle': u'Meat', u'name': u'lamb shoulder', u'metaInformation': [u'cut into chunks, or the same of ground lamb'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 17047, u'unit': u'pound'}, {u'originalString': u'1 lemon, zest finely grated', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'finely grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1/4 cup shelled pistachio nuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachio nuts', u'metaInformation': [u'shelled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'1/2 red onion, peeled and very finely sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'peeled', u'very finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 cup or so mixed salad leaves, torn into pieces', u'aisle': u'Produce', u'name': u'salad mix', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 21052, u'unit': u'cup'}, {u'originalString': u'4 large flatbreads or tortilla wraps', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortilla wraps', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}, {u'originalString': u'4 tablespoons thick yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yogurt', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1116, u'unit': u'tablespoons'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2009/12/dinner-tonight-grilled-lamb-kebabs-with-pistachios-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Combine the meat, lemon zest, pistachios, most of the thyme, chili, and cumin, plus a hefty pinch of salt and pepper into a food processor, and pulse the meat until it looks like ground.  If the meat is already ground, pulse only the pistachios until broken into pieces, then mix them into the meat with the rest of the spices. Divide the meat into 4 pieces and press them around grilling skewers into logs for grilling.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the red onion with the lemon juice and a pinch of salt and pepper.  Toss the greens, mint leaves, and parsley leaves on top, but do not toss to mix.  The red onion will mellow and slightly pickle in the lemon juice in the meantime.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}]}, {u'equipment': [], u'step': u'3', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Cook the kebabs on a cast iron grill pan, under a broiler, or on a grill until golden and cooked through.  Near the end of cooking, warm the flatbread with the meat for 30 seconds or so.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'While the meat is resting momentarily, drizzle the greens and herbs with olive oil. Toss with the red onions in the bottom of the bowl and divide among the warmed flatbreads.  Top with the meat, as logs or broken up into pieces, then top with the yogurt and some of the reserved spices.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-greens-or-mesclun.jpg', u'id': 21052, u'name': u'greens'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1116, u'name': u'yogurt'}]}, {u'equipment': [], u'step': u'Drizzle with olive oil, if desired.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 25, u'instructions': u'Procedures                                                                              1                                                                            Combine the meat, lemon zest, pistachios, most of the thyme, chili, and cumin, plus a hefty pinch of salt and pepper into a food processor, and pulse the meat until it looks like ground.  If the meat is already ground, pulse only the pistachios until broken into pieces, then mix them into the meat with the rest of the spices. Divide the meat into 4 pieces and press them around grilling skewers into logs for grilling.                                                                                                                            2                                                                            In a large bowl, combine the red onion with the lemon juice and a pinch of salt and pepper.  Toss the greens, mint leaves, and parsley leaves on top, but do not toss to mix.  The red onion will mellow and slightly pickle in the lemon juice in the meantime.                                                                                                                            3                                                                            Cook the kebabs on a cast iron grill pan, under a broiler, or on a grill until golden and cooked through.  Near the end of cooking, warm the flatbread with the meat for 30 seconds or so.                                                                                                                            4                                                                            While the meat is resting momentarily, drizzle the greens and herbs with olive oil. Toss with the red onions in the bottom of the bowl and divide among the warmed flatbreads.  Top with the meat, as logs or broken up into pieces, then top with the yogurt and some of the reserved spices.  Drizzle with olive oil, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-tonight-grilled-lamb-kebabs-with-pistachio-208471', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}