{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/743262-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 743262, u'veryPopular': False, u'lowFodmap': False, u'title': u'Green Bean-Mushroom Casserole', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 142.44, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'4 ounces cremini mushrooms, sliced', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11266, u'unit': u'ounces'}, {u'originalString': u'2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 pounds green beans, trimmed and halved', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'trimmed', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 11052, u'unit': u'pounds'}, {u'originalString': u'1/2 cup half-and-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 ounces shiitake mushrooms, stemmed and sliced', u'aisle': u'Produce', u'name': u'shiitake mushrooms', u'metaInformation': [u'stemmed', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11238, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'2 cups low-sodium chicken or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'Vegetable oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'servings'}, {u'originalString': u'1 white onion, diced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'diced', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}, {u'originalString': u'1 white onion, halved and thinly sliced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'halved', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpeg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/green-bean-mushroom-casserole.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Make the casserole: Melt the butter in a large Dutch oven over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the diced onion; cook, stirring, until softened, 7 to 10 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the mushrooms; saute until softened and most of the liquid has evaporated, 10 minutes. Sprinkle in the flour; cook, stirring, 1 minute.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the broth and half-and-half. Bring to a boil, then reduce the heat to medium low and simmer until thickened, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Bring a pot of salted water to a boil.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the green beans and cook until crisp-tender, 7 to 10 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}]}, {u'equipment': [], u'step': u'Drain; shake off any excess water and add to the mushroom sauce. Cook, stirring occasionally, until the beans are very tender, 10 to 12 minutes. Season with salt and pepper.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Make the topping: Soak the sliced onion in the buttermilk, 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the flour and 1 teaspoon salt in a medium bowl.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat 2 to 3 inches vegetable oil in a large pot until a deep-fry thermometer registers 350 degrees F. Working in batches, drain the onion, toss with the flour and shake off the excess, then fry until golden, 4 to 6 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer the green bean mixture to a 4-quart baking dish and top with the fried onion. (The casserole and topping can be made up to 2 hours ahead; refrigerate the casserole. Bring to room temperature; reheat at 350 degrees F, 30 minutes. Top with the fried onion; bake 5 more minutes.)', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Photograph by Chris Court', u'number': 13, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 240, u'instructions': u'Make the casserole: Melt the butter in a large Dutch oven over medium heat. Add the diced onion; cook, stirring, until softened, 7 to 10 minutes. Add the mushrooms; saute until softened and most of the liquid has evaporated, 10 minutes. Sprinkle in the flour; cook, stirring, 1 minute. Add the broth and half-and-half. Bring to a boil, then reduce the heat to medium low and simmer until thickened, about 5 minutes.                          Bring a pot of salted water to a boil. Add the green beans and cook until crisp-tender, 7 to 10 minutes. Drain; shake off any excess water and add to the mushroom sauce. Cook, stirring occasionally, until the beans are very tender, 10 to 12 minutes. Season with salt and pepper.                          Make the topping: Soak the sliced onion in the buttermilk, 5 minutes. Combine the flour and 1 teaspoon salt in a medium bowl. Heat 2 to 3 inches vegetable oil in a large pot until a deep-fry thermometer registers 350 degrees F. Working in batches, drain the onion, toss with the flour and shake off the excess, then fry until golden, 4 to 6 minutes. Drain on paper towels.                          Transfer the green bean mixture to a 4-quart baking dish and top with the fried onion. (The casserole and topping can be made up to 2 hours ahead; refrigerate the casserole. Bring to room temperature; reheat at 350 degrees F, 30 minutes. Top with the fried onion; bake 5 more minutes.)                          Photograph by Chris Court', u'spoonacularSourceUrl': u'https://spoonacular.com/green-bean-mushroom-casserole-743262', u'dishTypes': [u'side dish'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}