{u'recipes': [{u'sourceName': u'Cook Like a Champion Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/596040-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 596040, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pumpkin Seed Pesto', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 0, u'pricePerServing': 42.23, u'creditText': u'Cook Like a Champion Blog', u'extendedIngredients': [{u'originalString': u'1 cup cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 tablespoons lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoons'}, {u'originalString': u'6 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'2 cups raw, hulled unsalted pumpkin seeds (pepitas)', u'aisle': u'Savory Snacks', u'name': u'pumpkin seeds', u'metaInformation': [u'raw', u'unsalted', u'hulled', u'(pepitas)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12014, u'unit': u'cups'}, {u'originalString': u'Salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.cooklikeachampionblog.com/2013/10/pumpkin-seed-pesto/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 375\xba. Toss the pumpkin seeds with 2 tablespoons of olive oil and salt and pepper to taste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spread in an even layer on a baking sheet and bake for about 10 minutes, until fragrant and roasted. Set aside to cool completely. (Do NOT try to make this while the seeds are still warm because the pesto will turn gummy. Ask me how I know.) In the bowl of a food processor or pitcher of a blender, combine the cooled pumpkin seeds and remaining ingredients. Pulse to combine, stirring and scraping down the bowl as needed. Continue pulsing until a coarse paste forms.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-seeds.jpg', u'id': 12014, u'name': u'pumpkin seeds'}]}, {u'equipment': [], u'step': u'Add additional olive oil as needed to reach your desired consistency. Taste and season with salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Serve with warm baguette slices and store leftover pesto in an airtight container in the refrigerator.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 97, u'instructions': u'Heat oven to 375\xba. Toss the pumpkin seeds with 2 tablespoons of olive oil and salt and pepper to taste. Spread in an even layer on a baking sheet and bake for about 10 minutes, until fragrant and roasted. Set aside to cool completely. (Do NOT try to make this while the seeds are still warm because the pesto will turn gummy. Ask me how I know.) In the bowl of a food processor or pitcher of a blender, combine the cooled pumpkin seeds and remaining ingredients. Pulse to combine, stirring and scraping down the bowl as needed. Continue pulsing until a coarse paste forms. Add additional olive oil as needed to reach your desired consistency. Taste and season with salt and pepper. Serve with warm baguette slices and store leftover pesto in an airtight container in the refrigerator.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-seed-pesto-596040', u'dishTypes': [u'condiment', u'dip', u'sauce', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}