{u'recipes': [{u'sourceName': u'Jeanettes Healthy Living', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/473948-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 473948, u'veryPopular': True, u'lowFodmap': True, u'title': u'A Valentine’s Day Sweet Treat – Easy Dark Chocolate Walnut Pomegranate Clusters', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 60.35, u'creditText': u'Jeanettes Healthy Living', u'extendedIngredients': [{u'originalString': u'8 ounces dark chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'3/4 cup pomegranate seeds', u'aisle': u'Produce', u'name': u'pomegranate seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9286, u'unit': u'cup'}, {u'originalString': u'3/4 cup toasted walnut pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnut pieces', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://jeanetteshealthyliving.com/2012/02/a-valentines-day-sweet-treat-dark-chocolate-walnut-pomegranate-chocolate-clusters.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}], u'step': u'Melt chocolate in double boiler. Make chocolate clusters one of two ways: (1)', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Mix walnut pieces and pomegranate seeds in with chocolate and put spoonfuls of chocolate mixture on parchment paper lined baking sheet; (2) line mini-muffin tin with paper liners. Spoon a little melted chocolate in the bottom of the liner. Sprinkle a few walnuts and pomegranate seeds on top, then drizzle more melted chocolate on top. Sprinkle another layer of walnuts and pomegranate seeds on top, and finish with a drizzle of melted chocolate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'id': 9286, u'name': u'pomegranate seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnut pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}]}, {u'equipment': [], u'step': u'Place in refrigerator until firm.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Treat. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 2853, u'instructions': u'Melt chocolate in double boiler. Make chocolate clusters one of two ways: (1)Mix walnut pieces and pomegranate seeds in with chocolate and put spoonfuls of chocolate mixture on parchment paper lined baking sheet; (2) line mini-muffin tin with paper liners. Spoon a little melted chocolate in the bottom of the liner. Sprinkle a few walnuts and pomegranate seeds on top, then drizzle more melted chocolate on top. Sprinkle another layer of walnuts and pomegranate seeds on top, and finish with a drizzle of melted chocolate.Place in refrigerator until firm.', u'spoonacularSourceUrl': u'https://spoonacular.com/a-valentines-day-sweet-treat-easy-dark-chocolate-walnut-pomegranate-clusters-473948', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}