{u'recipes': [{u'sourceName': u'My Whole Food Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/496333-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 496333, u'veryPopular': True, u'lowFodmap': False, u'title': u'Spaghetti Squash with Pesto Sauce', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 258.29, u'creditText': u'My Whole Food Life', u'extendedIngredients': [{u'originalString': u'15 basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'1 large garlic clove', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4 T hemp oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'hemp oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hemp-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 99134, u'unit': u'T'}, {u'originalString': u'2 T nutritional yeast', u'aisle': u'Spices and Seasonings;Health Foods', u'name': u'nutritional yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutritional-yeast.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93690, u'unit': u'T'}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 cups slivered almonds', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10012061, u'unit': u'cups'}, {u'originalString': u'1 spaghetti squash', u'aisle': u'Produce', u'name': u'spaghetti squash', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11492, u'unit': u''}, {u'originalString': u'water (just enough to get desired consistency)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(just enough to get desired consistency)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 29.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://mywholefoodlife.com/2014/02/01/spaghetti-squash-with-pesto-sauce/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Cut the spaghetti squash in half and remove the seeds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti-squash.jpg', u'id': 11492, u'name': u'spaghetti squash'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Brush the squash with oil and lay face down on a lined baking sheet.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Bake for about 40 minutes. While the squash is roasting.  Make the pesto.In a food processor, combine all the pesto ingredients, except the water, and mix well.  Slowly, 1 tablespoon at a time, add water until you reach a desired consistency. Once the squash is done, use a fork to pull out the spaghetti.Toss the pesto on top and serve immediately or refrigerate for later.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 6722, u'instructions': u'Preheat the oven to 350. Cut the spaghetti squash in half and remove the seeds.Brush the squash with oil and lay face down on a lined baking sheet. Bake for about 40 minutes. While the squash is roasting.  Make the pesto.In a food processor, combine all the pesto ingredients, except the water, and mix well.  Slowly, 1 tablespoon at a time, add water until you reach a desired consistency. Once the squash is done, use a fork to pull out the spaghetti.Toss the pesto on top and serve immediately or refrigerate for later.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-squash-with-pesto-sauce-496333', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}