{u'recipes': [{u'sourceName': u'It Bakes Me Happy', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/472544-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 472544, u'veryPopular': True, u'lowFodmap': False, u'title': u'Deep Dish Skillet Pizza', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 415.43, u'creditText': u'It Bakes Me Happy', u'extendedIngredients': [{u'originalString': u'2 c cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'c'}, {u'originalString': u'2 Tbs olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1/2 - 3/4 c pizza sauce, depending on how you like it', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'c'}, {u'originalString': u'1/2 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 tsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tsp'}, {u'originalString': u'1 1/2 c unbleached all-purpose flour', u'aisle': u'Baking', u'name': u'unbleached flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10020081, u'unit': u'c'}, {u'originalString': u'1 cup warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1/2 c whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20080, u'unit': u'c'}, {u'originalString': u'2 1/2 tsp yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}, {u'originalString': u'additional toppings, as desired', u'aisle': u'?', u'name': u'additional toppings', u'metaInformation': [], u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'unit': u'serving'}], u'healthScore': 71.0, u'imageType': u'png', u'spoonacularScore': 99.0, u'sourceUrl': u'http://itbakesmehappy.com/2014/01/deep-dish-skillet-pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 70, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 450 F and lightly oil a 10" cast iron skillet. In a small bowl mix the yeast, sugar and water together; set aside to bloom for 10 minutes. In a large mixing bowl combine the salt, oil and flour; mix until well combined.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Let sit 10 minutes to proof while you prepare the toppings. Stretch the dough out to form crust and place in the skillet, pushing the edges of the crust up the sides of the skillet. Cover with sauce, cheese and desired toppings.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Bake for 18-20 minutes, until crust is golden and the cheese begins to bubble.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are great choices for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Madsen Family Cellars Sangiovese Wine with a 5 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'spice , coffee , cloves', u'title': u'Madsen Family Cellars Sangiovese Wine', u'price': u'$26.0', u'id': 431618, u'link': u'https://www.amazon.com/2009-Madsen-Family-Cellars-Sangiovese/dp/B00I0F3FJA', u'imageUrl': u'https://spoonacular.com/productImages/431618-312x231.jpg'}]}, u'aggregateLikes': 544, u'instructions': u'Preheat your oven to 450 F and lightly oil a 10" cast iron skillet. In a small bowl mix the yeast, sugar and water together; set aside to bloom for 10 minutes. In a large mixing bowl combine the salt, oil and flour; mix until well combined. Let sit 10 minutes to proof while you prepare the toppings. Stretch the dough out to form crust and place in the skillet, pushing the edges of the crust up the sides of the skillet. Cover with sauce, cheese and desired toppings. Bake for 18-20 minutes, until crust is golden and the cheese begins to bubble.', u'spoonacularSourceUrl': u'https://spoonacular.com/deep-dish-skillet-pizza-472544', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}