{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220113-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 220113, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fragrant cucumber & yogurt soup', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 155.84, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'300ml carton fresh chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'ml'}, {u'originalString': u'2 cucumbers, roughly chopped', u'aisle': u'Produce', u'name': u'cucumbers', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'handful mint leaves', u'aisle': u'Produce', u'name': u'fresh mint leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'handful'}, {u'originalString': u'2 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'500g Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'g'}, {u'originalString': u'flatbreads, to serve', u'aisle': u'Bakery/Bread', u'name': u'wheat flatbreads', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10018042, u'unit': u'servings'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 59.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/2666/fragrant-cucumber-and-yogurt-soup', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Put the cucumbers in a food processor with the yogurt, stock, garlic and mint, then season to taste. Blend until smooth, then pour into a jug.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place in the freezer for 20 mins to chill.When ready to serve, heat the grill.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush one side of the flatbread with 2 tsp olive oil, and grill for 1 min or until browned and crisp. 3 To serve, pour the soup into chilled bowls or glasses.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle over the remaining olive oil and season with a little cracked black pepper.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with the crisp flatbread on the side.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Yogurt can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 17, u'instructions': u'Put the cucumbers in a food processor with the yogurt, stock, garlic and mint, then season to taste. Blend until smooth, then pour into a jug. Place in the freezer for 20 mins to chill.When ready to serve, heat the grill. Brush one side of the flatbread with 2 tsp olive oil, and grill for 1 min or until browned and crisp. 3 To serve, pour the soup into chilled bowls or glasses. Drizzle over the remaining olive oil and season with a little cracked black pepper. Serve with the crisp flatbread on the side.', u'spoonacularSourceUrl': u'https://spoonacular.com/fragrant-cucumber-yogurt-soup-220113', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}