{u'recipes': [{u'sourceName': u'My Whole Food Life', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/496403-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 496403, u'veryPopular': True, u'lowFodmap': False, u'title': u'Gluten Free Homemade Oreos', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 75, u'pricePerServing': 136.52, u'creditText': u'My Whole Food Life', u'extendedIngredients': [{u'originalString': u'1/4 cup applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9019, u'unit': u'cup'}, {u'originalString': u'1/3 cup cacao or cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 cup coconut butter', u'aisle': u'Health Foods', u'name': u'coconut butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93746, u'unit': u'cup'}, {u'originalString': u'2 T coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'T'}, {u'originalString': u'1/2 cup coconut sugar', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93831, u'unit': u'cup'}, {u'originalString': u'2 eggs (I used flax egg replacements)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'(I used flax egg replacements)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'2-3 T milk (I used almond milk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(I used almond milk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'T'}, {u'originalString': u'2 cups gluten free oat flour', u'aisle': u'Gluten Free;Health Foods', u'name': u'oat flour', u'metaInformation': [u'gluten free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20132, u'unit': u'cups'}, {u'originalString': u'2 tsp ground vanilla beans', u'aisle': u'Baking', u'name': u'vanilla beans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93622, u'unit': u'tsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://mywholefoodlife.com/2014/01/07/gluten-free-homemade-oreos/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix all the dry ingredients in one bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix wet in another.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/dough-scraper.jpg', u'id': 404649, u'name': u'dough scraper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add wet to dry and mix until combined.Gather dough into a ball and wrap it in plastic.Stick it in the fridge to chill for about 1 hour.Preheat oven to 350.Once dough is chilled, cut it in half with a bench scraper.Tear out 2 sheets of parchment paper.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cookie-cutters.jpg', u'id': 221429, u'name': u'cookie cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'Roll the dough out onto one piece of parchment, while putting the other piece of parchment between the rolling pin and the dough.  This helps the dough from sticking to the rolling pin.Once the dough is rolled out very thin, cut it into circles using a cookie cutter.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place cookies on a lined baking sheet.Repeat these steps with the other half of the dough.Once all the cookies are cut, bake in the oven for about 8-12 minutes, depending on the thickness of the cookies. (I checked on mine every 5 minutes)While the cookies are baking, mix the filling ingredients in a blender or food processor.Wait until the cookies have cooled completely before adding the filling and making them into sandwiches.The filling will feel loose, but when you stick the cookies in the fridge, it firms up nicely.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 3526, u'instructions': u'Mix all the dry ingredients in one bowl.Mix wet in another.Add wet to dry and mix until combined.Gather dough into a ball and wrap it in plastic.Stick it in the fridge to chill for about 1 hour.Preheat oven to 350.Once dough is chilled, cut it in half with a bench scraper.Tear out 2 sheets of parchment paper.Roll the dough out onto one piece of parchment, while putting the other piece of parchment between the rolling pin and the dough.  This helps the dough from sticking to the rolling pin.Once the dough is rolled out very thin, cut it into circles using a cookie cutter.  Place cookies on a lined baking sheet.Repeat these steps with the other half of the dough.Once all the cookies are cut, bake in the oven for about 8-12 minutes, depending on the thickness of the cookies. (I checked on mine every 5 minutes)While the cookies are baking, mix the filling ingredients in a blender or food processor.Wait until the cookies have cooled completely before adding the filling and making them into sandwiches.The filling will feel loose, but when you stick the cookies in the fridge, it firms up nicely.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-homemade-oreos-496403', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}