{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/517634-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 517634, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Pork Tenderloin', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 172.23, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1 (5.5-ounce) can apricot nectar', u'aisle': u'Beverages', u'name': u'apricot nectar', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-nectar-or-apricot-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.5, u'consistency': u'solid', u'id': 9036, u'unit': u'ounce'}, {u'originalString': u'2 teaspoons cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup granulated white sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 pounds pork tenderloin', u'aisle': u'Meat', u'name': u'pork tenderloin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10218, u'unit': u'pounds'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 medium sweet onion, chopped', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1 (15-ounce) can whole-berry cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole berry cranberry sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 9081, u'unit': u'ounce'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.recipegirl.com/2008/09/16/cranberry-pork-tenderloin/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350\xb0 F.2.  In a medium bowl, combine all ingredients except pork.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Place pork in a casserole dish.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pour ingredients over pork.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake 1 hour 10 minutes with the dish covered.3.  Slice into medallions and spoon sauce over meat.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Malbec, Pinot Noir, and Sangiovese are great choices for Pork Tenderloin. Pinot noir's light body is great for lean cuts, medium bodied sangiovese complement meaty sauces, stews, and other multi-ingredient dishes, and full-bodied tannic malbec pairs with fatty cuts and barbecue. The Luigi Bosca Malbec with a 4.2 out of 5 star rating seems like a good match. It costs about 23 dollars per bottle.", u'pairedWines': [u'malbec', u'pinot noir', u'sangiovese'], u'productMatches': [{u'description': u'Luigi Bosca Malbec is an intense purple colour wine, with distinct aromas of ripe red fruits, spices and black pepper. The intensity of the entry in the mouth is complemented with the softness and sweetness of tannins, respecting the characteristics of the grape variety in Argentina. A pure, full-bodied, well-structured red wine with character and all the juiciness typical of this variety. A long lingering and elegant finish.', u'title': u'Luigi Bosca Malbec', u'price': u'$22.99', u'id': 438334, u'link': u'https://www.wine.com/product/luigi-bosca-malbec-2011/132493', u'imageUrl': u'https://spoonacular.com/productImages/438334-312x231.jpg'}]}, u'aggregateLikes': 88, u'instructions': u'1.  Preheat oven to 350\xb0 F.2.  In a medium bowl, combine all ingredients except pork. Place pork in a casserole dish. Pour ingredients over pork. Bake 1 hour 10 minutes with the dish covered.3.  Slice into medallions and spoon sauce over meat.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-pork-tenderloin-517634', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}