{u'recipes': [{u'sourceName': u'Kitchen Nostalgia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/723508-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 723508, u'veryPopular': False, u'lowFodmap': False, u'title': u'Croatian Kifle – Jam Crescent Cookies', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 38.19, u'creditText': u'Kitchen Nostalgia', u'extendedIngredients': [{u'originalString': u'1\xbd tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'2 stick + 5 tsp (250 g) butter or margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'⅔ cup + 3 Tbsp (200 ml) sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'ml'}, {u'originalString': u'about 1\xbd cup jam (apricot, plum, rose hip or any other type)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'jam', u'metaInformation': [u'or any other type)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19297, u'unit': u'cup'}, {u'originalString': u'\xbd tsp lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u'tsp'}, {u'originalString': u'3⅔ cups (500 g) pastry flour', u'aisle': u'Baking', u'name': u'pastry flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10020080, u'unit': u'g'}, {u'originalString': u'1 Tbsp powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'Tbsp'}, {u'originalString': u'a pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.kitchennostalgia.com/croatian-recipes/croatian-kifle-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Mix (either with hands or using mixer or food processor) flour with baking powder, butter, margarine, sour cream, powdered sugar, lemon zest and salt. Do not overwork. Wrap the dough in plastic and chill it in the fridge overnight or for about 1 hour in the freezer.On a lightly floured surface, roll one-fourth of the dough into a thin circle.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Cut the circle into 6 triangles and put about  teaspoon jam on each one. Jam should be firm rather then runny so that it does not spill out from cookies.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll triangles into crescents, starting at the wide end (see video below for instructions).Arrange cookies on a baking sheet (they wont expand a lot).', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Bake them in preheated 350 F (175 C) oven for about 15 minutes in regular oven or about 12 minutes in fan oven. They should still remain pale in color.', u'length': {u'number': 27, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Transfer the crescents to a wire rack and dust them with powdered sugar.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 271, u'instructions': u'Mix (either with hands or using mixer or food processor) flour with baking powder, butter, margarine, sour cream, powdered sugar, lemon zest and salt. Do not overwork. Wrap the dough in plastic and chill it in the fridge overnight or for about 1 hour in the freezer.On a lightly floured surface, roll one-fourth of the dough into a thin circle. Cut the circle into 6 triangles and put about  teaspoon jam on each one. Jam should be firm rather then runny so that it does not spill out from cookies. Roll triangles into crescents, starting at the wide end (see video below for instructions).Arrange cookies on a baking sheet (they wont expand a lot). Bake them in preheated 350 F (175 C) oven for about 15 minutes in regular oven or about 12 minutes in fan oven. They should still remain pale in color.Transfer the crescents to a wire rack and dust them with powdered sugar.', u'spoonacularSourceUrl': u'https://spoonacular.com/croatian-kifle-jam-crescent-cookies-723508', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}