{u'recipes': [{u'sourceName': u'Iowa Girl Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/631094-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 631094, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blue Moon Orange Chicken - Iowa Girl Eats', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 165.86, u'creditText': u'Iowa Girl Eats', u'extendedIngredients': [{u'originalString': u'1 cup Blue Moon beer', u'aisle': u'Alcoholic Beverages', u'name': u'beer', u'metaInformation': [u'blue'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14006, u'unit': u'cup'}, {u'originalString': u'1lb chicken breasts, pounded thin', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5062, u'unit': u'lb'}, {u'originalString': u'1-1/2 Tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'Tablespoons'}, {u'originalString': u'juice of 2 oranges', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9206, u'unit': u''}, {u'originalString': u'1/4 cup low-sodium soy sauce (do not use regular)', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low-sodium', u'(do not use regular)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 16424, u'unit': u'cup'}, {u'originalString': u'salt & pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 large shallots, sliced thin', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'large', u'sliced', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://iowagirleats.com/2013/05/13/blue-moon-orange-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush both sides of chicken breasts with extra virgin olive oil then season with salt and pepper. Cook in a large skillet over medium-high heat for 3-4 minutes a side, or until cooked through, then remove to a plate and set aside.Turn heat down to medium, add extra virgin olive oil to skillet, and then add shallots. Cook shallots until translucent, about 1 minute, then add beer, soy sauce, and orange juice. Turn heat up and bring mixture to a boil then cook, scraping up brown bits from bottom of skillet with a wooden spoon, until sauce has reduced and thickened, 4-5 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beer.jpg', u'id': 14006, u'name': u'beer'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add chicken back to skillet then coat with sauce and serve.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 335, u'instructions': u'Brush both sides of chicken breasts with extra virgin olive oil then season with salt and pepper. Cook in a large skillet over medium-high heat for 3-4 minutes a side, or until cooked through, then remove to a plate and set aside.Turn heat down to medium, add extra virgin olive oil to skillet, and then add shallots. Cook shallots until translucent, about 1 minute, then add beer, soy sauce, and orange juice. Turn heat up and bring mixture to a boil then cook, scraping up brown bits from bottom of skillet with a wooden spoon, until sauce has reduced and thickened, 4-5 minutes. Add chicken back to skillet then coat with sauce and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/blue-moon-orange-chicken-iowa-girl-eats-631094', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}