{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/737076-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 4, u'id': 737076, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cheesy Bacon, Eggs and Hash Browns in a Mug', u'diets': [u'gluten free', u'ketogenic'], u'preparationMinutes': 2, u'pricePerServing': 184.66, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 slices American cheese', u'aisle': u'Cheese', u'name': u'american cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 1253, u'unit': u'slices'}, {u'originalString': u'2 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'2 medium eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/4 cup plus 1 tablespoon frozen hash browns, thawed', u'aisle': u'Frozen', u'name': u'hash browns', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hash-brown-potatoes.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11390, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'serving'}, {u'originalString': u'1 tablespoon milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoon'}], u'healthScore': 8.0, u'imageType': u'jpeg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/cheesy-bacon-eggs-and-hash-browns-in-a-mug.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Line a large mug with a few sheets of paper towel. Lay the bacon in the mug, cover with another piece of paper towel and microwave on high power for 1 minute. Using the edges of the paper towel, lift the bacon from the mug and set aside.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Scoop the hash browns into the mug, pressing them down and up the sides to form a well. Cover with plastic wrap and microwave on high power for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hash-brown-potatoes.png', u'id': 11390, u'name': u'hash browns'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the eggs, milk and a pinch of salt and pepper to the mug and whisk together, leaving the hash browns in place. Tear the bacon and cheese into bite-size pieces and drop them into the egg mixture. Microwave on high power for 2 minutes, pausing after 1 minute to give the mixture a quick stir.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hash-brown-potatoes.png', u'id': 11390, u'name': u'hash browns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 805, u'instructions': u'Watch how to make this recipe.                    Line a large mug with a few sheets of paper towel. Lay the bacon in the mug, cover with another piece of paper towel and microwave on high power for 1 minute. Using the edges of the paper towel, lift the bacon from the mug and set aside.                          Scoop the hash browns into the mug, pressing them down and up the sides to form a well. Cover with plastic wrap and microwave on high power for 1 minute.                          Add the eggs, milk and a pinch of salt and pepper to the mug and whisk together, leaving the hash browns in place. Tear the bacon and cheese into bite-size pieces and drop them into the egg mixture. Microwave on high power for 2 minutes, pausing after 1 minute to give the mixture a quick stir.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-bacon-eggs-and-hash-browns-in-a-mug-737076', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 6, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}