{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/397010-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 397010, u'veryPopular': False, u'lowFodmap': True, u'title': u'Savory Spinach Chicken', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 15, u'pricePerServing': 301.82, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3 cups fresh baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'1 boneless skinless chicken breast half (5 ounces)', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'liquid', u'id': 5062, u'unit': u'ounces'}, {u'originalString': u'4 tablespoons Italian salad dressing, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'italian salad dressing', u'metaInformation': [u'italian', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4114, u'unit': u'tablespoons'}, {u'originalString': u'1 slice provolone cheese (3/4 ounce)', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.75, u'consistency': u'solid', u'id': 1035, u'unit': u'ounce'}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/savory-spinach-chicken', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Place 3 tablespoons salad dressing in a large resealable plastic bag; add the chicken. Seal bag and turn to coat; refrigerate for at least 2 hours.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'id': 4114, u'name': u'salad dressing'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain and discard marinade. In a small skillet, brown chicken on each side.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove and keep warm. In the same skillet, saute the spinach, remaining salad dressing and salt until spinach is wilted; drain.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'id': 4114, u'name': u'salad dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place chicken in a shallow baking dish coated with cooking spray. Top with spinach and cheese.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Bake, uncovered, at 350\xb0 for 18-22 minutes or until chicken juices run clear.', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 206, u'instructions': u'Directions                                                                                Place 3 tablespoons salad dressing in a large resealable plastic bag; add the chicken. Seal bag and turn to coat; refrigerate for at least 2 hours.                                                                                           Drain and discard marinade. In a small skillet, brown chicken on each side. Remove and keep warm. In the same skillet, saute the spinach, remaining salad dressing and salt until spinach is wilted; drain.                                                                                           Place chicken in a shallow baking dish coated with cooking spray. Top with spinach and cheese. Bake, uncovered, at 350\xb0 for 18-22 minutes or until chicken juices run clear.                                        Yield: 1 serving.                                                                                                                         Originally published as Savory Spinach Chicken in  Cooking for 2Spring 2009, p51                                                                                                                                                                                                        Nutritional Facts                                                                             1 chicken breast half (prepared with fat-free salad dressing) equals 250 calories, 9 g fat (4 g saturated fat), 91 mg cholesterol, 761 mg sodium, 6 g carbohydrate, 2 g fiber, 36 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/savory-spinach-chicken-397010', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}