{u'recipes': [{u'sourceName': u'Love & Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/446303-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 446303, u'veryPopular': False, u'lowFodmap': False, u'title': u'avocado steamed buns', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 120.05, u'creditText': u'Love & Lemons', u'extendedIngredients': [{u'originalString': u'avocado slices', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u'slices'}, {u'originalString': u'tablespoon of lime', u'aisle': u'Produce', u'name': u'lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'tablespoon'}, {u'originalString': u'shredded cabbage (napa and/or red cabbage)', u'aisle': u'Produce', u'name': u'red cabbage', u'metaInformation': [u'shredded', u'red', u'(napa and/or cabbage)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11112, u'unit': u'servings'}, {u'originalString': u'rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'servings'}, {u'originalString': u'pinches of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinche', u'unitShort': u'pinches', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinches'}, {u'originalString': u'sprinkle of sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12023, u'unit': u'servings'}, {u'originalString': u'sriracha', u'aisle': u'Condiments', u'name': u'sriracha', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'servings'}, {u'originalString': u'pinch of sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'pinch'}, {u'originalString': u'yuzu kosho or a bit of wasabi', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'wasabi', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wasabi.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11990, u'unit': u'servings'}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.loveandlemons.com/2014/01/08/avocado-steamed-buns/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make (or buy) the steamed buns.Marinate the shredded cabbage in a splash of rice vinegar and a few pinches of sugar and salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let sit for at least 30 minutes (or up to a couple of days in the fridge).Slice the avocado and squeeze a bit of lime juice on top along with a few pinches of salt.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Spread a bit of yuzu kosho or a tiny bit of wasabi onto the inside of the bun.Stuff with avocado and cabbage. Sprinkle with sesame seeds and serve with sriracha.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/wasabi.jpg', u'id': 11990, u'name': u'wasabi'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Steamed Bun. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 162, u'instructions': u'Make (or buy) the steamed buns.Marinate the shredded cabbage in a splash of rice vinegar and a few pinches of sugar and salt. Let sit for at least 30 minutes (or up to a couple of days in the fridge).Slice the avocado and squeeze a bit of lime juice on top along with a few pinches of salt.Spread a bit of yuzu kosho or a tiny bit of wasabi onto the inside of the bun.Stuff with avocado and cabbage. Sprinkle with sesame seeds and serve with sriracha.', u'spoonacularSourceUrl': u'https://spoonacular.com/avocado-steamed-buns-446303', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}