{u'recipes': [{u'sourceName': u'Diethood', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/622416-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 622416, u'veryPopular': False, u'lowFodmap': False, u'title': u'Orange Buttercream Filled Jaffa Cakes {Resanki}', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 101.53, u'creditText': u'Diethood', u'extendedIngredients': [{u'originalString': u'1 cup finely shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'4 packages Jaffa Cakes', u'aisle': u'Bakery/Bread', u'name': u'cup cakes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'packages', u'unitShort': u'packages', u'amount': 4.0, u'consistency': u'liquid', u'id': 18139, u'unit': u'packages'}, {u'originalString': u'2 tablespoons fresh orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9206, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon orange zest', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoon'}, {u'originalString': u'2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'4 tablespoons unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://diethood.com/orange-buttercream-filled-jaffa-cakes-resanki/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Combine butter and shortening in your mixer's bowl and, at low speed, gradually beat in the powdered sugar, orange zest, orange juice and vanilla; beat until blended.Turn the mixer on High and beat for 3 minutes, or until smooth and fluffy.Using a pastry bag or a teaspoon, pipe about a tablespoon size of filling onto half the Jaffa Cakes.Cover with the remaining cookies on top of the filling and lightly press to form sandwiches.", u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'id': 9216, u'name': u'orange zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}], u'step': u'Spread the shredded coconut on a shallow plate and roll each cake in the coconut so to cover the sides.Arrange cakes on a serving platter and let stand, lightly covered with a kitchen towel, for 2 hours.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 56, u'instructions': u"Combine butter and shortening in your mixer's bowl and, at low speed, gradually beat in the powdered sugar, orange zest, orange juice and vanilla; beat until blended.Turn the mixer on High and beat for 3 minutes, or until smooth and fluffy.Using a pastry bag or a teaspoon, pipe about a tablespoon size of filling onto half the Jaffa Cakes.Cover with the remaining cookies on top of the filling and lightly press to form sandwiches.Spread the shredded coconut on a shallow plate and roll each cake in the coconut so to cover the sides.Arrange cakes on a serving platter and let stand, lightly covered with a kitchen towel, for 2 hours.Serve.Serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/orange-buttercream-filled-jaffa-cakes-resanki-622416', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}