{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/519995-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 519995, u'veryPopular': False, u'lowFodmap': False, u'title': u'Biscoff Marshmallow Chocolate Bars (No-Bake)', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 85.01, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1 cup Biscoff Cookies (10 to 12 cookies) or Bistro Biscuits, roughly chopped (substitute with about 2 full-size sheets chopped (cinnamon) graham crackers)', u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [u'with 2 full-size sheets chopped (cinnamon) graham crackers)', u'roughly chopped', u'(10 to 12 cookies)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18009, u'unit': u'cup'}, {u'originalString': u'1/3 cup Creamy Biscoff Spread or Cookie Butter Spread (peanut butter may be substituted although the flavor will not be the same)', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'cookie butter', u'metaInformation': [u'(peanut butter may be substituted although the flavor will not be the same)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 99011, u'unit': u'cup'}, {u'originalString': u'3 to 3 1/2 cups mini-marshmallows', u'aisle': u'Baking', u'name': u'mini marshmallows', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10119116, u'unit': u'cups'}, {u'originalString': u'1 1/2 cups semi-sweet chocolate chips, for melting', u'aisle': u'Baking', u'name': u'semi sweet chocolate chips', u'metaInformation': [u'for melting'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10019903, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.averiecooks.com/2012/12/biscoff-marshmallow-chocolate-bars.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Line an 8-by-inch pan with aluminum foil, spray with cooking spray; set aside. In a large microwave-safe bowl, add 1 1/2 cups chocolate chips and heat on high power for 1 minute to soften and begin to melt.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add Biscoff spread and heat on high power for 30 seconds to melt, stirring to combine.', u'number': 2, u'ingredients': [{u'image': None, u'id': 99011, u'name': u'cookie butter'}]}, {u'equipment': [], u'step': u'Heat in 15-second bursts until the mixture can be stirred smooth, taking care not to overheat it.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the marshmallows, Biscoff cookies, and toss to coat evenly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour mixture into prepared pan, smoothing it lightly with a spatula. Sprinkle 1/4 cup chocolate chips evenly over the top.', u'number': 5, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Add slivered almonds, macadamia nuts, or a handful of shredded coconut to the batter. Omit the Biscoff cookies or graham crackers and instead use Nilla wafers or chopped Oreos. Sprinkle white chocolate chips, cinnamon chips, peanut butter or butterscotch chips, toffee bits, diced peanut butter cups, or Rolos on top.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix and match as desired.', u'number': 2, u'ingredients': []}], u'name': u"Place pan in the refrigerator for at least 2 hours to set-up, or until chilled and bars can be sliced. Bars will keep in an airtight container at room temperature for 1 week, in the refrigerator for up to 2 weeks, or in the freezer for up to 3 months. I prefer to keep them in the freezer (mine don't freeze solid) and serve them chilled. Optional Variations"}], u'aggregateLikes': 38, u'instructions': u"Line an 8-by-inch pan with aluminum foil, spray with cooking spray; set aside. In a large microwave-safe bowl, add 1 1/2 cups chocolate chips and heat on high power for 1 minute to soften and begin to melt. Add Biscoff spread and heat on high power for 30 seconds to melt, stirring to combine. Heat in 15-second bursts until the mixture can be stirred smooth, taking care not to overheat it. Add the marshmallows, Biscoff cookies, and toss to coat evenly. Pour mixture into prepared pan, smoothing it lightly with a spatula. Sprinkle 1/4 cup chocolate chips evenly over the top. Place pan in the refrigerator for at least 2 hours to set-up, or until chilled and bars can be sliced. Bars will keep in an airtight container at room temperature for 1 week, in the refrigerator for up to 2 weeks, or in the freezer for up to 3 months. I prefer to keep them in the freezer (mine don't freeze solid) and serve them chilled. Optional Variations: Add slivered almonds, macadamia nuts, or a handful of shredded coconut to the batter. Omit the Biscoff cookies or graham crackers and instead use Nilla wafers or chopped Oreos. Sprinkle white chocolate chips, cinnamon chips, peanut butter or butterscotch chips, toffee bits, diced peanut butter cups, or Rolos on top. Mix and match as desired.", u'spoonacularSourceUrl': u'https://spoonacular.com/biscoff-marshmallow-chocolate-bars-no-bake-519995', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}