{u'recipes': [{u'sourceName': u'Natashas Kitchen', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/583065-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 583065, u'veryPopular': False, u'lowFodmap': False, u'title': u'Beyond Caesar Salad and OXO Giveaway', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 254.38, u'creditText': u'Natashas Kitchen', u'extendedIngredients': [{u'originalString': u'1-2 avocados', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 cup Caesar dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'caesar dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 43015, u'unit': u'cup'}, {u'originalString': u'\xbd cup feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1 small red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'2 large heads of romaine lettuce', u'aisle': u'Produce', u'name': u'romaine lettuce', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'heads', u'unitShort': u'heads', u'amount': 2.0, u'consistency': u'solid', u'id': 10111251, u'unit': u'heads'}, {u'originalString': u'3 medium tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1 yellow or red bell pepper', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'red', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 66.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://natashaskitchen.com/2012/05/07/beyond-caesar-salad-and-oxo-giveaway/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/salad-spinner.jpg', u'id': 404792, u'name': u'salad spinner'}], u'step': u'Chop the romaine lettuce. Rince and dry the lettuce using salad spinner.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine', u'id': 10111251, u'name': u'romaine'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a large serving bowl.Slice the tomatoes, red bell pepper and avocados.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add them to the bowl.Finely chop red onion and sprinkle it over the salad along with the feta cheese and croutons.Just before serving, drizzle with Caesar dressing and mix.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coleslaw-or-caesar-dressing.jpg', u'id': 43015, u'name': u'caesar salad dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Gavi, Albarino, and Pinot Grigio are my top picks for Caesar Salad. We recommend a crisp, dry white wine such as a Gavi, Albari\xf1o, or Pinot Grigio. These wines stand up to the pungent dressing and complement the other flavors. The La Canan Albarino with a 4.1 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'gavi', u'albarino', u'pinot grigio'], u'productMatches': [{u'description': u'Pineapple, lemon, seashell and salt scents carry through on the pure, silky palate. Finishes very long with brilliant acidity, rich citrus fruit flavors, fine minerals and just the slightest touch of almond. Absolutely delicious.', u'title': u'La Cana Albarino', u'price': u'$19.79', u'id': 437713, u'link': u'https://www.wine.com/product/la-cana-albarino-2009/104926', u'imageUrl': u'https://spoonacular.com/productImages/437713-312x231.jpg'}]}, u'aggregateLikes': 71, u'instructions': u'Chop the romaine lettuce. Rince and dry the lettuce using salad spinner. Place in a large serving bowl.Slice the tomatoes, red bell pepper and avocados. Add them to the bowl.Finely chop red onion and sprinkle it over the salad along with the feta cheese and croutons.Just before serving, drizzle with Caesar dressing and mix.', u'spoonacularSourceUrl': u'https://spoonacular.com/beyond-caesar-salad-and-oxo-giveaway-583065', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}