{u'recipes': [{u'sourceName': u'Lifes Ambrosia', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/625581-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 625581, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prime Rib and Kale Chili', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 697.44, u'creditText': u'Lifes Ambrosia', u'extendedIngredients': [{u'originalString': u'12 ounces wheat ale', u'aisle': u'Alcoholic Beverages', u'name': u'ale', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 10014006, u'unit': u'ounces'}, {u'originalString': u'3 cups beef broth', u'aisle': u'Canned and Jarred', u'name': u'beef broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'cups'}, {u'originalString': u'1 (15.5 ounce) can chili beans in sauce', u'aisle': u'Canned and Jarred', u'name': u'chili beans', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 43112, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 (14.5 ounce) can fire roasted tomatoes', u'aisle': u'Canned and Jarred', u'name': u'fire roasted canned tomatoes', u'metaInformation': [u'fire roasted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 98849, u'unit': u'ounce'}, {u'originalString': u'4 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 jalapeno seeded, diced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'5 chops chopped kale, stems removed', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11233, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'diced onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11282, u'unit': u'servings'}, {u'originalString': u'3 cups diced cooked prime rib or steak', u'aisle': u'Meat', u'name': u'prime rib', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prime-rib.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 13833, u'unit': u'cups'}, {u'originalString': u'shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'servings'}, {u'originalString': u'sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1056, u'unit': u'servings'}, {u'originalString': u'1 tablespoon worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}, {u'originalString': u'1/2 yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 67.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.lifesambrosia.com/2015/01/prime-rib-and-kale-chili-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 36, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat olive oil in a pot over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add onion, jalapeno and garlic. Cook just until softened, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add in prime rib or steak. Cook until it starts to brown.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/prime-rib.png', u'id': 13833, u'name': u'prime rib'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour in ale. Scrape up any brown bits that have stuck to the bottom of the pot.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'id': 10014006, u'name': u'ale'}]}, {u'equipment': [], u'step': u'Pour in tomatoes, beans, and beef broth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'id': 6008, u'name': u'beef broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add in worcestershire, cumin and chili powder. Bring to a boil. Boil for 5 minutes. Reduce heat to simmer and cook for 2 hours.During the last 10 minutes of cooking add kale. Ladle chili into bowls.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Garnish with sour cream, cheddar and onions if desired.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'aggregateLikes': 21, u'instructions': u'Heat olive oil in a pot over medium heat. Add onion, jalapeno and garlic. Cook just until softened, about 2 minutes. Add in prime rib or steak. Cook until it starts to brown. Pour in ale. Scrape up any brown bits that have stuck to the bottom of the pot. Pour in tomatoes, beans, and beef broth. Add in worcestershire, cumin and chili powder. Bring to a boil. Boil for 5 minutes. Reduce heat to simmer and cook for 2 hours.During the last 10 minutes of cooking add kale. Ladle chili into bowls. Garnish with sour cream, cheddar and onions if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/prime-rib-and-kale-chili-625581', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl', u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 130, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}