{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474742-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 474742, u'veryPopular': False, u'lowFodmap': False, u'title': u'Flat Iron Steak Sammies with Provolone Sauce {Saturdays with Rachael Ray}', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 564.46, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'servings'}, {u'originalString': u'4 flat iron steaks, 6 to 8 ounces each', u'aisle': u'Meat', u'name': u'flat iron steaks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/boneless-chuck-or-top-blade-steak.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 23059, u'unit': u''}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, peeled and crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'grill seasoning', u'aisle': u'Spices and Seasonings', u'name': u'grill seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1022034, u'unit': u'servings'}, {u'originalString': u'1 1/2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'nutmeg, freshly grated', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2025, u'unit': u'servings'}, {u'originalString': u'1 large onion, thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 cup hot pepper rings (sometimes labeled banana pepper rings), drained', u'aisle': u'Canned and Jarred', u'name': u'pepper rings', u'metaInformation': [u'hot', u'drained', u'(sometimes labeled banana pepper rings)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 98903, u'unit': u'cup'}, {u'originalString': u'3 cubanelle peppers, (Italian mild frying peppers), seeded and thinly sliced', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'italian', u'seeded', u'thinly sliced', u'( mild frying peppers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'2 cups grated provolone cheese', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-slices.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1035, u'unit': u'cups'}, {u'originalString': u'salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'4 hoagie rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}], u'healthScore': 50.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.tasteandtellblog.com/saturdays-with-rachael-ray-flat-iron-steak-sammies-with-provolone-sauce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Leave the steaks on the counter, to take chill off, while the grill or grill pan heats up to medium-high. Coat the steaks with extra-virgin olive oil and grill seasoning.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.png', u'id': 1022034, u'name': u'grill seasoning'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tablespoons, 2 turns of the pan, extra-virgin olive oil in a skillet over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 1034053, u'name': u'extra virgin olive oil'}]}, {u'equipment': [], u'step': u'Add the cubanelle peppers, the garlic and onions and cook until very tender, 10 to 12 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add a splash of hot pepper juice and the hot pepper rings and remove from the heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cubanelle-pepper.jpg', u'id': 98903, u'name': u'banana pepper rings'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 250.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat oven to 250 degrees F.While the peppers cook, put the steaks on the hot grill and cook 10 minutes for rare, 2 minutes longer for each level of desired doneness, turning once about midway during the cook time. Meanwhile heat up a sauce pot over medium heat and add the butter. When the butter has melted, whisk in the flour and stir for 1 minute.', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Whisk in the milk and season with salt, pepper and nutmeg, to taste. Thicken the sauce for a couple of minutes, then reduce the heat to low.When the steaks are cooked to desired doneness, remove them to a cutting board and let rest for 5 minutes. Thinly slice on an angle against the grain of the meat. While the meat rests, warm the bread in the oven. Stir the cheese into sauce.To serve, split the bread lengthwise and spread the steak slices evenly across the bottoms of the bread. Top the steak with the sauce and the peppers and onions. Cover with the bread tops.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'aggregateLikes': 132, u'instructions': u'Leave the steaks on the counter, to take chill off, while the grill or grill pan heats up to medium-high. Coat the steaks with extra-virgin olive oil and grill seasoning.Heat 2 tablespoons, 2 turns of the pan, extra-virgin olive oil in a skillet over medium-high heat. Add the cubanelle peppers, the garlic and onions and cook until very tender, 10 to 12 minutes. Add a splash of hot pepper juice and the hot pepper rings and remove from the heat.Heat oven to 250 degrees F.While the peppers cook, put the steaks on the hot grill and cook 10 minutes for rare, 2 minutes longer for each level of desired doneness, turning once about midway during the cook time. Meanwhile heat up a sauce pot over medium heat and add the butter. When the butter has melted, whisk in the flour and stir for 1 minute. Whisk in the milk and season with salt, pepper and nutmeg, to taste. Thicken the sauce for a couple of minutes, then reduce the heat to low.When the steaks are cooked to desired doneness, remove them to a cutting board and let rest for 5 minutes. Thinly slice on an angle against the grain of the meat. While the meat rests, warm the bread in the oven. Stir the cheese into sauce.To serve, split the bread lengthwise and spread the steak slices evenly across the bottoms of the bread. Top the steak with the sauce and the peppers and onions. Cover with the bread tops.', u'spoonacularSourceUrl': u'https://spoonacular.com/flat-iron-steak-sammies-with-provolone-sauce-saturdays-with-rachael-ray-474742', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}