{u'recipes': [{u'sourceName': u'In Sock Monkey Slippers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/480952-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 480952, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cocoa Espresso Roasted Almonds', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 8, u'pricePerServing': 77.87, u'creditText': u'In Sock Monkey Slippers', u'extendedIngredients': [{u'originalString': u'2 cups raw almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cups'}, {u'originalString': u'2 tablespoons quality cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'1 egg white', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg white', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 tablespoons Lavazza Perfetto Espresso Roast, ground', u'aisle': u'Tea and Coffee', u'name': u'espresso', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 14210, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.insockmonkeyslippers.com/cocoa-espresso-roasted-almonds', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325\xb0F. Line a baking sheet with parchment paper, optional.In a small bowl, combine ground espresso, cocoa powder, and salt.In a large bowl, whisk together egg white and honey until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add nuts, stir, and then add the espresso mixture; stir thoroughly until the almonds are evenly coated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14210, u'name': u'espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pour almonds evenly onto the baking sheet and place in oven. Roast for 30 minutes, stirring halfway through. Allow to cool slightly before serving. Store in an air-tight container at room temperature.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Nicolas Feuillatte Blanc de Blancs with a 4.4 out of 5 star rating seems like a good match. It costs about 65 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Subtle glints of lime-blossom green, with delicate, abundant bubbles. The wine offers aromas of white flowers, such ashawthorn and acacia, as well as more subtle scents of citrus fruits, pears and even limeblossom. Very generous on the palate. Lively, fresh and powerful on the attack.', u'title': u'Nicolas Feuillatte Blanc de Blancs', u'price': u'$64.99', u'id': 442400, u'link': u'https://www.wine.com/product/nicolas-feuillatte-blanc-de-blancs-2005/127127', u'imageUrl': u'https://spoonacular.com/productImages/442400-312x231.jpg'}]}, u'aggregateLikes': 222, u'instructions': u'Preheat oven to 325\xb0F. Line a baking sheet with parchment paper, optional.In a small bowl, combine ground espresso, cocoa powder, and salt.In a large bowl, whisk together egg white and honey until combined. Add nuts, stir, and then add the espresso mixture; stir thoroughly until the almonds are evenly coated. Pour almonds evenly onto the baking sheet and place in oven. Roast for 30 minutes, stirring halfway through. Allow to cool slightly before serving. Store in an air-tight container at room temperature.', u'spoonacularSourceUrl': u'https://spoonacular.com/cocoa-espresso-roasted-almonds-480952', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 38, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}