{u'recipes': [{u'sourceName': u'Deliciously Organic', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/550661-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 550661, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cheesy Jalape\xf1o “Cornbread” (Grain-Free, Paleo)', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 99.32, u'creditText': u'Deliciously Organic', u'extendedIngredients': [{u'originalString': u'2 cups almond flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'almond flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 93740, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons coconut sugar', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93831, u'unit': u'teaspoons'}, {u'originalString': u'1 cup sour cream (or plain, whole coconut yogurt)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'plain', u'sour', u'whole', u'(or , coconut yogurt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 large eggs, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'8 tablespoons unsalted butter or ghee, melted and cooled slightly', u'aisle': u'Ethnic Foods', u'name': u'ghee', u'metaInformation': [u'unsalted', u'cooled', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoons'}, {u'originalString': u'2 medium jalape\xf1os, minced (optional)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapenos', u'metaInformation': [u'minced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1 teaspoon Celtic sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 yellow onion, minced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://deliciouslyorganic.net/cornbread-grain-free-gluten-free/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 425\xb0F and adjust rack to middle position of oven. Butter an 8 x 8-inch baking dish.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk almond flour, coconut flour baking powder, sea salt, baking soda and coconut sugar together in a large mixing bowl. In a separate bowl, whisk together the eggs, butter, and sour cream.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'id': 93740, u'name': u'almond flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Pour sour cream mixture, jalape\xf1os and onions into flour mixture and gently fold all ingredients together.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Pour half of the cornbread batter into the baking dish and spread out evenly. Sprinkle the shredded cheese on top, and then pour the remaining batter on top.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 30-35 minutes, or until the top is golden brown.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Cornbread on the menu? Try pairing with Riesling, Sparkling Wine, and Zinfandel. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Schmitt Sohne Relax Riesling with a 4.4 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'Relax Riesling is fermented slightly dry with a wonderful fruity bouquet and intense flavors of apples and peaches with just a hint of citrus. The natural acidity gives this wine a perfect balance that is refreshingly crisp and leaves your mouth watering. A perfect party wine, or can be enjoyed with a variety of foods from seafood and poultry to oriental food and fresh salads.', u'title': u'Schmitt Sohne Relax Riesling', u'price': u'$9.49', u'id': 434166, u'link': u'https://www.wine.com/product/schmitt-sohne-relax-riesling-2008/99841', u'imageUrl': u'https://spoonacular.com/productImages/434166-312x231.jpg'}]}, u'aggregateLikes': 1451, u'instructions': u'Preheat oven to 425\xb0F and adjust rack to middle position of oven. Butter an 8 x 8-inch baking dish. Whisk almond flour, coconut flour baking powder, sea salt, baking soda and coconut sugar together in a large mixing bowl. In a separate bowl, whisk together the eggs, butter, and sour cream. Pour sour cream mixture, jalape\xf1os and onions into flour mixture and gently fold all ingredients together. Pour half of the cornbread batter into the baking dish and spread out evenly. Sprinkle the shredded cheese on top, and then pour the remaining batter on top. Bake for 30-35 minutes, or until the top is golden brown.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-jalapeo-cornbread-grain-free-paleo-550661', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}