{u'recipes': [{u'sourceName': u'Kitchen Nostalgia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/566712-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 566712, u'veryPopular': False, u'lowFodmap': False, u'title': u'PINZA Sweet Easter Bread', u'diets': [], u'pricePerServing': 422.22, u'creditText': u'Kitchen Nostalgia', u'extendedIngredients': [{u'originalString': u'40 g (1.4 oz) fresh yeast; or 2 tsp (7 g; 0.25 oz) active dry yeast; or 2 tsp (7 g; 0.25 oz) instant yeast; or 2\xbd tsp (8 g; 0.28 oz) dry cake yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'fresh', u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.4, u'consistency': u'solid', u'id': 18375, u'unit': u'oz'}, {u'originalString': u'500 g (4 cups)all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'⅛ tsp allspice', u'aisle': u'Spices and Seasonings', u'name': u'allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'100 g (3/4 stick + 1 Tbsp) butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened', u'(3/4 stick + 1 Tbsp)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 egg for brushing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 large (or 2 small) egg yolk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolk', u'metaInformation': [u'small', u'large', u'(or 2 )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'grated zest of \xbd lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'150 ml (2/3 cup) warm milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'⅛ tsp nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'grated zest of 1 orange', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9216, u'unit': u''}, {u'originalString': u'1 Tbsp maraschino liqueur or Prosek* (optional)', u'aisle': u'Alcoholic Beverages', u'name': u'pear liqueur', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 98988, u'unit': u'Tbsp'}, {u'originalString': u'3-4 Tbsp rum', u'aisle': u'Alcoholic Beverages', u'name': u'rum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14037, u'unit': u'Tbsp'}, {u'originalString': u'\xbd tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'125 g (1/2 cup + 2 Tbsp) sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'(1/2 cup + 2 Tbsp)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 19335, u'unit': u'g'}, {u'originalString': u'crushed sugar cubes for decoration', u'aisle': u'Baking', u'name': u'sugar cubes', u'metaInformation': [u'crushed', u'for decoration'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cube', u'unitShort': u'cubes', u'amount': 1.0, u'consistency': u'solid', u'id': 10419335, u'unit': u'cubes'}, {u'originalString': u'2 whole eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 drops rose oil', u'aisle': u'?', u'name': u'rose oil', u'metaInformation': [], u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 3.0, u'unit': u'drops'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.kitchennostalgia.com/bread/pinza_sweet_easter_bread_recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 68, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Sift flour into a large bowl. Make a well in the middle of the flour mixture with your hand.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add yeast and warm milk. Stir with a little bit of flour. Cover and let rise until doubled in size, about 15 minutes.In a separate bowl, beat eggs and egg yolk with sugar, salt, rose oil, nutmeg, allspice and grated orange and lemon zest.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Add this to flour mixture together with softened butter, rum and maraschino liqueur.Turn the dough out onto a floured work surface, and knead until soft and elastic and you can see large bubbles appear, about 8 minutes (you can use mixer or food processor to speed up this process). Cover and let rise for 10 minutes.Divide the dough into halves.', u'length': {u'number': 18, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'id': 14037, u'name': u'rum'}]}, {u'equipment': [], u'step': u'Roll each half into a ball.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scissors.jpg', u'id': 404673, u'name': u'kitchen scissors'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Put the balls on a a baking sheet lined with greased baking paper. Cover with a damp towel and let rise until doubled in size (up to 3 hours, depending on how hot is your kitchen).Using a pair of kitchen scissors, make three 1-inch-deep, 3-inch long intersecting cuts that meet at the center. The cuts should be quite deep (at least halfway through the loaf) to allow the dough to rise up from the center and form the traditional crests on the loaf.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the bread with beaten egg and sprinkle with crushed sugar cubes.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 10419335, u'name': u'sugar cubes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 175.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Bake in 175 C (375 F) preheated oven for about 45 minutes or until toothpick inserted in the center comes out clean.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 23, u'instructions': u'Sift flour into a large bowl. Make a well in the middle of the flour mixture with your hand. Add yeast and warm milk. Stir with a little bit of flour. Cover and let rise until doubled in size, about 15 minutes.In a separate bowl, beat eggs and egg yolk with sugar, salt, rose oil, nutmeg, allspice and grated orange and lemon zest. Add this to flour mixture together with softened butter, rum and maraschino liqueur.Turn the dough out onto a floured work surface, and knead until soft and elastic and you can see large bubbles appear, about 8 minutes (you can use mixer or food processor to speed up this process). Cover and let rise for 10 minutes.Divide the dough into halves. Roll each half into a ball. Put the balls on a a baking sheet lined with greased baking paper. Cover with a damp towel and let rise until doubled in size (up to 3 hours, depending on how hot is your kitchen).Using a pair of kitchen scissors, make three 1-inch-deep, 3-inch long intersecting cuts that meet at the center. The cuts should be quite deep (at least halfway through the loaf) to allow the dough to rise up from the center and form the traditional crests on the loaf.Brush the bread with beaten egg and sprinkle with crushed sugar cubes.Bake in 175 C (375 F) preheated oven for about 45 minutes or until toothpick inserted in the center comes out clean.', u'spoonacularSourceUrl': u'https://spoonacular.com/pinza-sweet-easter-bread-566712', u'dishTypes': [], u'occasions': [u'easter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}