{u'recipes': [{u'sourceName': u'The Kitchen Magpie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570499-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 570499, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peanut Butter Cup Fudge', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 109.7, u'creditText': u'The Kitchen Magpie', u'extendedIngredients': [{u'originalString': u'1 can of sweetened condensed milk 300ml', u'aisle': u'Baking', u'name': u'condensed milk', u'metaInformation': [u'sweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 1095, u'unit': u'can'}, {u'originalString': u"1 230 gram bag of mini Reese's Peanut Butter Cups", u'aisle': u'Sweet Snacks', u'name': u'peanut butter cups', u'metaInformation': [u'mini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 230.0, u'consistency': u'liquid', u'id': 19150, u'unit': u'gram'}, {u'originalString': u'9\xbd squares of semi-sweet baking chocolate', u'aisle': u'Baking', u'name': u'Semi-Sweet Chocolate Baking Chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'squares', u'unitShort': u'squares', u'amount': 9.5, u'consistency': u'solid', u'id': 10019903, u'unit': u'squares'}, {u'originalString': u'1\xbd tsp pure vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.thekitchenmagpie.com/peanut-butter-cup-fudge', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large microwave safe bowl, and a 4 cup Pyrex measuring cup works perfectly, combine the chocolate and condensed milk.Microwave for one minute, then stir, then again for 45 seconds. Keep stirring until the chocolate is completely melted.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Let it sit and cool a wee while and move on to the next step.Line an 8\xd78 baking pan with tinfoil, leaving little handles on two sides so you can pull it out completely when the fudge is set.Chop up 15 or so of the cups, into quarters. Quarters made a perfect size for the fudge. I ended up with one cup of chopped pieces, perfect.Make sure you let the chocolate mixture cool for a while, so that these don’t melt right away.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Mix it into the slightly cooled chocolate mixture.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread it into the tinfoil lined pan then chop up the rest of the peanut butter cups, smaller this time, and press into the top of the fudge.Refrigerate a few hours then slice. It makes a nice 36 pieces of fudge.If you like peanut butter, this is the fudge for you. It’s like one amazing, maxed out peanut butter cup.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'id': 19150, u'name': u'peanut butter cups'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 203, u'instructions': u'In a large microwave safe bowl, and a 4 cup Pyrex measuring cup works perfectly, combine the chocolate and condensed milk.Microwave for one minute, then stir, then again for 45 seconds. Keep stirring until the chocolate is completely melted.Let it sit and cool a wee while and move on to the next step.Line an 8\xd78 baking pan with tinfoil, leaving little handles on two sides so you can pull it out completely when the fudge is set.Chop up 15 or so of the cups, into quarters. Quarters made a perfect size for the fudge. I ended up with one cup of chopped pieces, perfect.Make sure you let the chocolate mixture cool for a while, so that these don’t melt right away.Mix it into the slightly cooled chocolate mixture.Spread it into the tinfoil lined pan then chop up the rest of the peanut butter cups, smaller this time, and press into the top of the fudge.Refrigerate a few hours then slice. It makes a nice 36 pieces of fudge.If you like peanut butter, this is the fudge for you. It’s like one amazing, maxed out peanut butter cup.', u'spoonacularSourceUrl': u'https://spoonacular.com/peanut-butter-cup-fudge-570499', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}