{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598245-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 598245, u'veryPopular': False, u'lowFodmap': False, u'title': u'Grilled Coconut Wings', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 45, u'pricePerServing': 303.27, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'20 chicken wings, jointed', u'aisle': u'Meat', u'name': u'chicken wings', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 5100, u'unit': u''}, {u'originalString': u'1/2 cup finely minced cilantro leaves and stems', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 cups coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cups'}, {u'originalString': u'4 teaspoons fish sauce', u'aisle': u'Ethnic Foods', u'name': u'fish sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asian-fish-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 6179, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons crushed garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'4 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 1/2-inch-thick slice ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inches', u'unitShort': u'inch', u'amount': 1.5, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'1 teaspoon granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons ground turmeric', u'aisle': u'Spices and Seasonings', u'name': u'ground turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon fresh lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons low-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'teaspoons'}, {u'originalString': u'1 medium onion, coarsely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tablespoon peanut oil, plus more to taste', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup unsalted roasted peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'roasted peanuts', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 16092, u'unit': u'cup'}, {u'originalString': u'Pinch of salt (add to taste, as fish sauce can be very salty)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste', u'canned', u'(add , as fish sauce can be very salty)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'2 fresh Thai chiles or other small chiles', u'aisle': u'Produce;Ethnic Foods', u'name': u'thai chiles', u'metaInformation': [u'fresh', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thai-chiles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11670, u'unit': u''}, {u'originalString': u'1/3 cup canned unsweetened coconut milk', u'aisle': u'Canned and Jarred', u'name': u'unsweetened coconut milk', u'metaInformation': [u'unsweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 12117, u'unit': u'cup'}, {u'originalString': u'1 teaspoon ground galangal (or 1/2 teaspoon freshly grated ginger)', u'aisle': u'?', u'name': u'ground galangal', u'metaInformation': [u'freshly grated', u'(or 1/2 teaspoon ginger)'], u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'unit': u'teaspoon'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://leitesculinaria.com/1743/recipes-grilled-coconut-wings.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Make the Thai peanut sauce1. To make the peanut sauce, add the peanuts along with the peanut oil to a food processor. Blend, on high, until the peanuts form a rough paste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'id': 4042, u'name': u'peanut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the rest of the ingredients except for the cilantro; blend until smooth. Stir in the cilantro and thin with peanut oil to taste.Make the wings2. To make the marinade, using a food processor, grind the ingredients into a paste the consistency of thin yogurt. Reserve a small amount for basting and transfer the remaining marinade to a glass bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'id': 4042, u'name': u'peanut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Add the cleaned and trimmed chicken wings. Toss liberally, cover with plastic wrap, and marinate in the refrigerator overnight.3. To grill the wings, shake off the excess marinade and grill the wings over medium heat for approximately 5 minutes per side, or until crispy.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}, {u'equipment': [], u'step': u'Brush them frequently with the reserved marinade, and be careful not to burn the wing tips. The wings should have a crispy texture with a deep mahogany color when done.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-wings.png', u'id': 5100, u'name': u'chicken wings'}]}, {u'equipment': [], u'step': u'Serve with the Thai Peanut Sauce.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken Wings. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Make the Thai peanut sauce1. To make the peanut sauce, add the peanuts along with the peanut oil to a food processor. Blend, on high, until the peanuts form a rough paste. Add the rest of the ingredients except for the cilantro; blend until smooth. Stir in the cilantro and thin with peanut oil to taste.Make the wings2. To make the marinade, using a food processor, grind the ingredients into a paste the consistency of thin yogurt. Reserve a small amount for basting and transfer the remaining marinade to a glass bowl. Add the cleaned and trimmed chicken wings. Toss liberally, cover with plastic wrap, and marinate in the refrigerator overnight.3. To grill the wings, shake off the excess marinade and grill the wings over medium heat for approximately 5 minutes per side, or until crispy. Brush them frequently with the reserved marinade, and be careful not to burn the wing tips. The wings should have a crispy texture with a deep mahogany color when done. Serve with the Thai Peanut Sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-coconut-wings-598245', u'dishTypes': [u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}