{u'recipes': [{u'sourceName': u'Green Lite Bites', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/506345-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 506345, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sweet Potato and Black Bean Chili', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 92.18, u'creditText': u'Green Lite Bites', u'extendedIngredients': [{u'originalString': u'1 can black beans with liquid', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'with liquid'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 16018, u'unit': u'can'}, {u'originalString': u'1 14oz can of diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'oz'}, {u'originalString': u'3 tsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'2 tsp dried cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'2 tsp dried cilantro', u'aisle': u'Spices and Seasonings', u'name': u'dried cilantro', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'3 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1/2 large sweet onion chopped', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'large', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1 Sweet Potato (mine was about 200g)', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'(mine was 200g)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'2 small zucchini chopped', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 66.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://greenlitebites.com/2011/10/10/sweet-potato-black-bean-chili/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a medium-sized pot over medium-high heat. Spray with non-stick cooking spray and cook the onions with a small pinch of salt until just turning transparent and slightly browning.While the onion is cooking cut up the sweet potato into small cubes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the sweet potato to the pot with the onion. Continue to cook and occasional toss while you chop the zucchini.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the zucchini to the pot and the dry spices. Toss.At this point your pot will be getting dry and possibly sticking a little. That’s ok.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [], u'step': u'Add the can of diced tomatoes and it should losen all up.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the can of black beans and stir everything together.Bring the chili to a boil then lower to a simmer and cover. Cook 20 minutes covered and then another 10 minutes or so uncovered until the sweet potato softens.I measured out exactly 5 cups when it was done. 2 is a realistic serving but I’ll give you the nutritional information per cup so it’s easy to figure out if you decide to double or triple.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili on the menu? Try pairing with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Bohigas Brut Reserva Cava with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale yellow colour. Constant and small bubble. Foam of great persistence. Very fruity aromas, especially of white fruit (acid apple and pear) on shades of peel of citrics and white flowers. In the background, some spicy notes owed to ageing (cinnamon) and cookies. It is a well-structured "cava" in the mouth. Well picked up over its acidity that tenses it overall from beginning to end. The bubble lends a creamy feeling, and it gives volume and softness to the structure that returns acidity and widens the aromas of white fruits and spices that are repeated in the mouth. Its balanced end harmonizes its acidity, and leaves a memory of freshness and volume owing to its light sugar content View More', u'title': u'Bohigas Brut Reserva Cava', u'price': u'$16.99', u'id': 440298, u'link': u'https://www.wine.com/product/bohigas-brut-reserva-cava/131248', u'imageUrl': u'https://spoonacular.com/productImages/440298-312x231.jpg'}]}, u'aggregateLikes': 1588, u'instructions': u'Heat a medium-sized pot over medium-high heat. Spray with non-stick cooking spray and cook the onions with a small pinch of salt until just turning transparent and slightly browning.While the onion is cooking cut up the sweet potato into small cubes.Add the sweet potato to the pot with the onion. Continue to cook and occasional toss while you chop the zucchini.Add the zucchini to the pot and the dry spices. Toss.At this point your pot will be getting dry and possibly sticking a little. That’s ok. Add the can of diced tomatoes and it should losen all up.Add the can of black beans and stir everything together.Bring the chili to a boil then lower to a simmer and cover. Cook 20 minutes covered and then another 10 minutes or so uncovered until the sweet potato softens.I measured out exactly 5 cups when it was done. 2 is a realistic serving but I’ll give you the nutritional information per cup so it’s easy to figure out if you decide to double or triple.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-and-black-bean-chili-506345', u'dishTypes': [u'soup'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}