{u'recipes': [{u'sourceName': u'Spoon Fork Bacon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/666372-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 666372, u'veryPopular': False, u'lowFodmap': False, u'title': u'Individual Apple Crisps', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 112.76, u'creditText': u'Spoon Fork Bacon', u'extendedIngredients': [{u'originalString': u'1/2 cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon cardamom', u'aisle': u'Spices and Seasonings', u'name': u'cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2006, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'4 golden delicious apples, peeled, cored and thinly sliced', u'aisle': u'Produce', u'name': u'red delicious apples', u'metaInformation': [u'cored', u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-delicious-apples.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 1029003, u'unit': u''}, {u'originalString': u'1/2 cup rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 8120, u'unit': u'cup'}, {u'originalString': u'6 tablespoons cold unsalted butter, cut into tiny cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'cut into tiny cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.spoonforkbacon.com/2013/09/individual-apple-crisps/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Place oats, flour, sugar, cinnamon, and brown sugar in a mixing bowl and stir together.3.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [], u'step': u'Cut in butter until a coarse mealy texture forms.', u'number': 2, u'ingredients': []}], u'name': u'Preheat oven to 375F. Lightly grease 4 (8 ounce) ramekins with butter. Set aside.2. For streusel'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Combine all filling ingredients into a large mixing bowl and toss together until thoroughly mixed. Divide filling mixture into prepared ramekins and set aside.5.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}], u'step': u'Remove streusel from freezer and fluff with a fork until crumbly in texture. Divide streusel between the ramekins. (you want the crisps to be filled all the way to the top of each ramekin)6.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place crisps onto a baking sheet and bake for 20 to 25 minutes or until golden brown. Allow crisps to cool for 7 to 10 minutes before serving each with a scoop of ice cream on top.', u'length': {u'number': 27, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u'Place the bowl in the freezer for 20 minutes.4. For filling'}], u'aggregateLikes': 166, u'instructions': u'1. Preheat oven to 375F. Lightly grease 4 (8 ounce) ramekins with butter. Set aside.2. For streusel: Place oats, flour, sugar, cinnamon, and brown sugar in a mixing bowl and stir together.3. Cut in butter until a coarse mealy texture forms. Place the bowl in the freezer for 20 minutes.4. For filling: Combine all filling ingredients into a large mixing bowl and toss together until thoroughly mixed. Divide filling mixture into prepared ramekins and set aside.5. Remove streusel from freezer and fluff with a fork until crumbly in texture. Divide streusel between the ramekins. (you want the crisps to be filled all the way to the top of each ramekin)6. Place crisps onto a baking sheet and bake for 20 to 25 minutes or until golden brown. Allow crisps to cool for 7 to 10 minutes before serving each with a scoop of ice cream on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/individual-apple-crisps-666372', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}