{u'recipes': [{u'sourceName': u'The Gunny Sack', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/795476-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 795476, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Alfredo Stuffed French Bread', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 219.38, u'creditText': u'The Gunny Sack', u'extendedIngredients': [{u'originalString': u'1\xbd cups alfredo sauce', u'aisle': u'Pasta and Rice', u'name': u'alfredo sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 93606, u'unit': u'cups'}, {u'originalString': u'\xbd tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'2 tbsp butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tbsp'}, {u'originalString': u'2 cups diced, cooked chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'cups'}, {u'originalString': u'1 loaf French bread', u'aisle': u'Bakery/Bread', u'name': u'french bread', u'metaInformation': [u'french'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18029, u'unit': u'loaf'}, {u'originalString': u'3 tsp minced garlic, divided', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'divided', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'\xbd cup shredded parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'Optional garnish: chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1\xbd cups shredded mozzarella cheese, divided', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'cups'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.thegunnysack.com/chicken-alfredo-stuffed-french-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the loaf of french bread in half and pull out the soft bread in the center.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 18029, u'name': u'french bread'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the bread chunks in a large bowl and break into small pieces.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add diced, cooked chicken, alfredo sauce, 1 cup of mozzarella cheese, parmesan cheese, 2 teaspoons minced garlic, and pepper to the bowl with the bread pieces and stir until combined. Microwave the chicken alfredo mixture on high for 3-5 minutes, stirring halfway through.Scoop the heated chicken alfredo mixture into one of the halves of the French bread loaf, sprinkle with the remaining  cup of shredded mozzarella cheese and top with the second half of the loaf.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'id': 1001026, u'name': u'shredded mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/alfredo-sauce.jpg', u'id': 93606, u'name': u'alfredo sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 18029, u'name': u'french bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Mix 1 teaspoon minced garlic with the melted butter and brush over the loaf.Wrap the stuffed bread with Reynolds Wrap Heavy-Duty Aluminum Foil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake at 400 degrees for 25-30 minutes until heated through. (For crisper bread, bake uncovered for the last 5 minutes.)Carefully unwrap the foil, cut the Chicken Alfredo Stuffed French Bread into slices and garnish with chopped parsley, if desired.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'id': 18029, u'name': u'french bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is CalNaturale Chardonnay Lodi. It has 4.1 out of 5 stars and a bottle costs about 11 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 25, u'instructions': u'Cut the loaf of french bread in half and pull out the soft bread in the center. Put the bread chunks in a large bowl and break into small pieces.Add diced, cooked chicken, alfredo sauce, 1 cup of mozzarella cheese, parmesan cheese, 2 teaspoons minced garlic, and pepper to the bowl with the bread pieces and stir until combined. Microwave the chicken alfredo mixture on high for 3-5 minutes, stirring halfway through.Scoop the heated chicken alfredo mixture into one of the halves of the French bread loaf, sprinkle with the remaining  cup of shredded mozzarella cheese and top with the second half of the loaf.Mix 1 teaspoon minced garlic with the melted butter and brush over the loaf.Wrap the stuffed bread with Reynolds Wrap Heavy-Duty Aluminum Foil. Bake at 400 degrees for 25-30 minutes until heated through. (For crisper bread, bake uncovered for the last 5 minutes.)Carefully unwrap the foil, cut the Chicken Alfredo Stuffed French Bread into slices and garnish with chopped parsley, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-alfredo-stuffed-french-bread-795476', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}