{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/696034-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 696034, u'veryPopular': True, u'lowFodmap': True, u'title': u'Garden Pizza', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 40, u'pricePerServing': 183.08, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'4 whole baby or 1 medium zucchini, halved lengthwise', u'aisle': u'Produce', u'name': u'baby peas', u'metaInformation': [u'whole', u'medium', u'halved lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11304, u'unit': u''}, {u'originalString': u'1 pint cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'pint'}, {u'originalString': u'8 fresh basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 2044, u'unit': u''}, {u'originalString': u'4 ounces fresh mozzarella cheese, thinly sliced', u'aisle': u'Cheese', u'name': u'fresh mozzarella cheese', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1026, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons minced fresh oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoons grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'1 medium yellow bell pepper, diced', u'aisle': u'Produce', u'name': u'yellow bell pepper', u'metaInformation': [u'diced', u'yellow', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 89.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/garden_pizza.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Tip: To roll out pizza dough: When you're ready to get your pizzas on the grill, turn the dough out onto a lightly floured surface. Dust the top with flour; dimple with your fingertips to shape into a thick, flattened circledon't worry if it's not perfectly symmetrical. Then use a rolling pin to roll into a circle about 14 inches in diameter.Variation:Pizza on a charcoal grill: Light 6 quarts (about 1 large chimney starter full) of charcoal and burn until the coals are mostly white, about 20 minutes.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the coals in an even layer.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Place a grate over the coals.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Let the coals burn until they are about medium-low. (Grill any toppings for the pizza while the coals are burning down.) To test the heat, hold your palm about 5 inches above the grill rack; if you can hold it there for about 8 seconds before you need to move it away, the fire is medium-low.', u'number': 4, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-stone.jpg', u'id': 406907, u'name': u'pizza stone'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Place a pizza stone on the lowest rack; preheat oven to 450F for at least 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll out the dough and place on a cornmeal-dusted pizza peel or inverted baking sheet, using enough cornmeal so that the dough slides easily. Slide the dough onto the preheated stone and cook until the bottom begins to crisp, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the crust from the oven using a large spatula and place it uncooked-side down on the peel or baking sheet, making sure the underside of the crust is completely coated with cornmeal. Quickly add the toppings and slide the pizza back onto the stone. Continue baking until the toppings are hot and the bottom of the crust has browned, 12 to 15 minutes.Individual variation:The dough can be turned into 4 or 6 personal-size pizzas. After kneading, divide the dough into 4 or 6 equal balls.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Brush with oil and place 3 inches apart on a baking sheet. Cover and set aside until doubled in size, about 1 hour.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Roll each portion into a 6-to-8-inch circle.', u'number': 5, u'ingredients': []}], u'name': u'Transfer the crust to the grill rack, cover the grill and cook the crust, checking once or twice, until lightly browned, 3 to 4 minutes. Flip the crust, quickly add the toppings, cover the grill and cook until the toppings are hot and the bottom of the crust has browned, 5 to 8 minutes. If your crust browns faster than your toppings are cooking, slide a baking sheet under the pizza to keep the crust from burning while the toppings finish.Pizza in the oven'}], u'winePairing': {u'pairingText': u'Pizzan on the menu? Try pairing with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Fonterutoli Chianti Classico with a 4.3 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u"Color: Deep purplish-red but bright and exceptionally concentrated.Bouquet: Extremely intense and complex with scents of cherries and raspberries accompanied by light toasty and spicy shadings.Flavor: The impact in the mouth is incisive but soft due to a substantial structure of tannins in which those that are soft and well rounded stand out. Acidity is fused with the wine's body and aids the transmission of pleasant sensations of warmth and strength. The wine features a long finish that is unusual for a regular Chianti Classico.Conclusions: Those who argue that Chianti Classico is a prickly and rough wine will change their minds after tasting this 1999, which is ready to drink now but will improve for at least five years more.Alcohol: 13.5% by volume View More", u'title': u'Fonterutoli Chianti Classico', u'price': u'$24.49', u'id': 440954, u'link': u'https://www.wine.com/product/fonterutoli-chianti-classico-1998/12434', u'imageUrl': u'https://spoonacular.com/productImages/440954-312x231.jpg'}]}, u'aggregateLikes': 450, u'instructions': u"Tip: To roll out pizza dough: When you're ready to get your pizzas on the grill, turn the dough out onto a lightly floured surface. Dust the top with flour; dimple with your fingertips to shape into a thick, flattened circledon't worry if it's not perfectly symmetrical. Then use a rolling pin to roll into a circle about 14 inches in diameter.Variation:Pizza on a charcoal grill: Light 6 quarts (about 1 large chimney starter full) of charcoal and burn until the coals are mostly white, about 20 minutes. Spread the coals in an even layer. Place a grate over the coals. Let the coals burn until they are about medium-low. (Grill any toppings for the pizza while the coals are burning down.) To test the heat, hold your palm about 5 inches above the grill rack; if you can hold it there for about 8 seconds before you need to move it away, the fire is medium-low. Transfer the crust to the grill rack, cover the grill and cook the crust, checking once or twice, until lightly browned, 3 to 4 minutes. Flip the crust, quickly add the toppings, cover the grill and cook until the toppings are hot and the bottom of the crust has browned, 5 to 8 minutes. If your crust browns faster than your toppings are cooking, slide a baking sheet under the pizza to keep the crust from burning while the toppings finish.Pizza in the oven: Place a pizza stone on the lowest rack; preheat oven to 450F for at least 20 minutes. Roll out the dough and place on a cornmeal-dusted pizza peel or inverted baking sheet, using enough cornmeal so that the dough slides easily. Slide the dough onto the preheated stone and cook until the bottom begins to crisp, about 3 minutes. Remove the crust from the oven using a large spatula and place it uncooked-side down on the peel or baking sheet, making sure the underside of the crust is completely coated with cornmeal. Quickly add the toppings and slide the pizza back onto the stone. Continue baking until the toppings are hot and the bottom of the crust has browned, 12 to 15 minutes.Individual variation:The dough can be turned into 4 or 6 personal-size pizzas. After kneading, divide the dough into 4 or 6 equal balls. Brush with oil and place 3 inches apart on a baking sheet. Cover and set aside until doubled in size, about 1 hour. Roll each portion into a 6-to-8-inch circle.", u'spoonacularSourceUrl': u'https://spoonacular.com/garden-pizza-696034', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}