{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217973-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 70, u'id': 217973, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spicy plum & apple chutney', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 25, u'pricePerServing': 35.14, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1kg Bramley apples', u'aisle': u'Produce', u'name': u'bramley apples', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/braeburn-apples.png', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 1009003, u'unit': u'kg'}, {u'originalString': u'500ml bottle cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'ml'}, {u'originalString': u'1 cinnamon stick', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon stick', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1002010, u'unit': u''}, {u'originalString': u'1 tsp cumin seed', u'aisle': u'Spices and Seasonings', u'name': u'cumin seed', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'tsp'}, {u'originalString': u'1 garlic bulb', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'thumb-size piece fresh root ginger', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'450g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 450.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'2 large onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1kg plums', u'aisle': u'Produce', u'name': u'plums', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 9279, u'unit': u'kg'}, {u'originalString': u'1 tbsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tbsp'}, {u'originalString': u'3 star anise', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/12396/spicy-plum-and-apple-chutney', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Start by getting the ingredients ready.Peel the garlic cloves and cut them intoslivers. Peel and thinly shred the ginger.Halve, peel and thinly slice the onions,then put them in a large, wide saucepanor a preserving pan with the garlic andginger. Peel, core and chop the apples,then add to the pan with the spices,vinegar and salt.Bring the pan to the boil over a gentleheat, give everything a good stir, then turndown the heat and cover the pan (if youdon’t have a lid use foil). Simmer for 30 minsuntil the apples are cooked and pulpy.While the apples are simmering, stoneand quarter the plums, then add them tothe cooked apples with the sugar. Stirwell and leave to bubble away, this timeuncovered, for another 40 mins stirringregularly until the plums are cooked butstill retain some of their shape. Ladle intothe sterilised jars, seal and label.This chutney is best kept for abouta month before eating as the vinegarneeds a bit of time to mellow. If youdon’t want the flavour of the spicesto develop any more, then take out thecinnamon and star anise before potting.It will keep for 1 year in a cool place butonce opened store in the fridge and usewithin a month.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'id': 1012002, u'name': u'star anise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 253, u'instructions': u'Start by getting the ingredients ready.Peel the garlic cloves and cut them intoslivers. Peel and thinly shred the ginger.Halve, peel and thinly slice the onions,then put them in a large, wide saucepanor a preserving pan with the garlic andginger. Peel, core and chop the apples,then add to the pan with the spices,vinegar and salt.Bring the pan to the boil over a gentleheat, give everything a good stir, then turndown the heat and cover the pan (if youdon’t have a lid use foil). Simmer for 30 minsuntil the apples are cooked and pulpy.While the apples are simmering, stoneand quarter the plums, then add them tothe cooked apples with the sugar. Stirwell and leave to bubble away, this timeuncovered, for another 40 mins stirringregularly until the plums are cooked butstill retain some of their shape. Ladle intothe sterilised jars, seal and label.This chutney is best kept for abouta month before eating as the vinegarneeds a bit of time to mellow. If youdon’t want the flavour of the spicesto develop any more, then take out thecinnamon and star anise before potting.It will keep for 1 year in a cool place butonce opened store in the fridge and usewithin a month.', u'spoonacularSourceUrl': u'https://spoonacular.com/spicy-plum-apple-chutney-217973', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 40, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}