{u'recipes': [{u'sourceName': u'Fuss Free Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/494061-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 494061, u'veryPopular': False, u'lowFodmap': False, u'title': u'[] Smoked Salmon Omelette with Sweet Soy Sauce & Sriracha & How to Have Omelette for Dinner', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 344.59, u'creditText': u'Fuss Free Cooking', u'extendedIngredients': [{u'originalString': u'125g sweet baby corn, halved', u'aisle': u'Produce', u'name': u'baby corn', u'metaInformation': [u'sweet', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-corn.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 10011168, u'unit': u'g'}, {u'originalString': u'250g ready to serve brown rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'ready to serve'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 20040, u'unit': u'g'}, {u'originalString': u'Cooking oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cooking oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'6 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 red chilli, deseeded & roughly chopped (adjust to taste)', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'deseeded', u'roughly chopped', u'to taste', u'(adjust )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'2 smoked salmon fillets - 185g, skinless & roughly shred by hand', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [u'smoked', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 2.0, u'consistency': u'solid', u'id': 15076, u'unit': u'fillet'}, {u'originalString': u'Indonesian Sweet Soy Sauce/ Kecap Manis (for homemade version click here', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [u'sweet', u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'servings'}, {u'originalString': u'2 x spring onions, finely sliced', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'Sriracha Sauce', u'aisle': u'Condiments', u'name': u'sriracha sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1016168, u'unit': u'servings'}, {u'originalString': u'150g sugar snap peas, trimmed', u'aisle': u'Produce', u'name': u'sugar snap peas', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 10011300, u'unit': u'g'}, {u'originalString': u'White pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2032, u'unit': u'servings'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.fussfreecooking.com/recipe-categories/meat-recipes/smoked-salmon-omelette-with-sweet-soy-sauce-sriracha-how-to-have-omelette-for-dinner/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, add smoked salmon fillets, eggs, spring onions (saved a small handful for garnish later), red chilli, white pepper and 1/4 tsp of salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'id': 15076, u'name': u'salmon fillets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'id': 2032, u'name': u'white pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'red chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Whisk gently until the ingredients are well combined. Set aside.In a large stir fry pan, add a teaspoon of cooking oil. When the oil is hot, add sugar snap peas and sweet baby corns with a pinch of salt.  Cover the pan for a minute or two, cooking until the vegetables are slightly wilted.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'id': 10011300, u'name': u'sugar snap peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-corn.jpg', u'id': 10011168, u'name': u'baby corn'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the cooked vegetables from the pan to a plate and the cover with a cling wrap to keep warm. In the meantime, proceed to make the omelette.In the same pan, add a tbsp of cooking oil. When the oil is hot, add half of the egg mixture and cook over medium low heat, covered. When the omelette is roughly 70% - 80% cooked, fold it in thirds, resembling a long pillow.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer to a separate plate and cover with aluminium foil to keep warm. Repeat the same with the remaining egg mixture.Divide the omelettes into 4 portions and serve with sauteed vegetables and warm bed of brown rice. As a finishing touch, drizzle Indonesian sweet soy sauce and Sriracha and a sprinkle of chopped spring onion.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'id': 20040, u'name': u'brown rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Casa Catelli Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 8 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'It has a straw yellow color. On the nose it has floral notes with hint of dry hay and fresh lemon. On the palate it has a soft citrus flavor with hints of crusty bread and acacia honey. Indeed, well balanced and pleasant to drink with and without food.', u'title': u'Casa Catelli Pinot Grigio', u'price': u'$7.99', u'id': 439141, u'link': u'https://www.wine.com/product/casa-catelli-pinot-grigio-2014/142131', u'imageUrl': u'https://spoonacular.com/productImages/439141-312x231.jpg'}]}, u'aggregateLikes': 14, u'instructions': u'In a large bowl, add smoked salmon fillets, eggs, spring onions (saved a small handful for garnish later), red chilli, white pepper and 1/4 tsp of salt. Whisk gently until the ingredients are well combined. Set aside.In a large stir fry pan, add a teaspoon of cooking oil. When the oil is hot, add sugar snap peas and sweet baby corns with a pinch of salt.  Cover the pan for a minute or two, cooking until the vegetables are slightly wilted. Transfer the cooked vegetables from the pan to a plate and the cover with a cling wrap to keep warm. In the meantime, proceed to make the omelette.In the same pan, add a tbsp of cooking oil. When the oil is hot, add half of the egg mixture and cook over medium low heat, covered. When the omelette is roughly 70% - 80% cooked, fold it in thirds, resembling a long pillow. Transfer to a separate plate and cover with aluminium foil to keep warm. Repeat the same with the remaining egg mixture.Divide the omelettes into 4 portions and serve with sauteed vegetables and warm bed of brown rice. As a finishing touch, drizzle Indonesian sweet soy sauce and Sriracha and a sprinkle of chopped spring onion.', u'spoonacularSourceUrl': u'https://spoonacular.com/-smoked-salmon-omelette-with-sweet-soy-sauce-sriracha-how-to-have-omelette-for-dinner-494061', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}