{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/468010-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 468010, u'veryPopular': False, u'lowFodmap': False, u'title': u'Wild Rice Salad', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 139.5, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 cup cashews, optional', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashews', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12087, u'unit': u'cup'}, {u'originalString': u'2 cups diced cooked chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'cups'}, {u'originalString': u'1-1/2 cups halved green grapes', u'aisle': u'Produce', u'name': u'green grapes', u'metaInformation': [u'green', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cups'}, {u'originalString': u'Lettuce leaves', u'aisle': u'Produce', u'name': u'lettuce leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 93623, u'unit': u'leaves'}, {u'originalString': u'3/4 cup reduced-fat mayonnaise', u'aisle': u'Condiments', u'name': u'low fat mayonnaise', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 4641, u'unit': u'cup'}, {u'originalString': u'Seasoned salt, optional', u'aisle': u'Spices and Seasonings', u'name': u'seasoned salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1042047, u'unit': u'servings'}, {u'originalString': u'1 cup sliced water chestnuts, drained', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'water chestnuts', u'metaInformation': [u'drained', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-chestnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11590, u'unit': u'cup'}, {u'originalString': u'1 cup uncooked wild rice', u'aisle': u'Pasta and Rice', u'name': u'wild rice', u'metaInformation': [u'wild', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-wild-uncooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20088, u'unit': u'cup'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/wild-rice-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook rice according to package directions, omitting salt or substituting seasoned salt if desired.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1042047, u'name': u'seasoned salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain well; cool to room temperature. Spoon into a large bowl; add chicken, grapes, water chestnuts and mayonnaise. Toss gently with a fork. Cover and chill.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-chestnuts.jpg', u'id': 11590, u'name': u'water chestnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}, {u'equipment': [], u'step': u'Just before serving, add cashews if desired.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve on lettuce leaves or line a bowl with lettuce leaves and fill with salad.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce', u'id': 93623, u'name': u'lettuce leaf'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad can be paired with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Chehalem INOX Chardonnay. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased.", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Directions                                                                                Cook rice according to package directions, omitting salt or substituting seasoned salt if desired. Drain well; cool to room temperature. Spoon into a large bowl; add chicken, grapes, water chestnuts and mayonnaise. Toss gently with a fork. Cover and chill.                                                                                           Just before serving, add cashews if desired. Serve on lettuce leaves or line a bowl with lettuce leaves and fill with salad.                                        Yield: 6 servings.                                                                                                                         Originally published as Wild Rice Salad in  Taste of HomeFebruary/March 1993, p29                                                                                                                                                                                                        Nutritional Facts                                                                            Diabetic Exchanges: One serving (prepared without cashews or additional salt) equals 2 lean meat, 1 starch, 1 fruit, 1 vegetable, 1 fat; also, 318 calories, 229 mg sodium, 38 mg cholesterol, 40 gm carbohydrate, 19 gm protein, 10 gm fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/wild-rice-salad-468010', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}