{u'recipes': [{u'sourceName': u'Country Cleaver', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/528508-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 528508, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet Potato and Spring Vegetable Frittata', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 20, u'pricePerServing': 53.17, u'creditText': u'Country Cleaver', u'extendedIngredients': [{u'originalString': u'2 Tbsp Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tbsp'}, {u'originalString': u'6 Eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 clove Garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'1/4 cup herbed or regular Goat Cheese, crumbled', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1159, u'unit': u'cup'}, {u'originalString': u'\xbc cup Heavy Cream, or Half and Half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1 Heirloom Tomato, thinly sliced', u'aisle': u'Produce', u'name': u'heirloom tomato', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'1/2 tsp Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/4 cup wilted spinach, squeezed of extra moisture', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}, {u'originalString': u'1 cup pre-roasted Sweet Potato pieces, bite size', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 31.0, u'sourceUrl': u'http://www.countrycleaver.com/2014/03/sweet-potato-spring-vegetable-frittata.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Set oven rack nearest to the broiler. Preheat the broiler.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Let medium skillet (with oven safe handle) heat over medium high heat for about five minutes. In bowl whisk together eggs and heavy cream (or half and half), set aside.Thinly slice the tomato, and lay on several paper towels to wick away additional moisture. Sprinkle with salt and let rest while you prepare the additional vegetables and mince the garlic.Take goat cheese and crumble using a fork run over the top of the cheese, it will turn into crumbles. Set aside in a small bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add butter to the skillet and bring to simmer. Swirl the butter around the pan so the whole pan is evenly coated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u"Pour egg mixture into the bottom of the pan. Things will happen quickly - shake the skillet to ensure the eggs don't completely stick to the bottom. Run your spatula around the edge of the frittata to make sure it doesn't stick. Gently sprinkle the sweet potatoes into the pan, then the sliced heirloom tomato, and then spinach.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'heirloom tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Let the edge set in the skillet for about 2-3 minutes. Immediately transfer to oven under the broiler.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Let cook until the frittata starts to turn golden brown on top.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Remove from broiler and slice and serve while warm. Top with crumbled goat cheese and serve.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Frittatan on the menu? Try pairing with Sparkling Wine. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. The Banfi Rosa Regale Brachetto ( half-bottle) with a 4.4 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u"This sparkling red wine made from Brachetto d'Acqui in Piedmont, Italy is love at first sip and a perpetual crowd pleaser. The color is a festive cranberry. Aromatic with hints of raspberries, strawberries and rose petals. There is a taste of fresh raspberries, with crisp acidity, enticing the palate with an initial softness, graduating to a clean and dry finish. Perfect for any occasion. A unique and festive sparkling wine, seductive aperitif, and elegant dessert wine. Pairs well with seafood, cheeses, spicy fare and chocolate. Serve chilled.  View More", u'title': u'Banfi Rosa Regale Brachetto ( half-bottle)', u'price': u'$12.99', u'id': 448167, u'link': u'https://www.wine.com/product/banfi-rosa-regale-brachetto-375ml-half-bottle-2012/130015', u'imageUrl': u'https://spoonacular.com/productImages/448167-312x231.jpg'}]}, u'aggregateLikes': 168, u'instructions': u"Set oven rack nearest to the broiler. Preheat the broiler. Let medium skillet (with oven safe handle) heat over medium high heat for about five minutes. In bowl whisk together eggs and heavy cream (or half and half), set aside.Thinly slice the tomato, and lay on several paper towels to wick away additional moisture. Sprinkle with salt and let rest while you prepare the additional vegetables and mince the garlic.Take goat cheese and crumble using a fork run over the top of the cheese, it will turn into crumbles. Set aside in a small bowl. Add butter to the skillet and bring to simmer. Swirl the butter around the pan so the whole pan is evenly coated. Pour egg mixture into the bottom of the pan. Things will happen quickly - shake the skillet to ensure the eggs don't completely stick to the bottom. Run your spatula around the edge of the frittata to make sure it doesn't stick. Gently sprinkle the sweet potatoes into the pan, then the sliced heirloom tomato, and then spinach.Let the edge set in the skillet for about 2-3 minutes. Immediately transfer to oven under the broiler. Let cook until the frittata starts to turn golden brown on top. Remove from broiler and slice and serve while warm. Top with crumbled goat cheese and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-and-spring-vegetable-frittata-528508', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'spring', u'easter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}