{u'recipes': [{u'sourceName': u'The Baking Pan', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/534033-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 534033, u'veryPopular': False, u'lowFodmap': False, u'title': u'Peppermint Yule Log', u'diets': [u'dairy free'], u'preparationMinutes': 240, u'pricePerServing': 78.83, u'creditText': u'The Baking Pan', u'extendedIngredients': [{u'originalString': u'4 teaspoons light corn syrup', u'aisle': u'Baking', u'name': u'corn syrup', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19350, u'unit': u'teaspoons'}, {u'originalString': u'4 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'6 large eggs, separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'separated', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbc cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tablespoon liquid red food coloring', u'aisle': u'Baking', u'name': u'food coloring', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'tablespoon'}, {u'originalString': u'\xbe cup granulated sugar, divided', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1\xbc cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'About 10 small peppermint candies, crushed', u'aisle': u'Sweet Snacks', u'name': u'peppermint candies', u'metaInformation': [u'small', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/candy-canes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 98859, u'unit': u''}, {u'originalString': u'\xbc teaspoon pure peppermint extract', u'aisle': u'Baking', u'name': u'peppermint extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 1022050, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'1 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://thebakingpan.com/recipes/cakes/peppermint-yule-log/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a medium mixing bowl, combine flour and cocoa; sift or whisk together to mix. Set aside.In a large bowl of an electric mixer, add the egg yolks and beat 3 to 5 minutes on medium-high speed until the egg yolk foam becomes thick and lemon colored. With the mixer on medium speed, slowly add  cup of the sugar to the eggs, either one tablespoon at a time, or in a very slow steady stream, taking from 2 to 3 minutes to add all of the sugar, and beating until the eggs and sugar are fully incorporated. Scrape down the sides and bottom of the bowl with a rubber spatula so the mixture blends evenly. The mixture will be thick and a pale yellow color.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the vanilla and continue mixing for another minute. Reduce mixer speed to low and add the food coloring and mix until well blended.With the mixer on low speed, gradually add about  of the flour mixture, mix just until blended, and then add the remaining half, mix just until blended, scraping down the side of the bowl as needed.In another large mixing bowl and using clean beaters, beat the egg whites with an electric mixer until soft peaks form. Gradually add the remaining  cup sugar; continue beating until stiff peaks form. Using a balloon type whisk or large rubber spatula, gently fold about  of the beaten egg whites into the batter to lighten the batter, and then fold the remaining egg whites in.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'food color'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/offset-spatula.jpg', u'id': 405901, u'name': u'offset spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake: Spoon the batter into the prepared pan and smooth the surface with the back of a large spoon or large offset spatula.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 12 to 15 minutes or until the top of the cake springs back when lightly touched.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from oven, immediately loosen edges of cake from pan and turn the cake over onto the prepared towel. Carefully peel off the parchment paper, and then roll the cake and towel together tightly, starting with the narrow end.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place seam side down on a wire cooling rack to cool completely.In a large mixing bowl and using clean beaters, beat the egg whites with an electric mixer until stiff peaks form. Set aside.In a small heavy saucepan, combine sugar, water, and corn syrup to create syrup. Cook over medium heat, stirring frequently, until sugar has dissolved and syrup is clear. Increase heat to high and bring syrup to a boil. Boil without stirring until syrup reaches 248 degrees, using a candy or instant read thermometer to gauge the temperature, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'id': 19350, u'name': u'corn syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from heat.With the mixer at medium-high speed, pour the hot syrup slowly, in a thin steady stream into the beaten egg whites. Continue beating until the mixture is cool, thick, and shiny, 10 to 12 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [], u'step': u'Add the peppermint extract and beat for another minute. Frosting must be used immediately.Carefully unroll cooled cake but dont try to make the cake lie completely flat, the edge should remain curled so that the cake doesnt split.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 1022050, u'name': u'peppermint extract'}]}, {u'equipment': [], u'step': u'Spread about 2 cups of the frosting over the cake, spreading the frosting evenly under the curled edge and leaving a 1 inch border on the far side. Gently re-roll the cake without the towel, starting with the curled end.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Place seam side down on a serving plate.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the remaining frosting over the top of the cake.Sprinkle the crushed peppermint candies over the top of the cake.Cake can be served immediately, or cover and refrigerate several hours before serving. Refrigerate leftovers.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Yule Log. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 28, u'instructions': u'In a medium mixing bowl, combine flour and cocoa; sift or whisk together to mix. Set aside.In a large bowl of an electric mixer, add the egg yolks and beat 3 to 5 minutes on medium-high speed until the egg yolk foam becomes thick and lemon colored. With the mixer on medium speed, slowly add  cup of the sugar to the eggs, either one tablespoon at a time, or in a very slow steady stream, taking from 2 to 3 minutes to add all of the sugar, and beating until the eggs and sugar are fully incorporated. Scrape down the sides and bottom of the bowl with a rubber spatula so the mixture blends evenly. The mixture will be thick and a pale yellow color. Add the vanilla and continue mixing for another minute. Reduce mixer speed to low and add the food coloring and mix until well blended.With the mixer on low speed, gradually add about  of the flour mixture, mix just until blended, and then add the remaining half, mix just until blended, scraping down the side of the bowl as needed.In another large mixing bowl and using clean beaters, beat the egg whites with an electric mixer until soft peaks form. Gradually add the remaining  cup sugar; continue beating until stiff peaks form. Using a balloon type whisk or large rubber spatula, gently fold about  of the beaten egg whites into the batter to lighten the batter, and then fold the remaining egg whites in.Bake: Spoon the batter into the prepared pan and smooth the surface with the back of a large spoon or large offset spatula. Bake for 12 to 15 minutes or until the top of the cake springs back when lightly touched. Remove from oven, immediately loosen edges of cake from pan and turn the cake over onto the prepared towel. Carefully peel off the parchment paper, and then roll the cake and towel together tightly, starting with the narrow end. Place seam side down on a wire cooling rack to cool completely.In a large mixing bowl and using clean beaters, beat the egg whites with an electric mixer until stiff peaks form. Set aside.In a small heavy saucepan, combine sugar, water, and corn syrup to create syrup. Cook over medium heat, stirring frequently, until sugar has dissolved and syrup is clear. Increase heat to high and bring syrup to a boil. Boil without stirring until syrup reaches 248 degrees, using a candy or instant read thermometer to gauge the temperature, about 5 minutes. Remove from heat.With the mixer at medium-high speed, pour the hot syrup slowly, in a thin steady stream into the beaten egg whites. Continue beating until the mixture is cool, thick, and shiny, 10 to 12 minutes. Add the peppermint extract and beat for another minute. Frosting must be used immediately.Carefully unroll cooled cake but dont try to make the cake lie completely flat, the edge should remain curled so that the cake doesnt split.Spread about 2 cups of the frosting over the cake, spreading the frosting evenly under the curled edge and leaving a 1 inch border on the far side. Gently re-roll the cake without the towel, starting with the curled end. Place seam side down on a serving plate. Spread the remaining frosting over the top of the cake.Sprinkle the crushed peppermint candies over the top of the cake.Cake can be served immediately, or cover and refrigerate several hours before serving. Refrigerate leftovers.', u'spoonacularSourceUrl': u'https://spoonacular.com/peppermint-yule-log-534033', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 255, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}