{u'recipes': [{u'sourceName': u'Hilah Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/837845-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 837845, u'veryPopular': False, u'lowFodmap': False, u'title': u'World’s Best Tuna Melt', u'diets': [u'pescatarian'], u'pricePerServing': 177.18, u'creditText': u'Hilah Cooking', u'extendedIngredients': [{u'originalString': u'4 slices bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'1 5 oz can tuna', u'aisle': u'Canned and Jarred', u'name': u'canned tuna', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 15119, u'unit': u'oz'}, {u'originalString': u'2 ounces Cheddar (or see above for suggestions) sliced', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [u'sliced', u'for suggestions) '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 1009, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon minced fresh parsley or cilantro, optional', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons minced red or green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'1-2 tablespoons mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tablespoons'}, {u'originalString': u'1-2 teaspoons mustard', u'aisle': u'Condiments', u'name': u'mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2046, u'unit': u'teaspoons'}, {u'originalString': u'2-4 tablespoons diced pickled jalape\xf1os (with juice)', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'pickled jalapenos', u'metaInformation': [u'diced', u'with juice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickled-jalapenos.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10011632, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup fresh diced pineapple (probably could use canned, too)', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'fresh', u'diced', u'canned', u'(probably could use , too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9266, u'unit': u'cup'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'Optional: sliced tomato, cucumber, crispy lettuce', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'crispy', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u'servings'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://hilahcooking.com/worlds-best-tuna-melt/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Drain the tuna well and mix with pineapple through salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'id': 15119, u'name': u'tuna'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add mayonnaise and/or pickled jalapeo brine until a spreadable salad is made. This is important that the tuna salad be well-mixed and pretty smooth. Taste for salt.Lightly toast the sliced bread and place two slices on a baking sheet. Top with tuna salad then sliced cheese. Broil until cheese is melted. This should just take a minute or so, depending on how close the pan is to the broiler.Meanwhile, spread mayo on the other slices of bread.Pull out the tuna melts and top with vegetables and/or lettuce and the other slice of bread.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-canned.jpg', u'id': 15119, u'name': u'tuna'}]}, {u'equipment': [], u'step': u'Serve with chips, pickles, and beers!', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Tramin Pinot Grigio. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Bright yellow in color with coppery reflections and clear fruit aromas of pear, citrus, honeysuckle, tropical fruits and light spices. Firm, velvety and rich on the palate, with well-integrated acidity. A very round and satisfying wine. Recommended with fish antipasti, risotto with asparagus, omelets and pasta View More', u'title': u'Tramin Pinot Grigio', u'price': u'$18.29', u'id': 448227, u'link': u'https://www.wine.com/product/tramin-pinot-grigio-2009/106454', u'imageUrl': u'https://spoonacular.com/productImages/448227-312x231.jpg'}]}, u'aggregateLikes': 141, u'instructions': u'Drain the tuna well and mix with pineapple through salt and pepper. Add mayonnaise and/or pickled jalapeo brine until a spreadable salad is made. This is important that the tuna salad be well-mixed and pretty smooth. Taste for salt.Lightly toast the sliced bread and place two slices on a baking sheet. Top with tuna salad then sliced cheese. Broil until cheese is melted. This should just take a minute or so, depending on how close the pan is to the broiler.Meanwhile, spread mayo on the other slices of bread.Pull out the tuna melts and top with vegetables and/or lettuce and the other slice of bread.Serve with chips, pickles, and beers!', u'spoonacularSourceUrl': u'https://spoonacular.com/worlds-best-tuna-melt-837845', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}