{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/201896-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 201896, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken and "Slick" Dumplings', u'diets': [], u'pricePerServing': 160.25, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1 cup (5 ounces) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 20081, u'unit': u'ounces'}, {u'originalString': u'1 small head garlic, ends trimmed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'small', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'head'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon lemon juice from one lemon', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'2 medium onions, ends trimmed and quartered', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'medium', u'trimmed', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 bunch parsley, stems reserved, leaves chopped, divided', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'divided', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'bunch'}, {u'originalString': u'2 tablespoons (1 ounce) unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon vegetable shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'vegetable shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4615, u'unit': u'tablespoon'}, {u'originalString': u'1 whole small chicken, about 3 pounds', u'aisle': u'Meat', u'name': u'whole chicken', u'metaInformation': [u'whole', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 5006, u'unit': u''}, {u'originalString': u'1/4 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 teaspoon whole peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'whole peppercorns', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/02/chicken-and-slick-dumplings-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place chicken, onions, garlic, peppercorns, parsley stems, and 1 1/2 teaspoons salt in large saucepan or Dutch oven.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add water to pot to just cover chicken (about 10 cups). Bring to boil over medium-high heat and then reduce heat to simmer. Cook until chicken is tender and falling off the bone, about 1 hour.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'While broth is simmering, make dumpling dough: In medium bowl, stir flour with 2 tablespoons butter, shortening, baking powder, and 1/2 teaspoon salt, mashing with fork until mixture resembles coarse wet crumbs. Stir in milk until it forms a dough.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let sit about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'When cooked, transfer chicken to plate. Strain stock and return to saucepan. Simmer over medium-low heat until reduced to 6 cups. Skim fat from the top and season to taste with salt and ground pepper; keep warm. When chicken is cool enough to handle, remove meat from bones and shred into bite size pieces; reserve.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'On floured surface, roll dough into a rough 10- by 10-inch square about a quarter inch thick.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Cut dough into 1 1/2-inch wide strips, then cut each strip into 1 1/2-inch squares.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Return broth to simmer over medium heat.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Add dumplings to broth, one at a time. Cover and simmer until dumplings have puffed slightly and are cooked through, stirring gently once or twice to make sure that they don't stick to each other. Return chicken to pot to heat through. Stir in 1/3 cup parsley leaves, lemon juice, nutmeg (if using), and serve.", u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Raymond Reserve Selection Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish.', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 286, u'instructions': u"Procedures                                                                              1                                                                            Place chicken, onions, garlic, peppercorns, parsley stems, and 1 1/2 teaspoons salt in large saucepan or Dutch oven. Add water to pot to just cover chicken (about 10 cups). Bring to boil over medium-high heat and then reduce heat to simmer. Cook until chicken is tender and falling off the bone, about 1 hour.                                                                                                                            2                                                                            While broth is simmering, make dumpling dough: In medium bowl, stir flour with 2 tablespoons butter, shortening, baking powder, and 1/2 teaspoon salt, mashing with fork until mixture resembles coarse wet crumbs. Stir in milk until it forms a dough. Let sit about 20 minutes.                                                                                                                            3                                                                            When cooked, transfer chicken to plate. Strain stock and return to saucepan. Simmer over medium-low heat until reduced to 6 cups. Skim fat from the top and season to taste with salt and ground pepper; keep warm. When chicken is cool enough to handle, remove meat from bones and shred into bite size pieces; reserve.                                                                                                                            4                                                                            On floured surface, roll dough into a rough 10- by 10-inch square about a quarter inch thick. Cut dough into 1 1/2-inch wide strips, then cut each strip into 1 1/2-inch squares.                                                                                                                             5                                                                            Return broth to simmer over medium heat. Add dumplings to broth, one at a time. Cover and simmer until dumplings have puffed slightly and are cooked through, stirring gently once or twice to make sure that they don't stick to each other. Return chicken to pot to heat through. Stir in 1/3 cup parsley leaves, lemon juice, nutmeg (if using), and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-and-slick-dumplings-201896', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}