{u'recipes': [{u'sourceName': u'Amuse Your Bouche', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/578454-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 578454, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegetarian sausage hotpot', u'diets': [u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 223.73, u'creditText': u'Amuse Your Bouche', u'extendedIngredients': [{u'originalString': u'Black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 carrots, diced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'150g sweetcorn', u'aisle': u'Produce', u'name': u'ear sweetcorn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 11167, u'unit': u'g'}, {u'originalString': u'\xbd tsp dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2042, u'unit': u'tsp'}, {u'originalString': u'6 vegetarian sausages (thawed), cut into chunks', u'aisle': u'Frozen', u'name': u'vegetarian sausages', u'metaInformation': [u'thawed', u'cut into chunks', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hotdogs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 98968, u'unit': u''}, {u'originalString': u'3 garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4tbsp Bisto gravy granules', u'aisle': u'Canned and Jarred', u'name': u'gravy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gravy.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 6997, u'unit': u'tbsp'}, {u'originalString': u'100g green beans, chopped', u'aisle': u'Produce', u'name': u'green beans', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 11052, u'unit': u'g'}, {u'originalString': u'1tbsp margarine or butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'margarine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4073, u'unit': u'tbsp'}, {u'originalString': u'150g mushrooms, diced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 11260, u'unit': u'g'}, {u'originalString': u'1tbsp oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'1 onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 parsnip, diced', u'aisle': u'Produce', u'name': u'parsnip', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'350g potatoes (I used new potatoes)', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'(I used new potatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}, {u'originalString': u'500ml vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.amuse-your-bouche.com/vegetarian-sausage-hotpot/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large pan (use an ovenproof one if you have one), and add the sausage chunks, onion and garlic. Cook over a medium heat for several minutes, before adding the carrots, parsnip, mushrooms, green beans and sweetcorn.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-beans-or-string-beans.jpg', u'id': 11052, u'name': u'green beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add plenty of black pepper, and continue to cook, stirring fairly often, for 5 more minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 190.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat the oven to 190C (Gas Mark 5 / 375F).', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mandoline-slicer.png', u'id': 404687, u'name': u'mandoline'}], u'step': u'Add the thyme, vegetable stock, soy sauce and Bisto granules to the vegetables, mix well, and bring to a simmer. Cook for a couple more minutes while you slice the potatoes thinly - use a mandoline if you have one.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6615, u'name': u'vegetable stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Remove the stew from the heat, stir well, and then add one layer of sliced potatoes, overlapping them slightly. Season with salt and pepper, and dot about half of the margarine across the potatoes.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [], u'step': u'Add the remaining potatoes, and once again, season and dot with margarine.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 4073, u'name': u'margarine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in the oven and cook, uncovered, for one hour, or until the potatoes are tender.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Hot Dogs works really well with Riesling, Gewurztraminer, and ros\xe9 Wine. A Gew\xfcrztraminer will be great with your basic New York style hot dog with mustard and sauerkraut. For a Chicago-style dog with sour pickles and hot peppers, you might opt for a crisp Riesling. No matter your toppings, a dry ros\xe9 almost always works. One wine you could try is Chateau Ste. Michelle Dry Riesling. It has 4.5 out of 5 stars and a bottle costs about 10 dollars.', u'pairedWines': [u'riesling', u'gewurztraminer', u'rose wine'], u'productMatches': [{u'description': u'The Chateau Ste. Michelle Dry Riesling is a dry, crisp, refreshing style of Riesling with beautiful fruit flavors, crisp acidity and an elegant finish. It offers inviting floral and mandarin aromas with a clean finish. This is an incredibly versatile food wine and my favorite with oysters.', u'title': u'Chateau Ste. Michelle Dry Riesling', u'price': u'$9.99', u'id': 443227, u'link': u'https://www.wine.com/product/chateau-ste-michelle-dry-riesling-2012/125428', u'imageUrl': u'https://spoonacular.com/productImages/443227-312x231.jpg'}]}, u'aggregateLikes': 321, u'instructions': u'Heat the oil in a large pan (use an ovenproof one if you have one), and add the sausage chunks, onion and garlic. Cook over a medium heat for several minutes, before adding the carrots, parsnip, mushrooms, green beans and sweetcorn. Add plenty of black pepper, and continue to cook, stirring fairly often, for 5 more minutes.Heat the oven to 190C (Gas Mark 5 / 375F).Add the thyme, vegetable stock, soy sauce and Bisto granules to the vegetables, mix well, and bring to a simmer. Cook for a couple more minutes while you slice the potatoes thinly - use a mandoline if you have one.Remove the stew from the heat, stir well, and then add one layer of sliced potatoes, overlapping them slightly. Season with salt and pepper, and dot about half of the margarine across the potatoes. Add the remaining potatoes, and once again, season and dot with margarine.Place in the oven and cook, uncovered, for one hour, or until the potatoes are tender.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetarian-sausage-hotpot-578454', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}