{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/408837-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 408837, u'veryPopular': True, u'lowFodmap': False, u'title': u'30-Minute Chicken Noodle Soup', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 111.36, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3/4 cup sliced carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'3/4 cup sliced celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 teaspoon reduced-sodium chicken bouillon granules', u'aisle': u'Canned and Jarred', u'name': u'chicken bouillon granules', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1006080, u'unit': u'teaspoon'}, {u'originalString': u'1 can (14-1/2 ounces) chicken broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'ounces'}, {u'originalString': u'1 can (10-3/4 ounces) condensed cream of chicken soup, undiluted', u'aisle': u'Canned and Jarred', u'name': u'condensed cream of chicken soup', u'metaInformation': [u'undiluted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'ounces'}, {u'originalString': u'1-1/2 cups cubed cooked chicken breast', u'aisle': u'Meat', u'name': u'cooked chicken breast', u'metaInformation': [u'cubed', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 5064, u'unit': u'cups'}, {u'originalString': u'1-1/2 teaspoons dried parsley flakes', u'aisle': u'Spices and Seasonings', u'name': u'dried parsley flakes', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2029, u'unit': u'teaspoons'}, {u'originalString': u'3 cups uncooked egg noodles', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20409, u'unit': u'cups'}, {u'originalString': u'1 small onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'4 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/30-minute-chicken-noodle-soup', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a Dutch oven, combine the first 10 ingredients. Bring to a boil. Reduce heat; cover and simmer for 10 minutes or until vegetables are crisp-tender. Stir in noodles; cook 5-7 minutes longer or until noodles and vegetables are tender.', u'length': {u'number': 17, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Lightly Oaked, the Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The good percentage of oak aging brings a lovely vanilla note. The Mindbender Chardonnay is here to make you see Chardonnay in a new and innovative way. The Mindbender Chardonnay is a sophisticated style of Chardonnay, that is full of the best elements of this classic grape varietal. Visually it is golden straw in color. The aromatics are complex and welcoming with floral and citrus tones mixed with hints of honeysuckle and butterscotch. The well-rounded flavors carry the butterscotch throughout lending a smooth, creamy aspect while the citrus flavors bring freshness and brightness to the body. The good percentage of oak aging brings a lovely vanilla note. The finish is rounded out with a depth of ripe fruit flavors such as apricots, melons and peaches with a spritz of lime.', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 2199, u'instructions': u'Directions                                                                                In a Dutch oven, combine the first 10 ingredients. Bring to a boil. Reduce heat; cover and simmer for 10 minutes or until vegetables are crisp-tender. Stir in noodles; cook 5-7 minutes longer or until noodles and vegetables are tender.                                        Yield: 6 servings (2-1/4 quarts).                                                                                                                         Originally published as 30-Minute Chicken Noodle Soup in  Taste of HomeFebruary/March 2010, p50                                                                                                                                                                                                        Nutritional Facts                                                                             1-1/2 cups equals 196 calories, 5 g fat (1 g saturated fat), 49 mg cholesterol, 759 mg sodium, 22 g carbohydrate, 2 g fiber, 15 g protein. Diabetic Exchanges: 2 lean meat, 1 starch, 1/2 fat.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/30-minute-chicken-noodle-soup-408837', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}