{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/516939-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 516939, u'veryPopular': True, u'lowFodmap': False, u'title': u'Boston Banana Cream Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 40, u'pricePerServing': 28.59, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'2 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'2 large bananas, cut into 1/4-inch slices', u'aisle': u'Produce', u'name': u'bananas', u'metaInformation': [u'large', u'cut into 1/4-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9040, u'unit': u''}, {u'originalString': u'2 Tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup granulated white sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2/3 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 cup powdered sugar (sifted)', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'sifted', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'dash of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'dash'}, {u'originalString': u'1/4 cup shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 4615, u'unit': u'cup'}, {u'originalString': u'1 ounce unsweetened chocolate, chopped', u'aisle': u'Baking', u'name': u'unsweetened chocolate', u'metaInformation': [u'unsweetened', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baking-chocolate.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 19078, u'unit': u'ounce'}, {u'originalString': u'1/4 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.recipegirl.com/2008/08/13/boston-banana-cream-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 350 degrees F.  Grease bottom of 9-inch round pan, and then line with round piece of parchment and spray with cooking spray.2.  In a large bowl, blend all cake ingredients until moist; beating 2 minutes on medium.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour batter into prepared pan and bake for 20 to 30 minutes until a toothpick comes out clean. Cool 5 minutes, then invert onto wire rack.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine sugar, flour and salt in a saucepan. Slowly stir in milk. Cook on medium; stirring constantly. Bring to a boil for 1 minute, then temper the egg by adding about 1/4 cup of the hot filling into the egg.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add another 1/4 cup of the hot filling, mixing well. If the egg mixture has warmed up, go ahead and add the egg mixture back into the hot pan; cook until bubbly, stirring constantly. (Be careful- if you add the egg without warming it up first, you'll end up with scrambled eggs in your cream filling!)", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in butter and vanilla. Cool, stirring occasionally.4.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Spread half of the filling onto the bottom layer of the cake. Arrange banana slices on the filling, taking care to put some near the edges so that they will be seen in a decorative way from the outside. Then cover bananas with remaining filling. Carefully top the filling with the second layer, cut side down.5.  For glaze: In a small saucepan, cook chocolate and butter on low heat until melted. Stir in sugar, vanilla, salt and milk for spreading consistency. Be sure not to leave it too thick or the chocolate layer will be thick and harden, making it difficult to slice the cake neatly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Spread on top of cake, letting some drizzle down sides. Refrigerate.', u'number': 5, u'ingredients': []}], u'name': u'Remove parchment carefully and cool completely. When cake is completely cooled, split cake carefully into two layers (horizontally) with a long, thin knife.3.  Meanwhile, make filling'}], u'winePairing': {u'pairingText': u"Banana Cream Pie can be paired with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Angel Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 426, u'instructions': u"1.  Preheat oven to 350 degrees F.  Grease bottom of 9-inch round pan, and then line with round piece of parchment and spray with cooking spray.2.  In a large bowl, blend all cake ingredients until moist; beating 2 minutes on medium. Pour batter into prepared pan and bake for 20 to 30 minutes until a toothpick comes out clean. Cool 5 minutes, then invert onto wire rack. Remove parchment carefully and cool completely. When cake is completely cooled, split cake carefully into two layers (horizontally) with a long, thin knife.3.  Meanwhile, make filling: Combine sugar, flour and salt in a saucepan. Slowly stir in milk. Cook on medium; stirring constantly. Bring to a boil for 1 minute, then temper the egg by adding about 1/4 cup of the hot filling into the egg. Add another 1/4 cup of the hot filling, mixing well. If the egg mixture has warmed up, go ahead and add the egg mixture back into the hot pan; cook until bubbly, stirring constantly. (Be careful- if you add the egg without warming it up first, you'll end up with scrambled eggs in your cream filling!) Remove from heat and stir in butter and vanilla. Cool, stirring occasionally.4.  Spread half of the filling onto the bottom layer of the cake. Arrange banana slices on the filling, taking care to put some near the edges so that they will be seen in a decorative way from the outside. Then cover bananas with remaining filling. Carefully top the filling with the second layer, cut side down.5.  For glaze: In a small saucepan, cook chocolate and butter on low heat until melted. Stir in sugar, vanilla, salt and milk for spreading consistency. Be sure not to leave it too thick or the chocolate layer will be thick and harden, making it difficult to slice the cake neatly. Spread on top of cake, letting some drizzle down sides. Refrigerate.", u'spoonacularSourceUrl': u'https://spoonacular.com/boston-banana-cream-pie-516939', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 85, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}