{u'recipes': [{u'sourceName': u'My Zucchini Recipes', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/630432-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 630432, u'veryPopular': False, u'lowFodmap': False, u'title': u'Zucchini - eggplant - mushroom lasagna', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 216.47, u'creditText': u'jeremyzkc', u'extendedIngredients': [{u'originalString': u'\xbd teaspoon basil', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2044, u'unit': u'teaspoon'}, {u'originalString': u'50 g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'100 g smoked cheese', u'aisle': u'Cheese', u'name': u'cheese', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1041009, u'unit': u'g'}, {u'originalString': u'1 large eggplant', u'aisle': u'Produce', u'name': u'eggplant', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'2 tablespoons flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'200 g lasagna noodles', u'aisle': u'Pasta and Rice', u'name': u'lasagna noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10620420, u'unit': u'g'}, {u'originalString': u'2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1 cup champignon mushroom', u'aisle': u'Produce', u'name': u'mushroom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2025, u'unit': u'servings'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 medium red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'3 tablespoons soured cream for brushing', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soured cream', u'metaInformation': [u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1056, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons tomato puree', u'aisle': u'Canned and Jarred', u'name': u'tomato puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11547, u'unit': u'tablespoons'}, {u'originalString': u'white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2032, u'unit': u'servings'}, {u'originalString': u'1 large zucchini', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://myzucchinirecipes.com/zucchini-eggplant-mushroom-lasagna/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Cut the washed zucchini and eggplant in thin slices. Simmer the chopped onion on hot olive oil, add the zucchini slices and the mushroom, stir it and cook for 3-4 minutes, then add the eggplant slices (add the eggplant when the zucchini is almost completely softened, because the eggplant softens very quickly). Season it with salt, pepper. Stir it well and add the other condiments and the crushed garlic.When its nearly done, add tomato puree and cook it for 3-4 minutes, then put aside.Prepare the bechamel sauce: melt the butter in a saucepan, when its melted add the flour and stir until is smooth. Cook 5 minutes, until the mixture turns light golden color. Stir in the milk, make sure you stir well, so the sauce doesnt have lumps. Cook 10 minutes, stirring continuously, season with salt, white pepper and nutmeg, then remove from heat.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11547, u'name': u'tomato puree'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'id': 2032, u'name': u'white pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Mix the sauce with the zucchini stew.Preheat the oven to 200C/ 390F.Put a layer of the stew in the bottom of a greased baking tray, then layer the noodles, brush the noodles with 1 tablespoon soured cream. Layer the stew, the noodles and the soured cream, repeat it. Top off with stew. Sprinkle the top with the grated cheese, make sure to cover the stew completely.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake it covered with foil for 30 minutes, then uncover for 10-12 minutes until the cheese is melted.', u'length': {u'number': 42, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Let it cool for 10 minutes before slicing.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Lasagne works really well with Montepulciano, Sangiovese, and Chianti. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. The Buccicatino Montepulciano d with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'plum , dark chocolate , rich', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'Cut the washed zucchini and eggplant in thin slices. Simmer the chopped onion on hot olive oil, add the zucchini slices and the mushroom, stir it and cook for 3-4 minutes, then add the eggplant slices (add the eggplant when the zucchini is almost completely softened, because the eggplant softens very quickly). Season it with salt, pepper. Stir it well and add the other condiments and the crushed garlic.When its nearly done, add tomato puree and cook it for 3-4 minutes, then put aside.Prepare the bechamel sauce: melt the butter in a saucepan, when its melted add the flour and stir until is smooth. Cook 5 minutes, until the mixture turns light golden color. Stir in the milk, make sure you stir well, so the sauce doesnt have lumps. Cook 10 minutes, stirring continuously, season with salt, white pepper and nutmeg, then remove from heat. Mix the sauce with the zucchini stew.Preheat the oven to 200C/ 390F.Put a layer of the stew in the bottom of a greased baking tray, then layer the noodles, brush the noodles with 1 tablespoon soured cream. Layer the stew, the noodles and the soured cream, repeat it. Top off with stew. Sprinkle the top with the grated cheese, make sure to cover the stew completely.Bake it covered with foil for 30 minutes, then uncover for 10-12 minutes until the cheese is melted.Let it cool for 10 minutes before slicing.', u'spoonacularSourceUrl': u'https://spoonacular.com/zucchini-eggplant-mushroom-lasagna-630432', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}