{u'recipes': [{u'sourceName': u'Casaveneracion', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522325-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 522325, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mango martini', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 249.41, u'creditText': u'Casaveneracion', u'extendedIngredients': [{u'originalString': u'1/4 oz. of lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'oz'}, {u'originalString': u'1 ripe mango', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9176, u'unit': u''}, {u'originalString': u'1 tbsp. of sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 oz. of Triple Sec', u'aisle': u'Alcoholic Beverages', u'name': u'triple sec', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-rum.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 14534, u'unit': u'oz'}, {u'originalString': u'1 oz. of vodka', u'aisle': u'Alcoholic Beverages', u'name': u'vodka', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vodka.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 14051, u'unit': u'oz'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://casaveneracion.com/mango-martini-wow/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the mango, remove the stone and discard the skin.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Cut the mango flesh into small pieces. Throw into the blender, add the rest of the ingredients and a few ice cubes. Process until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}, {u'equipment': [], u'step': u'Pour into a glass.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish with a maraschino cherry, if you like.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve very cold.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 604, u'instructions': u'InstructionsCut the mango, remove the stone and discard the skin. Cut the mango flesh into small pieces. Throw into the blender, add the rest of the ingredients and a few ice cubes. Process until smooth. Pour into a glass. Garnish with a maraschino cherry, if you like. Serve very cold.', u'spoonacularSourceUrl': u'https://spoonacular.com/mango-martini-522325', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}