{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/466559-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 466559, u'veryPopular': False, u'lowFodmap': False, u'title': u'Potluck Meatballs', u'diets': [u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 50.53, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (10-1/2 ounces) condensed beef consomme, undiluted', u'aisle': u'Canned and Jarred', u'name': u'beef consomme', u'metaInformation': [u'undiluted', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 6008, u'unit': u'ounces'}, {u'originalString': u'2/3 cup soft bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'1 egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 teaspoon ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1 pound ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'1/2 cup grated onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/potluck-meatballs', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine the first six ingredients; crumble beef over mixture and mix well. Shape into 1-1/4-in. balls. In a large skillet, brown meatballs in batches; drain.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer to a greased 1-1/2-qt. baking dish.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Combine cornstarch and consomme until smooth; add to skillet. Bring to a boil, stirring to loosen browned bits from pan. Boil for 2 minutes or until thickened.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [], u'step': u'Pour over the meatballs.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake, uncovered, at 350\xb0 for 35-40 minutes or until no longer pink.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 83, u'instructions': u'Directions                                                                                In a large bowl, combine the first six ingredients; crumble beef over mixture and mix well. Shape into 1-1/4-in. balls. In a large skillet, brown meatballs in batches; drain.                                                                                           Transfer to a greased 1-1/2-qt. baking dish. Combine cornstarch and consomme until smooth; add to skillet. Bring to a boil, stirring to loosen browned bits from pan. Boil for 2 minutes or until thickened.                                                                                           Pour over the meatballs. Bake, uncovered, at 350\xb0 for 35-40 minutes or until no longer pink.                                        Yield: 2-1/2 dozen.                                                                                                                         Originally published as Potluck Meatballs in  Taste of HomeDecember/January 1999, p33                                                                                                                                                                                                        Nutritional Facts                                                                             3 meatballs with sauce equals 117 calories, 6 g fat (2 g saturated fat), 53 mg cholesterol, 477 mg sodium, 4 g carbohydrate, trace fiber, 11 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/potluck-meatballs-466559', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}