{u'recipes': [{u'sourceName': u'Cuopon Clipping Cook', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/478899-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 478899, u'veryPopular': False, u'lowFodmap': False, u'title': u"Bailey's and Coffee White Chocolate Chip Cookies", u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 22.11, u'creditText': u'Cuopon Clipping Cook', u'extendedIngredients': [{u'originalString': u'\xbe teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3/4 cup butter (1-1/2 cubes butter) - softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened', u'(1-1/2 cubes butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1-2/3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2-1/2 tablespoons instant coffee granules', u'aisle': u'Tea and Coffee', u'name': u'instant coffee granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 14214, u'unit': u'tablespoons'}, {u'originalString': u"2 tablespoons Bailey's Irish Cream", u'aisle': u'Alcoholic Beverages', u'name': u'irish cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baileys-liqueur.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 93764, u'unit': u'tablespoons'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1-1/2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'1 package of white chocolate chips (12 ounce package)', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white', u'(12 ounce package)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10019087, u'unit': u'package'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://www.couponclippingcook.com/baileys-and-coffee-white-chocolate-chip-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 375 degrees F.  In a large bowl add the flour, baking powder, baking soda, instant coffee, and salt.  Stir ingredients together and set aside.  In a large mixing bowl, add the butter, brown sugar, sugar, and vanilla.  Beat until light and fluffy.  Beat in the egg, and add the Bailey’s Irish Cream.  Gradually beat in the flour mixture until all ingredients are incorporated.  Stir in the white chocolate chips.  Drop by rounded heaping tablespoons on to an ungreased cookie sheet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'id': 10019087, u'name': u'white chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 14214, u'name': u'instant coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baileys-liqueur.png', u'id': 93764, u'name': u'irish cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake in a preheated oven until just when the cookie starts to “fall” (no more than about 9 minutes).  As the cookie bakes it should rise just a bit, then it will start to fall.  This is right when the cookies should be removed from the oven.  Using a spatula, carefully transfer the cookies on to a cooling rack.  If the cookies are too soft to move at first, let them sit on the pan for just a minute before moving them.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool and serve.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 214, u'instructions': u'Preheat oven to 375 degrees F.  In a large bowl add the flour, baking powder, baking soda, instant coffee, and salt.  Stir ingredients together and set aside.  In a large mixing bowl, add the butter, brown sugar, sugar, and vanilla.  Beat until light and fluffy.  Beat in the egg, and add the Bailey’s Irish Cream.  Gradually beat in the flour mixture until all ingredients are incorporated.  Stir in the white chocolate chips.  Drop by rounded heaping tablespoons on to an ungreased cookie sheet.Bake in a preheated oven until just when the cookie starts to “fall” (no more than about 9 minutes).  As the cookie bakes it should rise just a bit, then it will start to fall.  This is right when the cookies should be removed from the oven.  Using a spatula, carefully transfer the cookies on to a cooling rack.  If the cookies are too soft to move at first, let them sit on the pan for just a minute before moving them.  Let cool and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/baileys-and-coffee-white-chocolate-chip-cookies-478899', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 34, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}