{u'recipes': [{u'sourceName': u"Can't Stay out of the Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/499988-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 499988, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ten Grain Nut Bread', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 20.44, u'creditText': u"Can't Stay out of the Kitchen", u'extendedIngredients': [{u'originalString': u'2 \xbd cups Gold Medal bread flour', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 10120129, u'unit': u'cups'}, {u'originalString': u'2 tbsp. honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u"\xbe cup Bob's Red Mill ten-grain cereal", u'aisle': u'Cereal', u'name': u'nutri grain cereal', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/all-bran-cereal.jpg.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1008029, u'unit': u'cup'}, {u'originalString': u'3 tbsp. powdered milk', u'aisle': u'Baking', u'name': u'powdered milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-powdered.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1090, u'unit': u'tbsp'}, {u'originalString': u'2 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'4 tsp. vital wheat gluten', u'aisle': u'Health Foods;Baking', u'name': u'vital wheat gluten', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'solid', u'id': 48052, u'unit': u'tsp'}, {u'originalString': u'2 tbsp. canola, coconut or walnut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'walnut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnut-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4528, u'unit': u'tbsp'}, {u'originalString': u'1 cup whole wheat flour', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20080, u'unit': u'cup'}, {u'originalString': u'1 \xbd tsp. yeast', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 18375, u'unit': u'tsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://cantstayoutofthekitchen.com/2014/05/13/ten-grain-nut-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bread-machine.jpg', u'id': 5607, u'name': u'bread machine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Layer ingredients into bread canister in order given.Set bread machine to whole wheat setting.This will take approximately 4 hours.Allow bread to rest 15 minutes before removing bread canister from oven.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Brush top and sides of bread with butter to prevent crusts from hardening.Allow bread to rest an additional 15 minutes before cutting into slices.Makes a 2-lb. loaf.About 14 large slices.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 160, u'instructions': u'Layer ingredients into bread canister in order given.Set bread machine to whole wheat setting.This will take approximately 4 hours.Allow bread to rest 15 minutes before removing bread canister from oven.Brush top and sides of bread with butter to prevent crusts from hardening.Allow bread to rest an additional 15 minutes before cutting into slices.Makes a 2-lb. loaf.About 14 large slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/ten-grain-nut-bread-499988', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 250, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}