{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/746028-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 746028, u'veryPopular': False, u'lowFodmap': False, u'title': u'Braised Chicken Thighs with Olives and Potatoes', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 1148.7, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 1/2 cups baby carrots', u'aisle': u'Produce', u'name': u'baby carrots', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11960, u'unit': u'cups'}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'2 teaspoons chopped fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon chopped fresh sage', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'tablespoon'}, {u'originalString': u'5 cloves garlic, sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 5.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 cup pitted green olives, plus 1/4 cup brine from the jar', u'aisle': u'Canned and Jarred', u'name': u'green olives', u'metaInformation': [u'green', u'pitted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-olives---sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1029195, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'8 small red-skinned new potatoes, quartered', u'aisle': u'Produce', u'name': u'red skinned potatoes', u'metaInformation': [u'small', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 10011355, u'unit': u''}, {u'originalString': u'8 6-ounce skin-on, bone-in chicken thighs', u'aisle': u'Ethnic Foods', u'name': u'tofu skin', u'metaInformation': [u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beancurd-sheets.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 48.0, u'consistency': u'solid', u'id': 98891, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'1/2 large white onion, sliced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 61.0, u'imageType': u'jpeg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/braised-chicken-thighs-with-olives-and-potatoes.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 45, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Season the chicken with 1/2 teaspoon salt and a few grinds of pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat a large Dutch oven or pot over high heat and add the olive oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the chicken, skin-side down, and cook until golden, 3 to 4 minutes per side.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove to a plate and set aside.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Reduce the heat to medium high.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the garlic and cook 1 minute. Stir in the onion, carrots, tomato paste, sage and rosemary. Cook, scraping up any browned bits from the bottom of the pot, until the vegetables are slightly softened, 3 to 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the wine, olives and their brine, and the potatoes to the pot. Nestle the chicken in the mixture. Bring to a boil, then add 2 cups water and return to a boil. Reduce the heat to medium low, cover and simmer until the chicken is cooked through and the potatoes are tender, about 20 minutes. Season with salt and pepper.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Photograph by Charles Masters', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken Thighs. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 258, u'instructions': u'Season the chicken with 1/2 teaspoon salt and a few grinds of pepper. Heat a large Dutch oven or pot over high heat and add the olive oil. Add the chicken, skin-side down, and cook until golden, 3 to 4 minutes per side. Remove to a plate and set aside.                          Reduce the heat to medium high. Add the garlic and cook 1 minute. Stir in the onion, carrots, tomato paste, sage and rosemary. Cook, scraping up any browned bits from the bottom of the pot, until the vegetables are slightly softened, 3 to 4 minutes.                          Add the wine, olives and their brine, and the potatoes to the pot. Nestle the chicken in the mixture. Bring to a boil, then add 2 cups water and return to a boil. Reduce the heat to medium low, cover and simmer until the chicken is cooked through and the potatoes are tender, about 20 minutes. Season with salt and pepper.                          Photograph by Charles Masters', u'spoonacularSourceUrl': u'https://spoonacular.com/braised-chicken-thighs-with-olives-and-potatoes-746028', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}