{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/445295-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 445295, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fresh Raspberry Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 110.5, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'7-1/2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 7.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1 pastry shell (9 inches), baked', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry shell', u'metaInformation': [u'(9 inches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pastry-shells.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10018337, u'unit': u''}, {u'originalString': u'4 cups fresh raspberries, divided', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'fresh', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cups'}, {u'originalString': u'3/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/3 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'Whipped cream, optional', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1054, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/fresh-raspberry-pie-4', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a small saucepan, crush 1 cup of berries.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add water; simmer for 3 minutes. Strain, reserving juice; discard pulp and seeds.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add enough water to juice to measure 1 cup liquid. In a large saucepan, combine the sugar, cornstarch and salt. Slowly stir in raspberry liquid. bring to a boil; cook and stir for 2 minutes or until thickened.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Remove from the heat; cool slightly.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Place remaining raspberries in pastry shell; pour glaze over top. Refrigerate for 2-3 hours or unto set.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}]}, {u'equipment': [], u'step': u'Serve with whipped cream if desired.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie works really well with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The McFadden Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Late Harvest and Botrytis-blessed, like Ch\xe2teau d'Yquem, this is a sublime experience. Honeyed apricot meets baked apple pie in a glass. Quite simply, this is the best dessert wine you will taste, even at double the price, in your lifetime.", u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'Directions                                                                                In a small saucepan, crush 1 cup of berries. Add water; simmer for 3 minutes. Strain, reserving juice; discard pulp and seeds. Add enough water to juice to measure 1 cup liquid. In a large saucepan, combine the sugar, cornstarch and salt. Slowly stir in raspberry liquid. bring to a boil; cook and stir for 2 minutes or until thickened. Remove from the heat; cool slightly.                                                                                           Place remaining raspberries in pastry shell; pour glaze over top. Refrigerate for 2-3 hours or unto set. Serve with whipped cream if desired.                                        Yield: 6-8 servings.                                                                                                                         Originally published as Fresh Raspberry Pie in  Quick CookingJuly/August 2002, p38                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 slice) equals 232 calories, 7 g fat (3 g saturated fat), 5 mg cholesterol, 119 mg sodium, 41 g carbohydrate, 4 g fiber, 2 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/fresh-raspberry-pie-445295', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}