{u'recipes': [{u'sourceName': u'The Pioneer Woman', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/603670-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 603670, u'veryPopular': True, u'lowFodmap': False, u'title': u'Oven Roasted BBQ Chicken Thighs', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 129.84, u'creditText': u'The Pioneer Woman', u'extendedIngredients': [{u'originalString': u'3 cups Your Favorite BBQ Sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cups'}, {u'originalString': u'12 whole Chicken Thighs, Bone-in, Skin-on', u'aisle': u'Meat', u'name': u'bone-in chicken thighs', u'metaInformation': [u'whole', u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1005091, u'unit': u''}, {u'originalString': u'1 clove Garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'Hot Sauce, Optional', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'Olive Oil For Brushing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for brushing'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1/2 cup Peach Preserves', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'peach preserves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-preserves.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11319297, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://thepioneerwoman.com/cooking/2014/06/oven-bbq-chicken/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Combine BBQ sauce, peach preserves, garlic, and hot sauce in a medium saucepan and heat over medium heat for 5-10 minutes, or until nice and hot. Set aside.PREHEAT OVEN TO 400 DEGREES.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-preserves.jpg', u'id': 11319297, u'name': u'peach preserves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Drizzle olive oil on 2 rimmed baking sheets and place chicken thighs skin side down in the pans. Roast for 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven briefly, brush sauce all over the thighs, then use a spatula to flip them over to the other side, being careful not to tear the skin.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Brush the tops with more sauce and return to the oven for 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven, brush on more sauce, and return to the oven for another 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven, brush on sauce, and turn up the temperature to 425 degrees. Continue roasting for another 5 to 7 minutes, or until the sauce is starting to brown around the edges and the thighs are totally cooked through.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and let sit for at least 10 minutes before serving. Delicious!', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 48280, u'instructions': u'Combine BBQ sauce, peach preserves, garlic, and hot sauce in a medium saucepan and heat over medium heat for 5-10 minutes, or until nice and hot. Set aside.PREHEAT OVEN TO 400 DEGREES.Drizzle olive oil on 2 rimmed baking sheets and place chicken thighs skin side down in the pans. Roast for 25 minutes. Remove from oven briefly, brush sauce all over the thighs, then use a spatula to flip them over to the other side, being careful not to tear the skin. Brush the tops with more sauce and return to the oven for 7 minutes. Remove from oven, brush on more sauce, and return to the oven for another 7 minutes. Remove from oven, brush on sauce, and turn up the temperature to 425 degrees. Continue roasting for another 5 to 7 minutes, or until the sauce is starting to brown around the edges and the thighs are totally cooked through. Remove from the oven and let sit for at least 10 minutes before serving. Delicious!', u'spoonacularSourceUrl': u'https://spoonacular.com/oven-roasted-bbq-chicken-thighs-603670', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}