{u'recipes': [{u'sourceName': u'Spice Up the Curry', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/619275-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 619275, u'veryPopular': False, u'lowFodmap': True, u'title': u'Gobi Paratha | How to make Punjabi gobi paratha', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'whole 30', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 18.24, u'creditText': u'Spice Up the Curry', u'extendedIngredients': [{u'originalString': u'Amchur powder - 1 teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'amchur', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/amchoor.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 98964, u'unit': u'teaspoon'}, {u'originalString': u'Coriander powder - 1 teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'coriander powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoon'}, {u'originalString': u'Cumin seeds - \xbd teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'Cilantro or coriander leaves - few sprigs, finely chopped', u'aisle': u'Spices and Seasonings', u'name': u'dried coriander leaves', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'sprig', u'unitShort': u'sprigs', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'sprigs'}, {u'originalString': u'Garam masala - \xbd teaspoon', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93663, u'unit': u'teaspoon'}, {u'originalString': u'Ginger paste or freshly grated ginger - 1 teaspoon', u'aisle': u'Ethnic Foods', u'name': u'ginger paste', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger-garlic-paste.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93754, u'unit': u'teaspoon'}, {u'originalString': u'Green chili - 1 small, finely chopped', u'aisle': u'Produce', u'name': u'green chili', u'metaInformation': [u'green', u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'Oil - 1 tablespoon + more for frying the parathas', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'Oil - 2 tablespoons', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'Red chili powder - 1 teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'red chili powder', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'Salt - to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Turmeric powder - \xbc teaspoon', u'aisle': u'Spices and Seasonings', u'name': u'turmeric powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'Water - little more than \xbd cup', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'Chapati atta (Whole wheat flour) - 1 \xbd cups', u'aisle': u'?', u'name': u'chapati atta', u'metaInformation': [u'whole wheat', u'( flour)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'unit': u'cups'}, {u'originalString': u'Gobi or cauliflower - 2 cups, grated finely', u'aisle': u'?', u'name': u'gobi', u'metaInformation': [u'grated', u'finely'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 4.0, u'sourceUrl': u'http://www.spiceupthecurry.com/gobi-paratha-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grater.jpg', u'id': 404631, u'name': u'grater'}], u'step': u'Grate cauliflower using grater or food processor very finely.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a pan on medium heat. Once hot add cumin seeds. Once they sizzle, add chopped chilies and ginger paste, fry for few seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger-garlic-paste.png', u'id': 93754, u'name': u'ginger paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 2014, u'name': u'cumin seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in grated gobi with some salt. Cook for few minutes.Then add all dry spices and mix. Cook till it dries out means no moisture in the mixture.Turn off the stove and lastly mix in chopped cilantro. Keep it aside to cool.Take atta, salt and oil in a bowl. Rub it with your fingertips. Then start adding little water at a time and knead the dough, it should be smooth and soft.Cover the dough and let it rest for 20 minutes.After 20 minutes, stuffing is cooled down, divide into 6 equal portions. Knead the dough once again and divide it into 6 balls and flatten it out.Dip one flatten disc into dry flour and roll into 4 inch diameter circle.Put one portion of stuffing in the center, Gather the edges and pinch it to seal it properly. Flatten it using your hand.Dip again into dry flour and roll into 6 inch diameter paratha.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the tawa or pan on medium heat. Once hot place the paratha and let it cook for few seconds, you will see few bubbles on top surface.Then flip, cook other side.Apply some oil + flip + cook by pressing.to cook other side, again apply some oil + flip + cook by pressing with spatula.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove it from the pan and repeat the same for rest of the parathas.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Gruener Veltliner, Sparkling ros\xe9, and Riesling are my top picks for Paratha. The best wine for Indian food will depending on the dish, of course, but these picks can be served chilled and have some sweetness to complement the spiciness and complex flavors of a wide variety of traditional dishes. The Laurenz V Singing Gruner Veltliner with a 4.4 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'gruener veltliner', u'sparkling rose', u'riesling'], u'productMatches': [{u'description': u'A very attractive fruit bouquet yields apple, peach and citrus aromas along with a typical Veltliner spiciness and a touch of white pepper. The soft and juicy palate is supported by fine acidity. It sings on the palate!', u'title': u'Laurenz V Singing Gruner Veltliner', u'price': u'$16.49', u'id': 434576, u'link': u'https://www.wine.com/product/laurenz-v-singing-gruner-veltliner-2007/99150', u'imageUrl': u'https://spoonacular.com/productImages/434576-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'Grate cauliflower using grater or food processor very finely.Heat the oil in a pan on medium heat. Once hot add cumin seeds. Once they sizzle, add chopped chilies and ginger paste, fry for few seconds.Mix in grated gobi with some salt. Cook for few minutes.Then add all dry spices and mix. Cook till it dries out means no moisture in the mixture.Turn off the stove and lastly mix in chopped cilantro. Keep it aside to cool.Take atta, salt and oil in a bowl. Rub it with your fingertips. Then start adding little water at a time and knead the dough, it should be smooth and soft.Cover the dough and let it rest for 20 minutes.After 20 minutes, stuffing is cooled down, divide into 6 equal portions. Knead the dough once again and divide it into 6 balls and flatten it out.Dip one flatten disc into dry flour and roll into 4 inch diameter circle.Put one portion of stuffing in the center, Gather the edges and pinch it to seal it properly. Flatten it using your hand.Dip again into dry flour and roll into 6 inch diameter paratha.Heat the tawa or pan on medium heat. Once hot place the paratha and let it cook for few seconds, you will see few bubbles on top surface.Then flip, cook other side.Apply some oil + flip + cook by pressing.to cook other side, again apply some oil + flip + cook by pressing with spatula.Remove it from the pan and repeat the same for rest of the parathas.', u'spoonacularSourceUrl': u'https://spoonacular.com/gobi-paratha-how-to-make-punjabi-gobi-paratha-619275', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}