{u'recipes': [{u'sourceName': u'Damn Delicious', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/615663-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 615663, u'veryPopular': True, u'lowFodmap': False, u'title': u'One Pan Enchilada Bake', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 231.29, u'creditText': u'Damn Delicious', u'extendedIngredients': [{u'originalString': u'1 (7.5-ounce) tube refrigerated buttermilk biscuits, cut into quarters', u'aisle': u'Refrigerated', u'name': u'buttermilk biscuits', u'metaInformation': [u'refrigerated', u'cut into quarters'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 7.5, u'consistency': u'solid', u'id': 18009, u'unit': u'ounce'}, {u'originalString': u'1 cup canned black beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16018, u'unit': u'cup'}, {u'originalString': u'1 cup corn kernels, frozen, canned or roasted', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [u'frozen', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11172, u'unit': u'cup'}, {u'originalString': u'1 cup Old El mild enchilada sauce', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'enchilada sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6599, u'unit': u'cup'}, {u'originalString': u'2 tablespoons chopped fresh cilantro leaves', u'aisle': u'Produce', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 pound ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'pound'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 cup shredded Mexican blend cheese', u'aisle': u'Cheese', u'name': u'shredded mexican cheese blend', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-mexican-cheese-blend.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1251, u'unit': u'cup'}, {u'originalString': u'2 teaspoons Old El taco seasoning mix', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2073, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'tomato sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://damndelicious.net/2014/10/06/one-pan-enchilada-bake/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil in a medium oven-proof skillet over medium high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add ground beef and cook until browned, about 3-5 minutes, making sure to crumble the beef as it cooks; drain excess fat and stir in taco seasoning. Stir in black beans, corn, enchilada sauce and tomato sauce. Stir in biscuits and top with cheese.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa.jpg', u'id': 6599, u'name': u'enchilada sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place into oven and bake until golden brown and bubbly, about 25-30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately, garnished with cilantro, if desired.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}]}], u'name': u''}], u'aggregateLikes': 1135, u'instructions': u'Preheat oven to 350 degrees F. Heat olive oil in a medium oven-proof skillet over medium high heat. Add ground beef and cook until browned, about 3-5 minutes, making sure to crumble the beef as it cooks; drain excess fat and stir in taco seasoning. Stir in black beans, corn, enchilada sauce and tomato sauce. Stir in biscuits and top with cheese. Place into oven and bake until golden brown and bubbly, about 25-30 minutes. Serve immediately, garnished with cilantro, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/one-pan-enchilada-bake-615663', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}