{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'jewish'], u'image': u'https://spoonacular.com/recipeImages/597693-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 597693, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Chrain', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 15, u'pricePerServing': 21.87, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'3 medium beets, unpeeled but scrubbed', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'medium', u'unpeeled', u'scrubbed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11080, u'unit': u''}, {u'originalString': u'2 tablespoons cider vinegar (or substitute balsamic vinegar)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [u'(or substitute balsamic vinegar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoons'}, {u'originalString': u'1 garlic clove, peeled (optional)', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 to 1 1/2 teaspoons granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'1-by-3-inch piece fresh horseradish, peeled and roughly chopped, or more to taste (may substitute prepared horseradish to taste)', u'aisle': u'Produce', u'name': u'horseradish', u'metaInformation': [u'fresh', u'prepared', u'peeled', u'roughly chopped', u'to taste', u'(may substitute horseradish )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002055, u'unit': u'inch'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 to 2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://leitesculinaria.com/85022/recipes-homemade-chrain.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the whole, unpeeled beets in a large saucepan and add enough water to cover. Bring to a boil and cook until tender, 30 to 45 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [], u'step': u'Drain the beets and rinse them under cold running water until they’re cool enough to handle. Using your fingertips, slip off the skins. Then coarsely chop the beets. (You should have about 4 cups, give or take a little.)2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Place the chopped beets along with the remaining ingredients in a food processor and process until the desired consistency. (Consider adding the smaller amount of salt and sugar for starters, then toss in more if desired.) Taste and adjust the amount of horseradish accordingly. Cover and refrigerate the chrain for up to 1 week.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'id': 1002055, u'name': u'horseradish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 173, u'instructions': u'1. Place the whole, unpeeled beets in a large saucepan and add enough water to cover. Bring to a boil and cook until tender, 30 to 45 minutes. Drain the beets and rinse them under cold running water until they’re cool enough to handle. Using your fingertips, slip off the skins. Then coarsely chop the beets. (You should have about 4 cups, give or take a little.)2. Place the chopped beets along with the remaining ingredients in a food processor and process until the desired consistency. (Consider adding the smaller amount of salt and sugar for starters, then toss in more if desired.) Taste and adjust the amount of horseradish accordingly. Cover and refrigerate the chrain for up to 1 week.', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-chrain-597693', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}