{u'recipes': [{u'sourceName': u'The View from Great Island', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/557464-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 557464, u'veryPopular': False, u'lowFodmap': False, u'title': u'Whole Grain Pasta with Pistachio Pesto', u'diets': [], u'pricePerServing': 333.68, u'creditText': u'The View from Great Island', u'extendedIngredients': [{u'originalString': u'1/4 cup extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'1 clove garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u"a tablespoon of lemon juice (don't overdo it)", u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u"(don't overdo it)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'zest of 1 large lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'1/3 cup grated good quality Parmesan cheese (Parmigiano Reggiano)', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'(Parmigiano Reggiano)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'parsley and chopped pistachios for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'1 fistful of fresh parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u''}, {u'originalString': u'as much fresh cracked black pepper as you can stand', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'fresh', u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'can'}, {u'originalString': u'1 cup roasted unsalted pistachio nuts (buy them in their shell, if possible)', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachio nuts', u'metaInformation': [u'unsalted', u'(buy them in their shell, if possible)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'a pinch of sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'6 oz whole grain pasta', u'aisle': u'Pasta and Rice', u'name': u'whole grain rice pasta', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-rice-vermicelli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 99038, u'unit': u'oz'}], u'healthScore': 41.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://theviewfromgreatisland.com/2013/07/whole-grain-pasta-with-pistachio-pesto.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put the first 6 items into the bowl of a food processor.  Pulse until the nuts are finely ground, but there is still some texture to them.Cook the pasta in lots of salted water until is is just al dente.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u"Drain it but don't drain every last drop of water off of the pasta, leave it dripping wet.  Reserve a little on the side)", u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u"Add the oil  to the pasta and toss well.  Grate in the zest of the lemon, and add a squeeze of the juice.  Toss the pasta with 3/4 cup of your pistachio pesto. (You will have some leftover for another batch of pasta, keep it covered in the refrigerator until needed)  If your pasta seems a bit too dry, add in a little extra oil or a little extra pasta water.  Don't overdo either.  Check the seasonings, if you cooked your pasta in nicely salted water it shouldn't need more.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}]}, {u'equipment': [], u'step': u'Serve immediately with some extra parsley and chopped pistachios as garnish.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 77, u'instructions': u"Put the first 6 items into the bowl of a food processor.  Pulse until the nuts are finely ground, but there is still some texture to them.Cook the pasta in lots of salted water until is is just al dente.Drain it but don't drain every last drop of water off of the pasta, leave it dripping wet.  Reserve a little on the side)  Add the oil  to the pasta and toss well.  Grate in the zest of the lemon, and add a squeeze of the juice.  Toss the pasta with 3/4 cup of your pistachio pesto. (You will have some leftover for another batch of pasta, keep it covered in the refrigerator until needed)  If your pasta seems a bit too dry, add in a little extra oil or a little extra pasta water.  Don't overdo either.  Check the seasonings, if you cooked your pasta in nicely salted water it shouldn't need more.Serve immediately with some extra parsley and chopped pistachios as garnish.", u'spoonacularSourceUrl': u'https://spoonacular.com/whole-grain-pasta-with-pistachio-pesto-557464', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}