{u'recipes': [{u'sourceName': u'Emily Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/570069-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 570069, u'veryPopular': True, u'lowFodmap': False, u'title': u'Mediterranean Chicken Wraps', u'diets': [u'gluten free'], u'pricePerServing': 204.82, u'creditText': u'Emily Bites', u'extendedIngredients': [{u'originalString': u'\xbd t dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2003, u'unit': u't'}, {u'originalString': u'1 T extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'T'}, {u'originalString': u'12 T crumbled Feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 12.0, u'consistency': u'solid', u'id': 1019, u'unit': u'T'}, {u'originalString': u'\xbd t fresh rosemary, minced', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2063, u'unit': u't'}, {u'originalString': u'12 T garlic hummus', u'aisle': u'Refrigerated', u'name': u'hummus', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 12.0, u'consistency': u'liquid', u'id': 16158, u'unit': u'T'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbd t oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u't'}, {u'originalString': u'1 large plum tomato, diced', u'aisle': u'Produce', u'name': u'plum tomato', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'1 lb raw boneless, skinless chicken breasts, sliced into thin strips', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'raw', u'boneless', u'skinless', u'sliced into thin strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'lb'}, {u'originalString': u"6 low carb, high fiber tortillas (I used La Tortilla Factory's Smart & Delicious Low Carb, High Fiber)", u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [u'low carb', u"(I used La Tortilla Factory's Smart & Delicious , High Fiber)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18364, u'unit': u''}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.emilybites.com/2012/04/mediterranean-chicken-wraps.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, bring the oil over medium high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the garlic, basil, oregano and rosemary and stir into oil. Cook for about a minute until garlic is fragrant.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the chicken to the pan and stir to coat chicken with the oil and herbs. Cook for 5-7 minutes until chicken is cooked completely through.Warm the tortillas slightly in the microwave for a minute or so to make them more pliable.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Spread 2 tablespoons of hummus across the center of each tortilla. Divide the chicken strips evenly amongst the tortillas (I weighed my chicken strips after cooking and they were a little over 12 oz total, so each wrap should get about 2 oz of chicken). Sprinkle 2 tablespoons of feta cheese over the chicken on each wrap and then follow with tomato pieces. Fold the ends of the tortilla in and then roll the sides over.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'id': 1015062, u'name': u'chicken tenders'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hummus.jpg', u'id': 16158, u'name': u'hummus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}, {u'equipment': [], u'step': u'Cut in half and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try Raymond Reserve Selection Chardonnay. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish. View More', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 5756, u'instructions': u'In a large skillet, bring the oil over medium high heat. Add the garlic, basil, oregano and rosemary and stir into oil. Cook for about a minute until garlic is fragrant. Add the chicken to the pan and stir to coat chicken with the oil and herbs. Cook for 5-7 minutes until chicken is cooked completely through.Warm the tortillas slightly in the microwave for a minute or so to make them more pliable. Spread 2 tablespoons of hummus across the center of each tortilla. Divide the chicken strips evenly amongst the tortillas (I weighed my chicken strips after cooking and they were a little over 12 oz total, so each wrap should get about 2 oz of chicken). Sprinkle 2 tablespoons of feta cheese over the chicken on each wrap and then follow with tomato pieces. Fold the ends of the tortilla in and then roll the sides over. Cut in half and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/mediterranean-chicken-wraps-570069', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}