{u'recipes': [{u'sourceName': u'Eat Live Travel Write', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/569299-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 569299, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spaghetti and from-scratch meatballs', u'diets': [], u'preparationMinutes': 120, u'pricePerServing': 173.03, u'creditText': u'Eat Live Travel Write', u'extendedIngredients': [{u'originalString': u'\xbc cup breadcrumbs', u'aisle': u'Pasta and Rice', u'name': u'breadcrumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'900 mls tomato sauce (I used a jar that I bought at Lailey Vineyards, but any high quality jarred sauce will do)', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'jarred', u'bought', u'(I used a jar that I at Lailey Vineyards, but any sauce will do)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'mls', u'unitShort': u'mls', u'amount': 900.0, u'consistency': u'solid', u'id': 11549, u'unit': u'mls'}, {u'originalString': u'2 tablespoons 35% cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'35%'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon dried minced garlic', u'aisle': u'Spices and Seasonings', u'name': u'dried garlic', u'metaInformation': [u'dried', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2020, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon chopped fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 tablespoon chopped fresh oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup freshly grated parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'500g pork shoulder, diced into 1" pieces', u'aisle': u'Meat', u'name': u'pork shoulder', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 10072, u'unit': u'g'}, {u'originalString': u'salt and pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 shallot', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.eatlivetravelwrite.com/2011/05/spaghetti-and-from-scratch-meatballs/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Mix the pork with the garlic, shallot, parsley, thyme and oregano. Cover and place in the refrigerator for a couple of hours, placing in the freezer for the last 30 minutes. Use the Kitchen Aid meat grinding attachment to grind the meat and herbs together. Now use the paddle attachment, add the wine to the minced meat and combine for about a minute.For the meatballs: Preheat the oven to 350F.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Add the breadcrumbs, cream and parmesan to the meat and combine well. Using your hands, form meatballs. This amount made 25 decent sized ones or about 50 smaller ones.Brown meatballs in a heavy skillet or frying pan in olive oil then place in an oven-proof dish. Cover with the tomato sauce. Cover the dish with foil and bake for 30-45 minutes (longer for the larger sized meatballs).', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve over cooked spaghetti or bucatini.', u'number': 3, u'ingredients': []}], u'name': u'For the pork'}], u'winePairing': {}, u'aggregateLikes': 52, u'instructions': u'For the pork: Mix the pork with the garlic, shallot, parsley, thyme and oregano. Cover and place in the refrigerator for a couple of hours, placing in the freezer for the last 30 minutes. Use the Kitchen Aid meat grinding attachment to grind the meat and herbs together. Now use the paddle attachment, add the wine to the minced meat and combine for about a minute.For the meatballs: Preheat the oven to 350F.Add the breadcrumbs, cream and parmesan to the meat and combine well. Using your hands, form meatballs. This amount made 25 decent sized ones or about 50 smaller ones.Brown meatballs in a heavy skillet or frying pan in olive oil then place in an oven-proof dish. Cover with the tomato sauce. Cover the dish with foil and bake for 30-45 minutes (longer for the larger sized meatballs). Serve over cooked spaghetti or bucatini.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-and-from-scratch-meatballs-569299', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 120, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}