{u'recipes': [{u'sourceName': u'Foodie Crush', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532388-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532388, u'veryPopular': True, u'lowFodmap': False, u'title': u'Roasted Tomato and Zucchini Frittata', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 134.94, u'creditText': u'Foodie Crush', u'extendedIngredients': [{u'originalString': u'1 teaspoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'teaspoon'}, {u'originalString': u'1 cup cherry tomatoes', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'cup'}, {u'originalString': u'8 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/4 cup half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'Kosher salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 teaspoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoon'}, {u'originalString': u'Drizzle olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'4 sprigs fresh oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 4.0, u'consistency': u'solid', u'id': 2027, u'unit': u'sprigs'}, {u'originalString': u'1 teaspoon fresh oregano leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1/4 plus 2 tablespoons grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u''}, {u'originalString': u'1 medium zucchini, sliced or 1 1/2 cups', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.foodiecrush.com/2012/09/roasted-tomato-and-zucchini-frittata-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Preheat oven to 400 degrees. On a small sheet pan topped with foil, add tomatoes and garlic and drizzle with olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Add salt and pepper and toss to coat. Sprinkle with oregano leaves and roast in oven for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove and set aside.In a medium bowl, whisk together eggs, half and half, 1/4 cup of parmesan and salt. In a 9-inch saucepan over medium high heat, melt butter with olive oil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add zucchini and a sprinkle of salt and saut\xe9 for 5 minutes or just until zucchini starts to lightly brown.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add egg mixture to saucepan and top egg with tomatoes and fresh oregano. As egg cooks, lift edges of egg from sides of pan and tilt so uncooked portion runs to the edges. Repeat process and cook for 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place pan in oven and bake for 5 minutes or until frittata has puffed and edges of egg have started to pull apart from the pan.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and garnish with additional parmesan and more fresh oregano if desired.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Cut into wedges and serve.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine are my top picks for Frittata. Even if you aren't making mimosas, sparkling wine is great with eggs for two reasons. One, if you're eating eggs early in the day, sparkling wine has less alcohol. Secondly, it cleanses the palate, which is important since yolk is known to coat the palate. You could try Mionetto Cuvee Sergio Prosecco. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'sparkling wine'], u'productMatches': [{u'description': u'A cuvee that successfully introduces emotions and the special unmistakable flavor of wine skillfully produced to enhance the characteristics of the native grape varieties of a unique area, at the foot of the Pre-alps of Veneto, where Mionetto has been based since 1887. These flavors and aromas have disappeared over the years but now Mionetto are reintroducing them in this excellent cuv\xe9e.A delicate pale yellow color, with a characteristic aroma that blends with hints of honey and crab apples. It is dry and pleasantly slightly bitter on the palate. Lean due to the right level of acidity, it is moderately full-bodied with a fine and intense perlage.A balanced, smooth and refreshing sparkling wine that is ideal for any occasion, thanks to its moderate alcohol content and versatility. It is best served with simple light fish or vegetable dishes. It is an excellent aperitif accompanied by savory tarts or more delicate finger food such as shrimp vol-au-vent.', u'title': u'Mionetto Cuvee Sergio Prosecco', u'price': u'$17.99', u'id': 454770, u'link': u'https://www.wine.com/product/mionetto-cuvee-sergio-prosecco/58520', u'imageUrl': u'https://spoonacular.com/productImages/454770-312x231.jpg'}]}, u'aggregateLikes': 1683, u'instructions': u'Preheat oven to 400 degrees. On a small sheet pan topped with foil, add tomatoes and garlic and drizzle with olive oil. Add salt and pepper and toss to coat. Sprinkle with oregano leaves and roast in oven for 15 minutes. Remove and set aside.In a medium bowl, whisk together eggs, half and half, 1/4 cup of parmesan and salt. In a 9-inch saucepan over medium high heat, melt butter with olive oil. Add zucchini and a sprinkle of salt and saut\xe9 for 5 minutes or just until zucchini starts to lightly brown. Add egg mixture to saucepan and top egg with tomatoes and fresh oregano. As egg cooks, lift edges of egg from sides of pan and tilt so uncooked portion runs to the edges. Repeat process and cook for 2-3 minutes. Place pan in oven and bake for 5 minutes or until frittata has puffed and edges of egg have started to pull apart from the pan. Remove from oven and garnish with additional parmesan and more fresh oregano if desired. Cut into wedges and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-tomato-and-zucchini-frittata-532388', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}