{u'recipes': [{u'sourceName': u'Simple Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/501990-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 501990, u'veryPopular': False, u'lowFodmap': False, u'title': u'Keeping warm with Roasted Red Pepper Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 129.52, u'creditText': u'Simple Bites', u'extendedIngredients': [{u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'Black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'4 tablespoons cream for garnish', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'tablespoons'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'I medium yellow onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'yellow', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 11282, u'unit': u'servings'}, {u'originalString': u'2 tablespoons parsley, minced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'4 red bell peppers', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/2 teaspoon salt (adjust depending on stock)', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'(adjust depending on stock)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.simplebites.net/keeping-warm-with-roasted-red-pepper-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Turn on your broiler. Lightly rub the red peppers with 2 tablespoons of the olive oil. Broil for 15 minutes until the skin starts to char and is completely wrinkled on the side closet to the heat. Flip and broil for an additional 10-15 minutes until charred and wrinkled. Set aside until the peppers are cool enough to handle, and then remove blackened skin, stem, and seeds by cutting into quarters.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add the olive oil to a large stockpot over medium-high heat. Once the oil is hot, add in the onion and saut\xe9 until soft, about 5 minutes. Stir in the garlic.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the chicken stock, parsley, bay leaves, and the salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}], u'step': u'Add in the peeled red peppers. Bring to a boil, reduce heat and cook, covered, for 15-20 minutes. Using an immersion blender, blend until smooth.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'id': 11821, u'name': u'red pepper'}]}, {u'equipment': [], u'step': u'Serve immediately with a swirl of cream.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 56, u'instructions': u'Turn on your broiler. Lightly rub the red peppers with 2 tablespoons of the olive oil. Broil for 15 minutes until the skin starts to char and is completely wrinkled on the side closet to the heat. Flip and broil for an additional 10-15 minutes until charred and wrinkled. Set aside until the peppers are cool enough to handle, and then remove blackened skin, stem, and seeds by cutting into quarters.Add the olive oil to a large stockpot over medium-high heat. Once the oil is hot, add in the onion and saut\xe9 until soft, about 5 minutes. Stir in the garlic.Add the chicken stock, parsley, bay leaves, and the salt and pepper. Add in the peeled red peppers. Bring to a boil, reduce heat and cook, covered, for 15-20 minutes. Using an immersion blender, blend until smooth. Serve immediately with a swirl of cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/keeping-warm-with-roasted-red-pepper-soup-501990', u'dishTypes': [u'side dish'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}