{u'recipes': [{u'sourceName': u'Home Cooking Adventure', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/550805-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 550805, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Sushi', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 659.61, u'creditText': u'Home Cooking Adventure', u'extendedIngredients': [{u'originalString': u'1 avocado, peeled and thinly sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 carrot, finely sliced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'3 tbsp cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1017, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup imitation crabmeat, finely chopped', u'aisle': u'Seafood', u'name': u'imitation crabmeat', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93735, u'unit': u'cup'}, {u'originalString': u'8 small nori-roasted seaweed sheets', u'aisle': u'Ethnic Foods', u'name': u'nori', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 8.0, u'consistency': u'liquid', u'id': 11446, u'unit': u'sheets'}, {u'originalString': u'2 tbsp rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tbsp'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'serving'}, {u'originalString': u'2 tbsp sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tbsp'}, {u'originalString': u'soy sauce, wasabi and pickled ginger to serve', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'serving'}, {u'originalString': u'2 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 1/2 cup Sushi rice', u'aisle': u'Pasta and Rice', u'name': u'sushi rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 10220054, u'unit': u'cup'}, {u'originalString': u'1 3/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 63.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.homecookingadventure.com/recipes/homemade-sushi', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 58, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash the rice and rinse thoroughly in cool water. Repeat process until water runs clear.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drain well.\xa0', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the rice in heavy medium pot with lid.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Add water and bring to a boil over high heat, reduce heat to low, cover and simmer 20 minutes or until water is absorbed. Do not\xa0lift lid during cooking.Meanwhile prepare the sushi vinegar by mixing rice vinegar with sugar and salt in \xa0a small saucepan. Cook on low heat until the sugar is dissolved. Set aside to cool.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Remove the rice from heat and let stand covered for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the rice in nonmetallic bowl, add rice vinegar and gently fold in to combine while rice is still hot.\xa0Allow to cool slightly before continuing with sushi recipes.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}]}, {u'equipment': [], u'step': u'Place a sheet of nori over a bamboo mat.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}]}, {u'equipment': [], u'step': u'Spread the sushi rice evenly over 2/3 of the sheets leaving 1 inch open towards you. Sprinkle sesame seeds over its surface.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 10220054, u'name': u'sushi rice'}]}, {u'equipment': [], u'step': u'Place\xa0cream cheese, imitation crab meat and avocado across the middle of the rice. (or simply carrots or other vegetables).', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crabmeat.jpg', u'id': 93735, u'name': u'imitation crab'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Roll the mat lightly by holding it with your thumbs and the ingredients with your fingers. Gently pull the mat as you go to create a firm roll. Continue rolling until all the\xa0rice is covered with the nori.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}]}, {u'equipment': [], u'step': u'Remove the mat, straighten both ends of the roll and slice into six to eight pieces. Arrange sushi on a serving platter and serve with soy sauce , pickled ginger and wasabi. Have fun!', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}]}], u'name': u''}], u'aggregateLikes': 115, u'instructions': u'Wash the rice and rinse thoroughly in cool water. Repeat process until water runs clear. Drain well.\xa0Place the rice in heavy medium pot with lid. Add water and bring to a boil over high heat, reduce heat to low, cover and simmer 20 minutes or until water is absorbed. Do not\xa0lift lid during cooking.Meanwhile prepare the sushi vinegar by mixing rice vinegar with sugar and salt in \xa0a small saucepan. Cook on low heat until the sugar is dissolved. Set aside to cool.Remove the rice from heat and let stand covered for 10 minutes. Place the rice in nonmetallic bowl, add rice vinegar and gently fold in to combine while rice is still hot.\xa0Allow to cool slightly before continuing with sushi recipes.Place a sheet of nori over a bamboo mat. Spread the sushi rice evenly over 2/3 of the sheets leaving 1 inch open towards you. Sprinkle sesame seeds over its surface. Place\xa0cream cheese, imitation crab meat and avocado across the middle of the rice. (or simply carrots or other vegetables).Roll the mat lightly by holding it with your thumbs and the ingredients with your fingers. Gently pull the mat as you go to create a firm roll. Continue rolling until all the\xa0rice is covered with the nori.Remove the mat, straighten both ends of the roll and slice into six to eight pieces. Arrange sushi on a serving platter and serve with soy sauce , pickled ginger and wasabi. Have fun!', u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-sushi-550805', u'dishTypes': [u'antipasti', u'lunch', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u"hor d'oeuvre", u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}