{u'recipes': [{u'sourceName': u'Shugary Sweets', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/605910-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 605910, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cherry Dump Salad', u'diets': [u'gluten free'], u'preparationMinutes': 125, u'pricePerServing': 117.27, u'creditText': u'Shugary Sweets', u'extendedIngredients': [{u'originalString': u"1 can (15oz) crushed pineapple (don't drain the juice)", u'aisle': u'Canned and Jarred', u'name': u'canned pineapple', u'metaInformation': [u'crushed', u'canned', u"(don't drain the juice)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'liquid', u'id': 9354, u'unit': u'oz'}, {u'originalString': u'1 can (21oz) Cherry Pie filling', u'aisle': u'Baking', u'name': u'cherry pie filling', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-pie-filling.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 21.0, u'consistency': u'solid', u'id': 19314, u'unit': u'oz'}, {u'originalString': u'12oz Cool Whip', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'1 can (14oz) sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'oz'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://www.shugarysweets.com/2014/07/cherry-dump-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Dump all ingredients into a large bowl.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Combine with a wooden spoon until ingredients are evenly blended. Cover and refrigerate 2 hours or more.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve and enjoy.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Gruener Veltliner, and Sauvignon Blanc are great choices for Salad. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. You could try Ghost Pines Sonoma County Napa County Monterey County Chardonnay. Reviewers quite like it with a 5 out of 5 star rating and a price of about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 1041, u'instructions': u'Dump all ingredients into a large bowl. Combine with a wooden spoon until ingredients are evenly blended. Cover and refrigerate 2 hours or more. Serve and enjoy.', u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-dump-salad-605910', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 125, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}