{u'recipes': [{u'sourceName': u'Averie Cooks', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520249-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 520249, u'veryPopular': True, u'lowFodmap': False, u'title': u'Soft and Chewy Brown Sugar Maple Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 26.65, u'creditText': u'Averie Cooks', u'extendedIngredients': [{u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1 cup bread flour (all-purpose flour may be substituted and used exclusively in place of bread flour)', u'aisle': u'Baking', u'name': u'bread flour', u'metaInformation': [u'all-purpose', u'( flour may be substituted and used exclusively in place of bread flour)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10120129, u'unit': u'cup'}, {u'originalString': u'2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'3/4 cup dark brown sugar, packed', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 cup light brown sugar, packed', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3/4+ teaspoon maple extract, added slowly in 1/2 teaspoon increments and to taste', u'aisle': u'Baking', u'name': u'maple extract', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.75, u'consistency': u'liquid', u'id': 12111111, u'unit': u''}, {u'originalString': u'1/2 teaspoon salt, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 cup (1 1/2 sticks) unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'(1 1/2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.averiecooks.com/2013/01/brown-sugar-maple-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To the bowl of a stand mixer fitted with the paddle attachment, beat the butter on low speed until smooth, 1 to 2 minutes.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-scale.jpg', u'id': 404705, u'name': u'kitchen scale'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the sugars and beat on medium-high speed until creamed and well-combined, about 3 minutes. Stop, scrape down the sides of the bowl, and add the egg, vanilla extract, maple extract to taste (start with 3/4 teaspoon and add more to taste; I used nearly 1 1/2 teaspoons and cookies are prominently maple-flavored) and beat on medium-high speed until light and fluffy, about 3 minutes. Stop, scrape down the sides of the bowl, and add the flours (solely using all-purpose flour will work, but the cookies will not be as chewy or rise as well because bread flour creates chewier results and gives greater rise), corn starch, baking soda, salt, and mix until just combined, about 1 minute.  Using a 2-ounce cookie scoop, form heaping mounds weighing 2 1/4-ounces each (weighed on a scale, which is approximately a scant 1/4-cup measure); or divide dough into 13 to 15 pieces ( made 13 cookies).', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 12111111, u'name': u'maple extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 10120129, u'name': u'bread flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Place dough mounds on a large plate, cover with plasticwrap, and refrigerate for at least 2 hours; up to 5 days. Do not bake these cookies with dough that has not been properly chilled because they will spread and they won't stay thick and puffy. Preheat oven to 350F, line a baking sheet with a Silpat Non-Stick Baking Mat, parchment, or spray with cooking spray.", u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place dough on the baking sheet, spaced at least 2 inches apart; I bake 6 or 7 cookies per sheet.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for 10 to 12 minutes, or until just barely golden brown around the edges, even if slightly undercooked in the center, noting the tops will not be as browned and will be paler. The cookies in the photos were baked for 10 and 1/2 minutes, with one tray in the oven at a time, and rotated halfway through baking.  Upon removing trays from oven, if cookies stayed very domed while baking (likely they will if dough was well-chilled) immediately give cookies a firm yet gentle tap or two with the back of a spoon to flatten them. This creates a crackled top appearance.  Allow cookies to cool on baking sheets for about 10 minutes before moving them to a rack to finish cooling. Store cookies in an airtight container at room temperature for up to  5 days, or in the freezer for up to 3 months. Alternatively, unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days or in the freezer for up to 3 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.  Recipe adapted from Chocolate Chip and Chunk Cookies', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Madeira, and Prosecco are great choices for Cookies. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 17421, u'instructions': u"To the bowl of a stand mixer fitted with the paddle attachment, beat the butter on low speed until smooth, 1 to 2 minutes. Add the sugars and beat on medium-high speed until creamed and well-combined, about 3 minutes. Stop, scrape down the sides of the bowl, and add the egg, vanilla extract, maple extract to taste (start with 3/4 teaspoon and add more to taste; I used nearly 1 1/2 teaspoons and cookies are prominently maple-flavored) and beat on medium-high speed until light and fluffy, about 3 minutes. Stop, scrape down the sides of the bowl, and add the flours (solely using all-purpose flour will work, but the cookies will not be as chewy or rise as well because bread flour creates chewier results and gives greater rise), corn starch, baking soda, salt, and mix until just combined, about 1 minute.  Using a 2-ounce cookie scoop, form heaping mounds weighing 2 1/4-ounces each (weighed on a scale, which is approximately a scant 1/4-cup measure); or divide dough into 13 to 15 pieces ( made 13 cookies). Place dough mounds on a large plate, cover with plasticwrap, and refrigerate for at least 2 hours; up to 5 days. Do not bake these cookies with dough that has not been properly chilled because they will spread and they won't stay thick and puffy. Preheat oven to 350F, line a baking sheet with a Silpat Non-Stick Baking Mat, parchment, or spray with cooking spray. Place dough on the baking sheet, spaced at least 2 inches apart; I bake 6 or 7 cookies per sheet. Bake for 10 to 12 minutes, or until just barely golden brown around the edges, even if slightly undercooked in the center, noting the tops will not be as browned and will be paler. The cookies in the photos were baked for 10 and 1/2 minutes, with one tray in the oven at a time, and rotated halfway through baking.  Upon removing trays from oven, if cookies stayed very domed while baking (likely they will if dough was well-chilled) immediately give cookies a firm yet gentle tap or two with the back of a spoon to flatten them. This creates a crackled top appearance.  Allow cookies to cool on baking sheets for about 10 minutes before moving them to a rack to finish cooling. Store cookies in an airtight container at room temperature for up to  5 days, or in the freezer for up to 3 months. Alternatively, unbaked cookie dough can be stored in an airtight container in the refrigerator for up to 5 days or in the freezer for up to 3 months, so consider baking only as many cookies as desired and save the remaining dough to be baked in the future when desired.  Recipe adapted from Chocolate Chip and Chunk Cookies", u'spoonacularSourceUrl': u'https://spoonacular.com/soft-and-chewy-brown-sugar-maple-cookies-520249', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 13, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}