{u'recipes': [{u'sourceName': u'Food.com', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/232733-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 232733, u'veryPopular': False, u'lowFodmap': False, u'title': u'Flourless Deep Dark Chocolate Cookies', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 19.91, u'creditText': u'Food.com', u'extendedIngredients': [{u'originalString': u'1 1/2 cups bittersweet chocolate chips, divided (about 9 ounces)', u'aisle': u'Baking', u'name': u'bittersweet chocolate chips', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'3 large egg whites, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 cups powdered sugar, divided (can also use granulated sugar)', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [u'divided', u'(can also use granulated sugar)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://www.food.com/recipe/flourless-deep-dark-chocolate-cookies-329345', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'1 Preheat oven to 400\xb0F Spray 2 large baking sheets with nonstick spray. Melt 1 cup chocolate chips in glass bowl in microwave, stirring twice, about 2 minutes. Cool slightly.2 Using electric mixer, beat whites in large bowl to soft peaks. Gradually beat in 1 cup sugar. Continue beating until mixture resembles soft marshmallow creme. 3', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk 1 cup sugar, cocoa, cornstarch, and salt in medium bowl to blend. On low speed, beat dry ingredients into meringue. Stir in lukewarm chocolate and 1/2 cup chocolate chips (dough will become very stiff).4', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Roll 1 rounded tablespoon dough into ball (can coat in additional sugar if you want).5', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place on prepared sheet. Repeat with remaining dough, spacing 2 inches apart.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u"Bake until puffed and tops crack, about 8-10 minutes (don't overbake!). Cool on sheets on rack 10 minutes.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer to rack; cool.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies can be paired with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 80, u'instructions': u"1 Preheat oven to 400\xb0F Spray 2 large baking sheets with nonstick spray. Melt 1 cup chocolate chips in glass bowl in microwave, stirring twice, about 2 minutes. Cool slightly.2 Using electric mixer, beat whites in large bowl to soft peaks. Gradually beat in 1 cup sugar. Continue beating until mixture resembles soft marshmallow creme. 3 Whisk 1 cup sugar, cocoa, cornstarch, and salt in medium bowl to blend. On low speed, beat dry ingredients into meringue. Stir in lukewarm chocolate and 1/2 cup chocolate chips (dough will become very stiff).4 Roll 1 rounded tablespoon dough into ball (can coat in additional sugar if you want).5 Place on prepared sheet. Repeat with remaining dough, spacing 2 inches apart. Bake until puffed and tops crack, about 8-10 minutes (don't overbake!). Cool on sheets on rack 10 minutes. Transfer to rack; cool.", u'spoonacularSourceUrl': u'https://spoonacular.com/flourless-deep-dark-chocolate-cookies-232733', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}