{u'recipes': [{u'sourceName': u'This Mama Cooks', u'cuisines': [u'mediterranean', u'european', u'french'], u'image': u'https://spoonacular.com/recipeImages/841335-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 841335, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Gluten Free Crepes with Rice Flour', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 55.13, u'creditText': u'This Mama Cooks', u'extendedIngredients': [{u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup milk or alternative milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 tablespoons orange flavored liqueur, orange juice, or sweetener', u'aisle': u'Alcoholic Beverages', u'name': u'pear liqueur', u'metaInformation': [u'orange flavored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 98988, u'unit': u'tablespoons'}, {u'originalString': u'1 cup white rice flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'rice flour', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20061, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon butter or buttery spread, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'soy buttery spread', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/light-buttery-spread.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 4673, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.thismamacooks.com/2017/01/easy-gluten-free-crepes-rice-flour-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Beat eggs in a medium-sized bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add milk and melted butter. Stir to combine.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add white rice flour and salt. Stir until thoroughly mixed and blend until smooth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a lightly greased, nonstick skillet over medium heat.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour 1/4 cup of batter into skillet and swirl to evenly distribute batter into a circle.Cook about 30 seconds per side until crepe begins to brown.Flip and cook on other side for 30 seconds until crepe begins to brown.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove crepe and keep warm in oven until served.Repeat until batter is used up.', u'number': 6, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u'Beat eggs in a medium-sized bowl. Add milk and melted butter. Stir to combine.Add white rice flour and salt. Stir until thoroughly mixed and blend until smooth.Heat a lightly greased, nonstick skillet over medium heat. Pour 1/4 cup of batter into skillet and swirl to evenly distribute batter into a circle.Cook about 30 seconds per side until crepe begins to brown.Flip and cook on other side for 30 seconds until crepe begins to brown. Remove crepe and keep warm in oven until served.Repeat until batter is used up.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-gluten-free-crepes-with-rice-flour-841335', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}