{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'cajun', u'creol'], u'image': u'https://spoonacular.com/recipeImages/464881-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 464881, u'veryPopular': False, u'lowFodmap': True, u'title': u'Bacon-Wrapped Cajun Jalapenos', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 20, u'pricePerServing': 26.93, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'8 thick-sliced peppered bacon strips', u'aisle': u'Meat', u'name': u'bacon strips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u''}, {u'originalString': u'1 teaspoon Cajun seasoning', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'cajun seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032028, u'unit': u'teaspoon'}, {u'originalString': u'1 package (3 ounces) cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'8 large jalapeno peppers', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno peppers', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1/2 cup finely shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/bacon-wrapped-cajun-jalapenos', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut jalapenos in half lengthwise; remove seeds and membranes. In a small bowl, combine the cream cheese, cheddar cheese and Cajun seasoning. Stuff about 1-1/2 teaspoons into each pepper half.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1032028, u'name': u'cajun seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut bacon strips in half widthwise. In a large skillet, cook bacon until partially cooked but not crisp. Wrap a bacon piece around each pepper; secure with a toothpick.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Place on a wire rack in a shallow baking pan.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake, uncovered, at 350\xb0 for 25-30 minutes or until bacon is crisp. Discard toothpicks.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cava, Grenache, and Shiraz are my top picks for Chili. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. One wine you could try is Juve Y Camps Brut Nature Reserva de la Familia Cava. It has 4.3 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale gold in color, this Cava has aromas of mature white peach, toasted bread and green tea with hints of lemon citrus and apricots. Equally rich and broad on the palate, these flavors continue to unfold on the palate.Its fresh profile makes it a perfect match for pate, seafood, tapas, paellas, grilled poultry or cured meats.', u'title': u'Juve Y Camps Brut Nature Reserva de la Familia Cava', u'price': u'$15.99', u'id': 433977, u'link': u'https://www.wine.com/product/juve-y-camps-brut-nature-reserva-de-la-familia-cava-2011/150306', u'imageUrl': u'https://spoonacular.com/productImages/433977-312x231.jpg'}]}, u'aggregateLikes': 257, u'instructions': u"Directions                                                                                Cut jalapenos in half lengthwise; remove seeds and membranes. In a small bowl, combine the cream cheese, cheddar cheese and Cajun seasoning. Stuff about 1-1/2 teaspoons into each pepper half.                                                                                           Cut bacon strips in half widthwise. In a large skillet, cook bacon until partially cooked but not crisp. Wrap a bacon piece around each pepper; secure with a toothpick.                                                                                            Place on a wire rack in a shallow baking pan. Bake, uncovered, at 350\xb0 for 25-30 minutes or until bacon is crisp. Discard toothpicks. Serve immediately.                                        Yield: 16 appetizers.                                                                                                     Editor's Note: Wear disposable gloves when cutting hot peppers; the oils can burn skin. Avoid touching your face.                                                                                                Originally published as Bacon-Wrapped Cajun Jalapenos in  Taste of HomeOctober/November 2006, p56                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 each) equals 58 calories, 5 g fat (3 g saturated fat), 15 mg cholesterol, 204 mg sodium, 1 g carbohydrate, trace fiber, 2 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-wrapped-cajun-jalapenos-464881', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}