{u'recipes': [{u'sourceName': u'Pineapple and Coconut', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/588795-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 588795, u'veryPopular': True, u'lowFodmap': False, u'title': u'Persimmon Pear Brandy Pie with Vanilla Bean Crumble #PieWeek', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 210.13, u'creditText': u'Pineapple and Coconut', u'extendedIngredients': [{u'originalString': u'3 tbsp arrowroot starch', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot starch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20003, u'unit': u'tbsp'}, {u'originalString': u'4 Bosc pears', u'aisle': u'Produce', u'name': u'bosc pears', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'\xbd c butter ( 4 ounces), very cold and cut into small pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'very cold', u'small', u'cut into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'ounces'}, {u'originalString': u'1 \xbd c all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'c'}, {u'originalString': u'4 Fuyu Persimmons', u'aisle': u'Produce', u'name': u'persimmons', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/persimmon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9265, u'unit': u''}, {u'originalString': u'\xbe c granulated sugar ( I use Zulka)', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'( I use Zulka)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'\xbd tsp ground all spice', u'aisle': u'Spices and Seasonings', u'name': u'ground all spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2001, u'unit': u'tsp'}, {u'originalString': u'1 tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'tsp'}, {u'originalString': u'1 9” pie crust (ready made or scratch made, unbaked)', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [u'(ready made or scratch made, unbaked)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'\xbc tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbd c sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'c'}, {u'originalString': u'2 vanilla beans', u'aisle': u'Baking', u'name': u'vanilla beans', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 93622, u'unit': u''}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 27.0, u'sourceUrl': u'http://www.pineappleandcoconut.com/recipes/persimmon-pear-brandy-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 Deg F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place pie pan on a large sheet of foil, so you can wrap the edges of the pie with the foil if they start to get too brown during baking.Prepare your pie crust if making from scratch.In a large bowl combine the sugar, starch and spices.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Mix to combine.Peel and slice the persimmons and pears in half.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/persimmon.jpg', u'id': 9265, u'name': u'persimmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'id': 9252, u'name': u'pear'}]}, {u'equipment': [], u'step': u'Remove cores, stems, seeds. Quarter and cut into thin slices.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add to the bowl with the sugar mix and stir to combine.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add in the vanilla extract and brandy and let sit 15 min to release juices from the fruit', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium bowl add the sugar. Scrape the seeds out of the two vanilla bean pods and add to the sugar. Rub the sugar and vanilla bean seeds between your fingers to evenly distribute, and it is very fragrant.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 93622, u'name': u'vanilla bean'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Add in the flour, salt and butter.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix the topping with your hands to distribute the butter until it forms medium sized crumbs, the size of a large pea.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the fruit mixture to the pie crust, pouring over any liquid left in the bowl over the fruit. Cover the pie with the crumble topping', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'id': 18334, u'name': u'pie crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake for 45 minutes or until the top starts to brown and some of the juices bubble out. If the top is getting too brown place a piece of foil over the top.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool completely before serving.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 439, u'instructions': u'Preheat oven to 400 Deg F. Place pie pan on a large sheet of foil, so you can wrap the edges of the pie with the foil if they start to get too brown during baking.Prepare your pie crust if making from scratch.In a large bowl combine the sugar, starch and spices. Mix to combine.Peel and slice the persimmons and pears in half. Remove cores, stems, seeds. Quarter and cut into thin slices. Add to the bowl with the sugar mix and stir to combine. Add in the vanilla extract and brandy and let sit 15 min to release juices from the fruitIn a medium bowl add the sugar. Scrape the seeds out of the two vanilla bean pods and add to the sugar. Rub the sugar and vanilla bean seeds between your fingers to evenly distribute, and it is very fragrant. Add in the flour, salt and butter. Mix the topping with your hands to distribute the butter until it forms medium sized crumbs, the size of a large pea.Add the fruit mixture to the pie crust, pouring over any liquid left in the bowl over the fruit. Cover the pie with the crumble toppingBake for 45 minutes or until the top starts to brown and some of the juices bubble out. If the top is getting too brown place a piece of foil over the top.Let cool completely before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/persimmon-pear-brandy-pie-with-vanilla-bean-crumble-pieweek-588795', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}