{u'recipes': [{u'sourceName': u'Mels Kitchen Caf\xe9', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/569169-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 569169, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oven Baked Chimichangas', u'diets': [], u'pricePerServing': 127.12, u'creditText': u'Mels Kitchen Caf\xe9', u'extendedIngredients': [{u'originalString': u'1 1/2 cups cooked brown or white rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [u'white', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20040, u'unit': u'cups'}, {u'originalString': u'6 large burrito-size flour tortillas', u'aisle': u'Ethnic Foods', u'name': u'burrito size tortillas', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10118364, u'unit': u''}, {u'originalString': u'1 (16-ounce) can black beans, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned black beans', u'metaInformation': [u'black', u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-beans.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16018, u'unit': u'ounce'}, {u'originalString': u'2-3 cups diced, cooked chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'cups'}, {u'originalString': u'1-2 teaspoons minced canned chipotle chiles in adobo sauce (use the lesser amount for less heat, greater amount for a bigger kick)', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chiles in adobo', u'metaInformation': [u'canned', u'minced', u'for less heat, greater amount for a bigger kick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup finely chopped fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 cup shredded cheddar or monterey jack cheese (or a combination of both)', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded', u'(or a combination of both)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'1 onion, chopped fine', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Salt and Pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup canola or vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4513, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.melskitchencafe.com/oven-baked-chimichangas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place a rimmed baking sheet in the oven and heat the oven to 450 degrees. While the oven is heating, in a large skillet, heat 2 tablespoons of the oil over medium heat until the oil is shimmering. Cook the onion until it is just softened, about 3 minutes. Stir in the beans, rice, chicken and chipotle and cook until the mixture is heated through, about 3 minutes. Off the heat, stir in the cheese and cilantro. Season with salt and pepper to taste (I used about 1/4 teaspoon each).Stack the tortillas on a plate and cover with a damp paper towel. Microwave the tortillas until they are warm and pliable, about 1 minute. Top each warm tortilla with some of the chicken mixture, leaving about a 2-inch border at the bottom of the tortilla. Fold in the sides and roll up the tortilla tightly.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/canned-chipotle-chili.jpg', u'id': 11632, u'name': u'chipotle chiles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Brush the wrapped tortillas with the remaining oil and arrange them seam side down on the hot baking sheet that has been preheating in the oven.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Bake until the chimis are golden brown and crisp, about 8 to 10 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chimichanga works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Parducci Small Lot Pinot Noir New Label Wine with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Our Pinot Noir offers aromas of Juicy, ripe raspberries and strawberries. Its berry flavors are full and rich on the palate, picking up a hint of cedar in the finish. Enjoy this medium bodied red wine with grilled salmon, pork tenderloin, and fine cuts of red meat.', u'title': u'Parducci Small Lot Pinot Noir New Label Wine', u'price': u'$18.0', u'id': 428202, u'link': u'https://www.amazon.com/Parducci-Small-Mendocino-County-Wine/dp/B01HQX6G8I', u'imageUrl': u'https://spoonacular.com/productImages/428202-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'Place a rimmed baking sheet in the oven and heat the oven to 450 degrees. While the oven is heating, in a large skillet, heat 2 tablespoons of the oil over medium heat until the oil is shimmering. Cook the onion until it is just softened, about 3 minutes. Stir in the beans, rice, chicken and chipotle and cook until the mixture is heated through, about 3 minutes. Off the heat, stir in the cheese and cilantro. Season with salt and pepper to taste (I used about 1/4 teaspoon each).Stack the tortillas on a plate and cover with a damp paper towel. Microwave the tortillas until they are warm and pliable, about 1 minute. Top each warm tortilla with some of the chicken mixture, leaving about a 2-inch border at the bottom of the tortilla. Fold in the sides and roll up the tortilla tightly. Brush the wrapped tortillas with the remaining oil and arrange them seam side down on the hot baking sheet that has been preheating in the oven. Bake until the chimis are golden brown and crisp, about 8 to 10 minutes. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/oven-baked-chimichangas-569169', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}