{u'recipes': [{u'sourceName': u'Gal on a Mission', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/527321-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 527321, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pepperoni Pizza Pull-Apart Bread', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 161.56, u'creditText': u'Gal on a Mission', u'extendedIngredients': [{u'originalString': u'1 large loaf of bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 18064, u'unit': u'loaf'}, {u'originalString': u'6 tablespoons butter, melte', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'3 teaspoons Italian seasoning + more to sprinkle on top', u'aisle': u'Spices and Seasonings', u'name': u'italian seasoning', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1022027, u'unit': u'teaspoons'}, {u'originalString': u'2 cups mozzarella cheese', u'aisle': u'Cheese', u'name': u'mozzarella cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1026, u'unit': u'cups'}, {u'originalString': u'40 pepperoni slices, sliced in half', u'aisle': u'Meat', u'name': u'pepperoni', u'metaInformation': [u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 40.0, u'consistency': u'solid', u'id': 7057, u'unit': u'slices'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 70.0, u'sourceUrl': u'http://www.galonamission.com/pepperoni-pizza-pull-apart-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees and line a baking sheet with aluminum foil. Needs to be enough foil to cover the loaf of bread, you might need to combine two sheets together.Slice the loaf of bread into a checkered board.*Stuff mozzarella cheese and the sliced pepperoni into each slice of the bread.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepperoni.png', u'id': 7057, u'name': u'pepperoni'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Mix together the melted butter and Italian seasoning.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Drizzle between the slices of the bread.Sprinkle extra Italian seasoning on top. (optional)Gently cover the bread with the hanging aluminum foil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Herbes-de-Provence.jpg', u'id': 1022027, u'name': u'italian seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Bake for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizzan on the menu? Try pairing with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Felsina Chianti Colli Senesi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 21 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Deep ruby with violet hues. A fruity bouquet of berries and brushwood is well integrated with light, pleasing spice. Round and mellow on the palate, with a delightful finish of red fruit and vanilla.', u'title': u'Felsina Chianti Colli Senesi', u'price': u'$20.99', u'id': 442678, u'link': u'https://www.wine.com/product/felsina-chianti-colli-senesi-2013/158752', u'imageUrl': u'https://spoonacular.com/productImages/442678-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Preheat oven to 400 degrees and line a baking sheet with aluminum foil. Needs to be enough foil to cover the loaf of bread, you might need to combine two sheets together.Slice the loaf of bread into a checkered board.*Stuff mozzarella cheese and the sliced pepperoni into each slice of the bread.Mix together the melted butter and Italian seasoning. Drizzle between the slices of the bread.Sprinkle extra Italian seasoning on top. (optional)Gently cover the bread with the hanging aluminum foil. Bake for 15 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/pepperoni-pizza-pull-apart-bread-527321', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}