{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/577648-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 577648, u'veryPopular': False, u'lowFodmap': False, u'title': u'Arugula Salad with Fresh Figs & Blue Cheese with a Lemon Vinaigrette', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 130.37, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'1 package of Baby Arugula', u'aisle': u'Produce', u'name': u'baby arugula', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 11959, u'unit': u'package'}, {u'originalString': u'1/2 teaspoon freshly ground Black Pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons Blue Cheese, crumbled', u'aisle': u'Cheese', u'name': u'blue cheese', u'metaInformation': [u'blue', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1004, u'unit': u'tablespoons'}, {u'originalString': u'6-8 fresh Figs, quartered', u'aisle': u'Dried Fruits;Produce', u'name': u'fresh figs', u'metaInformation': [u'fresh', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-fresh.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 9089, u'unit': u''}, {u'originalString': u'1/2 teaspoon Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoon fresh Lemon Juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'6 teaspoons Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'4 ounces of Walnuts, toasted until fragrant', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 12155, u'unit': u'ounces'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.simplyscratch.com/2010/10/fresh-fig-arugula-salad-with-a-lemon-vinaigrette.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the arugula, figs and toasted walnuts in a large bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/arugula-or-rocket-salad.jpg', u'id': 11959, u'name': u'arugula'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/figs-fresh.jpg', u'id': 9089, u'name': u'figs'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Combine the lemon juice, salt and pepper and whisk in the olive oil. Taste to adjust seasonings. Plate salad and drizzle with vinaigrette. Sprinkle with blue cheese and serve!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'id': 1004, u'name': u'blue cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}], u'name': u''}], u'aggregateLikes': 33, u'instructions': u'Combine the arugula, figs and toasted walnuts in a large bowl.Combine the lemon juice, salt and pepper and whisk in the olive oil. Taste to adjust seasonings. Plate salad and drizzle with vinaigrette. Sprinkle with blue cheese and serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/arugula-salad-with-fresh-figs-blue-cheese-with-a-lemon-vinaigrette-577648', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}