{u'recipes': [{u'sourceName': u'Oh My Veggies', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/495584-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 495584, u'veryPopular': True, u'lowFodmap': False, u'title': u'Grilled Peaches + Peaches and Cream Popsicles', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 109.74, u'creditText': u'Oh My Veggies', u'extendedIngredients': [{u'originalString': u'1 teaspoon agave nectar or honey', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'agave nectar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19912, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 tbsp. granulated sugar (you may want to use more if the peaches are tart)', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'(you may want to use more if the peaches are tart)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1/4 c. milk (I use soymilk)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(I use soymilk)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'c'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'3 grilled peach halves', u'aisle': u'Produce', u'name': u'peach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'4 peaches, halved and pitted', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'pitted', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 9236, u'unit': u''}, {u'originalString': u'1/2 tbsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tbsp'}, {u'originalString': u'1 vanilla pudding cup (I use ZenSoy)', u'aisle': u'Baking', u'name': u'vanilla pudding mix', u'metaInformation': [u'(I use ZenSoy)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19206, u'unit': u''}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://ohmyveggies.com/recipe-grilled-peaches-peaches-and-cream-popsicles/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Combine olive oil and agave nectar or honey; brush over cut sides of peaches. Arrange peaches, cut side down, on a grill rack coated with cooking spray. Cook until caramelized.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19912, u'name': u'agave'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u"Remove from grill and top with fresh herbs, ice cream, granola, or anything else you like. Reserve 3 peach halves for popsicles, if you're making them.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'id': 9236, u'name': u'peach'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine ingredients in a blender and blend until smooth.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-molds.jpg', u'id': 405929, u'name': u'popsicle molds'}], u'step': u'Pour into popsicle molds and freeze until solid (approximately 10 minutes in the Zoku--is it just me, or do the freezing times take longer in there than the directions say?).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 431, u'instructions': u"Combine olive oil and agave nectar or honey; brush over cut sides of peaches. Arrange peaches, cut side down, on a grill rack coated with cooking spray. Cook until caramelized.Remove from grill and top with fresh herbs, ice cream, granola, or anything else you like. Reserve 3 peach halves for popsicles, if you're making them.Combine ingredients in a blender and blend until smooth. Pour into popsicle molds and freeze until solid (approximately 10 minutes in the Zoku--is it just me, or do the freezing times take longer in there than the directions say?).", u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-peaches-+-peaches-and-cream-popsicles-495584', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}