{u'recipes': [{u'sourceName': u'Weary Chef', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/793962-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 793962, u'veryPopular': False, u'lowFodmap': False, u'title': u'Hawaiian Pasta Salad', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 100.47, u'creditText': u'Weary Chef', u'extendedIngredients': [{u'originalString': u'6 ounces deli-sliced ham, chopped', u'aisle': u'Meat', u'name': u'deli ham', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10010151, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons sliced chives, (OK to substitute green onions or dried chives)', u'aisle': u'Spices and Seasonings', u'name': u'dried chives', u'metaInformation': [u'dried', u'sliced', u'(OK to substitute green onions or chives)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chives-dried.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11615, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup reduced-fat mayonnaise', u'aisle': u'Condiments', u'name': u'low fat mayonnaise', u'metaInformation': [u'reduced-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4641, u'unit': u'cup'}, {u'originalString': u'11 ounces canned mandarin orange slices (in light syrup), drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'mandarin orange', u'metaInformation': [u'light', u'canned', u'drained', u'(in syrup)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 9218, u'unit': u'ounces'}, {u'originalString': u'12 ounces uncooked pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 20420, u'unit': u'ounces'}, {u'originalString': u'20 ounces canned pineapple chunks or tidbits (in juice), drained', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'canned', u'drained', u'(in juice)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 1029354, u'unit': u'ounces'}, {u'originalString': u'1/2 cup teriyaki sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'teriyaki sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6112, u'unit': u'cup'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://wearychef.com/hawaiian-pasta-salad/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a large pot of lightly salted water to a boil. Cook pasta according to package directions.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain and rinse with cold water.Meanwhile, in a large bowl stir together teriyaki sauce and mayo. Stir in chives, oranges, pineapple, and ham.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6112, u'name': u'teriyaki sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [], u'step': u'Add cooked pasta, and stir until well coated.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately or store in refrigerator until ready to serve. Best if eaten within 48 hours.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 22, u'instructions': u'Heat a large pot of lightly salted water to a boil. Cook pasta according to package directions. Drain and rinse with cold water.Meanwhile, in a large bowl stir together teriyaki sauce and mayo. Stir in chives, oranges, pineapple, and ham.Add cooked pasta, and stir until well coated. Serve immediately or store in refrigerator until ready to serve. Best if eaten within 48 hours.', u'spoonacularSourceUrl': u'https://spoonacular.com/hawaiian-pasta-salad-793962', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}