{u'recipes': [{u'sourceName': u'My Life as a Mrs', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/498666-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 498666, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coconut Plantain Crusted Fish', u'diets': [u'dairy free', u'pescatarian'], u'pricePerServing': 229.83, u'creditText': u'My Life as a Mrs', u'extendedIngredients': [{u'originalString': u'1/4 cup packed cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1 cup of shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'2 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Mango Kiwi Salsa', u'aisle': u'Produce', u'name': u'kiwi', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9148, u'unit': u'servings'}, {u'originalString': u'1/2-2/3 cup key lime juice (depending on how tangy you like things)', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'(depending on how tangy you like things)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'1 1/2 cups mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 green plantains, peeled and shredded', u'aisle': u'Produce', u'name': u'plantains', u'metaInformation': [u'shredded', u'green', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plantains.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9277, u'unit': u''}, {u'originalString': u'Coconut Rice', u'aisle': u'Pasta and Rice', u'name': u'rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 20444, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'4 - 6 ounce filets of tilapia (or other white flaky fish)', u'aisle': u'Seafood', u'name': u'tilapia', u'metaInformation': [u'white', u'(or other flaky fish)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-tilapia.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 15261, u'unit': u'ounce'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.mylifeasamrs.com/2011/08/coconut-plantain-crusted-fish.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [], u'name': u'For the Garlic Key Lime Dressing'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Mix the shredded plantains and coconut together in a dish and set aside. Next season the flour with salt and pepper in a shallow baking dish. In a third baking dish, place the beaten eggs. Set up an "assembly line" Fish, flour mixture, egg wash, and then the coconut plantain mixture.Preheat oven to 375\xb0. In an oven-safe skillet over medium heat, heat enough canola oil (2 tablespoons or so) to coat the bottom of pan (I used my beloved cast iron). Dredge the fish into the flour mixture (being sure to thoroughly coat it) and shake off excess. Next, dunk into the egg wash. Last, place a thin layer (about 1/4") of the coconut plantain mixture into the hot pan, trying to match the size of the fish filet as best as possible.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plantains.jpg', u'id': 9277, u'name': u'plantain'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place dredged and egg washed fish on top of the coconut plantain "bed". Cook for 4 minutes, lift fish with a spatula. While holding fish with the spatula, add another thin layer of the coconut plantain mixture to the pan (again matching the size of your fish filet). Carefully flip the fish onto the new "bed" of coconut plantain mixture.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plantains.jpg', u'id': 9277, u'name': u'plantain'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place entire skillet into the oven and allow to finish cooking (about 4-7 minutes).', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and serve over a bed of coconut rice, drizzle with key lime dressing and top with mango kiwi salsa. Prepare to faint. SO good!', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kiwis.jpg', u'id': 9148, u'name': u'kiwi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'id': 20444, u'name': u'rice'}]}], u'name': u'Add all ingredients to a food processor and pulse until combined. Refrigerate until ready to use.For the Fish'}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Proverb Pinot Grigio Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 13 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Luminous pear and apple notes animated with aromas of lime and lemon.', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 259, u'instructions': u'For the Garlic Key Lime Dressing:Add all ingredients to a food processor and pulse until combined. Refrigerate until ready to use.For the Fish:Mix the shredded plantains and coconut together in a dish and set aside. Next season the flour with salt and pepper in a shallow baking dish. In a third baking dish, place the beaten eggs. Set up an "assembly line" Fish, flour mixture, egg wash, and then the coconut plantain mixture.Preheat oven to 375\xb0. In an oven-safe skillet over medium heat, heat enough canola oil (2 tablespoons or so) to coat the bottom of pan (I used my beloved cast iron). Dredge the fish into the flour mixture (being sure to thoroughly coat it) and shake off excess. Next, dunk into the egg wash. Last, place a thin layer (about 1/4") of the coconut plantain mixture into the hot pan, trying to match the size of the fish filet as best as possible. Place dredged and egg washed fish on top of the coconut plantain "bed". Cook for 4 minutes, lift fish with a spatula. While holding fish with the spatula, add another thin layer of the coconut plantain mixture to the pan (again matching the size of your fish filet). Carefully flip the fish onto the new "bed" of coconut plantain mixture. Place entire skillet into the oven and allow to finish cooking (about 4-7 minutes).  Remove from oven and serve over a bed of coconut rice, drizzle with key lime dressing and top with mango kiwi salsa. Prepare to faint. SO good!', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-plantain-crusted-fish-498666', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}