{u'recipes': [{u'sourceName': u'Spice Up the Curry', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/600700-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 600700, u'veryPopular': False, u'lowFodmap': False, u'title': u'Punjabi Samosa', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 45.81, u'creditText': u'Spice Up the Curry', u'extendedIngredients': [{u'originalString': u'All purpose flour (Maida) – 1 cup', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [u'(Maida)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'Cashew nuts – 12, chopped', u'aisle': u'Nuts;Savory Snacks', u'name': u'cashew nuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 12087, u'unit': u''}, {u'originalString': u'Ginger paste – \xbd teaspoon', u'aisle': u'Ethnic Foods', u'name': u'ginger paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger-garlic-paste.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93754, u'unit': u'teaspoon'}, {u'originalString': u'Green chili – 2, finely chopped', u'aisle': u'Produce', u'name': u'green chili', u'metaInformation': [u'green', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'Green peas – 1 cup', u'aisle': u'Produce', u'name': u'green peas', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11304, u'unit': u'cup'}, {u'originalString': u'Lemon juice – half of lemon or 1 tablespoon', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tablespoon'}, {u'originalString': u'Oil – 1 tablespoon', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'Oil – 2 tablespoons', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'Onions – \xbd cup or \xbd medium, finely chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Paneer – \xbd cup, grated', u'aisle': u'Cheese;Ethnic Foods', u'name': u'paneer', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 98847, u'unit': u'cup'}, {u'originalString': u'Potatoes – 2 medium or 1 cup, boiled and mashed', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'boiled', u'medium', u'mashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'Salt – to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Sugar – 1 teaspoon', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'Water – \xbc cup minus 1 teaspoon', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'teaspoon'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://www.spiceupthecurry.com/punjabi-samosa/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Take green peas in microwave safe bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'green peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Add a tablespoon of water, pinch of salt. Cook them in microwave for 2 minutes (depends on your microwave) if using frozen green peas. Cook them in microwave for 5 minutes (depends on your microwave) if using fresh green peas. Mean while prepare other stuff.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'green peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a tablespoon of oil in a pan on medium heat.Once hot add onions and saut\xe9 them till they become light brown.Then add all the ingredients in the manner shown in ingredients list.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix well.Lower the heat and cook it for 4 minutes. Stir in between.Turn off the heat and let it cool and divide into 12 equal portions. Mean while prepare dough for pastry shell.Take all purpose flour and salt in a bowl.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Mix well.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add oil and rub with your finger till oil incorporated with flours and make crumbly texture.Then slowly add water and knead into smooth dough. Do not add all the water at a time.Apply some oil on the dough ball and cover it. Keep it side for 15 minutes by the time stuffing will also become cool enough.Divide the dough into 12 equal portions.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Roll each portion between your palm and press into a circle.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Roll it gently in to circle about 6 inch in diameter. (Do not use any dry flour. If dough is sticking the use some oil.)', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut into two equal parts using knife as shown below. Now apply some water on the straight edge and make a cone shape by joining that edge slightly overlapping. Press little bit on that join and make it sealed.Fill in the stuffing and apply some water on the outer edge and seal it properly. Repeat the same process until finished.When you are about to finish the preparing samosa then heat the oil in pan for deep frying on medium heat.Once hot add few samosa at a time ad deep fry till golden brown. Fry samosa on medium-low flame otherwise pastry shell won’t cook properly.Fry all the samosa in batches and drain them out o paper towel to absorb excess oil.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve hot', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling ros\xe9 and Sparkling Wine are my top picks for Samosa. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 26, u'instructions': u'Take green peas in microwave safe bowl. Add a tablespoon of water, pinch of salt. Cook them in microwave for 2 minutes (depends on your microwave) if using frozen green peas. Cook them in microwave for 5 minutes (depends on your microwave) if using fresh green peas. Mean while prepare other stuff.Heat a tablespoon of oil in a pan on medium heat.Once hot add onions and saut\xe9 them till they become light brown.Then add all the ingredients in the manner shown in ingredients list. Mix well.Lower the heat and cook it for 4 minutes. Stir in between.Turn off the heat and let it cool and divide into 12 equal portions. Mean while prepare dough for pastry shell.Take all purpose flour and salt in a bowl. Mix well.Add oil and rub with your finger till oil incorporated with flours and make crumbly texture.Then slowly add water and knead into smooth dough. Do not add all the water at a time.Apply some oil on the dough ball and cover it. Keep it side for 15 minutes by the time stuffing will also become cool enough.Divide the dough into 12 equal portions. Roll each portion between your palm and press into a circle.Roll it gently in to circle about 6 inch in diameter. (Do not use any dry flour. If dough is sticking the use some oil.)Cut into two equal parts using knife as shown below. Now apply some water on the straight edge and make a cone shape by joining that edge slightly overlapping. Press little bit on that join and make it sealed.Fill in the stuffing and apply some water on the outer edge and seal it properly. Repeat the same process until finished.When you are about to finish the preparing samosa then heat the oil in pan for deep frying on medium heat.Once hot add few samosa at a time ad deep fry till golden brown. Fry samosa on medium-low flame otherwise pastry shell won’t cook properly.Fry all the samosa in batches and drain them out o paper towel to absorb excess oil.Serve hot', u'spoonacularSourceUrl': u'https://spoonacular.com/punjabi-samosa-600700', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}