{u'recipes': [{u'sourceName': u'Everyday Maven', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/589613-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 589613, u'veryPopular': True, u'lowFodmap': False, u'title': u'Turkey Tomatillo + Pinto Bean Soup with Corn', u'diets': [u'gluten free'], u'preparationMinutes': 10, u'pricePerServing': 138.48, u'creditText': u'Everyday Maven', u'extendedIngredients': [{u'originalString': u'1/2 tablespoon ancho chili powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'ancho chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022009, u'unit': u'tablespoon'}, {u'originalString': u'4 cups broth', u'aisle': u'Canned and Jarred', u'name': u'broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cups'}, {u'originalString': u'4 cups water or bean broth', u'aisle': u'Canned and Jarred', u'name': u'broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cups'}, {u'originalString': u'2 celery stalks', u'aisle': u'Produce', u'name': u'celery stalks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'12 ounces (3/4 pound) chopped or shredded turkey or chicken breast', u'aisle': u'Meat', u'name': u'chicken breast', u'metaInformation': [u'shredded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 5062, u'unit': u'pound'}, {u'originalString': u'2 cups organic frozen corn kernels', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [u'frozen', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11172, u'unit': u'cups'}, {u'originalString': u'1/4 cup coarse corn meal', u'aisle': u'Ethnic Foods;Baking', u'name': u'corn meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 35137, u'unit': u'cup'}, {u'originalString': u'1 dried bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried bay leaf', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'4 to 5 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 green bell peppers', u'aisle': u'Produce', u'name': u'green bell peppers', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1 4-ounce can hot diced green chiles', u'aisle': u'Produce', u'name': u'green chiles', u'metaInformation': [u'diced', u'green', u'hot', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 31015, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon + 1/4 teaspoon ground cumin , divided', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'1 serrano or jalapeno pepper (see NOTES for spiciness recommendation)', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'for spiciness recommendation)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1/2 tablespoon + 1 teaspoon kosher salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'2 cans pinto beans, rinsed and drained (or 3 cups cooked)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'pinto beans', u'metaInformation': [u'rinsed', u'cooked', u'drained', u'(or 3 cups )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pinto-beans.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 2.0, u'consistency': u'solid', u'id': 16043, u'unit': u'cans'}, {u'originalString': u'shredded cheese, fresh cilantro and baked tortilla chips for serving', u'aisle': u'Cheese', u'name': u'shredded cheese', u'metaInformation': [u'fresh', u'shredded', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1011026, u'unit': u'servings'}, {u'originalString': u'1 large sweet onion', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'sweet', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1 15-once can crushed tomatillos', u'aisle': u'Produce', u'name': u'tomatillos', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatillos.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11954, u'unit': u'can'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.everydaymaven.com/2012/slow-cooker-turkey-tomatillo-pinto-bean-soup/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Prep garlic, serrano chile, bell peppers, celery and onion for food processor by cleaning and chopping into chunks.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place garlic, serrano and bell peppers and celery into bowl of food processor. Process until pureed and slightly foamy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add in onion chunks and pulse until onion is roughly chopped and still in visible pieces.[img src="http://www.everydaymaven.com/wp-content/uploads/2012/12/IMG_8093.jpg" width="550"]', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large pan over medium high heat and add olive oil. Once hot, add in onion mixture from food processor along with bay leaf, dried oregano, ancho chili powder, 1 teaspoon of ground cumin and 1/2 tablespoon kosher salt. Cook, stirring frequently, for 5 to 7 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1022009, u'name': u'ancho chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'ground cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer to slow cooker and add all remaining ingredients EXCEPT 1/4 teaspoon of ground cumin and 1 teaspoon of kosher salt. Stir and set on LOW for 8 Hours. I used a 6.5 Quart Slow Cooker.When cooking time is up, adjust seasonings by adding remaining ground cumin and kosher salt. This thickens as it sits, freezes great and is better the next day. If you eat it immediatly, note it will be a bit looser and more like a Soup than a Chili.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'ground cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}]}, {u'equipment': [], u'step': u'Serve with shredded cheese and baked tortilla chips or over cooked brown rice or quinoa and Enjoy!', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1011026, u'name': u'shredded cheese'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 532, u'instructions': u'Prep garlic, serrano chile, bell peppers, celery and onion for food processor by cleaning and chopping into chunks.Place garlic, serrano and bell peppers and celery into bowl of food processor. Process until pureed and slightly foamy.Add in onion chunks and pulse until onion is roughly chopped and still in visible pieces.[img src="http://www.everydaymaven.com/wp-content/uploads/2012/12/IMG_8093.jpg" width="550"]Heat a large pan over medium high heat and add olive oil. Once hot, add in onion mixture from food processor along with bay leaf, dried oregano, ancho chili powder, 1 teaspoon of ground cumin and 1/2 tablespoon kosher salt. Cook, stirring frequently, for 5 to 7 minutes.Transfer to slow cooker and add all remaining ingredients EXCEPT 1/4 teaspoon of ground cumin and 1 teaspoon of kosher salt. Stir and set on LOW for 8 Hours. I used a 6.5 Quart Slow Cooker.When cooking time is up, adjust seasonings by adding remaining ground cumin and kosher salt. This thickens as it sits, freezes great and is better the next day. If you eat it immediatly, note it will be a bit looser and more like a Soup than a Chili.Serve with shredded cheese and baked tortilla chips or over cooked brown rice or quinoa and Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-tomatillo-+-pinto-bean-soup-with-corn-589613', u'dishTypes': [u'side dish'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 490, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}