{u'recipes': [{u'sourceName': u'Caras Cravings', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573106-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 573106, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pumpkin Caramel Candy Cups', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 95.77, u'creditText': u'Caras Cravings', u'extendedIngredients': [{u'originalString': u'2 tablespoons coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup full fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'10 drops liquid vanilla stevia', u'aisle': u'Baking', u'name': u'liquid stevia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia-drops.jpg', u'unitLong': u'drops', u'unitShort': u'drops', u'amount': 10.0, u'consistency': u'solid', u'id': 10811111, u'unit': u'drops'}, {u'originalString': u'1/4 cup + 2 tablespoons cup maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19911, u'unit': u'cup'}, {u'originalString': u'1 cup + 2 tablespoons natural, unsweetened cocoa powder', u'aisle': u'Spices and Seasonings', u'name': u'natural spices', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2035, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup pumpkin puree', u'aisle': u'Baking', u'name': u'pumpkin puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'xylitol', u'aisle': u'Health Foods;Baking', u'name': u'xylitol', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 99005, u'unit': u'servings'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.carascravings.com/2012/10/pumpkin-caramel-cups-vegan-gluten-free-refined-sugar-free.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine the xylitol, coconut milk, 2 tablespoons coconut oil, pumpkin, salt, and pumpkin pie spice in a small saucepan. Cook over medium-low heat, stirring, until, coconut oil is melted and xylitol is dissolved. Increase heat to medium and bring to a boil. Cook, stirring, for 3 minutes. The mixture will become darker and thicker. Turn off heat and stir in vanilla.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'id': 1002035, u'name': u'pumpkin pie spice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': None, u'id': 99005, u'name': u'xylitol'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mini-muffin-tray.jpg', u'id': 405905, u'name': u'mini muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool, and transfer to a small bowl. Cover and refrigerate for several hours or overnight. Line a 24-cup mini muffin tin with paper liners.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}], u'step': u'Combine the 3/4 cup coconut oil, maple syrup, cocoa powder, salt ans stevia in the top of a double boiler set over water simmering at medium heat. Stir until smooth, then reduce heat to a low simmer to keep warm. Spoon 1 teaspoon chocolate into the bottom of each muffin liner. Freeze for 5 minutes,until firm.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place a small dollop of the pumpkin caramel mixture in each muffin liner, being careful not to let it touch the sides of the liners. (You may have some leftover.) Return to freezer for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}], u'step': u'Transfer the remaining warm chocolate to a liquid measuring cup with a spout.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour enough chocolate into each liner to cover the pumpkin caramel and fill in around the sides. Refrigerate until firm, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 397, u'instructions': u'Combine the xylitol, coconut milk, 2 tablespoons coconut oil, pumpkin, salt, and pumpkin pie spice in a small saucepan. Cook over medium-low heat, stirring, until, coconut oil is melted and xylitol is dissolved. Increase heat to medium and bring to a boil. Cook, stirring, for 3 minutes. The mixture will become darker and thicker. Turn off heat and stir in vanilla. Let cool, and transfer to a small bowl. Cover and refrigerate for several hours or overnight. Line a 24-cup mini muffin tin with paper liners. Combine the 3/4 cup coconut oil, maple syrup, cocoa powder, salt ans stevia in the top of a double boiler set over water simmering at medium heat. Stir until smooth, then reduce heat to a low simmer to keep warm. Spoon 1 teaspoon chocolate into the bottom of each muffin liner. Freeze for 5 minutes,until firm.Place a small dollop of the pumpkin caramel mixture in each muffin liner, being careful not to let it touch the sides of the liners. (You may have some leftover.) Return to freezer for 10 minutes.Transfer the remaining warm chocolate to a liquid measuring cup with a spout. Pour enough chocolate into each liner to cover the pumpkin caramel and fill in around the sides. Refrigerate until firm, about 20 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/pumpkin-caramel-candy-cups-573106', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}