{u'recipes': [{u'sourceName': u'The Healthy Foodie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551466-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 551466, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp and Baby Bok Choy Stirfry', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'pricePerServing': 840.93, u'creditText': u'The Healthy Foodie', u'extendedIngredients': [{u'originalString': u'6 baby bok choys, cut in quarters', u'aisle': u'Produce', u'name': u'baby bok choy', u'metaInformation': [u'cut in quarters'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 93636, u'unit': u''}, {u'originalString': u'1-2 tsp black and white sesame seeds, for garnish', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'black sesame seeds', u'metaInformation': [u'white', u'black', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-sesame-seeds-or-chia-seeds.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10012023, u'unit': u'tsp'}, {u'originalString': u'2 tbsp fresh ginger, grated', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tbsp'}, {u'originalString': u'1 garlic clove, chopped', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 green onions, coarsely chopped', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'\xbd tsp unpasteurized liquid honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'liquid honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'tsp'}, {u'originalString': u'\xbd red bell pepper, sliced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 tsp sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tsp'}, {u'originalString': u'12 large raw tiger shrimps, cleaned and shelled (I used size 26-30)', u'aisle': u'Seafood', u'name': u'shrimps', u'metaInformation': [u'raw', u'shelled', u'large', u'cleaned', u'(I used size 26-30)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 15152, u'unit': u''}, {u'originalString': u'1 tsp Tamari sauce (I use gluten free)', u'aisle': u'Ethnic Foods', u'name': u'tamari soy sauce', u'metaInformation': [u'gluten free', u'(I use )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10116124, u'unit': u'tsp'}, {u'originalString': u"2 tbsp white balsamic or wine vinegar (or rice vinegar if you don't want to keep grain free)", u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white', u"(or rice vinegar if you don't want to keep grain free)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002068, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp sambal oelek', u'aisle': u'?', u'name': u'sambal oelek', u'metaInformation': [], u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'unit': u'tsp'}, {u'originalString': u'20 snowpeas, ends removed', u'aisle': u'?', u'name': u'snowpeas', u'metaInformation': [], u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'unit': u''}], u'healthScore': 42.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://thehealthyfoodie.com/shrimp-and-baby-bok-choy-stirfry/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'In a small mixing bowl, add all the ingredients for the sauce and stir with a whisk until well incorporated. Set aside.Coat a skillet with cooking spray and heat over medium-high heat. When pan is hot enough, add shrimp and saute until they start to turn pink but are still slightly translucent. Stir in green onions, bell pepper, snow peas and bok choy. Continue cooking for a minute or two, until the vegetables start to wilt. Stir in sauce and cook for an additional minute.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Transfer to serving plate and garnish with sesame seeds', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}], u'name': u''}], u'aggregateLikes': 49, u'instructions': u'In a small mixing bowl, add all the ingredients for the sauce and stir with a whisk until well incorporated. Set aside.Coat a skillet with cooking spray and heat over medium-high heat. When pan is hot enough, add shrimp and saute until they start to turn pink but are still slightly translucent. Stir in green onions, bell pepper, snow peas and bok choy. Continue cooking for a minute or two, until the vegetables start to wilt. Stir in sauce and cook for an additional minute.Transfer to serving plate and garnish with sesame seeds', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-and-baby-bok-choy-stirfry-551466', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}