{u'recipes': [{u'sourceName': u'The Comfort of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/626499-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 626499, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Smoked Sausage Tortellini', u'diets': [], u'pricePerServing': 330.88, u'creditText': u'The Comfort of Cooking', u'extendedIngredients': [{u'originalString': u'Chopped fresh parsley', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11297, u'unit': u'servings'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 cup heavy cream or half-and-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'2 Tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'Freshly grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'servings'}, {u'originalString': u'1 lb. smoked sausage or kielbasa', u'aisle': u'Meat', u'name': u'smoked sausage', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7916, u'unit': u'lb'}, {u'originalString': u'1 cup tomato sauce or your favorite spaghetti sauce', u'aisle': u'Pasta and Rice', u'name': u'spaghetti sauce', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011549, u'unit': u'cup'}, {u'originalString': u'9 oz. fresh or frozen tortellini', u'aisle': u'Pasta and Rice;Refrigerated;Frozen', u'name': u'tortellini', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 93727, u'unit': u'oz'}, {u'originalString': u'3/4 cup chicken broth or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://www.thecomfortofcooking.com/2015/01/creamy-smoked-sausage-tortellini.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet with a lid, heat 2 tablespoons olive oil. Once hot, add sausage and cook until well browned, about 3-4 minutes per side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add garlic and stir until golden and fragrant, about 30 seconds. Stir in broth, tomato sauce, cream and tortellini. Cook until simmering and bubbly. Reduce heat to low, cover and simmer for 12 minutes, or until tortellini are tender and heated through.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'id': 93727, u'name': u'tortellini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve and garnish with chopped parsley, if desired.Enjoy!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'aggregateLikes': 7, u'instructions': u'In a large skillet with a lid, heat 2 tablespoons olive oil. Once hot, add sausage and cook until well browned, about 3-4 minutes per side. Add garlic and stir until golden and fragrant, about 30 seconds. Stir in broth, tomato sauce, cream and tortellini. Cook until simmering and bubbly. Reduce heat to low, cover and simmer for 12 minutes, or until tortellini are tender and heated through.Serve and garnish with chopped parsley, if desired.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-smoked-sausage-tortellini-626499', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}