{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/199874-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199874, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken Soup with Matzo Balls', u'diets': [u'dairy free'], u'pricePerServing': 206.92, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 medium carrots, peeled and cut into 3-inch pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'peeled', u'cut into 3-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'4 stalks of celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 4.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'1 4-pound chicken', u'aisle': u'Meat', u'name': u'chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 4.0, u'consistency': u'solid', u'id': 1025006, u'unit': u'pound'}, {u'originalString': u'2 large eggs room temperature, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'lightly beaten', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoons finely chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2045, u'unit': u'teaspoons'}, {u'originalString': u'3 cloves of garlic, unpeeled', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'unpeeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 tablespoons chopped ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11216, u'unit': u'tablespoons'}, {u'originalString': u'Juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1/2 cup matzo meal', u'aisle': u'Ethnic Foods;Baking', u'name': u'matzo meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/matzo.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18217, u'unit': u'cup'}, {u'originalString': u'1 large onion, unpeeled, washed', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'washed', u'large', u'unpeeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 parsnip, sliced up in 1/2-inch semi-circles', u'aisle': u'Produce', u'name': u'parsnip', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'2 potatoes, cubed into 1 inch pieces', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons seltzer water', u'aisle': u'Beverages', u'name': u'seltzer water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'tablespoons'}, {u'originalString': u'1 turnip, cubed into 1/2-inch pieces', u'aisle': u'Produce', u'name': u'turnip', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11564, u'unit': u''}, {u'originalString': u'2 tablespoons vegetable oil or schmaltz', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2032, u'unit': u'teaspoon'}], u'healthScore': 26.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/04/chicken-soup-with-matzo-balls.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'To make the soup: Thoroughly wash the chicken and place it in the pot.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}]}, {u'equipment': [], u'step': u'Add the water (enough to submerge everything with 2 inches of water on top), the onion, the bunch of dill (tied with a string), celery and salt. Bring to a boil and skim off the foam that will form on top. Discard the foam, continue to cook on medium-high heat until the foam stops appearing. Lower the heat to medium-low and add ginger, the turnip, the parsnip, carrots and the lemon juice. Cover and cook over very low heat for 2 hours.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'id': 11564, u'name': u'turnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'After 2 hours, taste the broth and see if you want more salt, or other seasonings in it. Pull the chicken out. It should be falling apart and falling off the bone. Pull the bones out and discard, and cut up the chicken in pieces.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place half of the chicken back in the soup and half put aside for chicken salad the next day. Ever-so-slightly increase the heat and add the potatoes. While the potatoes cook, start on the matzo balls.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1025006, u'name': u'chicken'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 10018217, u'name': u'matzo'}]}, {u'equipment': [], u'step': u'3', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To make matzo balls: In a large bowl, mix together the matzo meal, eggs, vegetable oil, seltzer, salt and pepper. Cover and refrigerate for 30 minutes. Take the matzo ball mix out of the refrigerator and place by the stove where your soup is simmering.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/matzo.jpg', u'id': 18217, u'name': u'matzo meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 10018217, u'name': u'matzo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place a bowl of cold water next to your matzo ball mix—you will need to dip your hands in it so that the matzo meal won’t stick to your palms.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/matzo.jpg', u'id': 18217, u'name': u'matzo meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 10018217, u'name': u'matzo'}]}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Grab a bit of the mix and roll it in your palms to a ball about 1 inch in diameter. Drop the matzo balls in the soup one at a time. When out of the mix, cover the soup and simmer for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'id': 10018217, u'name': u'matzo'}]}, {u'equipment': [], u'step': u'5', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Remove the soup from heat.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve in bowls immediately with freshly cut dill sprinkled on top.', u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'id': 2045, u'name': u'dill'}]}], u'name': u''}], u'aggregateLikes': 171, u'instructions': u'Procedures                                                                              1                                                                            To make the soup: Thoroughly wash the chicken and place it in the pot. Add the water (enough to submerge everything with 2 inches of water on top), the onion, the bunch of dill (tied with a string), celery and salt. Bring to a boil and skim off the foam that will form on top. Discard the foam, continue to cook on medium-high heat until the foam stops appearing. Lower the heat to medium-low and add ginger, the turnip, the parsnip, carrots and the lemon juice. Cover and cook over very low heat for 2 hours.                                                                                                                            2                                                                            After 2 hours, taste the broth and see if you want more salt, or other seasonings in it. Pull the chicken out. It should be falling apart and falling off the bone. Pull the bones out and discard, and cut up the chicken in pieces. Place half of the chicken back in the soup and half put aside for chicken salad the next day. Ever-so-slightly increase the heat and add the potatoes. While the potatoes cook, start on the matzo balls.                                                                                                                            3                                                                            To make matzo balls: In a large bowl, mix together the matzo meal, eggs, vegetable oil, seltzer, salt and pepper. Cover and refrigerate for 30 minutes. Take the matzo ball mix out of the refrigerator and place by the stove where your soup is simmering. Place a bowl of cold water next to your matzo ball mix—you will need to dip your hands in it so that the matzo meal won’t stick to your palms.                                                                                                                            4                                                                            Grab a bit of the mix and roll it in your palms to a ball about 1 inch in diameter. Drop the matzo balls in the soup one at a time. When out of the mix, cover the soup and simmer for 30 minutes.                                                                                                                            5                                                                            Remove the soup from heat. Serve in bowls immediately with freshly cut dill sprinkled on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-soup-with-matzo-balls-199874', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 180, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}