{u'recipes': [{u'sourceName': u'Mother Rimmy', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/532140-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532140, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mediterranean Shrimp Salad Pizza', u'diets': [u'pescatarian'], u'pricePerServing': 309.13, u'creditText': u'Mother Rimmy', u'extendedIngredients': [{u'originalString': u'2 cups baby spinach', u'aisle': u'Produce', u'name': u'baby spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11457, u'unit': u'cups'}, {u'originalString': u'3 tablespoons capers', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup low fat feta cheese, crumbled', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'low fat', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1 \xbd teaspoons garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 large Whole Wheat Boboli Pizza Thin Crust', u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [u'whole wheat', u'large', u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93770, u'unit': u''}, {u'originalString': u'\xbd cup red bell (capsicum) peppers, chopped', u'aisle': u'Produce', u'name': u'red bell peppers', u'metaInformation': [u'red', u'chopped', u'(capsicum)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u'cup'}, {u'originalString': u'1 pinch red pepper', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u'pinch'}, {u'originalString': u'1 cup salad shrimp', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'cup'}, {u'originalString': u'1 teaspoon turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoon'}, {u'originalString': u'4 tablespoons walnut pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnut pieces', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 12155, u'unit': u'tablespoons'}, {u'originalString': u'\xbe cup low fat yogurt cheese', u'aisle': u'?', u'name': u'yogurt cheese', u'metaInformation': [u'low fat'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'unit': u'cup'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://motherrimmy.com/mediterranean-shrimp-salad-pizza-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees and bake the pizza crust for 8 - 10 minutes until lightly crisped.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93770, u'name': u'prepared pizza crust'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine salad shrimp, olive oil, walnuts, capers, onion, bell pepper, 1 teaspoon oregano, 1/2 teaspoon lemon zest and pinch of dried red pepper in a large bowl. In another bowl combine yogurt cheese, remaining oregano, garlic, remaining lemon zest and turmeric.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Spread cheese mixture over pizza crust and top with spinach and then shrimp mixture. Sprinkle with feta cheese and serve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93770, u'name': u'prepared pizza crust'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish works really well with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Miranda Lambert Kerosene Pinot Grigio Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 26 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'light , pear , apple', u'title': u'Miranda Lambert Kerosene Pinot Grigio Wine', u'price': u'$26.0', u'id': 428324, u'link': u'https://www.amazon.com/Miranda-Lambert-Kerosene-Pinot-Grigio/dp/B0184UHJRO', u'imageUrl': u'https://spoonacular.com/productImages/428324-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'Preheat oven to 350 degrees and bake the pizza crust for 8 - 10 minutes until lightly crisped.Combine salad shrimp, olive oil, walnuts, capers, onion, bell pepper, 1 teaspoon oregano, 1/2 teaspoon lemon zest and pinch of dried red pepper in a large bowl. In another bowl combine yogurt cheese, remaining oregano, garlic, remaining lemon zest and turmeric.Spread cheese mixture over pizza crust and top with spinach and then shrimp mixture. Sprinkle with feta cheese and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/mediterranean-shrimp-salad-pizza-532140', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}