{u'recipes': [{u'sourceName': u'Eclectic Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/542905-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 542905, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chipotle Shrimp and Mango Flatbread', u'diets': [u'pescatarian'], u'pricePerServing': 215.1, u'creditText': u'Eclectic Recipes', u'extendedIngredients': [{u'originalString': u'2 teaspoons chipotle chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chipotle chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1052009, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'1/2 cup bean chopped mango', u'aisle': u'Produce', u'name': u'mango', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9176, u'unit': u'cup'}, {u'originalString': u"4 pieces Flatout Bread's new Thin Crust Flatbreads Artisan Pizza", u'aisle': u'Pasta and Rice;Refrigerated', u'name': u'pizza crust', u'metaInformation': [u'thin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 93770, u'unit': u'pieces'}, {u'originalString': u'8 tablespoons pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'tablespoons'}, {u'originalString': u'2 cups queso fresco crumbling cheese', u'aisle': u'Cheese', u'name': u'queso fresco cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/camembert.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1228, u'unit': u'cups'}, {u'originalString': u'1/4 cup chopped red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10011282, u'unit': u'cup'}, {u'originalString': u'24 large shrimp, peeled and de-veined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'liquid', u'id': 15152, u'unit': u''}, {u'originalString': u'1/2 cup chopped tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 49.0, u'sourceUrl': u'http://eclecticrecipes.com/chipotle-shrimp-and-mango-flatbread-giveaway', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to 350\xb0. Use indirect heat by turning only one burner on a higher setting.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the flatbread on the side of the grill where the burner is NOT turned on. Top flatbread with pizza sauce, shrimp, queso fresco, mango, tomato, red onion, and sprinkle with chipotle chili powder. Grill with lid closed for 4 - 8 minutes, or until shrimp are cooked and pink, and cheese has melted. Top with freshly chopped cilantro before serving.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1052009, u'name': u'ground chipotle chile pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/camembert.jpg', u'id': 1228, u'name': u'queso fresco'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango.jpg', u'id': 9176, u'name': u'mango'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. One wine you could try is Proverb Pinot Grigio Wine. It has 5 out of 5 stars and a bottle costs about 13 dollars.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Luminous pear and apple notes animated with aromas of lime and lemon.', u'title': u'Proverb Pinot Grigio Wine', u'price': u'$12.75', u'id': 431299, u'link': u'https://www.amazon.com/2016-Proverb-Pinot-Grigio-750mL/dp/B074G3D221', u'imageUrl': u'https://spoonacular.com/productImages/431299-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u'Heat grill to 350\xb0. Use indirect heat by turning only one burner on a higher setting. Place the flatbread on the side of the grill where the burner is NOT turned on. Top flatbread with pizza sauce, shrimp, queso fresco, mango, tomato, red onion, and sprinkle with chipotle chili powder. Grill with lid closed for 4 - 8 minutes, or until shrimp are cooked and pink, and cheese has melted. Top with freshly chopped cilantro before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/chipotle-shrimp-and-mango-flatbread-542905', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}