{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/696077-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 696077, u'veryPopular': True, u'lowFodmap': False, u'title': u'Indian Spiced Shrimp', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 270.62, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon black peppercorns', u'aisle': u'Spices and Seasonings', u'name': u'black peppercorns', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022030, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoon'}, {u'originalString': u'1 tablespoon coriander seeds', u'aisle': u'Spices and Seasonings', u'name': u'coriander seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coriander-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2013, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon cumin seeds', u'aisle': u'Spices and Seasonings', u'name': u'cumin seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2014, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons finely chopped fresh cilantro', u'aisle': u'Produce', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tablespoons'}, {u'originalString': u'1 pound raw shrimp, (16-20 per pound), peeled and deveined', u'aisle': u'Seafood', u'name': u'raw shrimp', u'metaInformation': [u'raw', u'deveined', u'peeled', u'per pound),  and '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'1 dried red chile, such as Thai, cayenne or chile de arbol', u'aisle': u'Produce', u'name': u'red chile', u'metaInformation': [u'dried', u'red', u' such as thai, cayenne or chile de arbol'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup minced, shallots', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11677, u'unit': u'cup'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 teaspoon black or yellow mustard seeds', u'aisle': u'Spices and Seasonings', u'name': u'yellow mustard seeds', u'metaInformation': [u'black', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2024, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon yellow split peas', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'yellow split peas', u'metaInformation': [u'split', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/split-peas-green.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 16085, u'unit': u'tablespoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/indian_spiced_shrimp.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Toast split peas, coriander, cumin, peppercorns and chile in a large skillet over medium heat, shaking the pan occasionally, until the peas turn reddish brown, the spices become fragrant and the chile blackens slightly, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-pepper.jpg', u'id': 1022030, u'name': u'peppercorns'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/split-peas-green.jpg', u'id': 16085, u'name': u'split peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mortar-and-pestle.jpg', u'id': 404751, u'name': u'mortar and pestle'}], u'step': u'Transfer to a plate to cool for 3 to 5 minutes. Grind in a spice grinder or mortar and pestle until the mixture is the texture of finely ground black pepper.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine cilantro, tamarind concentrate (or lime juice), salt and the spice blend in a medium bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Add shrimp and turn to coat. Cover and refrigerate for 30 minutes. (Do not marinate for more than 2 hours or the acidity in the tamarind will affect the shrimp's texture.)", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in the pan over medium-high heat; add mustard seeds. When the seeds begin to pop, cover the skillet. As soon as the popping stops, add shallots and the shrimp in a single layer and cook until the undersides of the shrimp turn salmon-pink, 1 to 2 minutes. Turn the shrimp and cook until the other side is pink, 1 to 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mustard-seeds.jpg', u'id': 2024, u'name': u'mustard seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add water and continue cooking for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 546, u'instructions': u"Toast split peas, coriander, cumin, peppercorns and chile in a large skillet over medium heat, shaking the pan occasionally, until the peas turn reddish brown, the spices become fragrant and the chile blackens slightly, 2 to 3 minutes. Transfer to a plate to cool for 3 to 5 minutes. Grind in a spice grinder or mortar and pestle until the mixture is the texture of finely ground black pepper.Combine cilantro, tamarind concentrate (or lime juice), salt and the spice blend in a medium bowl. Add shrimp and turn to coat. Cover and refrigerate for 30 minutes. (Do not marinate for more than 2 hours or the acidity in the tamarind will affect the shrimp's texture.)Heat oil in the pan over medium-high heat; add mustard seeds. When the seeds begin to pop, cover the skillet. As soon as the popping stops, add shallots and the shrimp in a single layer and cook until the undersides of the shrimp turn salmon-pink, 1 to 2 minutes. Turn the shrimp and cook until the other side is pink, 1 to 2 minutes. Add water and continue cooking for 1 minute. Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/indian-spiced-shrimp-696077', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}