{u'recipes': [{u'sourceName': u'Just One Cookbook', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/613317-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 613317, u'veryPopular': False, u'lowFodmap': False, u'title': u'Miso Ramen 味噌ラーメン', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 383.17, u'creditText': u'Just One Cookbook', u'extendedIngredients': [{u'originalString': u'4 cups (1 L) chicken stock/broth', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'L', u'unitShort': u'L', u'amount': 1.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'L'}, {u'originalString': u'1 tsp. Chili Bean Sauce/Paste (La Doubanjiang)', u'aisle': u'Ethnic Foods', u'name': u'chili paste', u'metaInformation': [u'(La Doubanjiang)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-paste.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6973, u'unit': u'tsp'}, {u'originalString': u'Corn kernels', u'aisle': u'Produce', u'name': u'corn kernels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11172, u'unit': u'servings'}, {u'originalString': u'Ramen Eggs (Recipe)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'(Recipe)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u'servings'}, {u'originalString': u'2 large garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 inch ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'inch', u'unitShort': u'inch', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'inch'}, {u'originalString': u'Chopped scallion/green onion', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'servings'}, {u'originalString': u'\xbc lb (113 g) ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 113.0, u'consistency': u'solid', u'id': 10219, u'unit': u'g'}, {u'originalString': u'3 Tbsp. miso (I use awase miso)', u'aisle': u'Ethnic Foods', u'name': u'miso', u'metaInformation': [u'(I use awase miso)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 16112, u'unit': u'Tbsp'}, {u'originalString': u'Nori (seaweed)', u'aisle': u'Ethnic Foods', u'name': u'nori', u'metaInformation': [u'(seaweed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 11446, u'unit': u'servings'}, {u'originalString': u'Pickled red ginger (Kizami Beni Shoga)', u'aisle': u'Ethnic Foods;Gourmet', u'name': u'pickled ginger', u'metaInformation': [u'red', u'(Kizami Beni Shoga)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger-pickled.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 10111216, u'unit': u'servings'}, {u'originalString': u'2 serving ramen noodles', u'aisle': u'Pasta and Rice', u'name': u'ramen noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ramen.jpg', u'unitLong': u'servings', u'unitShort': u'serving', u'amount': 2.0, u'consistency': u'solid', u'id': 6583, u'unit': u'serving'}, {u'originalString': u'1 Tbsp. sake', u'aisle': u'Alcoholic Beverages', u'name': u'sake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 43479, u'unit': u'Tbsp'}, {u'originalString': u'1 tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp. sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'Tbsp'}, {u'originalString': u'1 Tbsp. sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12023, u'unit': u'Tbsp'}, {u'originalString': u'1 shallot', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1 Tbsp. sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Tbsp'}, {u'originalString': u'\xbc tsp. white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2032, u'unit': u'tsp'}, {u'originalString': u'Spicy Bean Sprout Salad (Recipe)', u'aisle': u'Produce', u'name': u'yam bean', u'metaInformation': [u'(Recipe)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jicama.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 11603, u'unit': u'servings'}, {u'originalString': u'Chashu (Recipe)', u'aisle': u'?', u'name': u'chashu', u'metaInformation': [u'(Recipe)'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'unit': u'servings'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.justonecookbook.com/recipes/homemade-chashu-miso-ramen/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Mince the garlic, ginger, and shallot.Grind sesame seeds.In a medium pot, heat sesame oil over medium heat and cook the minced garlic, ginger, and shallot until fragrant.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add the meat and increase heat to medium high. Cook the meat until no longer pink.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add spicy bean paste (La Doubanjiang) and miso.And add sesame seeds and sugar and mix well.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/miso.jpg', u'id': 16112, u'name': u'miso'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add sake, chicken stock, salt and pepper.Keep the ramen soup simmered.Noodles will be done cooking in less than 2 minutes. Therefore, prepare ramen toppings first so you can serve the hot ramen immediately.Bring a large pot of un-salted water to a boil (ramen noodles already have salt in the dough) While boiling, take some hot water into serving bowls to warm up the bowls. Loosen up the noodles and cook according to the package instructions. I usually cook the noodles al dente (about 15 seconds earlier than suggested time).When noodles are done, quickly pick them up with a mesh sieve. You dont want to dilute your soup, so make sure you drain the water well.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ramen.jpg', u'id': 6583, u'name': u'ramen noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sake-cup.jpg', u'id': 43479, u'name': u'sake'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve the noodles into bowls.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add the soup and top with various toppings youve prepared. I put chashu, ramen egg, spicy bean sprout salad, corn, scallion, shiraga negi, pickled red ginger, and a sheet of nori.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ramen.jpg', u'id': 6583, u'name': u'ramen noodles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nori.jpg', u'id': 11446, u'name': u'nori'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Ramen Noodles works really well with Riesling, Sake, and Sauvignon Blanc. Sak\xe9 is an obvious choice when it comes to Japanese food. If you want to stick to grape wine, though, you might opt for sauvignon blanc or riesling. One wine you could try is Schmitt Sohne Relax Riesling. It has 4.4 out of 5 stars and a bottle costs about 9 dollars.', u'pairedWines': [u'riesling', u'sake', u'sauvignon blanc'], u'productMatches': [{u'description': u'Relax Riesling is fermented slightly dry with a wonderful fruity bouquet and intense flavors of apples and peaches with just a hint of citrus. The natural acidity gives this wine a perfect balance that is refreshingly crisp and leaves your mouth watering. A perfect party wine, or can be enjoyed with a variety of foods from seafood and poultry to oriental food and fresh salads.', u'title': u'Schmitt Sohne Relax Riesling', u'price': u'$9.49', u'id': 434166, u'link': u'https://www.wine.com/product/schmitt-sohne-relax-riesling-2008/99841', u'imageUrl': u'https://spoonacular.com/productImages/434166-312x231.jpg'}]}, u'aggregateLikes': 180, u'instructions': u'Mince the garlic, ginger, and shallot.Grind sesame seeds.In a medium pot, heat sesame oil over medium heat and cook the minced garlic, ginger, and shallot until fragrant.Add the meat and increase heat to medium high. Cook the meat until no longer pink.Add spicy bean paste (La Doubanjiang) and miso.And add sesame seeds and sugar and mix well.Add sake, chicken stock, salt and pepper.Keep the ramen soup simmered.Noodles will be done cooking in less than 2 minutes. Therefore, prepare ramen toppings first so you can serve the hot ramen immediately.Bring a large pot of un-salted water to a boil (ramen noodles already have salt in the dough) While boiling, take some hot water into serving bowls to warm up the bowls. Loosen up the noodles and cook according to the package instructions. I usually cook the noodles al dente (about 15 seconds earlier than suggested time).When noodles are done, quickly pick them up with a mesh sieve. You dont want to dilute your soup, so make sure you drain the water well. Serve the noodles into bowls.Add the soup and top with various toppings youve prepared. I put chashu, ramen egg, spicy bean sprout salad, corn, scallion, shiraga negi, pickled red ginger, and a sheet of nori.', u'spoonacularSourceUrl': u'https://spoonacular.com/miso-ramen--613317', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}