{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/215697-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 215697, u'veryPopular': False, u'lowFodmap': False, u'title': u'Thai coconut & veg broth', u'diets': [u'dairy free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 217.8, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'\xbd head Chinese leaf, sliced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [u'chinese', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.5, u'consistency': u'solid', u'id': 2004, u'unit': u'head'}, {u'originalString': u'2 tsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tsp'}, {u'originalString': u'2 carrots, cut into matchsticks', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'cut into matchsticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'6 cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 10311529, u'unit': u''}, {u'originalString': u'175g medium egg noodles', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 20409, u'unit': u'g'}, {u'originalString': u'handful coriander, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'juice 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'400ml can half-fat coconut milk', u'aisle': u'Canned and Jarred', u'name': u'low fat coconut milk', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 400.0, u'consistency': u'liquid', u'id': 99009, u'unit': u'ml'}, {u'originalString': u'3 spring onions, halved, then finely sliced lengthways', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'halved', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'\xbd x 300g bag beansprouts', u'aisle': u'Tea and Coffee', u'name': u'tea bag', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10111111, u'unit': u''}, {u'originalString': u'1\xbd tbsp Thai red curry paste', u'aisle': u'Ethnic Foods', u'name': u'thai red curry paste', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 93605, u'unit': u'tbsp'}, {u'originalString': u'1 tsp vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tsp'}, {u'originalString': u'1l vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'liter', u'unitShort': u'l', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'l'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1120676/thai-coconut-and-veg-broth', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wok.png', u'id': 404666, u'name': u'wok'}], u'step': u'Place the curry paste in a largesaucepan or wok with the oil. Fryfor 1 min until fragrant. Tip in thevegetable stock, coconut milk andbrown sugar. Simmer for 3 mins.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-curry-paste.png', u'id': 93605, u'name': u'curry paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Add the noodles, carrots and', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Chinese leaf and simmer for4-6 mins, until all are tender.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Mixin beansprouts and tomatoes.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Addlime juice to taste and some extraseasoning, if you like. Spoon intobowls and sprinkle with springonions and coriander.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Thai on the menu? Try pairing with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Mulderbosch Chenin Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food.', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 204, u'instructions': u'Place the curry paste in a largesaucepan or wok with the oil. Fryfor 1 min until fragrant. Tip in thevegetable stock, coconut milk andbrown sugar. Simmer for 3 mins.Add the noodles, carrots andChinese leaf and simmer for4-6 mins, until all are tender. Mixin beansprouts and tomatoes. Addlime juice to taste and some extraseasoning, if you like. Spoon intobowls and sprinkle with springonions and coriander.', u'spoonacularSourceUrl': u'https://spoonacular.com/thai-coconut-veg-broth-215697', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}