{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/211359-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 211359, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pan-fried sea trout, peas & chorizo fricass\xe9e', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 290.45, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'25g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'2 tbsp small capers, drained', u'aisle': u'Canned and Jarred', u'name': u'capers', u'metaInformation': [u'small', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2054, u'unit': u'tbsp'}, {u'originalString': u'125ml fresh chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 125.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'ml'}, {u'originalString': u'100g cured chorizo, about 1 small sausage, diced', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'liquid', u'id': 7019, u'unit': u'g'}, {u'originalString': u'1 lemon, halved', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'150g cooked peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}, {u'originalString': u'1 red onion, finely chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'1 tbsp red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'tbsp'}, {u'originalString': u'2 fillets of sea trout about 150g each (or use salmon)', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'(or use salmon)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'fillets', u'unitShort': u'fillets', u'amount': 2.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'fillets'}, {u'originalString': u'large pinch sweet smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'sweet paprika', u'metaInformation': [u'smoked', u'sweet', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002028, u'unit': u'pinch'}, {u'originalString': u'small bunch tarragon, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'tarragon', u'metaInformation': [u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2041, u'unit': u'bunch'}, {u'originalString': u'350g waxy potatoes, such as Charlotte, peeled and cut into small cubes', u'aisle': u'Produce', u'name': u'waxy potatoes', u'metaInformation': [u' such as charlotte, peeled and cut into small cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 350.0, u'consistency': u'solid', u'id': 11355, u'unit': u'g'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/644646/panfried-sea-trout-peas-and-chorizo-fricasse', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'First make the dressing.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat 1 tbspof the olive oil in a small saucepan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Addthe capers and the onion and cook for3 mins until softened. Splash in the redwine vinegar and bubble down, thenremove the pan from the heat.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/capers.jpg', u'id': 2054, u'name': u'capers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Addthe rest of the oil and the tarragon, thenleave to infuse.For the fricass\xe9e, heat the oil in a saut\xe9pan, add the chorizo and fry for 2 minsuntil it starts to crisp and render outred oil. Throw the potatoes and paprikain the pan and cook for 5 mins, tossingoccasionally, until they start to brown on the edges.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Pour in the chicken stock, turn up theheat and boil the stock for 8-10 mins untilit has nearly all evaporated and thepotatoes are tender. Stir the peas intothe potatoes and cook for 2 mins moreuntil heated through, then set aside.Using a sharp knife, score the skinof the trout fillet at close intervals,then season generously with sea saltand black pepper.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the butter in a non-stick fryingpan. When it starts to sizzle, carefullylay the fish in the pan, skin-side down.Gently fry for about 8 mins until theskin is crisp and golden and most ofthe flesh has changed colour withjust the top still raw.Carefully turn the fish fillets over, thensqueeze over the juice from one half ofthe lemon. Cook for 1 min more, bastingfish with the lemony pan juices. Turn offthe heat and leave the fish in the pan. Youare now ready to plate up – you can servethe other lemon half on the side if you like.Spoon a pile of the fricass\xe9einto the centre of each plate.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Place another spoonful ofthe mixture on top to createa small heap. Gently sit the fish filleton top, skin-side up. Spoon the caper dressingaround the outside of theplate and serve.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish on the menu? Try pairing with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The King Estate Signature Collection Pinot Gris with a 4.3 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light straw with emerald green hue. Aromas of green apple, citrus, honeysuckle, white peach, apricot and floral notes. Flavors of pear, melon, lemon and lime, wet stone, kiwi and honey. The palate has a soft, rich entry, nice texture, good weight and a long, lively crisp finish.', u'title': u'King Estate Signature Collection Pinot Gris', u'price': u'$15.99', u'id': 441154, u'link': u'https://www.wine.com/product/king-estate-signature-collection-pinot-gris-2011/116609', u'imageUrl': u'https://spoonacular.com/productImages/441154-312x231.jpg'}]}, u'aggregateLikes': 124, u'instructions': u'First make the dressing. Heat 1 tbspof the olive oil in a small saucepan. Addthe capers and the onion and cook for3 mins until softened. Splash in the redwine vinegar and bubble down, thenremove the pan from the heat. Addthe rest of the oil and the tarragon, thenleave to infuse.For the fricass\xe9e, heat the oil in a saut\xe9pan, add the chorizo and fry for 2 minsuntil it starts to crisp and render outred oil. Throw the potatoes and paprikain the pan and cook for 5 mins, tossingoccasionally, until they start to brown on the edges.Pour in the chicken stock, turn up theheat and boil the stock for 8-10 mins untilit has nearly all evaporated and thepotatoes are tender. Stir the peas intothe potatoes and cook for 2 mins moreuntil heated through, then set aside.Using a sharp knife, score the skinof the trout fillet at close intervals,then season generously with sea saltand black pepper.Heat the butter in a non-stick fryingpan. When it starts to sizzle, carefullylay the fish in the pan, skin-side down.Gently fry for about 8 mins until theskin is crisp and golden and most ofthe flesh has changed colour withjust the top still raw.Carefully turn the fish fillets over, thensqueeze over the juice from one half ofthe lemon. Cook for 1 min more, bastingfish with the lemony pan juices. Turn offthe heat and leave the fish in the pan. Youare now ready to plate up – you can servethe other lemon half on the side if you like.Spoon a pile of the fricass\xe9einto the centre of each plate. Place another spoonful ofthe mixture on top to createa small heap. Gently sit the fish filleton top, skin-side up. Spoon the caper dressingaround the outside of theplate and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/pan-fried-sea-trout-peas-chorizo-fricasse-211359', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}