{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/200194-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 200194, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dinner Tonight: Harissa and Yogurt-Marinated Chicken', u'diets': [u'gluten free', u'primal'], u'pricePerServing': 242.13, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 boneless chicken thighs or drumsticks', u'aisle': u'Meat', u'name': u'boneless chicken thighs', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 5091, u'unit': u''}, {u'originalString': u'2 generous tablespoons thick Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 1256, u'unit': u''}, {u'originalString': u'2 1/2 teaspoons harissa paste', u'aisle': u'Ethnic Foods', u'name': u'harissa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.5, u'consistency': u'solid', u'id': 1006972, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup torn mint leaves', u'aisle': u'Produce', u'name': u'mint leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'3 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'Salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2010/05/dinner-tonight-harissa-and-yogurt-marinated-chicken-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the harissa into the yogurt in a bowl, then whisk in the olive oil. The result will be somewhat curdled, which is what it should look like. Season to taste with salt and pepper, then coat the chicken pieces in the marinade and allow to sit for at least 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/harissa-paste.jpg', u'id': 1006972, u'name': u'harissa'}]}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill-pan.jpg', u'id': 404648, u'name': u'grill pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat a broiler, grill, or grill pan until very hot, then cook the chicken with the skin side towards the flame to crisp up the skin. I cooked it about 75 percent of the way there with the skin towards the heat source to ensure a great crust, then turned it just to finish.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Just as the chicken comes off the heat, scatter with the mint leaves so that they wilt from the heat of the chicken (if cooking under the broiler, you can send it back under the flame for a few moments to soften them).', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [], u'step': u'Serve immediately while juicy and sizzling.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 113, u'instructions': u'Procedures                                                                              1                                                                            Whisk the harissa into the yogurt in a bowl, then whisk in the olive oil. The result will be somewhat curdled, which is what it should look like. Season to taste with salt and pepper, then coat the chicken pieces in the marinade and allow to sit for at least 10 minutes.                                                                                                                            2                                                                            Heat a broiler, grill, or grill pan until very hot, then cook the chicken with the skin side towards the flame to crisp up the skin. I cooked it about 75 percent of the way there with the skin towards the heat source to ensure a great crust, then turned it just to finish.                                                                                                                            3                                                                            Just as the chicken comes off the heat, scatter with the mint leaves so that they wilt from the heat of the chicken (if cooking under the broiler, you can send it back under the flame for a few moments to soften them). Serve immediately while juicy and sizzling.', u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-tonight-harissa-and-yogurt-marinated-chicken-200194', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}