{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/475068-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 475068, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Eggs with Creamed Spinach {Cookbook of the Month }', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 134.68, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'6 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup freshly grated Parmigiano-Reggiano or grana padana', u'aisle': u'Cheese', u'name': u'grana padano', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1011033, u'unit': u'cup'}, {u'originalString': u'2/3 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 pound fresh spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'pound'}, {u'originalString': u'6 slices white bread, crusts removed, toasted and buttered, each slice cut into triangles', u'aisle': u'Bakery/Bread', u'name': u'white bread', u'metaInformation': [u'white', u'toasted', u'cut into triangles'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 6.0, u'consistency': u'solid', u'id': 18069, u'unit': u'slices'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.tasteandtellblog.com/cookbook-of-the-month-recipe-baked-eggs-with-creamed-spinach/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ramekin.jpg', u'id': 404781, u'name': u'ramekin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bring about 3 quarts of salted water to a rapid boil.Take the stems of the spinach leaves by pinching the leaf at the base between thumb and forefinger and pulling back the stem with the other hand so that you remove the stem where it runs up the center of the leaf instead of just breaking it off at the base. Wash the leaves thoroughly, plunge them in the boiling water, and simmer them until they “melt”, about 30 seconds. Immediately drain in a colander and rinse with cold water. Gently squeeze the leaves in small bunches to get rid of excess water. Slice the small bunches into 2 or 3 pieces each, so the spinach ends up coarsely chopped.Bring 1/4 cup of the cream to a simmer in a saute pan, season it with salt and pepper, and cook it down until it’s so thick it looks almost like a paste. Stir in the fresh-cooked spinach for about 30 seconds then turn off the heat.Use a brush or your finger to smear the insides of 6 ramekins or custard cups with the softened butter. Distribute the creamed spinach among the ramekins and crack an egg into each ramekin. Spoon the rest of the cream, about 1 tablespoon per ramekin, over the eggs. Sprinkle with salt and pepper and the grated Parmigiano-Reggiano.Line the bottom of a lidded saute pan with a kitchen towel, (to keep the ramekins from moving around, arrange the ramekins in the pan), and pour in enough water to come about one-third of the way up the sides of the ramekins.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the pan over high heat, and as soon as the water comes to the simmer, turn the heat down to low and cover the pan. Cook until the egg whites set but the yolks are still runny, 10 to 12 minutes. Because of the cream, the eggs may look runny on top, so judge doneness by quickly touching the egg white with your finger, not by how they look on top.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve on little folded napkins set on small plates, with the toasts passed at the table or arranged around the rim of each plate.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 54, u'instructions': u'Bring about 3 quarts of salted water to a rapid boil.Take the stems of the spinach leaves by pinching the leaf at the base between thumb and forefinger and pulling back the stem with the other hand so that you remove the stem where it runs up the center of the leaf instead of just breaking it off at the base. Wash the leaves thoroughly, plunge them in the boiling water, and simmer them until they “melt”, about 30 seconds. Immediately drain in a colander and rinse with cold water. Gently squeeze the leaves in small bunches to get rid of excess water. Slice the small bunches into 2 or 3 pieces each, so the spinach ends up coarsely chopped.Bring 1/4 cup of the cream to a simmer in a saute pan, season it with salt and pepper, and cook it down until it’s so thick it looks almost like a paste. Stir in the fresh-cooked spinach for about 30 seconds then turn off the heat.Use a brush or your finger to smear the insides of 6 ramekins or custard cups with the softened butter. Distribute the creamed spinach among the ramekins and crack an egg into each ramekin. Spoon the rest of the cream, about 1 tablespoon per ramekin, over the eggs. Sprinkle with salt and pepper and the grated Parmigiano-Reggiano.Line the bottom of a lidded saute pan with a kitchen towel, (to keep the ramekins from moving around, arrange the ramekins in the pan), and pour in enough water to come about one-third of the way up the sides of the ramekins. Put the pan over high heat, and as soon as the water comes to the simmer, turn the heat down to low and cover the pan. Cook until the egg whites set but the yolks are still runny, 10 to 12 minutes. Because of the cream, the eggs may look runny on top, so judge doneness by quickly touching the egg white with your finger, not by how they look on top. Serve on little folded napkins set on small plates, with the toasts passed at the table or arranged around the rim of each plate.', u'spoonacularSourceUrl': u'https://spoonacular.com/baked-eggs-with-creamed-spinach-cookbook-of-the-month--475068', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}