{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/344987-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 344987, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple Strudel', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 109.02, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/4 cup bourbon or apple juice', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9016, u'unit': u'cup'}, {u'originalString': u'1/2 cup brown sugar, packed', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 tablespoons butter, cut into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons butter, melted, for brushing phyllo sheets, plus more if needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted', u'plus more if needed', u'for brushing phyllo sheets, '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'Caramel sauce, purchased', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19364, u'unit': u'servings'}, {u'originalString': u"Confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 19336, u'unit': u'servings'}, {u'originalString': u"2 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1/2 cup golden raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'golden raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/golden-raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9297, u'unit': u'cup'}, {u'originalString': u'2 to 3 Granny Smith apples (about 1 pound), peeled, cored, halved, and thinly sliced', u'aisle': u'Produce', u'name': u'granny smith apples', u'metaInformation': [u'cored', u'peeled', u'halved', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1029003, u'unit': u'pound'}, {u'originalString': u'1 tablespoon granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon ground cinnamon, plus more for sprinkling', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [u'plus more for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/2 lemon, juiced', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 tablespoon lemon zest, finely chopped', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tablespoon'}, {u'originalString': u'3 1/2 tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'5 sheets phyllo dough from 1 pound package of frozen dough', u'aisle': u'Refrigerated;Frozen', u'name': u'phyllo dough', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'unitLong': u'sheets', u'unitShort': u'sheets', u'amount': 5.0, u'consistency': u'solid', u'id': 18338, u'unit': u'sheets'}, {u'originalString': u'1/2 cup crushed shortbread cookies', u'aisle': u'Sweet Snacks', u'name': u'shortbread cookies', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18192, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/paula-deen/apple-strudel-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, pour the bourbon or apple juice over the raisins and microwave on high for 45 seconds.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 9016, u'name': u'apple juice'}]}, {u'equipment': [], u'step': u'Let sit for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the raisins, apples, lemon juice, lemon zest, cinnamon, brown sugar, cookie crumbs, pecans, and butter in a large bowl.', u'number': 4, u'ingredients': [{u'image': None, u'id': 10018192, u'name': u'cookie crumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Remove the phyllo dough from the box, unfold, and cover with a damp towel.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/filo-dough.png', u'id': 18338, u'name': u'filo pastry'}]}, {u'equipment': [], u'step': u'Place 1 sheet of phyllo on the work surface and brush lightly with melted butter. Repeat with the remaining sheets, brushing each with melted butter, stacking when done, being sure to keep the unbuttered phyllo covered.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Place the apple mixture on the nearest third of the phyllo stack, being sure to leave a 2-inch border. Gently lift the bottom edge of the phyllo stack to cover the filling and fold the side edges over. Continue to roll the stack away from you until the filling is completely sealed in and the seam is on the bottom.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer to the prepared baking sheet.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the top with melted butter and sprinkle with granulated sugar.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Bake for 30 minutes, until golden brown.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u"Pour over the glaze and sprinkle with cinnamon and confectioners' sugar. Pass warm caramel sauce, to drizzle over the strudel.", u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [], u'step': u'Mix ingredients thoroughly.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u"*Cook's Note: If too thick add a little bit of milk. If too thin add a little bit of confectioners' sugar.", u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Strudel. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 11, u'instructions': u"Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper.                          In a small bowl, pour the bourbon or apple juice over the raisins and microwave on high for 45 seconds. Let sit for 15 minutes.                          Combine the raisins, apples, lemon juice, lemon zest, cinnamon, brown sugar, cookie crumbs, pecans, and butter in a large bowl.                          Remove the phyllo dough from the box, unfold, and cover with a damp towel. Place 1 sheet of phyllo on the work surface and brush lightly with melted butter. Repeat with the remaining sheets, brushing each with melted butter, stacking when done, being sure to keep the unbuttered phyllo covered.                          Place the apple mixture on the nearest third of the phyllo stack, being sure to leave a 2-inch border. Gently lift the bottom edge of the phyllo stack to cover the filling and fold the side edges over. Continue to roll the stack away from you until the filling is completely sealed in and the seam is on the bottom. Transfer to the prepared baking sheet. Brush the top with melted butter and sprinkle with granulated sugar.                          Bake for 30 minutes, until golden brown. Pour over the glaze and sprinkle with cinnamon and confectioners' sugar. Pass warm caramel sauce, to drizzle over the strudel.                          Mix ingredients thoroughly.                          *Cook's Note: If too thick add a little bit of milk. If too thin add a little bit of confectioners' sugar.", u'spoonacularSourceUrl': u'https://spoonacular.com/apple-strudel-344987', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 65, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}