{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/772363-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 772363, u'veryPopular': False, u'lowFodmap': False, u'title': u'Stinky Polenta, Roast Chicken, Crispy Kale, Red Wine Balsamic Demi', u'diets': [u'gluten free'], u'preparationMinutes': 45, u'pricePerServing': 753.01, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'cup'}, {u'originalString': u'2 bay leaves', u'aisle': u'Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'5 skin-on chicken breasts', u'aisle': u'Meat', u'name': u'bone in skin on chicken breasts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'liquid', u'id': 1005057, u'unit': u''}, {u'originalString': u'Canola oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1 carrot, diced', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 stalk celery, diced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery-leaves.jpg', u'unitLong': u'stalk', u'unitShort': u'stalk', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalk'}, {u'originalString': u'1 cup dark chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cup'}, {u'originalString': u'4 cups dark chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'3 sprigs fresh thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'sprigs', u'unitShort': u'sprigs', u'amount': 3.0, u'consistency': u'solid', u'id': 2049, u'unit': u'sprigs'}, {u'originalString': u'4 ounces Gorgonzola cheese, crumbled', u'aisle': u'Cheese', u'name': u'gorgonzola cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1011004, u'unit': u'ounces'}, {u'originalString': u'2 bunches kale, julienned', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'bunches', u'unitShort': u'bunches', u'amount': 2.0, u'consistency': u'solid', u'id': 11233, u'unit': u'bunches'}, {u'originalString': u'4 ounces mascarpone', u'aisle': u'Cheese', u'name': u'mascarpone', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 93820, u'unit': u'ounces'}, {u'originalString': u'Extra-virgin olive oil, for coating the pan', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'for coating the pan'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'Extra-virgin olive oil, for sweating the vegetables', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'for sweating the vegetables'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 ounces grated Parmigiano-Reggiano', u'aisle': u'Cheese', u'name': u'parmigiano reggiano', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1033, u'unit': u'ounces'}, {u'originalString': u'2 cups polenta', u'aisle': u'Pasta and Rice;Ethnic Foods;Baking', u'name': u'polenta', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10035137, u'unit': u'cups'}, {u'originalString': u'1 bottle red wine', u'aisle': u'Alcoholic Beverages', u'name': u'red wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'bottle', u'unitShort': u'bottle', u'amount': 1.0, u'consistency': u'liquid', u'id': 14096, u'unit': u'bottle'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 5.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon white truffle oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'truffle oil', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/truffle-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1024053, u'unit': u'tablespoon'}, {u'originalString': u'8 ounces (2 sticks) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounces'}], u'healthScore': 37.0, u'imageType': u'jpeg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/stinky-polenta-roast-chicken-crispy-kale-red-wine-balsamic-demi.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 61, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the roast chicken: Preheat the oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Season the chicken breasts with salt and pepper. Put a cast-iron pan over high heat until hot. Coat the pan with olive oil, add the chicken skin-side down and cook until the skin is crispy, about 7 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer the chicken to a baking sheet fitted with a rack. Roast until cooked through, 20 to 30 minutes depending on size.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'For the red wine balsamic demi: In a saucepan over high heat, add a little olive oil.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}]}, {u'equipment': [], u'step': u'Add the thyme, bay leaves, carrots, celery and onions and sweat the vegetables about 5 minutes. Deglaze with the red wine, then add the balsamic and dark chicken stock. Bring to a boil.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14096, u'name': u'red wine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [], u'step': u'Add the tomato paste and reduce to a simmer.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Add the sugar and simmer to reduce the sauce to a glaze consistency, 15 to 20 minutes. Strain and reserve.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"For the stinky polenta: Bring the dark chicken stock to a boil in a saucepan. Using a whisk, slowly incorporate the polenta into the stock, stirring vigorously. When fully incorporated, lower the heat to simmer. Cook, stirring frequently to make sure the polenta doesn't burn, until thickened, 10 to 15 minutes.", u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 10035137, u'name': u'polenta'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour enough canola oil into a large heavy-bottomed saucepan to come about a third of the way up.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'canola oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}], u'step': u'Heat the oil until a deep-frying thermometer inserted in the oil reaches 325 degrees F.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add the julienned kale to the oil and fry about 2 minutes; the kale should still be very green and crisp, not brown at all.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels and set aside for garnish.', u'number': 4, u'ingredients': []}], u'name': u'For the crispy kale'}, {u'steps': [{u'equipment': [], u'step': u'Add the butter, Gorgonzola, Parmigiano-Reggiano, mascarpone and additional water or the chicken cooking juices if needed. Finish with the white truffle oil and add salt and pepper to taste.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'id': 1011004, u'name': u'gorgonzola'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'To plate, spoon about 3 tablespoons of the glaze into 5 wide bowls. Put some polenta on top. Slice each chicken breast and put on top of the polenta.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 10035137, u'name': u'polenta'}]}, {u'equipment': [], u'step': u'Garnish with crispy kale and serve.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}], u'name': u'To finish the polenta'}], u'aggregateLikes': 15, u'instructions': u"For the roast chicken: Preheat the oven to 350 degrees F.                          Season the chicken breasts with salt and pepper. Put a cast-iron pan over high heat until hot. Coat the pan with olive oil, add the chicken skin-side down and cook until the skin is crispy, about 7 minutes. Transfer the chicken to a baking sheet fitted with a rack. Roast until cooked through, 20 to 30 minutes depending on size.                          For the red wine balsamic demi: In a saucepan over high heat, add a little olive oil. Add the thyme, bay leaves, carrots, celery and onions and sweat the vegetables about 5 minutes. Deglaze with the red wine, then add the balsamic and dark chicken stock. Bring to a boil. Add the tomato paste and reduce to a simmer. Add the sugar and simmer to reduce the sauce to a glaze consistency, 15 to 20 minutes. Strain and reserve.                          For the stinky polenta: Bring the dark chicken stock to a boil in a saucepan. Using a whisk, slowly incorporate the polenta into the stock, stirring vigorously. When fully incorporated, lower the heat to simmer. Cook, stirring frequently to make sure the polenta doesn't burn, until thickened, 10 to 15 minutes.                          For the crispy kale: Pour enough canola oil into a large heavy-bottomed saucepan to come about a third of the way up. Heat the oil until a deep-frying thermometer inserted in the oil reaches 325 degrees F.                          Add the julienned kale to the oil and fry about 2 minutes; the kale should still be very green and crisp, not brown at all. Drain on paper towels and set aside for garnish.                          To finish the polenta: Add the butter, Gorgonzola, Parmigiano-Reggiano, mascarpone and additional water or the chicken cooking juices if needed. Finish with the white truffle oil and add salt and pepper to taste.                          To plate, spoon about 3 tablespoons of the glaze into 5 wide bowls. Put some polenta on top. Slice each chicken breast and put on top of the polenta. Garnish with crispy kale and serve.", u'spoonacularSourceUrl': u'https://spoonacular.com/stinky-polenta-roast-chicken-crispy-kale-red-wine-balsamic-demi-772363', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}