{u'recipes': [{u'sourceName': u'Sugar Dish Me', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/517749-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 517749, u'veryPopular': True, u'lowFodmap': False, u'title': u'Creamy Garlic Mashed Potatoes', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 53.05, u'creditText': u'Sugar Dish Me', u'extendedIngredients': [{u'originalString': u'fresh chopped parsley and unsalted butter to garnish', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'fresh', u'unsalted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'2-3 cloves garlic, minced (about 3 teaspoons)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1 teaspoon kosher salt (more to taste)', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste', u'(more )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup sour cream (I opt for low fat; it tastes the same in potatoes!)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat sour cream', u'metaInformation': [u'sour', u'low fat', u'for ; it tastes the same in potatoes!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1179, u'unit': u'cup'}, {u'originalString': u'\xbc- 1/2 cup milk, as needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'\xbd cup plain Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'4 large Russett poatoes, scrubbed, peeled, and cut into uniform pieces, about 3" each', u'aisle': u'?', u'name': u'russett poatoes', u'metaInformation': [u'large', u'peeled', u'scrubbed', u'cut into uniform pieces, 3" each'], u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 15.0, u'sourceUrl': u'http://www.sugardishme.com/2013/07/25/creamy-garlic-mashed-potatoes/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u"Place the potato pieces in a large stock pot and cover them plus another couple of inches with cold water (you can salt the water if you'd like-- no more than a teaspoon or two).Bring the pot to a boil and cook for 15-20 minutes-- the time will depend on the size of your pieces. You'll know they are done when you can easily cut them with the side of a spoon. Careful not to overcook them or they will be a starchy mess.", u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain the potatoes, place them back in the stock pot, and set aside.In a small skillet, heat the olive oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u"Add the garlic and toast it-- just until it turns golden. The garlic should only cook for about a minute. Don't let it burn!", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Pour the oil and garlic over the hot drained potatoes.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}], u'step': u'Add the Greek yogurt, sour cream, and salt.Grab your potato masher and get to work! They will be creamy as soon as the ingredients begin to combine.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Drizzle in the milk a little at a time only adding JUST ENOUGH to reach your desired consistency. Continue mixing and mashing until your potatoes are creamy and fluffy.If you like whipped potatoes, you can get out your hand mixer and beat the potatoes until they are fluffy, adding more milk if necessary.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Serve hot and garnish with a sprinkle of fresh parsley and a pat of butter.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 512, u'instructions': u"Place the potato pieces in a large stock pot and cover them plus another couple of inches with cold water (you can salt the water if you'd like-- no more than a teaspoon or two).Bring the pot to a boil and cook for 15-20 minutes-- the time will depend on the size of your pieces. You'll know they are done when you can easily cut them with the side of a spoon. Careful not to overcook them or they will be a starchy mess. Drain the potatoes, place them back in the stock pot, and set aside.In a small skillet, heat the olive oil. Add the garlic and toast it-- just until it turns golden. The garlic should only cook for about a minute. Don't let it burn!Pour the oil and garlic over the hot drained potatoes. Add the Greek yogurt, sour cream, and salt.Grab your potato masher and get to work! They will be creamy as soon as the ingredients begin to combine. Drizzle in the milk a little at a time only adding JUST ENOUGH to reach your desired consistency. Continue mixing and mashing until your potatoes are creamy and fluffy.If you like whipped potatoes, you can get out your hand mixer and beat the potatoes until they are fluffy, adding more milk if necessary.Serve hot and garnish with a sprinkle of fresh parsley and a pat of butter.", u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-garlic-mashed-potatoes-517749', u'dishTypes': [u'side dish'], u'occasions': [u'thanksgiving', u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}