{u'recipes': [{u'sourceName': u'Love and Olive Oil', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/836057-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 836057, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eggnog Rice Krispie Treats', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 25.08, u'creditText': u'Love and Olive Oil', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'8 cups (16 oz) mini marshmallows, divided', u'aisle': u'Baking', u'name': u'marshmallows', u'metaInformation': [u'mini', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 19116, u'unit': u'oz'}, {u'originalString': u'7 cups rice krispies cereal', u'aisle': u'Cereal', u'name': u'rice krispies cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 7.0, u'consistency': u'solid', u'id': 8065, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon rum extract', u'aisle': u'Baking', u'name': u'rum extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 12211111, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'5 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.loveandoliveoil.com/2016/12/eggnog-rice-krispie-treats.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Lightly butter the bottom and sides of a 13-by-9-inch square baking pan (halve this recipe for an 8-by-8-inch pan). Line bottom and long sides with a strip of aluminum foil; lightly butter foil. In a large saucepan, melt butter over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add 6 cups of mini marshmallows and stir until melted and smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marshmallows-mini.png', u'id': 10119116, u'name': u'mini marshmallows'}]}, {u'equipment': [], u'step': u"Remove from heat and stir in salt, rum extract, and nutmeg. Fold in rice krispies until evenly coated (be somewhat gentle with them so they don't crush). Fold in remaining 2 cups marshmallows.", u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 12211111, u'name': u'rum extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread into prepared pan, pressing into an even layer. If it helps, lightly butter your hands or the spatula and use that to press the mixture into the pan without sticking. If you want to top the bars with sprinkles, do so while they are still slightly warm and sticky.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool completely before slicing into bars. Treats are best enjoyed the day they are made, but will keep for up to 3 days in an airtight container.', u'number': 5, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 267, u'instructions': u"Lightly butter the bottom and sides of a 13-by-9-inch square baking pan (halve this recipe for an 8-by-8-inch pan). Line bottom and long sides with a strip of aluminum foil; lightly butter foil. In a large saucepan, melt butter over medium-high heat. Add 6 cups of mini marshmallows and stir until melted and smooth. Remove from heat and stir in salt, rum extract, and nutmeg. Fold in rice krispies until evenly coated (be somewhat gentle with them so they don't crush). Fold in remaining 2 cups marshmallows. Spread into prepared pan, pressing into an even layer. If it helps, lightly butter your hands or the spatula and use that to press the mixture into the pan without sticking. If you want to top the bars with sprinkles, do so while they are still slightly warm and sticky. Let cool completely before slicing into bars. Treats are best enjoyed the day they are made, but will keep for up to 3 days in an airtight container.", u'spoonacularSourceUrl': u'https://spoonacular.com/eggnog-rice-krispie-treats-836057', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}