{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/383155-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 383155, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheese Quesadillas', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 109.7, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'4 flour tortillas (8 inches), warmed', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [u'warmed', u'(es)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'8-inchs', u'unitShort': u'8-inch', u'amount': 4.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'8-inch'}, {u'originalString': u'1/2 cup salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'1-1/2 cups (6 ounces) shredded Mexican cheese blend', u'aisle': u'Cheese', u'name': u'shredded mexican cheese blend', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1251, u'unit': u'ounces'}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cheese-quesadillas-2', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the tortillas on a greased baking sheet.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Combine the cheese and salsa; spread over half of each tortilla. Fold over.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [], u'step': u'Broil 4 in. from the heat for 3 minutes on each side or until golden brown.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into wedges.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Quesadillan on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Mark West Black Label Monterey County Pinot Noir. It has 4.1 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"The deepest, darkest, smoothest Pinot in Mark West's collection, with notes of black cherries, plums, mocha, vanilla, and caramel.Pairs perfectly with grilled lamb chops, gourmet flatbread pizza, and pulled pork sandwiches.", u'title': u'Mark West Black Label Monterey County Pinot Noir', u'price': u'$12.99', u'id': 437001, u'link': u'https://www.wine.com/product/mark-west-black-label-monterey-county-pinot-noir-2016/235737', u'imageUrl': u'https://spoonacular.com/productImages/437001-312x231.jpg'}]}, u'aggregateLikes': 77, u'instructions': u'Directions                                                                                Place the tortillas on a greased baking sheet. Combine the cheese and salsa; spread over half of each tortilla. Fold over.                                                                                            Broil 4 in. from the heat for 3 minutes on each side or until golden brown. Cut into wedges.                                        Yield: 4 servings.                                                                                                                         Originally published as Cheese Quesadillas in  Simple & DeliciousSeptember/October 2007, p19                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cheese-quesadillas-383155', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}