{u'recipes': [{u'sourceName': u'The Healthy Foodie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619843-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 619843, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mongolian Beef over Cauliflower Rice – A Right Out of The Paleo Kitchen', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal'], u'pricePerServing': 555.81, u'creditText': u'The Healthy Foodie', u'extendedIngredients': [{u'originalString': u'1 tablespoon arrowroot powder', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20003, u'unit': u'tablespoon'}, {u'originalString': u'1 small head cauliflower, grated', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'grated', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u'head'}, {u'originalString': u'\xbd cup (120 ml) coconut aminos', u'aisle': u'Health Foods;Condiments', u'name': u'coconut aminos', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 120.0, u'consistency': u'liquid', u'id': 98929, u'unit': u'ml'}, {u'originalString': u'1 tablespoon coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoon'}, {u'originalString': u'1 pound (455 grams) flank steak, thinly sliced against the grain', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 455.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'grams'}, {u'originalString': u'\xbd teaspoon grated fresh ginger', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 green onion, sliced, for garnish', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'sliced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1/2 teaspoon freshly cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon Himalayan salt', u'aisle': u'Spices and Seasonings;Gourmet', u'name': u'pink himalayan salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/himalayan-pink-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032047, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup (60 ml) raw honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'raw honey', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 60.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'ml'}, {u'originalString': u'\xbd teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'pinch of Himalayan salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'pinch'}, {u'originalString': u'1 teaspoon toasted sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons sesame seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12023, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon unseasoned rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'unseasoned rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 medium yellow onion, finely chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 44.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://thehealthyfoodie.com/mongolian-beef-cauliflower-rice-recipe-right-paleo-kitchen/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the coconut oil in a large pan over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the onion and cook for 2 minutes. Meanwhile, add the coconut aminos, honey, garlic, ginger, red pepper flakes and a pinch of salt and pepper to a glass measuring cup and mix with a flat whisk until well combined.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 98929, u'name': u'coconut aminos'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour that mixture in the pan with the onions and let it come to a boil.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the arrowroot powder to the pan while continuously whisking until the mixture is thickened, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20003, u'name': u'arrowroot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the steak slices in the pan with the sauce, distributing them throughout the pan so as not to overcrowd them. Simmer the meat in the sauce for 4-5 minutes, or until no red meat is apparent. Once the meat has cooked through, place over cauliflower rice and top with chopped green onion.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 10111135, u'name': u'cauliflower rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u'Add riced cauliflower, rice vinegar and sesame oil and continue cooking for an additional 5-8 minutes, until cauliflower is cooked but remains a tad crunchy. Kill the heat and set aside. While the rice cooks, make the Mongolian beef'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the cauliflower into small florets and place in the bowl of your food processor. Pulse a few quick times (about 10 to 15) until it resembles the texture of rice', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'id': 11135, u'name': u'cauliflower'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the coconut oil to a large skillet set over medium heat and cook the onion, garlic, sesame seeds, salt and pepper until fragrant, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u'First, make the cauliflower rice'}], u'aggregateLikes': 144, u'instructions': u'First, make the cauliflower rice: Cut the cauliflower into small florets and place in the bowl of your food processor. Pulse a few quick times (about 10 to 15) until it resembles the texture of riceAdd the coconut oil to a large skillet set over medium heat and cook the onion, garlic, sesame seeds, salt and pepper until fragrant, about 5 minutes.Add riced cauliflower, rice vinegar and sesame oil and continue cooking for an additional 5-8 minutes, until cauliflower is cooked but remains a tad crunchy. Kill the heat and set aside. While the rice cooks, make the Mongolian beef: Heat the coconut oil in a large pan over medium heat. Add the onion and cook for 2 minutes. Meanwhile, add the coconut aminos, honey, garlic, ginger, red pepper flakes and a pinch of salt and pepper to a glass measuring cup and mix with a flat whisk until well combined. Pour that mixture in the pan with the onions and let it come to a boil. Add the arrowroot powder to the pan while continuously whisking until the mixture is thickened, about 2 minutes. Place the steak slices in the pan with the sauce, distributing them throughout the pan so as not to overcrowd them. Simmer the meat in the sauce for 4-5 minutes, or until no red meat is apparent. Once the meat has cooked through, place over cauliflower rice and top with chopped green onion.', u'spoonacularSourceUrl': u'https://spoonacular.com/mongolian-beef-over-cauliflower-rice-a-right-out-of-the-paleo-kitchen-619843', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}