{u'recipes': [{u'sourceName': u'Sallys Baking Addiction', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573336-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 573336, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crispy Baked Onion Rings', u'diets': [], u'preparationMinutes': 745, u'pricePerServing': 144.38, u'creditText': u'Sallys Baking Addiction', u'extendedIngredients': [{u'originalString': u'4 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'3/4 cup (125g) ground cornmeal', u'aisle': u'Ethnic Foods;Baking', u'name': u'ground cornmeal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 35137, u'unit': u'g'}, {u'originalString': u'1 quart (950ml) low fat buttermilk*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat buttermilk', u'metaInformation': [u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 950.0, u'consistency': u'solid', u'id': 1088, u'unit': u'ml'}, {u'originalString': u'1 cup (60g) panko bread crumbs*', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 10018079, u'unit': u'g'}, {u'originalString': u'1/2 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 large sweet onions, cut into 1/2 inch slices', u'aisle': u'Produce', u'name': u'sweet onions', u'metaInformation': [u'sweet', u'large', u'cut into 1/2 inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'2/3 cup (85g) whole wheat flour (or all-purpose)', u'aisle': u'Baking', u'name': u'whole wheat flour', u'metaInformation': [u'whole wheat', u'all-purpose', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 20080, u'unit': u'g'}], u'healthScore': 39.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://sallysbakingaddiction.com/2014/01/07/crispy-baked-onion-rings/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"At least 4 hours ahead of time, place the sliced onion rings into a large dish and pour buttermilk overtop. You don't have to drown the onions, just make sure they are somewhat submerged. Cover tightly and store in the refrigerator. See my photo above. In this step, you are soaking the onions, which will tenderize them. I strongly suggest soaking them for at least 12 hours for the best taste. I soaked mine overnight.Once the onions have soaked, remove from the refrigerator. Set aside.Preheat oven to 425F degrees. Line two large baking sheets with parchment paper or silicone baking mats. In a medium bowl, beat the egg whites. Set aside. In a large shallow dish (I used a pie dish), mix the whole wheat flour, cornmeal, bread crumbs, and the seasonings together until combined.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20080, u'name': u'whole wheat flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Remove each ring from the buttermilk and dip in egg whites. Immediately submerge in the bread crumb mixture, mixing around to coat the onion well. If the bread crumbs won’t adhere, dip in egg whites and then the breading again. If you find you need more breading, make more.Lay each breaded ring on the baking sheets in a single layer. You\'ll have two batches if your onions were quite large like mine. When all the rings are breaded, spray each with nonstick spray to "seal" the breading, which will prevent the breading from staying raw and allows it to bake onto the onion rings.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Bake each batch for 15 minutes, remove from the oven and flip each ring using tongs. Spray the other side with nonstick spray. Then bake for 15 more minutes. A note about bake time:\xa0all ovens are different! And everyone likes a different level of crispiness. I baked my onion rings in my oven for 30 minutes, rotating and flipping once, and they were perfectly brown and crisp. Just bake the rings until they reach your desired level of brownness.Allow the onion rings to sit out for 10 minutes before digging in. Enjoy immediately.', u'length': {u'number': 70, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 72780, u'instructions': u'At least 4 hours ahead of time, place the sliced onion rings into a large dish and pour buttermilk overtop. You don\'t have to drown the onions, just make sure they are somewhat submerged. Cover tightly and store in the refrigerator. See my photo above. In this step, you are soaking the onions, which will tenderize them. I strongly suggest soaking them for at least 12 hours for the best taste. I soaked mine overnight.Once the onions have soaked, remove from the refrigerator. Set aside.Preheat oven to 425F degrees. Line two large baking sheets with parchment paper or silicone baking mats. In a medium bowl, beat the egg whites. Set aside. In a large shallow dish (I used a pie dish), mix the whole wheat flour, cornmeal, bread crumbs, and the seasonings together until combined.Remove each ring from the buttermilk and dip in egg whites. Immediately submerge in the bread crumb mixture, mixing around to coat the onion well. If the bread crumbs won’t adhere, dip in egg whites and then the breading again. If you find you need more breading, make more.Lay each breaded ring on the baking sheets in a single layer. You\'ll have two batches if your onions were quite large like mine. When all the rings are breaded, spray each with nonstick spray to "seal" the breading, which will prevent the breading from staying raw and allows it to bake onto the onion rings.Bake each batch for 15 minutes, remove from the oven and flip each ring using tongs. Spray the other side with nonstick spray. Then bake for 15 more minutes. A note about bake time:\xa0all ovens are different! And everyone likes a different level of crispiness. I baked my onion rings in my oven for 30 minutes, rotating and flipping once, and they were perfectly brown and crisp. Just bake the rings until they reach your desired level of brownness.Allow the onion rings to sit out for 10 minutes before digging in. Enjoy immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/crispy-baked-onion-rings-573336', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 775, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}