{u'recipes': [{u'sourceName': u'Little Spice Jar', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/666564-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 666564, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Chicken Wild Rice Soup {Slow Cooker}', u'diets': [], u'pricePerServing': 128.87, u'creditText': u'Little Spice Jar', u'extendedIngredients': [{u'originalString': u'\xbd cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'\xbe cup carrots, chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'\xbe cup celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'4-5 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'6 cups low sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'2 cups milk (see note)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 tablespoons olive oil (or substitute more butter)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'(or substitute more butter)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 cup onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 tablespoons salt-free poultry seasoning', u'aisle': u'Spices and Seasonings', u'name': u'poultry seasoning', u'metaInformation': [u'salt-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2034, u'unit': u'tablespoons'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 pound boneless, skinless chicken breast', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 cup uncooked wild rice', u'aisle': u'Pasta and Rice', u'name': u'wild rice', u'metaInformation': [u'wild', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-wild-uncooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20088, u'unit': u'cup'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 65.0, u'sourceUrl': u'http://www.littlespicejar.com/creamy-chicken-wild-rice-soup-slow-cooker/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse wild rice under running water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-wild-uncooked.png', u'id': 20088, u'name': u'wild rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place the uncooked rice, chicken breast, onions, celery, carrots, garlic, bay leaves, chicken broth, water, and poultry seasoning in a slow cooker. Cover and cook on the high setting for 3-4 hours or on the low setting for 7-8. In the last  hour of cooking, remove the chicken from the slow cooker. Allow to cool slightly before shredding using two forks.When the rice is done cooking, add the shredded chicken back into the slow cooker. Melt the butter and oil in a saucepan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/seasoning.jpg', u'id': 2034, u'name': u'poultry seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the flour and let the mixture cook for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk the mixture slowly while adding in the milk. Continue to whisk until all lumps have dissolved. Allow the mixture to thicken and become creamy.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add this creamy mixture to the slow cooker. Stir to combine.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add additional water or milk to your preference if the consistency is too thick. Season with salt and pepper to taste.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken on the menu? Try pairing with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'apple , pear , lemon', u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 80, u'instructions': u'Rinse wild rice under running water. Place the uncooked rice, chicken breast, onions, celery, carrots, garlic, bay leaves, chicken broth, water, and poultry seasoning in a slow cooker. Cover and cook on the high setting for 3-4 hours or on the low setting for 7-8. In the last  hour of cooking, remove the chicken from the slow cooker. Allow to cool slightly before shredding using two forks.When the rice is done cooking, add the shredded chicken back into the slow cooker. Melt the butter and oil in a saucepan. Add the flour and let the mixture cook for 1 minute. Whisk the mixture slowly while adding in the milk. Continue to whisk until all lumps have dissolved. Allow the mixture to thicken and become creamy.Add this creamy mixture to the slow cooker. Stir to combine. Add additional water or milk to your preference if the consistency is too thick. Season with salt and pepper to taste.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-chicken-wild-rice-soup-slow-cooker-666564', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}