{u'recipes': [{u'sourceName': u'Jans Sushi Bar', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/476835-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 476835, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pork, Cabbage and Apple Skillet', u'diets': [u'gluten free'], u'pricePerServing': 274.52, u'creditText': u'Jans Sushi Bar', u'extendedIngredients': [{u'originalString': u'1/4 cup apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 2048, u'unit': u'cup'}, {u'originalString': u'4 ounces bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'ounces'}, {u'originalString': u'3/4 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 medium cabbage, thinly sliced', u'aisle': u'Produce', u'name': u'cabbage', u'metaInformation': [u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11109, u'unit': u''}, {u'originalString': u'1 1/2 teaspoons caraway seeds', u'aisle': u'Spices and Seasonings', u'name': u'caraway seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caraway-seeds.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2005, u'unit': u'teaspoons'}, {u'originalString': u'3 tablespoons ghee or clarified butter', u'aisle': u'Ethnic Foods', u'name': u'clarified butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93632, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon coconut sugar (optional)', u'aisle': u'Baking', u'name': u'coconut sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93831, u'unit': u'tablespoon'}, {u'originalString': u'1 medium onion, thinly sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 pounds pork loin, trimmed of fat, cut into 1/2-inch pieces', u'aisle': u'Meat', u'name': u'pork loin', u'metaInformation': [u'trimmed of fat', u'cut into 1/2-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 10225, u'unit': u'pounds'}, {u'originalString': u'1 1/2 teaspoons kosher sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoons'}, {u'originalString': u'2 medium tart apples, peeled and thinly sliced', u'aisle': u'Produce', u'name': u'tart apples', u'metaInformation': [u'medium', u'peeled', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}], u'healthScore': 28.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.janssushibar.com/pork-cabbage-apple-skillet/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook the bacon over medium heat in a large skillet or Dutch oven until crisp.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove with a slotted spoon and transfer to paper towels to drain.Increase the heat to medium high. Lightly sprinkle the pork with salt and pepper and add to the bacon fat in the pan. Cook, stirring frequently, until lightly browned on the outside, but still pink in the center, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pork from the pan with a slotted spoon; cover and set aside.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the ghee, cabbage, onion, apple, reserved bacon, salt, pepper, caraway seeds, vinegar and coconut sugar, if using, to the pan. Toss to combine and cook, stirring occasionally, until the cabbage is almost completely wilted, about 7 to 10 minutes. Reduce the heat to medium and continue cooking, stirring frequently, until the cabbage is beginning to brown and caramelize, another 10 to 15 minutes.Return the pork, along with any accumulated pan juices, to the skillet and toss with the cabbage mixture. Continue cooking until the pork is cooked through, another 5 to 7 minutes.Taste and adjust seasoning, if needed, and serve.Nutrition (per serving): 405 calories, 19.8g total fat, 127.9mg cholesterol, 730.9mg sodium, 966.4mg potassium, 17.8g carbohydrates, 4.9g fiber, 11.2g sugar, 38.5g protein', u'length': {u'number': 22, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/caraway-seeds.jpg', u'id': 2005, u'name': u'caraway seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-sugar.jpg', u'id': 93831, u'name': u'coconut sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ghee.jpg', u'id': 93632, u'name': u'ghee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 184, u'instructions': u'Cook the bacon over medium heat in a large skillet or Dutch oven until crisp. Remove with a slotted spoon and transfer to paper towels to drain.Increase the heat to medium high. Lightly sprinkle the pork with salt and pepper and add to the bacon fat in the pan. Cook, stirring frequently, until lightly browned on the outside, but still pink in the center, about 5 minutes. Remove the pork from the pan with a slotted spoon; cover and set aside.Add the ghee, cabbage, onion, apple, reserved bacon, salt, pepper, caraway seeds, vinegar and coconut sugar, if using, to the pan. Toss to combine and cook, stirring occasionally, until the cabbage is almost completely wilted, about 7 to 10 minutes. Reduce the heat to medium and continue cooking, stirring frequently, until the cabbage is beginning to brown and caramelize, another 10 to 15 minutes.Return the pork, along with any accumulated pan juices, to the skillet and toss with the cabbage mixture. Continue cooking until the pork is cooked through, another 5 to 7 minutes.Taste and adjust seasoning, if needed, and serve.Nutrition (per serving): 405 calories, 19.8g total fat, 127.9mg cholesterol, 730.9mg sodium, 966.4mg potassium, 17.8g carbohydrates, 4.9g fiber, 11.2g sugar, 38.5g protein', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-cabbage-and-apple-skillet-476835', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}