{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/599785-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 599785, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chorizo Breakfast Tacos', u'diets': [u'gluten free'], u'preparationMinutes': 35, u'pricePerServing': 240.16, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1/2 pound Mexican chorizo', u'aisle': u'Meat', u'name': u'chorizo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 7019, u'unit': u'pound'}, {u'originalString': u'1/2 cup chopped fresh cilantro leaves and stems', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'8 corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'4 ounces (about 1 cup) Cotija cheese (or substitute feta, ricotta salata, Parmesan, Romano, or even Cheddar or Monterey Jack), crumbled or grated', u'aisle': u'Cheese', u'name': u'cotija cheese', u'metaInformation': [u'grated', u'crumbled', u'(or substitute feta, ricotta salata, Parmesan, Romano, or even Cheddar or Monterey Jack)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001019, u'unit': u'cup'}, {u'originalString': u'8 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Kosher salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Extra-virgin olive oil, as needed', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'as needed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'2 radishes, trimmed and thinly sliced', u'aisle': u'Produce', u'name': u'radishes', u'metaInformation': [u'trimmed', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radishes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11429, u'unit': u''}, {u'originalString': u'2 tablespoons (1 ounce) unsalted butter, at room temperature, plus more as needed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'as needed', u'plus more ', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'ounce'}, {u'originalString': u'1 pound Yukon Gold potatoes, peeled and cut into 1/2-inch dice', u'aisle': u'Produce', u'name': u'yukon gold potatoes', u'metaInformation': [u'peeled', u'cut into 1/2-inch dice'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 10211362, u'unit': u'pound'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 84.0, u'sourceUrl': u'http://leitesculinaria.com/94367/recipes/courses/breakfast-chorizo-breakfast-tacos.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 28, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/colander.jpg', u'id': 404639, u'name': u'colander'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Plunk the potatoes in a saucepan and add enough cold water to cover along with a teaspoon salt. Bring to a boil. Immediately drain the potatoes in a colander in the sink and rinse them under cold running water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer the potatoes to a plate lined with paper towels to drain, changing towels if necessary, until the potatoes are very dry and completely cool. (You can cover and refrigerate the potatoes overnight.)2.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large, heavy-bottomed skillet over medium-high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the chorizo, spread evenly around the skillet, and cook, without stirring, until nicely caramelized on the bottom, 3 to 5 minutes. (If your chorizo is very lean, drizzle a little olive oil into the skillet to prevent it from sticking.) Stir to get the uncooked parts of the chorizo in contact with the skillet and continue cooking until all the meat is cooked through, about 5 minutes more. Using a slotted spoon, transfer the chorizo to a large bowl.3. If the skillet looks dry, add more oil to the fat in the skillet and heat over medium-high heat.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Spread the potatoes evenly in the skillet and cook, stirring and turning gently with a spatula, until golden brown on all sides, about 10 minutes. Dump the potatoes into the bowl with the chorizo and mix gently. Taste and adjust the seasoning.4.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour off any excess fat in the skillet into a small heatproof bowl.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the skillet over medium heat. One at a time, add the tortillas and fry on each side until they soften and blister slightly, about 30 seconds per side. If the skillet dries out, add a wee small amount of the reserved fat (or, if there wasn’t any fat to reserve, a little olive oil). Keep the tortillas warm by stacking them and wrapping them in a kitchen towel as they come out of the skillet.5. In a small nonstick skillet, heat 1 teaspoon olive oil over medium-high heat. When the oil is hot, add a scant teaspoon butter and swirl the skillet to mix the fats. Crack an egg into the skillet and cook until the white is just set, about 3 minutes. Slide the egg carefully onto a platter you’ve rinsed with hot water and cover to keep warm. Repeat to cook the remaining eggs in the remaining butter, adding more oil as needed.6. To assemble the tacos, place 2 warm tortillas on each plate and spoon a few tablespoons chorizo and potatoes in the middle of each tortilla. Top each with a fried egg and radish slices. Finish with a big pinch cilantro and a sprinkle Cotija.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chorizo.jpg', u'id': 7019, u'name': u'chorizo'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/radishes.jpg', u'id': 11429, u'name': u'radish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Serve right away. Repeat until your hangover is gone or you can’t eat anymore. Then take a nap.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Tacos can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Garnet Monterey Pinot Noir with a 4.2 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"This is a Pinot with power, but also with finesse. Aromas include ripe blackberries, cherry preserves, vanilla toffee and toasted French oak. You'll love the velvety richness of the attack. The flavors of dark red fruits and exotic spices just make this a juicy, delicious mouthful of wine.", u'title': u'Garnet Monterey Pinot Noir', u'price': u'$15.99', u'id': 444323, u'link': u'https://www.wine.com/product/garnet-monterey-pinot-noir-2011/123633', u'imageUrl': u'https://spoonacular.com/productImages/444323-312x231.jpg'}]}, u'aggregateLikes': 54, u'instructions': u'1. Plunk the potatoes in a saucepan and add enough cold water to cover along with a teaspoon salt. Bring to a boil. Immediately drain the potatoes in a colander in the sink and rinse them under cold running water. Transfer the potatoes to a plate lined with paper towels to drain, changing towels if necessary, until the potatoes are very dry and completely cool. (You can cover and refrigerate the potatoes overnight.)2. Heat a large, heavy-bottomed skillet over medium-high heat. Add the chorizo, spread evenly around the skillet, and cook, without stirring, until nicely caramelized on the bottom, 3 to 5 minutes. (If your chorizo is very lean, drizzle a little olive oil into the skillet to prevent it from sticking.) Stir to get the uncooked parts of the chorizo in contact with the skillet and continue cooking until all the meat is cooked through, about 5 minutes more. Using a slotted spoon, transfer the chorizo to a large bowl.3. If the skillet looks dry, add more oil to the fat in the skillet and heat over medium-high heat. Spread the potatoes evenly in the skillet and cook, stirring and turning gently with a spatula, until golden brown on all sides, about 10 minutes. Dump the potatoes into the bowl with the chorizo and mix gently. Taste and adjust the seasoning.4. Pour off any excess fat in the skillet into a small heatproof bowl. Place the skillet over medium heat. One at a time, add the tortillas and fry on each side until they soften and blister slightly, about 30 seconds per side. If the skillet dries out, add a wee small amount of the reserved fat (or, if there wasn’t any fat to reserve, a little olive oil). Keep the tortillas warm by stacking them and wrapping them in a kitchen towel as they come out of the skillet.5. In a small nonstick skillet, heat 1 teaspoon olive oil over medium-high heat. When the oil is hot, add a scant teaspoon butter and swirl the skillet to mix the fats. Crack an egg into the skillet and cook until the white is just set, about 3 minutes. Slide the egg carefully onto a platter you’ve rinsed with hot water and cover to keep warm. Repeat to cook the remaining eggs in the remaining butter, adding more oil as needed.6. To assemble the tacos, place 2 warm tortillas on each plate and spoon a few tablespoons chorizo and potatoes in the middle of each tortilla. Top each with a fried egg and radish slices. Finish with a big pinch cilantro and a sprinkle Cotija. Serve right away. Repeat until your hangover is gone or you can’t eat anymore. Then take a nap.', u'spoonacularSourceUrl': u'https://spoonacular.com/chorizo-breakfast-tacos-599785', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}