{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/772225-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 772225, u'veryPopular': False, u'lowFodmap': False, u'title': u'Steakhouse Rib Eyes with Creamed Spinach', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 161.56, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup 2-percent or whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'2 percent milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1174, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon cayenne pepper, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'Coarse kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons chopped fresh flat-leaf parsley', u'aisle': u'Produce', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'2 packages (10 ounces each) frozen chopped spinach, thawed and well drained', u'aisle': u'Frozen', u'name': u'frozen spinach', u'metaInformation': [u'frozen', u'thawed', u'drained', u'chopped', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 11463, u'unit': u'ounces'}, {u'originalString': u'1/4 teaspoon freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons pure olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'2 bone-in rib eye steaks, each about 1 1/2 inches thick', u'aisle': u'Meat', u'name': u'rib eye steaks', u'metaInformation': [u'bone-in', u'thick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'liquid', u'id': 23232, u'unit': u'rib'}, {u'originalString': u'1 shallot, very finely chopped', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'very finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'8 ounces mushrooms, such as cremini or white button, sliced', u'aisle': u'Produce', u'name': u'white mushrooms', u'metaInformation': [u'white', u' such as cremini or  button, sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}], u'healthScore': 33.0, u'imageType': u'jpeg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/steakhouse-rib-eyes-with-creamed-spinach.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Adjust oven rack to middle position and heat oven to 350 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Place a rack over a rimmed baking sheet. Set aside. Pat the steaks dry with paper towels and season on both sides with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large skillet over medium-high heat just until smoking.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the steaks in the skillet and cook to sear, about 3 minutes. Flip to sear the other side, about 3 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 125.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Transfer the steaks to the prepared rack and roast in the middle of the oven until the steaks are medium rare (an instant-read thermometer inserted into the center of the steaks will register 125 degrees F), about 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Meanwhile, once you have transferred the steaks to the oven, immediately add the mushrooms to the skillet and season with salt and pepper. Reduce the heat to medium low and cook, stirring occasionally, until golden brown, 8 to 10 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [], u'step': u'Add parsley and toss to combine. Taste and adjust the seasoning with salt and pepper. Keep warm.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer the steaks to a warmed serving platter, tent with foil, and let rest for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [], u'step': u'Remove any fat on the edges and cut the steaks into 1/2-inch-thick slices.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ribeye-raw.jpg', u'id': 23232, u'name': u'steak'}]}, {u'equipment': [], u'step': u'Serve topped with mushrooms and with the spinach on the side.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt the butter over medium-low heat in a medium saucepan.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Add the shallot and cook until translucent, 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [], u'step': u'Increase the heat to medium.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the flour and cook until foaming but not browned, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the milk.', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Add the cayenne and nutmeg and season with salt and pepper. Bring to a boil; continue cooking, stirring constantly, until the sauce thickens, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [], u'step': u'Add the spinach and stir to combine. Cook until heated through, 3 to 5 minutes. Taste and adjust the seasoning with more salt and pepper if needed.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 18, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 51, u'instructions': u'Adjust oven rack to middle position and heat oven to 350 degrees F. Place a rack over a rimmed baking sheet. Set aside. Pat the steaks dry with paper towels and season on both sides with salt and pepper.                          Heat the oil in a large skillet over medium-high heat just until smoking. Place the steaks in the skillet and cook to sear, about 3 minutes. Flip to sear the other side, about 3 minutes. Transfer the steaks to the prepared rack and roast in the middle of the oven until the steaks are medium rare (an instant-read thermometer inserted into the center of the steaks will register 125 degrees F), about 12 minutes.                          Meanwhile, once you have transferred the steaks to the oven, immediately add the mushrooms to the skillet and season with salt and pepper. Reduce the heat to medium low and cook, stirring occasionally, until golden brown, 8 to 10 minutes. Add parsley and toss to combine. Taste and adjust the seasoning with salt and pepper. Keep warm.                          Transfer the steaks to a warmed serving platter, tent with foil, and let rest for 10 minutes. Remove any fat on the edges and cut the steaks into 1/2-inch-thick slices. Serve topped with mushrooms and with the spinach on the side.                          Melt the butter over medium-low heat in a medium saucepan. Add the shallot and cook until translucent, 2 to 3 minutes.                          Increase the heat to medium. Whisk in the flour and cook until foaming but not browned, about 1 minute. Whisk in the milk. Add the cayenne and nutmeg and season with salt and pepper. Bring to a boil; continue cooking, stirring constantly, until the sauce thickens, about 2 minutes.                          Add the spinach and stir to combine. Cook until heated through, 3 to 5 minutes. Taste and adjust the seasoning with more salt and pepper if needed. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/steakhouse-rib-eyes-with-creamed-spinach-772225', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}