{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/621951-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 621951, u'veryPopular': False, u'lowFodmap': False, u'title': u'Burrata Prosciutto Oregano Pizza', u'diets': [], u'pricePerServing': 545.41, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'6 ounces burrata', u'aisle': u'Cheese', u'name': u'burrata', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/burrata.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 93617, u'unit': u'ounces'}, {u'originalString': u'Fresh ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/2 cup (approximately) fresh oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'fresh', u'(approximately)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'cup'}, {u'originalString': u'1 batch pizza dough (homemade or purchased)', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [u'homemade', u'( or purchased)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 93610, u'unit': u''}, {u'originalString': u'1/2 cup (approximately) pizza sauce', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'(approximately)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11549, u'unit': u'cup'}, {u'originalString': u'2-3 slices of prosciutto, torn into strips', u'aisle': u'Meat', u'name': u'prosciutto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 2.0, u'consistency': u'solid', u'id': 10010123, u'unit': u'slices'}], u'healthScore': 8.0, u'imageType': u'png', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.framedcooks.com/2014/12/burrata-prosciutto-oregano-pizza.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-stone.jpg', u'id': 406907, u'name': u'pizza stone'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Preheat the oven to 500 degrees.  If you have a pizza stone, let it heat in the oven too.  If not no worries - you can bake this on a cookie sheet.2. Shape the dough into a rough circle, about 10 inches across.  Don't worry about being too accurate - you are looking for a general pizza shape.", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place it on a pizza peel or on the cookie sheet.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the pizza sauce over it.3.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'pizza sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake it for about 10 minutes - the crust should be turning golden - and then take it out.4. Tear the burrata into chunks and place it on the pizza.  Nestle the prosciutto strips in between the cheese chunks and return it to the oven just until the cheese melted - a few minutes will do it.5. Take it out, grind some fresh pepper on top, sprinkle with oregano, cut into slices and serve!', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/proscuitto.jpg', u'id': 10010123, u'name': u'prosciutto'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/burrata.jpg', u'id': 93617, u'name': u'burrata'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza can be paired with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Fonterutoli Chianti Classico. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 24 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u"Color: Deep purplish-red but bright and exceptionally concentrated.Bouquet: Extremely intense and complex with scents of cherries and raspberries accompanied by light toasty and spicy shadings.Flavor: The impact in the mouth is incisive but soft due to a substantial structure of tannins in which those that are soft and well rounded stand out. Acidity is fused with the wine's body and aids the transmission of pleasant sensations of warmth and strength. The wine features a long finish that is unusual for a regular Chianti Classico.Conclusions: Those who argue that Chianti Classico is a prickly and rough wine will change their minds after tasting this 1999, which is ready to drink now but will improve for at least five years more.Alcohol: 13.5% by volume View More", u'title': u'Fonterutoli Chianti Classico', u'price': u'$24.49', u'id': 440954, u'link': u'https://www.wine.com/product/fonterutoli-chianti-classico-1998/12434', u'imageUrl': u'https://spoonacular.com/productImages/440954-312x231.jpg'}]}, u'aggregateLikes': 73, u'instructions': u"1. Preheat the oven to 500 degrees.  If you have a pizza stone, let it heat in the oven too.  If not no worries - you can bake this on a cookie sheet.2. Shape the dough into a rough circle, about 10 inches across.  Don't worry about being too accurate - you are looking for a general pizza shape.  Place it on a pizza peel or on the cookie sheet.  Spread the pizza sauce over it.3. Bake it for about 10 minutes - the crust should be turning golden - and then take it out.4. Tear the burrata into chunks and place it on the pizza.  Nestle the prosciutto strips in between the cheese chunks and return it to the oven just until the cheese melted - a few minutes will do it.5. Take it out, grind some fresh pepper on top, sprinkle with oregano, cut into slices and serve!", u'spoonacularSourceUrl': u'https://spoonacular.com/burrata-prosciutto-oregano-pizza-621951', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}