{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/201206-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 201206, u'veryPopular': True, u'lowFodmap': True, u'title': u'Grilled Zucchini with Olives, Parsley and Lemon', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly', u'whole 30', u'vegan'], u'pricePerServing': 61.3, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'3 tablespoons black olives, preferably oil-cured, pitted and sliced in half', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'pitted', u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup chopped fresh parsley leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley leaves', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'Kosher salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 tablespoon juice and 1 teaspoon zest from one lemon', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u'tablespoon'}, {u'originalString': u'Olive oil, for brushing zucchini', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for brushing zucchini'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 56.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2012/07/grilled-zucchini-with-olives-parsley-and-lemon-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, preheat a gas grill to high, covered, for at least 10 minutes. Clean and oil the grilling grate.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-brush.jpg', u'id': 404764, u'name': u'pastry brush'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Using a pastry brush, brush zucchini with olive oil on both sides, and season to taste with salt and pepper. When grill is hot, add zucchini slices and cook, covered, until zucchini is well-browned on one side, 4 to 5 minutes. Flip slices and cook, covered, until zucchini is well-browned and tender, 3 to 4 minutes.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Transfer zucchini to a serving platter.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Squeeze lemon juice and drizzle olive oil over zucchini. Sprinkle on olives, parsley and lemon zest and serve immediately.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 551, u'instructions': u'Procedures                                                                              1                                                                            Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and spread the coals evenly over the coal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Alternatively, preheat a gas grill to high, covered, for at least 10 minutes. Clean and oil the grilling grate.                                                                                                                            2                                                                            Using a pastry brush, brush zucchini with olive oil on both sides, and season to taste with salt and pepper. When grill is hot, add zucchini slices and cook, covered, until zucchini is well-browned on one side, 4 to 5 minutes. Flip slices and cook, covered, until zucchini is well-browned and tender, 3 to 4 minutes. Transfer zucchini to a serving platter.                                                                                                                            3                                                                            Squeeze lemon juice and drizzle olive oil over zucchini. Sprinkle on olives, parsley and lemon zest and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/grilled-zucchini-with-olives-parsley-and-lemon-201206', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}