{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/380294-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 380294, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Pork Chop Dinner', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 324.03, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'2 medium carrots, sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1-1/2 teaspoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'teaspoons'}, {u'originalString': u'1 can (10-3/4 ounces) ready-to-serve creamy chicken soup', u'aisle': u'Canned and Jarred', u'name': u'cream of chicken soup', u'metaInformation': [u'ready-to-serve', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-chicken-soup.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'liquid', u'id': 6016, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon onion soup mix', u'aisle': u'Canned and Jarred', u'name': u'onion soup mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 6094, u'unit': u'tablespoon'}, {u'originalString': u'2 boneless pork loin chops (3/4 inch thick and 4 ounces each)', u'aisle': u'Meat', u'name': u'pork loin chops', u'metaInformation': [u'boneless', u'(3/ and 4 ounces each)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin-chops.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 10062, u'unit': u''}, {u'originalString': u'2 medium potatoes, peeled and cut into 1/4-inch slices', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'medium', u'peeled', u'cut into 1/4-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11362, u'unit': u''}], u'healthScore': 47.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/creamy-pork-chop-dinner', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place the potatoes and carrots in a 1-qt. baking dish coated with cooking spray. In a large skillet coated with cooking spray, brown pork chops on both sides.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}]}, {u'equipment': [], u'step': u'Place over vegetables.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine the soup mix, cornstarch and soup until blended.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}]}, {u'equipment': [], u'step': u'Pour over pork chops. Cover and bake at 350\xb0 for 1 hour or until meat and potatoes are tender.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-chops.jpg', u'id': 10010062, u'name': u'pork chops'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}]}], u'name': u''}], u'aggregateLikes': 74, u'instructions': u'Directions                                                                                Place the potatoes and carrots in a 1-qt. baking dish coated with cooking spray. In a large skillet coated with cooking spray, brown pork chops on both sides. Place over vegetables.                                                                                           In a small bowl, combine the soup mix, cornstarch and soup until blended. Pour over pork chops. Cover and bake at 350\xb0 for 1 hour or until meat and potatoes are tender.                                        Yield: 2 servings.                                                                                                                         Originally published as Creamy Pork Chop Dinner in  Cooking for 2Spring 2006, p39                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 360 calories, 11 g fat (3 g saturated fat), 57 mg cholesterol, 807 mg sodium, 40 g carbohydrate, 6 g fiber, 27 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-pork-chop-dinner-380294', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}