{u'recipes': [{u'sourceName': u'Memorie Di Angelina', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/481270-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 481270, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crema di ricotta (Ricotta Mousse)', u'diets': [u'gluten free'], u'pricePerServing': 404.46, u'creditText': u'Memorie Di Angelina', u'extendedIngredients': [{u'originalString': u'Almond shavings', u'aisle': u'Nuts', u'name': u'almond', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12061, u'unit': u'servings'}, {u'originalString': u'Berries', u'aisle': u'Produce', u'name': u'berries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/berries-mixed.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1009054, u'unit': u'servings'}, {u'originalString': u'Powdered cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'servings'}, {u'originalString': u'Cocoa', u'aisle': u'Baking', u'name': u'cocoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'servings'}, {u'originalString': u'2 egg yolks, preferably pasteurized', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'Crumbled hazelnuts', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 12120, u'unit': u'servings'}, {u'originalString': u'450g (16 oz) ricotta cheese', u'aisle': u'Cheese', u'name': u'ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'liquid', u'id': 1036, u'unit': u'oz'}, {u'originalString': u'A few spoonfuls of rum, Amaretto, Frangelico or other liqueur', u'aisle': u'Alcoholic Beverages', u'name': u'rum', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rum-dark.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'liquid', u'id': 14037, u'unit': u'servings'}, {u'originalString': u'Semi-sweet dark chocolate, shavings', u'aisle': u'Sweet Snacks', u'name': u'semi-sweet chocolate', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'liquid', u'id': 19903, u'unit': u'servings'}, {u'originalString': u"50-75g (2- 2-1/2 oz) confectioner's sugar, or to taste", u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'oz'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://memoriediangelina.com/2014/05/11/crema-di-ricotta-ricotta-mousse/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 39, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place the ricotta inside a fine mesh strainer, which itself is placed inside a large mixing bowl, like so:If the ricotta looks a bit wet, let it drain for about an hour, then throw out any liquid that has dripped into the bowl and dry out the bowl.Using a spatula or wooden spoon, press the ricotta through the strainer into the bowl.In the bowl of a standing mixer, whisk the egg yolks and sugar together until they are completely smooth and the mixture forms ribbons, like so:Now add the ricotta and whisk again,  until the ricotta is fully incorporated as well and the mixture is completely smooth. If you like, whisk in a few spoonfuls of liqueur. (I used Frangelico this time.)Refrigerate the ricotta mixture for at least an hour, preferably for several hours or even overnight. Cover the mixture with plastic wrap to prevent a  film from forming on its surface. It will have thickened considerably.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve the ricotta mousse in dessert bowls, topped with chocolate shavings and/or one or more of the other toppings listed. Feel free to be as creative as you like; the ricotta mousse goes with just about anything.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'id': 10219903, u'name': u'chocolate shavings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'id': 1036, u'name': u'ricotta cheese'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 101, u'instructions': u'Place the ricotta inside a fine mesh strainer, which itself is placed inside a large mixing bowl, like so:If the ricotta looks a bit wet, let it drain for about an hour, then throw out any liquid that has dripped into the bowl and dry out the bowl.Using a spatula or wooden spoon, press the ricotta through the strainer into the bowl.In the bowl of a standing mixer, whisk the egg yolks and sugar together until they are completely smooth and the mixture forms ribbons, like so:Now add the ricotta and whisk again,  until the ricotta is fully incorporated as well and the mixture is completely smooth. If you like, whisk in a few spoonfuls of liqueur. (I used Frangelico this time.)Refrigerate the ricotta mixture for at least an hour, preferably for several hours or even overnight. Cover the mixture with plastic wrap to prevent a  film from forming on its surface. It will have thickened considerably.Serve the ricotta mousse in dessert bowls, topped with chocolate shavings and/or one or more of the other toppings listed. Feel free to be as creative as you like; the ricotta mousse goes with just about anything.', u'spoonacularSourceUrl': u'https://spoonacular.com/crema-di-ricotta-ricotta-mousse-481270', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}