{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/434153-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 434153, u'veryPopular': True, u'lowFodmap': True, u'title': u'Strawberry Cooler', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 144.63, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 cup ginger ale', u'aisle': u'Beverages', u'name': u'ginger ale', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14136, u'unit': u'cup'}, {u'originalString': u'Crushed ice', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'servings'}, {u'originalString': u'1/4 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'2 teaspoons grated lemon peel', u'aisle': u'Produce', u'name': u'lemon peel', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoons'}, {u'originalString': u'Whole strawberries, optional', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 9316, u'unit': u'servings'}, {u'originalString': u'3/4 to 1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 80.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/strawberry-cooler', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender, process the water, strawberries, sugar, lemon juice and peel in batches until smooth. Strain the berry seeds if desired.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Pour into a pitcher; stir in the ginger ale.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soda-can.jpg', u'id': 14136, u'name': u'ginger ale'}]}, {u'equipment': [], u'step': u'Serve in chilled glasses over ice.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}, {u'equipment': [], u'step': u'Garnish with whole berries if desired.', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 1397, u'instructions': u'Directions                                                                                In a blender, process the water, strawberries, sugar, lemon juice and peel in batches until smooth. Strain the berry seeds if desired. Pour into a pitcher; stir in the ginger ale. Serve in chilled glasses over ice. Garnish with whole berries if desired.                                        Yield: 8 servings.                                                                                                                         Originally published as Strawberry Cooler in  Country ExtraJuly  2002, p49                                                                                                                                                                                                        Nutritional Facts                                                                             1 cup equals 116 calories, trace fat (trace saturated fat), 0 cholesterol, 3 mg sodium, 29 g carbohydrate, 2 g fiber, 1 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-cooler-434153', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}