{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/595746-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 595746, u'veryPopular': True, u'lowFodmap': False, u'title': u'Beef Soup Series – Part 2: Beef and Barley Soup', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 132.0, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'1 pound chuck beef, cut into small pieces', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'small', u'cut into  pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 13786, u'unit': u'pound'}, {u'originalString': u'1 cup diced carrots', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u'cup'}, {u'originalString': u'1 cup diced celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 cup diced leeks', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11246, u'unit': u'cup'}, {u'originalString': u'1 cup diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 cup pearl barley', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'pearl barley', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barley-pearl.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20005, u'unit': u'cup'}, {u'originalString': u'Pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 quarts brown stock (or beef stock)', u'aisle': u'Canned and Jarred', u'name': u'stock', u'metaInformation': [u'(or beef stock)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'quarts', u'unitShort': u'quarts', u'amount': 2.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'quarts'}, {u'originalString': u'1 can diced tomato', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'can'}, {u'originalString': u'2 tablespoons tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup diced white turnip', u'aisle': u'Produce', u'name': u'turnip', u'metaInformation': [u'diced', u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turnips.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11564, u'unit': u'cup'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.afamilyfeast.com/beef-soup-series-part-2-beef-and-barley-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a 10-quart pot or Dutch oven, heat olive oil over medium high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place beef in oil and sear on all sides. Do not crowd the meat in the pan – brown the beef in batches.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, celery, carrots and leeks and saut\xe9 for 3-5 minutes until vegetables are slightly tender.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add garlic and cook one more minute.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add tomato paste and cook an additional minute.Move mixture to sides of pan and place barley in center.  Saut\xe9 for 2 minutes being careful not to burn the barley or mixture.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Add all other ingredients except salt and pepper and bring to a boil. Bring to a simmer and cook for one hour and 15 minutes.  Adjust seasoning with salt and pepper as needed.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 2745, u'instructions': u'In a 10-quart pot or Dutch oven, heat olive oil over medium high heat.Place beef in oil and sear on all sides. Do not crowd the meat in the pan – brown the beef in batches.Add onion, celery, carrots and leeks and saut\xe9 for 3-5 minutes until vegetables are slightly tender. Add garlic and cook one more minute. Add tomato paste and cook an additional minute.Move mixture to sides of pan and place barley in center.  Saut\xe9 for 2 minutes being careful not to burn the barley or mixture.Add all other ingredients except salt and pepper and bring to a boil. Bring to a simmer and cook for one hour and 15 minutes.  Adjust seasoning with salt and pepper as needed.', u'spoonacularSourceUrl': u'https://spoonacular.com/beef-soup-series-part-2-beef-and-barley-soup-595746', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}