{u'recipes': [{u'sourceName': u'Real Housemoms', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/834891-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 834891, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cinnamon Cheesecake Dip', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 106.16, u'creditText': u'Real Housemoms', u'extendedIngredients': [{u'originalString': u'4 tablespoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'cookie wafers, graham crackers, apples, strawberries, etc. for dipping', u'aisle': u'Sweet Snacks', u'name': u'cookie', u'metaInformation': [u'for dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'liquid', u'id': 10118192, u'unit': u'servings'}, {u'originalString': u'1 (8 oz) brick cream cheese - softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 (5 oz) container vanilla Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'skim vanilla greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-yogurt.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'liquid', u'id': 99033, u'unit': u'oz'}, {u'originalString': u'4 ounces whipped topping (store-bought or homemade)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'homemade', u'store-bought', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://realhousemoms.com/cinnamon-cheesecake-dip/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine brown sugar and cinnamon.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'Place cream cheese in a medium mixing bowl and whip until smooth using a hand mixer.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add Greek yogurt to cream cheese and cinnamon sugar mixture.Blend with mixer until all combined.Gently fold in whipped topping until all combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add to a serving bowl and chill until ready to serve.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with sweet cookies/crackers or fruit.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortbread-cookies.jpg', u'id': 10118192, u'name': u'cookies'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 12, u'instructions': u'In a small bowl, combine brown sugar and cinnamon.Place cream cheese in a medium mixing bowl and whip until smooth using a hand mixer.Add Greek yogurt to cream cheese and cinnamon sugar mixture.Blend with mixer until all combined.Gently fold in whipped topping until all combined.Add to a serving bowl and chill until ready to serve.Serve with sweet cookies/crackers or fruit.', u'spoonacularSourceUrl': u'https://spoonacular.com/cinnamon-cheesecake-dip-834891', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}