{u'recipes': [{u'sourceName': u'Feed Me Phoebe', u'cuisines': [u'spanish', u'european'], u'image': u'https://spoonacular.com/recipeImages/479092-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 479092, u'veryPopular': True, u'lowFodmap': False, u'title': u'Meatless Monday: Vegetarian Butternut Squash and Leek Paella', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 132.78, u'creditText': u'Feed Me Phoebe', u'extendedIngredients': [{u'originalString': u'2 cups paella or arborio rice', u'aisle': u'Pasta and Rice', u'name': u'arborio rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10020052, u'unit': u'cups'}, {u'originalString': u'4 cups diced butternut squash', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'1 15-ounce can diced tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'4 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 leeks, white and light green parts only, halved lengthwise and thinly sliced', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'light', u'white', u'green', u'halved lengthwise', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'Olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1 large onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon red chili flakes', u'aisle': u'Spices and Seasonings', u'name': u'red chili flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'2 tablespoons chopped parsley leaves or green scallions to garnish', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'green', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoons'}, {u'originalString': u'1 quart vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'quart'}, {u'originalString': u'1/2 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 32.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://feedmephoebe.com/2013/01/meatless-monday-vegetarian-butternut-squash-and-leek-paella/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Combine the squash, 2 tablespoons of olive oil and 1/2 teaspoon salt on a parchment-lined baking sheet. Toss to combine and arrange in an even layer.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 10011485, u'name': u'squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the oven until browned and caramelized, about 30 to 40 minutes. Set aside.Meanwhile, heat 2 tablespoons olive oil in a large cast iron skillet or paella pan over a medium-high flame.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion and saute until soft, about 5 minutes. Toss in the leeks and continue to cook until wilted, about 3 more minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the garlic, paprika, chili flakes, and rice. Stir to coat in the oil and onion mixture. Continue to cook, stirring occasionally, until all the rice has gotten a chance to toast on the bottom of the pan, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the wine and scrape up any brown bit on the bottom of the pan. Stir in the tomatoes and 1 teaspoon salt.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread the rice mixture in an even layer in the pan.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Pour enough of the stock over the rice so it is just slightly submerged. Bring to a boil, then turn the heat down to medium-low and simmer until most of the liquid is absorbed, about 25 to 30 minutes. Taste the rice; it should be crusty around the edges and al dente on top, but cooked through in the middle. If not, add another cup of stock and continue to cook for another 5 to 10 minutes.When paella is done, arrange the roasted butternut squash on top and garnish with parsley or scallions.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'id': 11485, u'name': u'butternut squash'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Paella works really well with Tempranillo, Albarino, and Grenache. When pairing wine with Spanish dishes, why not follow the rule 'what grows together goes together'? We recommend albari\xf1o for white wine and garnachan and tempranillo for red. One wine you could try is Rancho Maria Vineyards Tempranillo. It has 5 out of 5 stars and a bottle costs about 25 dollars.", u'pairedWines': [u'tempranillo', u'albarino', u'grenache'], u'productMatches': [{u'description': u'Sweet, serve chilled as a refreshing daily drinker.', u'title': u'Rancho Maria Vineyards Tempranillo', u'price': u'$25.0', u'id': 469600, u'link': u'https://www.amazon.com/2012-Rancho-Maria-Vineyards-Tempranillo/dp/B00FPOSFD0', u'imageUrl': u'https://spoonacular.com/productImages/469600-312x231.jpg'}]}, u'aggregateLikes': 701, u'instructions': u'Preheat the oven to 425 degrees F.Combine the squash, 2 tablespoons of olive oil and 1/2 teaspoon salt on a parchment-lined baking sheet. Toss to combine and arrange in an even layer. Bake in the oven until browned and caramelized, about 30 to 40 minutes. Set aside.Meanwhile, heat 2 tablespoons olive oil in a large cast iron skillet or paella pan over a medium-high flame. Add the onion and saute until soft, about 5 minutes. Toss in the leeks and continue to cook until wilted, about 3 more minutes. Add the garlic, paprika, chili flakes, and rice. Stir to coat in the oil and onion mixture. Continue to cook, stirring occasionally, until all the rice has gotten a chance to toast on the bottom of the pan, about 3 minutes. Add the wine and scrape up any brown bit on the bottom of the pan. Stir in the tomatoes and 1 teaspoon salt. Spread the rice mixture in an even layer in the pan.Pour enough of the stock over the rice so it is just slightly submerged. Bring to a boil, then turn the heat down to medium-low and simmer until most of the liquid is absorbed, about 25 to 30 minutes. Taste the rice; it should be crusty around the edges and al dente on top, but cooked through in the middle. If not, add another cup of stock and continue to cook for another 5 to 10 minutes.When paella is done, arrange the roasted butternut squash on top and garnish with parsley or scallions.', u'spoonacularSourceUrl': u'https://spoonacular.com/meatless-monday-vegetarian-butternut-squash-and-leek-paella-479092', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}