{u'recipes': [{u'sourceName': u'Add A Pinch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/476620-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 1, u'id': 476620, u'veryPopular': True, u'lowFodmap': False, u'title': u'Bacon S’mores', u'diets': [u'dairy free'], u'preparationMinutes': 1, u'pricePerServing': 68.11, u'creditText': u'Add A Pinch', u'extendedIngredients': [{u'originalString': u'1 piece cooked bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'piece'}, {u'originalString': u'2 graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 18617, u'unit': u''}, {u'originalString': u'1 large toasted marshmallow', u'aisle': u'Baking', u'name': u'marshmallow', u'metaInformation': [u'large', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 19116, u'unit': u''}, {u'originalString': u'2 pieces chocolate bar', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate bar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 10019904, u'unit': u'pieces'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://addapinch.com/cooking/2013/06/08/bacon-smores-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Assemble basic s'more of placing chocolate bar onto one graham cracker. The add a piece of cooked bacon and top with a toasted marshmallow and second graham cracker.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/normal-marshmallows.jpg', u'id': 19116, u'name': u'marshmallows'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 560, u'instructions': u"Assemble basic s'more of placing chocolate bar onto one graham cracker. The add a piece of cooked bacon and top with a toasted marshmallow and second graham cracker.", u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-smores-476620', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 2, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}