{u'recipes': [{u'sourceName': u'Naturally Ella', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/798674-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 798674, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegetarian Breakfast Burritos', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 155.39, u'creditText': u'Naturally Ella', u'extendedIngredients': [{u'originalString': u'1/2 large avocado, diced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/4 cup cilantro, minced', u'aisle': u'Produce', u'name': u'cilantro', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'Juice from 1/2 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'4 teaspoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'1/2 recipe for chorizo-spiced crumble', u'aisle': u'Meat', u'name': u'real bacon recipe pieces', u'metaInformation': [u'for chorizo-spiced crumble'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bacon-bits.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10862, u'unit': u''}, {u'originalString': u'3 tablespoons minced red onion', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'tablespoons'}, {u'originalString': u'3 tablespoons minced red pepper', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'red', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11821, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup roasted tomato salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 6164, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'2 large whole wheat tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'whole wheat tortillas', u'metaInformation': [u'whole wheat', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortillas-whole-wheat.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 93675, u'unit': u''}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://naturallyella.com/vegetarian-breakfast-burritos/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Make the crumble according to the directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat 2 teaspoons olive oil in a large skillet over medium-low heat. Then add the crumble mixture and cook until warm. Set aside and return the pan to the heat.In a bowl, whisk together the eggs, milk, and salt.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining 2 teaspoons olive oil to the pan followed by the eggs. Cook, scraping occasionally, until the eggs are set and remove from heat.Next, cut the avocado into 1/4 inch thick slices and toss with cilantro and lime juice.Warm the tortillas, then begin assembling.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Place half the eggs in the middle of the tortilla, slightly closer to you. Top the eggs with half the avocado, crumble, onions, peppers, and salsa. Then, fold the part of the tortilla closest to you over the filling, tuck the sides in, and roll away from you. Repeat with the second tortilla.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'aggregateLikes': 29, u'instructions': u'Make the crumble according to the directions. Heat 2 teaspoons olive oil in a large skillet over medium-low heat. Then add the crumble mixture and cook until warm. Set aside and return the pan to the heat.In a bowl, whisk together the eggs, milk, and salt. Add the remaining 2 teaspoons olive oil to the pan followed by the eggs. Cook, scraping occasionally, until the eggs are set and remove from heat.Next, cut the avocado into 1/4 inch thick slices and toss with cilantro and lime juice.Warm the tortillas, then begin assembling. Place half the eggs in the middle of the tortilla, slightly closer to you. Top the eggs with half the avocado, crumble, onions, peppers, and salsa. Then, fold the part of the tortilla closest to you over the filling, tuck the sides in, and roll away from you. Repeat with the second tortilla.', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetarian-breakfast-burritos-798674', u'dishTypes': [u'lunch', u'main course', u'morning meal', u'brunch', u'main dish', u'breakfast', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}