{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/215837-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 215837, u'veryPopular': False, u'lowFodmap': False, u'title': u'Broken biscotti ice cream with hot mocha', u'diets': [u'dairy free'], u'preparationMinutes': 5, u'pricePerServing': 231.93, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'12 biscotti biscuits', u'aisle': u'Sweet Snacks', u'name': u'biscotti', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/biscotti.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 98843, u'unit': u''}, {u'originalString': u'2 tbsp brandy', u'aisle': u'Alcoholic Beverages', u'name': u'brandy', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 10114037, u'unit': u'tbsp'}, {u'originalString': u'100g bar good-quality dark chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate bar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'liquid', u'id': 10019904, u'unit': u'g'}, {u'originalString': u'200ml (about 1 mug) freshly-made strong coffee', u'aisle': u'Tea and Coffee', u'name': u'strong coffee', u'metaInformation': [u'( 1 mug)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 200.0, u'consistency': u'solid', u'id': 14209, u'unit': u'ml'}, {u'originalString': u'500ml pot good-quality vanilla ice-cream', u'aisle': u'Frozen', u'name': u'vanilla ice cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'ml'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 33.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1784/broken-biscotti-ice-cream-with-hot-mocha', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Leave the ice cream out of the freezer for 5 mins to soften, then tip into a bowl. Meanwhile, put six of the biscotti into a freezer bag and lightly crush with a rolling pin, fold into the ice cream, then return to the freezer.Break the chocolate into a pan or microwaveable bowl, add the brandy and heat gently until melted or microwave on High for 30 secs. Stir (it will thicken), then pour in the hot coffee and carry on stirring until smooth.Scoop the ice cream into heatproof glasses or bowls, then pour the mocha over.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/biscotti.jpg', u'id': 98843, u'name': u'biscotti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brandy.jpg', u'id': 10114037, u'name': u'brandy'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}]}, {u'equipment': [], u'step': u'Serve straight away withthe remaining biscotti.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/biscotti.jpg', u'id': 98843, u'name': u'biscotti'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Vanillan Ice Cream on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u'Leave the ice cream out of the freezer for 5 mins to soften, then tip into a bowl. Meanwhile, put six of the biscotti into a freezer bag and lightly crush with a rolling pin, fold into the ice cream, then return to the freezer.Break the chocolate into a pan or microwaveable bowl, add the brandy and heat gently until melted or microwave on High for 30 secs. Stir (it will thicken), then pour in the hot coffee and carry on stirring until smooth.Scoop the ice cream into heatproof glasses or bowls, then pour the mocha over. Serve straight away withthe remaining biscotti.', u'spoonacularSourceUrl': u'https://spoonacular.com/broken-biscotti-ice-cream-with-hot-mocha-215837', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}