{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/444807-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 444807, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheddar Loaves', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 25.96, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'3 teaspoons active dry yeast', u'aisle': u'Baking', u'name': u'active yeast', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 18375, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'6 to 6-1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 cups warm 2% milk (110\xb0 to 115\xb0)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%', u'(110\xb0 to 115\xb0)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'2 cups (8 ounces) shredded sharp cheddar cheese', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'ounces'}, {u'originalString': u'3 teaspoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup warm water (110\xb0 to 115\xb0)', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'(110\xb0 to 115\xb0)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/cheddar-loaves', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, dissolve yeast in warm water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Add the milk, butter, eggs, sugar, salt and 6 cups flour. Beat on medium speed for 3 minutes. Stir in enough remaining flour to form a soft dough.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Turn onto a lightly floured surface; knead until smooth and elastic, about 6-8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a greased bowl, turning once to grease top. Cover and let rise in a warm place until doubled, about 1 hour.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Punch dough down. Turn onto a lightly floured surface; knead cheese into the dough. Divide in half; shape each portion into a 6-in. round loaf.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on greased baking sheets. Cover and let rise until doubled, about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 350\xb0 for 35-40 minutes or until golden brown.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from pans to wire racks to cool. Refrigerate leftovers.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 77, u'instructions': u'Directions                                                                                In a large bowl, dissolve yeast in warm water. Add the milk, butter, eggs, sugar, salt and 6 cups flour. Beat on medium speed for 3 minutes. Stir in enough remaining flour to form a soft dough.                                                                                            Turn onto a lightly floured surface; knead until smooth and elastic, about 6-8 minutes. Place in a greased bowl, turning once to grease top. Cover and let rise in a warm place until doubled, about 1 hour.                                                                                           Punch dough down. Turn onto a lightly floured surface; knead cheese into the dough. Divide in half; shape each portion into a 6-in. round loaf. Place on greased baking sheets. Cover and let rise until doubled, about 45 minutes.                                                                                            Bake at 350\xb0 for 35-40 minutes or until golden brown. Remove from pans to wire racks to cool. Refrigerate leftovers.                                        Yield: 2 loaves (12 slices each).                                                                                                                         Originally published as Cheddar Loaves in  Taste of HomeJune/July 2007, p37                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 slice) equals 178 calories, 5 g fat (3 g saturated fat), 33 mg cholesterol, 279 mg sodium, 26 g carbohydrate, 1 g fiber, 7 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/cheddar-loaves-444807', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}