{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/215170-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 215170, u'veryPopular': False, u'lowFodmap': False, u'title': u'Springtime pasta', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 168.78, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g streaky bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'g'}, {u'originalString': u"100g soft mild goat's cheese", u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'soft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1159, u'unit': u'g'}, {u'originalString': u'200g bag shredded kale', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 11233, u'unit': u'g'}, {u'originalString': u'400g penne', u'aisle': u'Pasta and Rice', u'name': u'penne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/penne-pasta.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 11120420, u'unit': u'g'}, {u'originalString': u'1 medium red onion, finely sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'finely sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/10342/springtime-pasta', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Boil the pasta in salted water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Addthe kale for the final 2 mins, then drain,reserving a little of the cooking liquid.Meanwhile, dry-fry the bacon in a nonstickpan until crisp.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from thepan and drain off most of the fat, leavingbehind about 1 tsp. Gently fry the onionin the fat for 2-3 mins until soft.Tip the cooked pasta and kale intothe pan, then stir through the bacon andgoat’s cheese.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Add a little of the pastacooking water if the mixture seems a bitdry.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Serve in bowls scattered with grated', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Parmesan, if you like.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 345, u'instructions': u'Boil the pasta in salted water. Addthe kale for the final 2 mins, then drain,reserving a little of the cooking liquid.Meanwhile, dry-fry the bacon in a nonstickpan until crisp. Remove from thepan and drain off most of the fat, leavingbehind about 1 tsp. Gently fry the onionin the fat for 2-3 mins until soft.Tip the cooked pasta and kale intothe pan, then stir through the bacon andgoat’s cheese. Add a little of the pastacooking water if the mixture seems a bitdry. Serve in bowls scattered with gratedParmesan, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/springtime-pasta-215170', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}