{u'recipes': [{u'sourceName': u'Gimme Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/681249-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 681249, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mini Pumpkin Cheesecakes with Gingersnap Crust', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 102.21, u'creditText': u'Gimme Delicious', u'extendedIngredients': [{u'originalString': u'3 tablespoons melted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'\xbd cup canned pumpkin', u'aisle': u'Baking', u'name': u'canned pumpkin', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'salted caramel sauce', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19364, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 package (8 ounces) Cream Cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'24 Gingersnap Cookies', u'aisle': u'Sweet Snacks', u'name': u'gingersnap cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gingersnaps.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 24.0, u'consistency': u'solid', u'id': 18172, u'unit': u''}, {u'originalString': u'Crust', u'aisle': u'Refrigerated', u'name': u'pie crust', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 18334, u'unit': u'servings'}, {u'originalString': u'\xbd teaspoon pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'\xbd tsp vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'Whipped cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1054, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://gimmedelicious.com/2015/10/04/mini-pumpkin-cheesecakes-with-gingersnap-crust/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees F.In a food processor, grind gingersnap cookies to crumbs.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gingersnaps.jpg', u'id': 18172, u'name': u'gingersnap cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add melted butter and pulse just until mixed and the mixture is crumbly.Lightly spray mini cheesecake pan with non stick cooking spray or line with paper cupcake liners.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place approximately 1 tablespoon of gingersnap crust mixture into each of the 12 cheesecake cavities in pan. Press down with spoon or small glass.Beat cream cheese, pumpkin, sugar, vanilla, and spices with electric mixer on medium speed until well blended.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 2035, u'name': u'spices'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add eggs and beat until just blended.Spoon cream cheese mixture into mini cheesecake pan on top of gingersnap crusts.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 20-25 minutes until set.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from oven and let cool in pan for at least 30 minutes. Chill for at least two hours, or overnight before serving. Top with whipped cream and drizzle with caramel sauce, if desired.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 39, u'instructions': u'Preheat oven to 350 degrees F.In a food processor, grind gingersnap cookies to crumbs. Add melted butter and pulse just until mixed and the mixture is crumbly.Lightly spray mini cheesecake pan with non stick cooking spray or line with paper cupcake liners.Place approximately 1 tablespoon of gingersnap crust mixture into each of the 12 cheesecake cavities in pan. Press down with spoon or small glass.Beat cream cheese, pumpkin, sugar, vanilla, and spices with electric mixer on medium speed until well blended. Add eggs and beat until just blended.Spoon cream cheese mixture into mini cheesecake pan on top of gingersnap crusts. Bake for 20-25 minutes until set. Remove from oven and let cool in pan for at least 30 minutes. Chill for at least two hours, or overnight before serving. Top with whipped cream and drizzle with caramel sauce, if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/mini-pumpkin-cheesecakes-with-gingersnap-crust-681249', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}