{u'recipes': [{u'sourceName': u'The Cookie Rookie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608917-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 608917, u'veryPopular': True, u'lowFodmap': False, u'title': u'Skinny Caramel Apple Dip', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 97.92, u'creditText': u'The Cookie Rookie', u'extendedIngredients': [{u'originalString': u'Apple slices, for dipping', u'aisle': u'Produce', u'name': u'apple', u'metaInformation': [u'for dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 9003, u'unit': u'slices'}, {u'originalString': u'1 16 ounce jar of your favorite caramel sauce (I love Salted Caramel by Smuckers)', u'aisle': u'Nut butters, Jams, and Honey;Frozen;Baking', u'name': u'caramel sauce', u'metaInformation': [u'salted', u'your favorite', u'(I love Caramel by Smuckers)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 19364, u'unit': u'ounce'}, {u'originalString': u'\xbd a tub (about 6 ounces) fat-free or light Cool Whip', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat-free cool whip', u'metaInformation': [u'light', u'fat-free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1200, u'unit': u'ounces'}, {u'originalString': u'8-ounce package low-fat cream cheese, softened', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [u'low-fat', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounce'}, {u'originalString': u'\xbd cup white chocolate chips', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10019087, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'png', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.thecookierookie.com/skinny-caramel-apple-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}], u'step': u'In an electric mixer, blend cream cheese, Cool Whip, and caramel sauce until well combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sauce-caramel.jpg', u'id': 19364, u'name': u'caramel sauce'}]}, {u'equipment': [], u'step': u'Mix in white chocolate chips', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'id': 10019087, u'name': u'white chocolate chips'}]}, {u'equipment': [], u'step': u'You can eat immediately, or refridgerate for about an hour to allow to firm up a bit.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with apple slices.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip on the menu? Try pairing with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. You could try Bellissima Sparkling ros\xe9. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi.', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 5024, u'instructions': u'In an electric mixer, blend cream cheese, Cool Whip, and caramel sauce until well combined.Mix in white chocolate chipsYou can eat immediately, or refridgerate for about an hour to allow to firm up a bit. Serve with apple slices.', u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-caramel-apple-dip-608917', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl', u'halloween'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}