{u'recipes': [{u'sourceName': u'The Pioneer Woman', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/427828-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 8, u'id': 427828, u'veryPopular': True, u'lowFodmap': False, u'title': u'Summer Stir-Fry', u'diets': [u'gluten free', u'pescatarian'], u'preparationMinutes': 15, u'pricePerServing': 156.08, u'creditText': u'The Pioneer Woman', u'extendedIngredients': [{u'originalString': u'2 Tablespoons Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'Tablespoons'}, {u'originalString': u'2 ears Corn, Kernels Sliced Off', u'aisle': u'Produce', u'name': u'ears corn', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'Chopped Fresh Herbs, If Desired', u'aisle': u'Produce', u'name': u'fresh herbs', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mixed-fresh-herbs.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012024, u'unit': u'servings'}, {u'originalString': u'4 cloves Garlic, Minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 cup Grape Tomatoes, Sliced In Half Lengthwise', u'aisle': u'Produce', u'name': u'grape tomatoes', u'metaInformation': [u'sliced in half lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10111529, u'unit': u'cup'}, {u'originalString': u'12 whole Jumbo Shrimp, Peeled, Deveined, Tails Left On', u'aisle': u'Seafood', u'name': u'jumbo shrimp', u'metaInformation': [u'whole', u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 15152, u'unit': u''}, {u'originalString': u'2 Tablespoons Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tablespoons'}, {u'originalString': u'Salt And Freshly Ground Pepper, To Taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 whole Zucchini, Sliced On A Slight Diagonal', u'aisle': u'Produce', u'name': u'zucchini', u'metaInformation': [u'whole', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 51.0, u'sourceUrl': u'http://thepioneerwoman.com/cooking/2010/06/summer-stir-fry/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tablespoon butter and 1 tablespoon olive oil in a large skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add minced garlic. When oil/butter is hot, add shrimp and cook for 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove to a plate. Do not clean skillet.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the rest of the butter and oil and heat over medium heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add zucchini slices in a single layer and cook for one minute, tossing once. Scoot the zucchini to the edges of the pan, then add corn kernels to the middle of the pan. Cook for one minute.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [], u'step': u'Add grape tomatoes, salt, and pepper, and toss around, then add shrimp. Cook for an additional 30 seconds, then remove from heat.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'id': 10111529, u'name': u'grape tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u"Serve on a big platter.Hint: Much better after it's been allowed to cool for a bit! Yummy and refreshing.", u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 3238, u'instructions': u"Heat 1 tablespoon butter and 1 tablespoon olive oil in a large skillet over medium heat. Add minced garlic. When oil/butter is hot, add shrimp and cook for 3 minutes. Remove to a plate. Do not clean skillet.Add the rest of the butter and oil and heat over medium heat. Add zucchini slices in a single layer and cook for one minute, tossing once. Scoot the zucchini to the edges of the pan, then add corn kernels to the middle of the pan. Cook for one minute. Add grape tomatoes, salt, and pepper, and toss around, then add shrimp. Cook for an additional 30 seconds, then remove from heat. Serve on a big platter.Hint: Much better after it's been allowed to cool for a bit! Yummy and refreshing.", u'spoonacularSourceUrl': u'https://spoonacular.com/summer-stir-fry-427828', u'dishTypes': [u'side dish'], u'occasions': [u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 23, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}