{u'recipes': [{u'sourceName': u'Boulder Locavore', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/522063-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 522063, u'veryPopular': True, u'lowFodmap': False, u'title': u'Summer Grilled Chicken Chopped Salad with White Balsamic Dressing', u'diets': [u'gluten free'], u'preparationMinutes': 25, u'pricePerServing': 713.51, u'creditText': u'Boulder Locavore', u'extendedIngredients': [{u'originalString': u'\xbd cup Focaccia Croutons*', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'croutons', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18242, u'unit': u'cup'}, {u'originalString': u'\xbd cup Cucumber, peeled and chopped', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u'cup'}, {u'originalString': u'1 \xbd tsp Dijon Mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tsp'}, {u'originalString': u'\xbe cup Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'\xbc cup Feta Cheese, crumbled', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'\xbd tsp fresh Garlic, finely minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'tsp'}, {u'originalString': u'1/16 teaspoon ground White Pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.0625, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'\xbc cup Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1/16 teaspoon Kosher Salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.0625, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups Romaine Lettuce Hearts, chopped', u'aisle': u'Produce', u'name': u'romaine hearts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/romaine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011251, u'unit': u'cups'}, {u'originalString': u'\xbe cup grilled or rotisserie Chicken, chilled and chopped', u'aisle': u'Meat', u'name': u'rotisserie chicken', u'metaInformation': [u'chilled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 5112, u'unit': u'cup'}, {u'originalString': u'\xbd tsp Shallots, finely diced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11677, u'unit': u'tsp'}, {u'originalString': u'\xbd cup fresh Tomatoes, chopped', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}, {u'originalString': u'\xbd cup White Balsamic Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white balsamic vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1012069, u'unit': u'cup'}], u'healthScore': 38.0, u'imageType': u'jpg', u'spoonacularScore': 96.0, u'sourceUrl': u'http://boulderlocavore.com/2013/05/summer-grilled-chicken-chopped-salad-with-white-balsamic-dressing.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 83, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine all dressing ingredients into a jar with a sealed lid.  Shake vigorously for 1-2 minutes until all ingredients are fully incorporated.  If the honey settles, stir with a spoon, then seal jar and shake vigorously again.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Drizzle desired amount of dressing onto salad (there will be a surplus to use on future salads).', u'number': 2, u'ingredients': []}], u'name': u'To make saladcombine lettuce, tomatoes, cucumber, chicken, croutons and feta cheese in a large dining bowl.  Toss to fully combine.To make White Balsamic Dressing'}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is Waterbrook Reserve Chardonnay. It has 5 out of 5 stars and a bottle costs about 20 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'ripe pear , lychee , sweet toasty oak', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 687, u'instructions': u'To make salad:combine lettuce, tomatoes, cucumber, chicken, croutons and feta cheese in a large dining bowl.  Toss to fully combine.To make White Balsamic Dressing:Combine all dressing ingredients into a jar with a sealed lid.  Shake vigorously for 1-2 minutes until all ingredients are fully incorporated.  If the honey settles, stir with a spoon, then seal jar and shake vigorously again.Drizzle desired amount of dressing onto salad (there will be a surplus to use on future salads).', u'spoonacularSourceUrl': u'https://spoonacular.com/summer-grilled-chicken-chopped-salad-with-white-balsamic-dressing-522063', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 1, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}