{u'recipes': [{u'sourceName': u'Healthy Seasonal Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/524084-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 524084, u'veryPopular': False, u'lowFodmap': False, u'title': u'sweet potato cheddar soup with chipotle', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 61.2, u'creditText': u'Healthy Seasonal Recipes', u'extendedIngredients': [{u'originalString': u'1 cup chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 chipotle chili in adobo, minced or more to taste', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'chipotle chili peppers in adobo', u'metaInformation': [u'minced', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11632, u'unit': u''}, {u'originalString': u'2 tablespoons cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoons'}, {u'originalString': u'\xbc teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'6 cups reduced-sodium vegetable broth or chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cups'}, {u'originalString': u'3 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'\xbe teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 sliced scallions, for garnish', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'sliced', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'6 ounces sharp cheddar, shredded', u'aisle': u'Cheese', u'name': u'sharp cheddar', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'ounces'}, {u'originalString': u'2 large sweet potatoes, peeled and cut into 1 \xbd inch chunks', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'large', u'peeled', u'cut into 1 \xbd inch chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'1 yellow onion, diced', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://www.healthyseasonalrecipes.com/sweet-potato-cheddar-soup-chipotle/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat oil in a large Dutch oven or heavy-bottomed soup pot over medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add onion, celery and salt and cook, stirring occasionally until the onion is softened and starting to brown, about 7 minutes. Stir in cumin and cinnamon and cook until the spices are fragrant, about 30 seconds.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add sweet potatoes and broth, cover, increase heat to high and bring to a simmer. Reduce heat to medium-low to maintain a gentle simmer, and cook, uncovered until the potatoes are completely soft and falling apart, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add chili and vinegar and remove from the heat. Working in batches, carefully transfer a few cups of the sweet potato mixture to a blender and puree. Use caution when pureeing hot liquids. Alternatively use an immersion blender. Stir cheddar into the soup until completely melted.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}]}, {u'equipment': [], u'step': u'Serve immediately with the scallions on top.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 174, u'instructions': u'Heat oil in a large Dutch oven or heavy-bottomed soup pot over medium-high heat. Add onion, celery and salt and cook, stirring occasionally until the onion is softened and starting to brown, about 7 minutes. Stir in cumin and cinnamon and cook until the spices are fragrant, about 30 seconds. Add sweet potatoes and broth, cover, increase heat to high and bring to a simmer. Reduce heat to medium-low to maintain a gentle simmer, and cook, uncovered until the potatoes are completely soft and falling apart, about 20 minutes. Add chili and vinegar and remove from the heat. Working in batches, carefully transfer a few cups of the sweet potato mixture to a blender and puree. Use caution when pureeing hot liquids. Alternatively use an immersion blender. Stir cheddar into the soup until completely melted. Serve immediately with the scallions on top.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-cheddar-soup-with-chipotle-524084', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}