{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/630951-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 630951, u'veryPopular': True, u'lowFodmap': True, u'title': u'Hazelnut Mocha Breakfast Cereal', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'pricePerServing': 72.54, u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup brewed coffee, cold', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'cold', u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 14209, u'unit': u'cup'}, {u'originalString': u"1/2 cup golden flax seed meal (I use Bob's Red Mill)", u'aisle': u'Health Foods;Baking', u'name': u'flax seed meal', u'metaInformation': [u'red', u"(I use Bob's Mill)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12220, u'unit': u'cup'}, {u'originalString': u'1 tablespoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoon'}, {u'originalString': u"1/4 cup hazelnut meal (I use Bob's Red Mill)", u'aisle': u'Gluten Free;Health Foods', u'name': u'hazelnut meal', u'metaInformation': [u'red', u"(I use Bob's Mill)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93810, u'unit': u'cup'}, {u'originalString': u"1/4 cup hulled hemp seeds (I use Bob's Red Mill)", u'aisle': u'Health Foods', u'name': u'hemp seeds', u'metaInformation': [u'red', u'hulled', u"(I use Bob's Mill)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shelled-hemp-seeds.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93602, u'unit': u'cup'}, {u'originalString': u'3 packets Stevia in the Raw', u'aisle': u'Baking', u'name': u'stevia', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'packets', u'unitShort': u'packets', u'amount': 3.0, u'consistency': u'solid', u'id': 93628, u'unit': u'packets'}, {u'originalString': u'1 tablespoon unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoon'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://theprimitivepalate.com/2015/01/08/paleo-low-carb-hazelnut-mocha-breakfast-cereal/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 300F degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Combine all of the dry ingredients into a food processor. Pulse until incorporated.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add butter and coffee, blend until a doughy-batter forms (about 30 seconds).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Spread onto a silpat or parchment-lined baking sheet. Try to get as thin as possible without having holes. (The longer the batter sets the firmer is gets, after a while I just pressed it out with my hands.)', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 15 minutes and then drop your temp to 250 and bake another 15 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pizza-cutter.jpg', u'id': 404651, u'name': u'pizza cutter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from the oven and cut into bite-sized squares, a pizza cutter works best.Turn off oven. Put pan back in and let it sit for an hour to an hour and a half until crispy.Cool completely before eating.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 516, u'instructions': u'Preheat oven to 300F degrees.Combine all of the dry ingredients into a food processor. Pulse until incorporated.Add butter and coffee, blend until a doughy-batter forms (about 30 seconds).Spread onto a silpat or parchment-lined baking sheet. Try to get as thin as possible without having holes. (The longer the batter sets the firmer is gets, after a while I just pressed it out with my hands.)Bake for 15 minutes and then drop your temp to 250 and bake another 15 minutes.Remove pan from the oven and cut into bite-sized squares, a pizza cutter works best.Turn off oven. Put pan back in and let it sit for an hour to an hour and a half until crispy.Cool completely before eating.', u'spoonacularSourceUrl': u'https://spoonacular.com/hazelnut-mocha-breakfast-cereal-630951', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}