{u'recipes': [{u'sourceName': u'Foodista', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/640508-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 640508, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cream Cheese Stuffed Baby Bell Pepper Appetizer', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'pricePerServing': 23.89, u'creditText': u'Foodista.com – The Cooking Encyclopedia Everyone Can Edit', u'extendedIngredients': [{u'originalString': u'3 ounces pkg. cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 3.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 stalks green onion, finely chopped', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u'stalks'}, {u'originalString': u'Ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 tablespoons butter or olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'12 snack peppers', u'aisle': u'Produce', u'name': u'snack peppers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 10311821, u'unit': u''}, {u'originalString': u'\xbd cup walnuts, chopped', u'aisle': u'Nuts;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 53.0, u'sourceUrl': u'http://www.foodista.com/recipe/LH47XCLV/cream-cheese-stuffed-baby-bell-peppers', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'dishTypes': [u'side dish'], u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 350 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut the bell peppers lengthwise, remove the seeds and stems.  Lightly oil the bell peppers by tossing them in a bowl with some grapeseed oil or olive oil.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'id': 10211821, u'name': u'bell pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the peppers on a baking sheet skin-side down. Roast in the oven for 8-10 minutes until the edges begin to show some color.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and allow to cool.While the peppers are roasting, prepare your stuffing.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place the cream cheese, walnuts, garlic, salt, sriracha and black pepper in a bowl and mix until creamy (I used a fork to mash the ingredients together but Im sure this can be done in a food processor or mixer).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the green onion and fold in to the cream cheese until combined.  Test the cream cheese for flavor. If you would like, add more salt and/or sriracha.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat your oven to 400 degrees. Use a spoon (or a piping bag) to stuff the peppers liberally and place them back on the baking sheet.  There is enough stuffing here to really pack those suckers up, so you dont need to worry about the amount of cream cheese youre portioning out.  If the cream cheese is very soft, place the baking sheet in the refrigerator for 15 minutes to allow it to set up. If not, place pop the peppers in the oven and bake about 8 minutes.  Change oven setting to high broil and bake an additional 2 minutes, until the tops of the cream cheese begin to brown (If theyre already brown at this point, skip the broiling).Put on a pretty plate and serve to your friends.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}], u'name': u''}], u'aggregateLikes': 81, u'instructions': u'<ol><li>Preheat the oven to 350 degrees. Cut the bell peppers lengthwise, remove the seeds and stems.  Lightly oil the bell peppers by tossing them in a bowl with some grapeseed oil or olive oil.  Place the peppers on a baking sheet skin-side down. Roast in the oven for 8-10 minutes until the edges begin to show some color.  Remove from the oven and allow to cool.</li><li>While the peppers are roasting, prepare your stuffing.  Place the cream cheese, walnuts, garlic, salt, sriracha and black pepper in a bowl and mix until creamy (I used a fork to mash the ingredients together but Im sure this can be done in a food processor or mixer). Add the green onion and fold in to the cream cheese until combined.  Test the cream cheese for flavor. If you would like, add more salt and/or sriracha.</li><li>Heat your oven to 400 degrees. Use a spoon (or a piping bag) to stuff the peppers liberally and place them back on the baking sheet.  There is enough stuffing here to really pack those suckers up, so you dont need to worry about the amount of cream cheese youre portioning out.  If the cream cheese is very soft, place the baking sheet in the refrigerator for 15 minutes to allow it to set up. If not, place pop the peppers in the oven and bake about 8 minutes.  Change oven setting to high broil and bake an additional 2 minutes, until the tops of the cream cheese begin to brown (If theyre already brown at this point, skip the broiling).</li><li>Put on a pretty plate and serve to your friends.</li></ol>', u'spoonacularSourceUrl': u'https://spoonacular.com/cream-cheese-stuffed-baby-bell-pepper-appetizer-640508', u'license': u'CC BY 3.0', u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}