{u'recipes': [{u'sourceName': u'Brown Eyed Baker', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/507803-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 23, u'id': 507803, u'veryPopular': True, u'lowFodmap': False, u'title': u'Oven-Fried Onion Rings', u'diets': [], u'preparationMinutes': 45, u'pricePerServing': 22.88, u'creditText': u'Brown Eyed Baker', u'extendedIngredients': [{u'originalString': u'\xbd cup buttermilk, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'buttermilk', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1230, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2031, u'unit': u'teaspoon'}, {u'originalString': u'Dash cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'Dash'}, {u'originalString': u'1 large egg, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'\xbd cup all-purpose flour, divided', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'\xbc ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u''}, {u'originalString': u'Dash ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'Dash'}, {u'originalString': u'2 tablespoons horseradish', u'aisle': u'Produce', u'name': u'horseradish', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002055, u'unit': u'tablespoons'}, {u'originalString': u'2 teaspoons ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 11935, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'\xbc teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'4 cups kettle-cooked potato chips', u'aisle': u'Savory Snacks', u'name': u'potato chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potato-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19411, u'unit': u'cups'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'30 saltine crackers', u'aisle': u'Savory Snacks', u'name': u'saltine crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 30.0, u'consistency': u'solid', u'id': 18228, u'unit': u''}, {u'originalString': u'6 tablespoons vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoons'}, {u'originalString': u'2 large yellow onions, cut into 24 rings (see note)', u'aisle': u'Produce', u'name': u'yellow onions', u'metaInformation': [u'yellow', u'large', u'cut into 24 rings (see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.browneyedbaker.com/2010/06/16/oven-fried-onion-rings-take-ii/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Adjust oven racks to lower-middle and upper-middle positions and heat oven to 450 degrees F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place \xbc cup flour in shallow baking dish. Beat egg and buttermilk together in bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk remaining \xbc cup flour, cayenne, salt and pepper into buttermilk mixture. Pulse saltines and potato chips together in food processor until finely ground; 8 to 10 pulses.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potato-chips.jpg', u'id': 19411, u'name': u'potato chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/saltine-crackers.jpg', u'id': 18228, u'name': u'saltine crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place crumb mixture in second shallow baking dish.2. Working one at a time, dredge each onion ring in flour, shaking off excess. Dip rings in buttermilk mixture, allowing excess to drip back into bowl, then drop into crumb coating, turning rings to coat evenly.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk.jpg', u'id': 1230, u'name': u'buttermilk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Transfer coated rings to large plate or tray.3.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Pour 3 tablespoons oil onto each of two rimmed baking sheets.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place baking sheets in oven and heat until just smoking, about 8 minutes. Carefully tilt heated sheets to coat evenly with oil, then arrange onion rings on sheets. Baking, flipping onion rings and switching and rotating position of baking sheets halfway through baking, until golden brown on both sides, about 15 minutes. Briefly drain onion rings on paper towel-lined plate.', u'length': {u'number': 23, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Serve immediately.* Note 1: Slice the onions into \xbd-inch-thick rounds, separate the rings, and discard any rings smaller than 2 inches in diameter. It will depend on the size of your onions, but both of mine ended up being sliced into 4 to get the \xbd-inch-thick rounds.* Note 2: The onion rings can be breaded in advance and refrigerated for up to an hour.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Combine all ingredients and refrigerate.', u'number': 1, u'ingredients': []}], u'name': u'Let them sit at room temperature for 30 minutes before baking them; if baked while still chilled from the refrigerator, the onions will not cook enough to soften and will remain crunchy.4. To make the Dipping Sauce'}], u'winePairing': {u'pairingText': u"Fingerfood can be paired with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Nicolas Feuillatte Blanc de Blancs with a 4.4 out of 5 star rating seems like a good match. It costs about 65 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Subtle glints of lime-blossom green, with delicate, abundant bubbles. The wine offers aromas of white flowers, such ashawthorn and acacia, as well as more subtle scents of citrus fruits, pears and even limeblossom. Very generous on the palate. Lively, fresh and powerful on the attack. View More', u'title': u'Nicolas Feuillatte Blanc de Blancs', u'price': u'$64.99', u'id': 442400, u'link': u'https://www.wine.com/product/nicolas-feuillatte-blanc-de-blancs-2005/127127', u'imageUrl': u'https://spoonacular.com/productImages/442400-312x231.jpg'}]}, u'aggregateLikes': 4442, u'instructions': u'1. Adjust oven racks to lower-middle and upper-middle positions and heat oven to 450 degrees F. Place \xbc cup flour in shallow baking dish. Beat egg and buttermilk together in bowl. Whisk remaining \xbc cup flour, cayenne, salt and pepper into buttermilk mixture. Pulse saltines and potato chips together in food processor until finely ground; 8 to 10 pulses.Place crumb mixture in second shallow baking dish.2. Working one at a time, dredge each onion ring in flour, shaking off excess. Dip rings in buttermilk mixture, allowing excess to drip back into bowl, then drop into crumb coating, turning rings to coat evenly.Transfer coated rings to large plate or tray.3. Pour 3 tablespoons oil onto each of two rimmed baking sheets. Place baking sheets in oven and heat until just smoking, about 8 minutes. Carefully tilt heated sheets to coat evenly with oil, then arrange onion rings on sheets. Baking, flipping onion rings and switching and rotating position of baking sheets halfway through baking, until golden brown on both sides, about 15 minutes. Briefly drain onion rings on paper towel-lined plate. Serve immediately.* Note 1: Slice the onions into \xbd-inch-thick rounds, separate the rings, and discard any rings smaller than 2 inches in diameter. It will depend on the size of your onions, but both of mine ended up being sliced into 4 to get the \xbd-inch-thick rounds.* Note 2: The onion rings can be breaded in advance and refrigerated for up to an hour. Let them sit at room temperature for 30 minutes before baking them; if baked while still chilled from the refrigerator, the onions will not cook enough to soften and will remain crunchy.4. To make the Dipping Sauce: Combine all ingredients and refrigerate.', u'spoonacularSourceUrl': u'https://spoonacular.com/oven-fried-onion-rings-507803', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}