{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/224571-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 224571, u'veryPopular': True, u'lowFodmap': False, u'title': u'Broccoli & cauliflower cheese', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 73.69, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 small head broccoli, broken into small florets', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'head', u'unitShort': u'head', u'amount': 1.0, u'consistency': u'solid', u'id': 11090, u'unit': u'head'}, {u'originalString': u'50g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1 small cauliflower, leaves removed and broken into small florets', u'aisle': u'Produce', u'name': u'cauliflower', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cauliflower.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11135, u'unit': u''}, {u'originalString': u'100g strong cheddar, or vegetarian alternative', u'aisle': u'Cheese', u'name': u'cheddar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1009, u'unit': u'g'}, {u'originalString': u'2 tbsp snipped chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'snipped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tbsp'}, {u'originalString': u'50g flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'500ml milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 500.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}, {u'originalString': u'1 tsp mustard powder', u'aisle': u'Spices and Seasonings', u'name': u'mustard powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'tsp'}], u'healthScore': 16.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1272637/broccoli-and-cauliflower-cheese', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a very large saucepan, cook thecauliflower in boiling salted water for5 mins. Then add the broccoli and cookfor 3 mins more.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain well and transferto a large ovenproof dish.To make the cheese sauce, melt thebutter in a small pan. When foaming, addflour and mustard powder, and cook for1 min, stirring constantly. Take off theheat and add the milk, a little at a time,stirring constantly to get rid of any lumps.Once half the milk has been added,return to the heat and add the remainingmilk. Keep stirring and bring to the boil,then turn down to a simmer and cook for2 mins, until thickened and smooth.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'id': 1002024, u'name': u'mustard powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Addmost of the cheese and some seasoningthen take off the heat and add the chives.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}, {u'equipment': [], u'step': u'Pour the sauce over the vegetablesand sprinkle with the remaining cheese.This can be done the day before and keptcovered in the fridge. Cook in the ovenwith the pork for 35-40 mins until bubbling,allowing an extra 5-10 mins cooking timeif from the fridge.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [], u'step': u'Serve with the pork.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 422, u'instructions': u'In a very large saucepan, cook thecauliflower in boiling salted water for5 mins. Then add the broccoli and cookfor 3 mins more. Drain well and transferto a large ovenproof dish.To make the cheese sauce, melt thebutter in a small pan. When foaming, addflour and mustard powder, and cook for1 min, stirring constantly. Take off theheat and add the milk, a little at a time,stirring constantly to get rid of any lumps.Once half the milk has been added,return to the heat and add the remainingmilk. Keep stirring and bring to the boil,then turn down to a simmer and cook for2 mins, until thickened and smooth. Addmost of the cheese and some seasoningthen take off the heat and add the chives.Pour the sauce over the vegetablesand sprinkle with the remaining cheese.This can be done the day before and keptcovered in the fridge. Cook in the ovenwith the pork for 35-40 mins until bubbling,allowing an extra 5-10 mins cooking timeif from the fridge. Serve with the pork.', u'spoonacularSourceUrl': u'https://spoonacular.com/broccoli-cauliflower-cheese-224571', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 75, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}