{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/696339-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 696339, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pear-Quinoa Salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 96.77, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'2 tablespoons walnut oil or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup snipped fresh chives', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'snipped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11156, u'unit': u'cup'}, {u'originalString': u'2 ripe but firm pears, diced', u'aisle': u'Produce', u'name': u'pears', u'metaInformation': [u'diced', u'firm', u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'1/4 teaspoon freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup quinoa (see Tips), rinsed if necessary', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'rinsed', u'(see Tips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 14-ounce can reduced-sodium chicken broth or vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'reduced-sodium', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ounce'}, {u'originalString': u'1 tablespoon fruity vinegar, such as pear, raspberry or pomegranate', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vinegar', u'metaInformation': [u'fruity', u' such as pear, raspberry or pomegranate'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoon'}, {u'originalString': u'1/2 cup coarsely chopped walnuts or pecans, toasted (see Tips)', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'toasted', u'coarsely chopped', u'(see Tips)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 58.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/pear_quinoa_salad.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Bring broth to a boil in a large saucepan. Stir in quinoa, reduce heat to maintain a simmer, cover and cook until the liquid is absorbed and the quinoa has popped, about 15 minutes.Meanwhile, whisk oil, vinegar, chives, salt and pepper in a large bowl.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add pears and toss to coat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'id': 9252, u'name': u'pear'}]}, {u'equipment': [], u'step': u'Drain any excess liquid from the cooked quinoa, if necessary.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the quinoa to the pear mixture; toss to combine.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'id': 9252, u'name': u'pear'}]}, {u'equipment': [], u'step': u'Transfer to the refrigerator to cool for about 15 minutes or serve warm.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve topped with nuts.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad on the menu? Try pairing with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Downton Abbey Countess of Grantham Chardonnay. It has 5 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 5257, u'instructions': u'Bring broth to a boil in a large saucepan. Stir in quinoa, reduce heat to maintain a simmer, cover and cook until the liquid is absorbed and the quinoa has popped, about 15 minutes.Meanwhile, whisk oil, vinegar, chives, salt and pepper in a large bowl. Add pears and toss to coat.Drain any excess liquid from the cooked quinoa, if necessary. Add the quinoa to the pear mixture; toss to combine. Transfer to the refrigerator to cool for about 15 minutes or serve warm. Serve topped with nuts.', u'spoonacularSourceUrl': u'https://spoonacular.com/pear-quinoa-salad-696339', u'dishTypes': [u'side dish', u'salad'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}