{u'recipes': [{u'sourceName': u'Rachel Cooks', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/608151-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 608151, u'veryPopular': True, u'lowFodmap': False, u'title': u'5-ingredient Grilled Pesto Pizza', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 151.7, u'creditText': u'Rachel Cooks', u'extendedIngredients': [{u'originalString': u'\xbd cup basil pesto', u'aisle': u'Pasta and Rice', u'name': u'basil pesto', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93698, u'unit': u'cup'}, {u'originalString': u'1 1-lb to 1.25-lb. ball pizza dough, preferably whole-grain', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 93610, u'unit': u'lb'}, {u'originalString': u'1 cup shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'cup'}, {u'originalString': u'1 large tomato, sliced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 38.0, u'sourceUrl': u'http://www.rachelcooks.com/2014/08/15/grilled-pizza-pesto-tomatoes-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Preheat grill to medium heat.Dust work surface with flour.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Roll pizza dough out to 15 to 16 inches. Sprinkle flour or cornmeal on a large un-rimmed baking sheet or pizza peel.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93610, u'name': u'pizza dough'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer the pizza dough to the baking sheet or peel.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'id': 93610, u'name': u'pizza dough'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Brush grill grate to clean it and oil it with an oil soaked towel. Slide the dough off the baking sheet or peel onto the grill and cook until it is firmed up and crisped on the bottom, 2 to 3 minutes.Carefully, Flip the dough over using the peel or tongs and baking sheet.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Spread the pesto over the dough. Top with tomatoes and cheddar. Cover the grill and cook until the cheese is melted and the bottom of the crust is crispy, 5 to 7 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1009, u'name': u'cheddar cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are my top picks for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Selvapiana Chianti Rufina. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 14 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses. View More', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 399, u'instructions': u'Preheat grill to medium heat.Dust work surface with flour. Roll pizza dough out to 15 to 16 inches. Sprinkle flour or cornmeal on a large un-rimmed baking sheet or pizza peel. Transfer the pizza dough to the baking sheet or peel.Brush grill grate to clean it and oil it with an oil soaked towel. Slide the dough off the baking sheet or peel onto the grill and cook until it is firmed up and crisped on the bottom, 2 to 3 minutes.Carefully, Flip the dough over using the peel or tongs and baking sheet. Spread the pesto over the dough. Top with tomatoes and cheddar. Cover the grill and cook until the cheese is melted and the bottom of the crust is crispy, 5 to 7 minutes.', u'spoonacularSourceUrl': u'https://spoonacular.com/5-ingredient-grilled-pesto-pizza-608151', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 5, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}