{u'recipes': [{u'sourceName': u'Skinny Taste', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/6245-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 6245, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Snapper Fillet', u'diets': [u'dairy free', u'pescatarian'], u'pricePerServing': 221.1, u'creditText': u'Skinny Taste', u'extendedIngredients': [{u'originalString': u'2 tbsp fresh rosemary or fresh oregano', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tbsp'}, {u'originalString': u'3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tbsp Italian seasoned breadcrumbs', u'aisle': u'Bakery/Bread;Oil, Vinegar, Salad Dressing;Baking', u'name': u'italian seasoned breadcrumbs', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18376, u'unit': u'tbsp'}, {u'originalString': u'kosher salt and fresh pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'fresh lemon wedges for serving', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [u'fresh', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'2 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'3 snapper fillets, 8 oz each', u'aisle': u'Seafood', u'name': u'snapper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-snapper-fresh.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 3.0, u'consistency': u'solid', u'id': 15101, u'unit': u'fillet'}], u'healthScore': 65.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.skinnytaste.com/2011/05/roasted-snapper-fillet-and-sustainable.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 450. Rinse and dry fish well. Line a broiler rack with aluminum foil. Lightly spray with oil.Rub fish with 1 tsp olive oil and season with salt and pepper, garlic and rosemary.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place skin side down on oven rack and sprinkle bread crumbs on top.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle remaining oil and bake until fish is cooked through, about 15-20 minutes.Print This4 SP 6 PP Fish Recipes Lenten Friendly Recipes Main Dishes Recipes Seafood Recipesposted May 10, 2011 by Gina26 Comments', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Red Snapper can be paired with Pinot Noir, Pinot Grigio, and Gruener Veltliner. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Beaux Freres The Beaux Freres Vineyard Pinot Noir. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 56 dollars per bottle.", u'pairedWines': [u'pinot noir', u'pinot grigio', u'gruener veltliner'], u'productMatches': [{u'description': u'Shows dark plum/garnet with some amber and orange at the edge. The nose shows roasted herbs and meatiness with some background notes of sweet cherry, truffle and vegetal qualities. This is a distinctive Pinot Noir with aromatics that are very old-world. In the mouth the wine has always had a certain austerity but a bit of a gap in the middle. The wine has held up nicely over time but has never really developed the sweetness and charm that we would expect of our best Pinot Noirs.', u'title': u'Beaux Freres The Beaux Freres Vineyard Pinot Noir', u'price': u'$55.99', u'id': 445451, u'link': u'https://www.wine.com/product/beaux-freres-the-beaux-freres-vineyard-pinot-noir-1996/126352', u'imageUrl': u'https://spoonacular.com/productImages/445451-312x231.jpg'}]}, u'aggregateLikes': 134, u'instructions': u'Preheat oven to 450. Rinse and dry fish well. Line a broiler rack with aluminum foil. Lightly spray with oil.Rub fish with 1 tsp olive oil and season with salt and pepper, garlic and rosemary.Place skin side down on oven rack and sprinkle bread crumbs on top.Drizzle remaining oil and bake until fish is cooked through, about 15-20 minutes.Print This4 SP 6 PP Fish Recipes Lenten Friendly Recipes Main Dishes Recipes Seafood Recipesposted May 10, 2011 by Gina26 Comments', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-snapper-fillet-6245', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}