{u'recipes': [{u'sourceName': u'Nutrition Stripped ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/538035-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 538035, u'veryPopular': False, u'lowFodmap': False, u'title': u'Raw Pumpkin Pie Cheesecake', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'vegan'], u'preparationMinutes': 300, u'pricePerServing': 247.21, u'creditText': u'Nutrition Stripped ', u'extendedIngredients': [{u'originalString': u'1 cup raw almonds, ground', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12061, u'unit': u'cup'}, {u'originalString': u'1\xbd cans organic pumpkin puree (15 oz. cans)', u'aisle': u'Baking', u'name': u'canned pumpkin puree', u'metaInformation': [u'organic', u'(15 oz. cans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cans', u'unitShort': u'cans', u'amount': 1.5, u'consistency': u'solid', u'id': 11424, u'unit': u'cans'}, {u'originalString': u'2 tablespoons organic coconut oil', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u'1 cup dates, pitted and chopped', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'pitted', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9087, u'unit': u'cup'}, {u'originalString': u'\xbd cup hazelnuts, ground', u'aisle': u'Baking', u'name': u'hazelnuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12120, u'unit': u'cup'}, {u'originalString': u'1\xbd cups maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 19911, u'unit': u'cups'}, {u'originalString': u'\xbc teaspoon freshly grated nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon pumpkin pie spice', u'aisle': u'Spices and Seasonings', u'name': u'pumpkin pie spice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002035, u'unit': u'teaspoon'}, {u'originalString': u'2 cups raw cashews', u'aisle': u'Nuts;Savory Snacks', u'name': u'raw cashews', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 12087, u'unit': u'cups'}, {u'originalString': u'pinch of sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'pinch'}, {u'originalString': u'\xbd cup shredded coconut, unsweetened', u'aisle': u'Baking', u'name': u'unsweetened shredded coconut', u'metaInformation': [u'shredded', u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012108, u'unit': u'cup'}, {u'originalString': u'1 cup raw walnuts, ground', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'raw'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12155, u'unit': u'cup'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://nutritionstripped.com/raw-pumpkin-pie-cheesecake/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'CRUST //', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Combine all ingredients in a food processor or high speed blender until combined. The desired texture is a chunky and sticky "dough". You should be able to squeeze the dough in your fingertips and it create a firm crust.In a spring form tart pan (I used 12in.), pour the crust mixture into the bottom and spread evenly.Firmly press and crust into and around the sides of the tart pan until a thick bottom layer has been created.Freeze for at least 3 hours.While you\'re waiting for the crust to harden, start making the filling.FILLING //', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u"Combine all ingredients into a high speed blender starting with the cashews first, then adding in remaining ingredients. A high speed blender will be the best option as this mixture is very thick and creamy.Set mixture aside in a small mixing bowl in the fridge.When your crust is done chilling, pour the filling mixture into the tart pan using a spatula to evenly spread the filling mixture.Freeze the whole pie for at least 2 hours prior to serving.When you're ready to serve, thaw at room temperature for about 30 minutes or until the pumpkin pie filling is thick, creamy, and cool- it should not be frozen.This will keep very well in the freezer if you have leftovers.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashews.jpg', u'id': 12087, u'name': u'cashews'}]}, {u'equipment': [], u'step': u'Garnish with Coconut Whipped Cream (recipe on my blog).Top with fresh cinnamon and nuts of your choice.Enjoy!', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 302, u'instructions': u'CRUST //Combine all ingredients in a food processor or high speed blender until combined. The desired texture is a chunky and sticky "dough". You should be able to squeeze the dough in your fingertips and it create a firm crust.In a spring form tart pan (I used 12in.), pour the crust mixture into the bottom and spread evenly.Firmly press and crust into and around the sides of the tart pan until a thick bottom layer has been created.Freeze for at least 3 hours.While you\'re waiting for the crust to harden, start making the filling.FILLING //Combine all ingredients into a high speed blender starting with the cashews first, then adding in remaining ingredients. A high speed blender will be the best option as this mixture is very thick and creamy.Set mixture aside in a small mixing bowl in the fridge.When your crust is done chilling, pour the filling mixture into the tart pan using a spatula to evenly spread the filling mixture.Freeze the whole pie for at least 2 hours prior to serving.When you\'re ready to serve, thaw at room temperature for about 30 minutes or until the pumpkin pie filling is thick, creamy, and cool- it should not be frozen.This will keep very well in the freezer if you have leftovers.Garnish with Coconut Whipped Cream (recipe on my blog).Top with fresh cinnamon and nuts of your choice.Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/raw-pumpkin-pie-cheesecake-538035', u'dishTypes': [], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 300, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}