{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/600592-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 600592, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ci Ci’s Cherry Pizza', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 75.56, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'1 tablespoon Brown Sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup Softened Butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 Can Cherry Pie Filling (20 ounces)', u'aisle': u'Baking', u'name': u'cherry pie filling', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-pie-filling.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 19314, u'unit': u'ounces'}, {u'originalString': u'1/2 cup Flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 Package Pizza Mix (prepared as directed)', u'aisle': u'Baking', u'name': u'pizza mix', u'metaInformation': [u'prepared', u'( as directed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'Package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 98924, u'unit': u'Package'}, {u'originalString': u"12' Pizza Pan", u'aisle': u'Baking', u'name': u'pizza mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 98924, u'unit': u'servings'}, {u'originalString': u'1/8 teaspoon Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'Crumb Topping', u'aisle': u'Savory Snacks', u'name': u'cracker crumb', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crackers.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10018621, u'unit': u'servings'}, {u'originalString': u'3 tablespoon Sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.copykat.com/2009/02/06/ci-cis-cherry-pizza/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare pizza dough as directed.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread pizza dough on greased pizza pant and prick with a fork 8 - 10 times.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in preheated oven at 450 degrees for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove pizza dough from oven and spread with cherry pie filling. Sprinkle with 1/4 cup of crumb topping and place back into oven and bake for 20 - 25 minutes.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-pie-filling.jpg', u'id': 19314, u'name': u'cherry pie filling'}]}, {u'equipment': [], u'step': u'Remove pizza when dough is golden brown.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve as a desert or a wonderful after school snack for the gang.Crumb Topping Directions', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Mix flour, sugar, brown sugar, and salt.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Place butter with mixture and blend until the topping resembles corn meal. This topping can also be used on baked fruit deserts.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Cecchi Sangiovese di Toscana with a 4.1 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'The red wine is made according to traditional methods, along with the help of modern technology and with much care. It has a ruby red colour with purple lights, and a delicate fruity bouquet reminiscent of violets and irises. Its good structure, well combined with a moderate acidity, can be distinguished on the palate. Although lacking in sharp tannins, the generous taste of the Sangiovese guarantees a wine that ages well. This wine is pleasant with cold and hot meat dishes and when young should be served at a temperature of 16 \xb0C.', u'title': u'Cecchi Sangiovese di Toscana', u'price': u'$9.49', u'id': 439017, u'link': u'https://www.wine.com/product/cecchi-sangiovese-di-toscana-2000/48873', u'imageUrl': u'https://spoonacular.com/productImages/439017-312x231.jpg'}]}, u'aggregateLikes': 262, u'instructions': u'Prepare pizza dough as directed. Spread pizza dough on greased pizza pant and prick with a fork 8 - 10 times. Place in preheated oven at 450 degrees for 5 minutes. Remove pizza dough from oven and spread with cherry pie filling. Sprinkle with 1/4 cup of crumb topping and place back into oven and bake for 20 - 25 minutes. Remove pizza when dough is golden brown. Serve as a desert or a wonderful after school snack for the gang.Crumb Topping DirectionsMix flour, sugar, brown sugar, and salt. Place butter with mixture and blend until the topping resembles corn meal. This topping can also be used on baked fruit deserts.', u'spoonacularSourceUrl': u'https://spoonacular.com/ci-cis-cherry-pizza-600592', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}