{u'recipes': [{u'sourceName': u'Life as a Strawberry', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/532837-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 532837, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow Cooker BBQ Chicken Sandwiches', u'diets': [u'dairy free'], u'pricePerServing': 107.96, u'creditText': u'Life as a Strawberry', u'extendedIngredients': [{u'originalString': u'1 large avocado, sliced', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u"1/2 cup of your favorite BBQ sauce (I like Jack Daniel's Original No. 7)", u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'your favorite', u"(I like Jack Daniel's Original No. 7)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 6150, u'unit': u'cup'}, {u'originalString': u'2 chicken breasts', u'aisle': u'Meat', u'name': u'chicken breasts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'4 hamburger buns or dinner rolls', u'aisle': u'Bakery/Bread;Frozen', u'name': u'dinner yeast rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dinner-yeast-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18347, u'unit': u''}, {u'originalString': u'4 tsp. prepared horseradish sauce (optional)', u'aisle': u'Condiments', u'name': u'horseradish sauce', u'metaInformation': [u'prepared'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 2055, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. hot sauce (I like sriracha or anything with a kick)', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'or anything with a kick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6168, u'unit': u'tsp'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/2 tsp. worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 6971, u'unit': u'tsp'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 60.0, u'sourceUrl': u'http://www.lifeasastrawberry.com/slow-cooker-bbq-chicken-sandwiches/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Place all ingredients in a small slow cooker and toss with a pair of tongs (or your hands) to coat the chicken on all sides. Cook on low for 6-10 hours.When you’re ready to eat, turn off the slow cooker and shred the chicken with two forks. The chicken should be very soft and shred with very little effort – yayyyyy, slow cookers!Put a big scoop of BBQ chicken onto the bottom half of each bun.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread 1 tsp. of horseradish on the top piece of each bun.Top chicken with a few slices of fresh avocado and pop the top of the bun on to complete your sandwich. Enjoy!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/horseradish.jpg', u'id': 1002055, u'name': u'horseradish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The NV Mindbender Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'butterscotch , citrus , vanilla', u'title': u'NV Mindbender Chardonnay', u'price': u'$12.0', u'id': 428583, u'link': u'https://www.amazon.com/Mindbender-California-Chardonnay-White-Wine/dp/B00GB87SJQ', u'imageUrl': u'https://spoonacular.com/productImages/428583-312x231.jpg'}]}, u'aggregateLikes': 480, u'instructions': u'Place all ingredients in a small slow cooker and toss with a pair of tongs (or your hands) to coat the chicken on all sides. Cook on low for 6-10 hours.When you’re ready to eat, turn off the slow cooker and shred the chicken with two forks. The chicken should be very soft and shred with very little effort – yayyyyy, slow cookers!Put a big scoop of BBQ chicken onto the bottom half of each bun. Spread 1 tsp. of horseradish on the top piece of each bun.Top chicken with a few slices of fresh avocado and pop the top of the bun on to complete your sandwich. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-bbq-chicken-sandwiches-532837', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}