{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/245506-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 245506, u'veryPopular': False, u'lowFodmap': False, u'title': u'Shrimp and Avocado Salad', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30', u'pescatarian'], u'pricePerServing': 228.91, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'2 ripe avocados', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'ripe'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1 Tbsp chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'Tbsp'}, {u'originalString': u'1/2 lb small or extra small shrimp, cooked, peeled, and de-veined', u'aisle': u'Seafood', u'name': u'extra large shrimp', u'metaInformation': [u'small', u'cooked', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 15152, u'unit': u'lb'}, {u'originalString': u'1 green onion, thinly sliced', u'aisle': u'Produce', u'name': u'green onion', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'Lemon slices for garnish', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u'slices'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'Lettuce - preferably butter lettuce or red leaf lettuce', u'aisle': u'Produce', u'name': u'red leaf lettuce', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lollo-rosso.jpg', u'unitLong': u'leaf', u'unitShort': u'leaf', u'amount': 1.0, u'consistency': u'solid', u'id': 11257, u'unit': u'leaf'}, {u'originalString': u'Optional - 2 Tbsp chopped roasted walnuts or pistachios', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnuts', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12155, u'unit': u'Tbsp'}, {u'originalString': u'1/4 cup of white wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white wine vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1002068, u'unit': u'cup'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/shrimp_and_avocado_salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine oil, vinegar, and green onions in a bowl. Chop shrimp into 1/2 inch pieces and add to oil mixture.2 Arrange leaves of lettuce on individual plates.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Cut avocados in half and remove pits.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [], u'step': u'Remove some of the avocado around the pit area and mix in with the shrimp. With a spoon, carefully scoop out avocado halves from their skins in one piece.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Place avocado half on plate with lettuce.3 Spoon shrimp mixture on to avocado. Sprinkle with walnuts and cilantro (optional).', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Serve with lemon slices for garnish.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are great choices for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Kris Pinot Grigio with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Brilliant lemon-green in color, KRIS offers enticing aromas of acacia flowers, citrus, tangerine, and hints of almonds.Try pairing with risotto, tossed salads, homemade pasta and grilled white meats or salmon.Blend: 100% Pinot Grigio View More', u'title': u'Kris Pinot Grigio', u'price': u'$14.99', u'id': 433207, u'link': u'https://www.wine.com/product/kris-pinot-grigio-2016/206138', u'imageUrl': u'https://spoonacular.com/productImages/433207-312x231.jpg'}]}, u'aggregateLikes': 203, u'instructions': u'1 Combine oil, vinegar, and green onions in a bowl. Chop shrimp into 1/2 inch pieces and add to oil mixture.2 Arrange leaves of lettuce on individual plates. Cut avocados in half and remove pits. Remove some of the avocado around the pit area and mix in with the shrimp. With a spoon, carefully scoop out avocado halves from their skins in one piece. Place avocado half on plate with lettuce.3 Spoon shrimp mixture on to avocado. Sprinkle with walnuts and cilantro (optional).Serve with lemon slices for garnish.', u'spoonacularSourceUrl': u'https://spoonacular.com/shrimp-and-avocado-salad-245506', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}