{u'recipes': [{u'sourceName': u'Cooking Ala Mel', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520116-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 520116, u'veryPopular': False, u'lowFodmap': False, u'title': u'Healthier Buffalo Chicken Mac and Cheese', u'diets': [u'gluten free'], u'pricePerServing': 194.96, u'creditText': u'Cooking Ala Mel', u'extendedIngredients': [{u'originalString': u'1/2 tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'16 oz. (about 4 cups) pasta (I used gluten free brown rice & quinoa fusilli)', u'aisle': u'Pasta and Rice', u'name': u'gluten free pasta', u'metaInformation': [u'gluten free', u'(I used brown rice & quinoa fusilli)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 98875, u'unit': u'cups'}, {u'originalString': u"1 cup Red Hot sauce (use less if you don't like things spicy)", u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'red', u"(use less if you don't like things spicy)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'cup'}, {u'originalString': u'3 cups fresh kale, chopped', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'1/2 tsp onion powder', u'aisle': u'Spices and Seasonings', u'name': u'onion powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2026, u'unit': u'tsp'}, {u'originalString': u'1 tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 cup plain greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'8 oz. (about 2 cups) sharp cheddar cheese, shredded', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'cups'}, {u'originalString': u'4 oz. (about 1 cup) mozzarella cheese, shredded', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds boneless, skinless chicken breast, cooked & shredded', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'shredded', u'boneless', u'skinless', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://cookingalamel.com/2014/03/healthier-buffalo-chicken-mac-and-cheese.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook the pasta according to the package’s instructions (about 8-10 minutes), until al dente.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the kale in the bottom of a strainer, and pour the pasta over top to drain and wilt the kale. Save about 1 cup of the pasta water. Return the cooked pasta and wilted kale to the pot.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add about 1/2 cup of the reserved pasta water to the pot, and stir in the cheese until melted. Stir in the shredded chicken, Red Hot, salt, pepper, garlic powder, onion powder, and greek yogurt, until smooth and creamy. Stir in the remaining pasta water to thin, if necessary. Top with scallions, if using, and serve immediately.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-powder.jpg', u'id': 2026, u'name': u'onion powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Macaroni and Cheese on the menu? Try pairing with Chenin Blanc, Lambrusco, and Riesling. With rich, cheesy mac & cheese you'll want to cleanse the palate with something crisp and acidic. We recommend Chenin Blanc, Riesling, or dry Lambrusco if you're in the mood for a red. You could try Essay Chenin Blanc. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 9 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'lambrusco', u'riesling'], u'productMatches': [{u'description': u"The Essay Chenin Blanc is a medium-bodied white blend made from South Africa's white varietal, Chenin Blanc. The Chenin Blanc gives the wines its fruit salad, guava and melon aromas and a refreshing acidity. Some sur lie on the less for a few months adds to the complexity and body. A touch of aromatic Viognier complements the fruit structure with some floral hints. The wine is perfect on its own as an aperitif on the porch on a hot summer's day. Chenin Blanc pairs well with a wide range of foods, especially sushi, oysters, Asian curries, sweet-and-sour dishes, and summer salads.Blend: 87% Chenin Blanc, 13% Viognier", u'title': u'Essay Chenin Blanc', u'price': u'$8.99', u'id': 439943, u'link': u'https://www.wine.com/product/essay-chenin-blanc-2014/139942', u'imageUrl': u'https://spoonacular.com/productImages/439943-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Cook the pasta according to the package’s instructions (about 8-10 minutes), until al dente.Place the kale in the bottom of a strainer, and pour the pasta over top to drain and wilt the kale. Save about 1 cup of the pasta water. Return the cooked pasta and wilted kale to the pot.Add about 1/2 cup of the reserved pasta water to the pot, and stir in the cheese until melted. Stir in the shredded chicken, Red Hot, salt, pepper, garlic powder, onion powder, and greek yogurt, until smooth and creamy. Stir in the remaining pasta water to thin, if necessary. Top with scallions, if using, and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/healthier-buffalo-chicken-mac-and-cheese-520116', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}