{u'recipes': [{u'sourceName': u'Contentedness Cooking', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/668308-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 668308, u'veryPopular': True, u'lowFodmap': False, u'title': u'Cherry-Onion Crostini', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 715.73, u'creditText': u'Contentedness Cooking', u'extendedIngredients': [{u'originalString': u'your favorite baguette', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u'serving'}, {u'originalString': u'8 oz (250 g) tart cherries, pitted and halved', u'aisle': u'Produce', u'name': u'cherries', u'metaInformation': [u'pitted', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 9070, u'unit': u'g'}, {u'originalString': u'1-2 Tbs olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbs'}, {u'originalString': u'1 red onion, small', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'5 oz (150 g) vegan sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'vegan sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 93608, u'unit': u'g'}, {u'originalString': u'1 yellow onion, small', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.contentednesscooking.com/cherry-onion-crostini/', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Wash the tart cherries, cut in halves, and remove pits.Peel the onions and cut into rings.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat olive oil in a medium sauce pan.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onion rings and sautee for 5-10 minutes until they soften. Then add the cherry halves and cook for another 5-10 minutes.To assemble to crostini, put a good teaspoon of the vegan sour cream on top of a baguette slice, then add the cherry-onion mix. If you like, you can also toast the baguette slices first.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 93608, u'name': u'vegan sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sliced-baguette-or-crostini.jpg', u'id': 10018033, u'name': u'crostini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherries.jpg', u'id': 9070, u'name': u'cherries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood can be paired with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Ruffino Prosecco with a 4.2 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Ruffino Prosecco has been produced from grapes grown in the hilly area of Valdobbiadene, which is the most historically vocated region for the production of Prosecco.Bright straw yellow with fine bubbles.  The bouquet is fragrant and intensely fruity. It shows clean notes of apples, pears and citrus, accompanied by slight hints of hawthorn, wisteria and elder.  Crisp, clean and delicate with fine bubble caressing. Intense sensations of apples and peaches drive a pleasant aftertaste, that is reminiscent of fruity and floral aromas.Ideal as an aperitif; it is very versatile as a food companion. Ruffino Prosecco perfectly matches with pizza, fish and shellfish dishes as well as white meat dishes. View More', u'title': u'Ruffino Prosecco', u'price': u'$12.99', u'id': 447373, u'link': u'https://www.wine.com/product/ruffino-prosecco/111308', u'imageUrl': u'https://spoonacular.com/productImages/447373-312x231.jpg'}]}, u'aggregateLikes': 1176, u'instructions': u'Wash the tart cherries, cut in halves, and remove pits.Peel the onions and cut into rings.Heat olive oil in a medium sauce pan. Add the onion rings and sautee for 5-10 minutes until they soften. Then add the cherry halves and cook for another 5-10 minutes.To assemble to crostini, put a good teaspoon of the vegan sour cream on top of a baguette slice, then add the cherry-onion mix. If you like, you can also toast the baguette slices first.', u'spoonacularSourceUrl': u'https://spoonacular.com/cherry-onion-crostini-668308', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}