{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/792584-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 792584, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Coconut Cream Pie', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 74.21, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'Toasted shredded or flaked coconut, for topping', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded', u'flaked', u'toasted', u'for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 12104, u'unit': u'servings'}, {u'originalString': u'1 graham cracker crust pie shell (see below)', u'aisle': u'Baking', u'name': u'graham cracker pie crust', u'metaInformation': [u'(see below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust-graham-cracker.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18942, u'unit': u''}, {u'originalString': u'1\xbe cups light coconut milk (not coconut milk beverage)', u'aisle': u'Canned and Jarred', u'name': u'light coconut milk', u'metaInformation': [u'light', u'(not coconut milk beverage)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'liquid', u'id': 99009, u'unit': u'cups'}, {u'originalString': u'1 box Jell-O Pudding-Cook & Serve Coconut Cream Pudding & Pie Filling', u'aisle': u'Sweet Snacks;Health Foods', u'name': u'soy pudding', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pudding-chocolate.jpg', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'liquid', u'id': 93700, u'unit': u'box'}, {u'originalString': u'Whipped Coconut Cream (store-bought or homemade), optional for topping', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'coconut cream', u'metaInformation': [u'homemade', u'store-bought', u'for topping', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 12115, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 28.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/easy-coconut-cream-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Follow the package directions to make the pudding, but use 1 cups light canned coconut milk in place of the milk.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the pie filling into the prepared pie shell.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool.Refrigerate the pie for at least 3 hours, or until set.Optionally top with whipped coconut cream. Sprinkle with toasted coconut before serving.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-cream.jpg', u'id': 12115, u'name': u'coconut cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Coconut Cream Pie works really well with Vin Santo, Late Harvest Riesling, and Lambrusco Dolce. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Snake River Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'vin santo', u'late harvest riesling', u'lambrusco dolce'], u'productMatches': [{u'description': u'honey , minerality , lime', u'title': u'Snake River Late Harvest Riesling', u'price': u'$16.0', u'id': 431450, u'link': u'https://www.amazon.com/2010-Snake-River-Harvest-Riesling/dp/B00GWUM1A4', u'imageUrl': u'https://spoonacular.com/productImages/431450-312x231.jpg'}]}, u'aggregateLikes': 70, u'instructions': u'Follow the package directions to make the pudding, but use 1 cups light canned coconut milk in place of the milk.Pour the pie filling into the prepared pie shell. Let cool.Refrigerate the pie for at least 3 hours, or until set.Optionally top with whipped coconut cream. Sprinkle with toasted coconut before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-coconut-cream-pie-792584', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}