{u'recipes': [{u'sourceName': u'I Wash You Dry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/779644-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 779644, u'veryPopular': False, u'lowFodmap': True, u'title': u'Chicken Bacon Ranch Potato Salad', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'pricePerServing': 199.45, u'creditText': u'I Wash You Dry', u'extendedIngredients': [{u'originalString': u'3 large baking potatoes (about 2 1/2 lbs.)', u'aisle': u'Produce', u'name': u'baking potatoes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.5, u'consistency': u'solid', u'id': 11353, u'unit': u'lbs'}, {u'originalString': u'5 deli fried chicken tenders (boneless), cut into bite-size pieces', u'aisle': u'Meat', u'name': u'chicken tenders', u'metaInformation': [u'boneless', u'cut into bite-size pieces', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-tenders-or-fingers.png', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1015062, u'unit': u''}, {u'originalString': u'1 tbsp freshly chopped chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tbsp'}, {u'originalString': u'1/2 cup mayo', u'aisle': u'Condiments', u'name': u'mayo', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4025, u'unit': u'cup'}, {u'originalString': u'1/2 cup ranch dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'ranch dressing', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4639, u'unit': u'cup'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'6 strips thick cut bacon, cooked crisp and cut into bite size pieces', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'thick cut', u'crisp', u'cooked', u'cut into bite size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 6.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'strips'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.iwashyoudry.com/2016/06/14/chicken-bacon-ranch-potato-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Boil the potatoes in a large pot of water until a fork easily pierces, with little resistance.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain and let cool on a cooling rack until completely cool (about 1 hour). Peel potatoes and cut into bite size pieces then place in a large bowl.In a separate bowl whisk together the mayo and ranch dressing. Fold the dressing into the potatoes.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ranch-dressing.jpg', u'id': 4639, u'name': u'ranch dressing'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}]}, {u'equipment': [], u'step': u'Add the crispy bacon and fried chicken pieces, then stir gently to mix. Season with salt and pepper and garnish with chopped chives if desired. Enjoy!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Ghost Pines Sonoma County Napa County Monterey County Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 27 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Selected from three of California's most recognized Chardonnay appellations, Sonoma, Monterey and Napa, our Ghost Pines Chardonnay offers expressive, fruit-forward characteristics. The artful combination of these three regions delivers baked apple, pear and lemon cream flavors, accented by an elegant finish of sweet vanilla.", u'title': u'Ghost Pines Sonoma County Napa County Monterey County Chardonnay', u'price': u'$26.65', u'id': 428231, u'link': u'https://www.amazon.com/Ghost-Pines-Sonoma-Monterey-Chardonnay/dp/B01A8WOKCS', u'imageUrl': u'https://spoonacular.com/productImages/428231-312x231.jpg'}]}, u'aggregateLikes': 273, u'instructions': u'Boil the potatoes in a large pot of water until a fork easily pierces, with little resistance. Drain and let cool on a cooling rack until completely cool (about 1 hour). Peel potatoes and cut into bite size pieces then place in a large bowl.In a separate bowl whisk together the mayo and ranch dressing. Fold the dressing into the potatoes.Add the crispy bacon and fried chicken pieces, then stir gently to mix. Season with salt and pepper and garnish with chopped chives if desired. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-bacon-ranch-potato-salad-779644', u'dishTypes': [u'side dish'], u'occasions': [u"father's day", u'4th of july', u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}