{u'recipes': [{u'sourceName': u'Taste and Tell Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/602654-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 602654, u'veryPopular': True, u'lowFodmap': False, u'title': u'Breakfast Pigs in a Blanket {Fridays with Rachael Ray}', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 90.02, u'creditText': u'Taste and Tell Blog', u'extendedIngredients': [{u'originalString': u'8 breakfast sausage links', u'aisle': u'Meat', u'name': u'breakfast sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breakfast-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 7919, u'unit': u''}, {u'originalString': u'1 can (8 oz) crescent rolls', u'aisle': u'Refrigerated', u'name': u'crescent rolls', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93618, u'unit': u'oz'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons maple syrup, plus more for serving', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'plus more for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon poppy seeds', u'aisle': u'Spices and Seasonings;Baking', u'name': u'poppy seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2033, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 20.0, u'sourceUrl': u'http://www.tasteandtellblog.com/breakfast-pigs-in-a-blanket/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 375\xb0F. Cook the sausages according to the package direction; set aside.Open the crescent rolls and separate into triangles.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}]}, {u'equipment': [], u'step': u'Brush the maple syrup over the surface of the crescent rolls.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place one sausage on the wide end of each crescent triangle, roll up and place on an ungreased baking sheet.In a small bowl, lightly beat the egg with a splash of water.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u"Brush the tops of the crescents with the egg wash. (You don't need to use it all, just enough to cover the tops of the dough.)  Sprinkle with the poppy seeds.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poppyseed.jpg', u'id': 2033, u'name': u'poppy seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'id': 93618, u'name': u'refrigerated crescent rolls'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake until golden brown, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with more maple syrup, for dipping.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Mumm Napa Cuvee M with a 4.1 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"The naturally ripened fruit selected from more than 50 separate vineyards, reveals layers of crisp and creamy textures that are rich and lingering. Individually selected lots were kept separate during initial fermentation in order to highlight their vineyard differences and extract the quintessence of their specific strengths. The resulting blend is a soft and elegant wine that highlights the delicious and powerful ripe fruit flavors that characterize the world-class grapes of the Napa Valley.Cuv\xe9e M exhibits a graceful stream of very fine bubbles gently rising to a persistent mousse cordon with a light peach rose color. The aromas are elegant, rich and complex, showing fresh white and yellow stone fruits with subtle hints of wild strawberry. A light touch of fresh brioche, with hints of vanilla and honey add to the wine's complex bouquet. On the palate, full flavors of peach and pear combine with a creamy caramel character, which lingers into a long satisfying finish.Mumm Napa's Cuv\xe9e M is the perfect sparkling wine for champagne cocktails or as an ap\xe9ritif to pair with hors d'oeuvres. It is also a perfect match with creamy desserts and spicy foods. View More", u'title': u'Mumm Napa Cuvee M', u'price': u'$19.99', u'id': 451872, u'link': u'https://www.wine.com/product/mumm-napa-cuvee-m/80229', u'imageUrl': u'https://spoonacular.com/productImages/451872-312x231.jpg'}]}, u'aggregateLikes': 1122, u'instructions': u"Preheat the oven to 375\xb0F. Cook the sausages according to the package direction; set aside.Open the crescent rolls and separate into triangles.  Brush the maple syrup over the surface of the crescent rolls.  Place one sausage on the wide end of each crescent triangle, roll up and place on an ungreased baking sheet.In a small bowl, lightly beat the egg with a splash of water. Brush the tops of the crescents with the egg wash. (You don't need to use it all, just enough to cover the tops of the dough.)  Sprinkle with the poppy seeds.Bake until golden brown, about 10 minutes.  Serve with more maple syrup, for dipping.", u'spoonacularSourceUrl': u'https://spoonacular.com/breakfast-pigs-in-a-blanket-fridays-with-rachael-ray-602654', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}