{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/404437-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 404437, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tomato Basil Soup', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 145.61, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/4 cup butter, cubed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'4 medium carrot, finely chopped', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 can (49 ounces) reduced-sodium chicken broth or 6 cups vegetable broth, divided', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'reduced-sodium', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 49.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'ounces'}, {u'originalString': u'5 teaspoons dried basil', u'aisle': u'Spices and Seasonings', u'name': u'dried basil', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 5.0, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoons'}, {u'originalString': u'1 can (12 ounces) fat-free evaporated milk', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [u'fat-free', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1214, u'unit': u'ounces'}, {u'originalString': u'1 large onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 teaspoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}, {u'originalString': u'1 can (29 ounces) tomato puree', u'aisle': u'Canned and Jarred', u'name': u'tomato puree', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 29.0, u'consistency': u'solid', u'id': 11547, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2032, u'unit': u'teaspoon'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 61.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/tomato-basil-soup', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'In a Dutch oven, cook carrots and onion in butter over medium-low heat for 30 minutes or until vegetables are tender, stirring occasionally.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Remove from the heat and cool slightly.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender, place 1/2 broth and the cooled vegetables; cover and process until blended. Return to the Dutch oven. Stir in the tomato puree, basil sugar, salt, pepper and remaining broth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11547, u'name': u'tomato puree'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bring to a boil. Reduce heat; simmer, uncovered, for 30 minutes. Reduce heat to low. Gradually stir in evaporated milk; heat through (do not boil).', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1214, u'name': u'evaporated milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 9, u'instructions': u'Directions                                                                                In a Dutch oven, cook carrots and onion in butter over medium-low heat for 30 minutes or until vegetables are tender, stirring occasionally. Remove from the heat and cool slightly.                                                                                           In a blender, place 1/2 broth and the cooled vegetables; cover and process until blended. Return to the Dutch oven. Stir in the tomato puree, basil sugar, salt, pepper and remaining broth.                                                                                            Bring to a boil. Reduce heat; simmer, uncovered, for 30 minutes. Reduce heat to low. Gradually stir in evaporated milk; heat through (do not boil).                                        Yield: 6 servings (2-1/4 quarts).                                                                                                                         Originally published as Tomato Basil Soup in  Light & TastyOctober/November 2004, p39                                                                                                                                                                                                        Nutritional Facts                                                                             One serving (1-1/2 cups) equals 201 calories, 8 g fat (5 g saturated fat), 23 mg cholesterol, 1,004 mg sodium, 24 g carbohydrate, 3 g fiber, 10 g protein. Diabetic Exchanges: 3 vegetable, 1-1/2 fat, 1/2 fat-free milk.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/tomato-basil-soup-404437', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}