{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'spanish', u'european'], u'image': u'https://spoonacular.com/recipeImages/738467-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 225, u'id': 738467, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Winter Flan', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 88.77, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'6 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 12-ounce can evaporated milk (full fat or 2 percent)', u'aisle': u'Baking', u'name': u'evaporated milk', u'metaInformation': [u'canned', u'(full fat or 2 percent)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 1214, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon ground allspice', u'aisle': u'Spices and Seasonings', u'name': u'ground allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2001, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 14-ounce can sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}, {u'originalString': u'1 cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}], u'healthScore': 5.0, u'imageType': u'jpeg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/chocolate-winter-flan.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'In a blender, blend together the eggs, evaporated milk, condensed milk, whole milk, cocoa, allspice and cinnamon until well incorporated and creamy.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1214, u'name': u'evaporated milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'whole milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}], u'step': u'Bake either using the water bath or double boiler method below.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'To bake using the water bath method: Preheat the oven to 350 degrees F.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Caramelize the sugar in a pan over the stovetop until a light golden brown, using a wooden spoon to stir. This is the trickiest part as sugar burns easily, so don't let it get too dark and keep mixing the sugar with the spoon. Don't step away from this process; once the sugar gets hot, it browns quickly. Once it is completely liquefied, pour into an ovensafe 6- to 8-inch round mold (a tempered glass pie dish works well) and coat the bottom and sides three-quarters of the way up.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404629, u'name': u'roasting pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Fill an oven roasting pan or baking dish with about 1 inch of water and place the sugar-coated pie dish inside.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Add the flan mixture to the pie dish and bake until the top is firm and the flan starts to pull away from the sides, about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from the water bath and let cool to room temperature, about 2 hours.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'To transfer the flan to a serving plate, make sure the sides are loose (you can run a thin knife around the edges to make sure it is not sticking to the sides), put a plate on top and in one fluid motion, invert the flan onto the plate and remove the pie dish. Refrigerate to chill before slicing and serving.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To bake using the double boiler method: If you have a double boiler pan (which is what I typically use and is easier!), caramelize the sugar in the double boiler insert on the stovetop using the same method as above.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from the heat and, using a wooden spoon and by tilting and rotating the pan, coat all sides of the pan three-quarters of the way up.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Fill the other double boiler pan with water about one-quarter full and bring to a boil while the sugar is caramelizing.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the flan mixture into the caramel and put the double boiler insert over the pan with the hot water. Cover and cook over medium low until the flan appears more solid and pulls away from the sides, about 45 minutes.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool to room temperature for about 2 hours before inverting onto a serving plate using the same method as above. Refrigerate and serve cold.', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Albarino, and Grenache are my top picks for Creme Caramel. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'albarino', u'grenache', u'moscato dasti', u'port', u'tempranillo'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 391, u'instructions': u"Watch how to make this recipe.                    In a blender, blend together the eggs, evaporated milk, condensed milk, whole milk, cocoa, allspice and cinnamon until well incorporated and creamy. Bake either using the water bath or double boiler method below.                          To bake using the water bath method: Preheat the oven to 350 degrees F.                          Caramelize the sugar in a pan over the stovetop until a light golden brown, using a wooden spoon to stir. This is the trickiest part as sugar burns easily, so don't let it get too dark and keep mixing the sugar with the spoon. Don't step away from this process; once the sugar gets hot, it browns quickly. Once it is completely liquefied, pour into an ovensafe 6- to 8-inch round mold (a tempered glass pie dish works well) and coat the bottom and sides three-quarters of the way up.                          Fill an oven roasting pan or baking dish with about 1 inch of water and place the sugar-coated pie dish inside. Add the flan mixture to the pie dish and bake until the top is firm and the flan starts to pull away from the sides, about 45 minutes. Remove from the water bath and let cool to room temperature, about 2 hours.                          To transfer the flan to a serving plate, make sure the sides are loose (you can run a thin knife around the edges to make sure it is not sticking to the sides), put a plate on top and in one fluid motion, invert the flan onto the plate and remove the pie dish. Refrigerate to chill before slicing and serving.                          To bake using the double boiler method: If you have a double boiler pan (which is what I typically use and is easier!), caramelize the sugar in the double boiler insert on the stovetop using the same method as above. Remove from the heat and, using a wooden spoon and by tilting and rotating the pan, coat all sides of the pan three-quarters of the way up.                          Fill the other double boiler pan with water about one-quarter full and bring to a boil while the sugar is caramelizing.                          Pour the flan mixture into the caramel and put the double boiler insert over the pan with the hot water. Cover and cook over medium low until the flan appears more solid and pulls away from the sides, about 45 minutes. Let cool to room temperature for about 2 hours before inverting onto a serving plate using the same method as above. Refrigerate and serve cold.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-winter-flan-738467', u'dishTypes': [u'dessert'], u'occasions': [u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 245, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}