{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220771-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 220771, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pork & ham pie', u'diets': [u'gluten free'], u'preparationMinutes': 75, u'pricePerServing': 91.57, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'6 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'small handful sage leaves', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'handful'}, {u'originalString': u'2 leaves gelatine (optional, see Know-how)', u'aisle': u'Baking', u'name': u'gelatine', u'metaInformation': [u'(optional, see Know-how)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'leaves', u'unitShort': u'leaves', u'amount': 2.0, u'consistency': u'solid', u'id': 19177, u'unit': u'leaves'}, {u'originalString': u'140g cooked ham meat (see know-how), chopped into small chunks', u'aisle': u'Meat', u'name': u'ham', u'metaInformation': [u'small', u'cooked', u'chopped', u'(see know-how)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 10151, u'unit': u'g'}, {u'originalString': u'4 tbsp milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'1 small onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'200g good-quality pork sausagemeat', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10010219, u'unit': u'g'}, {u'originalString': u'400g minced pork', u'aisle': u'Meat', u'name': u'pork', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 10010219, u'unit': u'g'}, {u'originalString': u'few shakes Tabasco sauce', u'aisle': u'Condiments', u'name': u'tabasco sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'100g lard, plus extra for greasing', u'aisle': u'?', u'name': u'lard', u'metaInformation': [u'for greasing'], u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'unit': u'g'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.bbcgoodfood.com/node/98089', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bring a large pan of salted water to the boil, then boil the eggs for exactly 7\xbd mins. Cool in cold water, peel and set aside. Tip the pork, sausagemeat, ham, sage and onion into a large bowl. Season generously and add a few shakes of Tabasco.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 6168, u'name': u'hot sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ham-whole.jpg', u'id': 10151, u'name': u'ham'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Mix well with your hands until completely combined. Take about 1 tbsp of the mix, shape into a small burger and fry in a pan. Taste for seasoning. Slightly over-seasoned is perfect.Melt a few tbsps lard, brush a 1-litre terrine dish with an even layer of the melted fat, then dust with flour. Tomake the pastry, tip the flour into a bowl with 2 tsp salt.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the lard and milk into a pan with 150ml water, then heat until the lard has completely melted.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Pour into the flour and beat with a wooden spoon until combined. Tip onto the surface and knead until it all comes together.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Cut a piece of baking parchment to fit the bottom and long sides of the terrine dish with some hanging over the edge. Take about two-thirds of the pastry dough and shape it into a rectangle roughly the width and length of the dish. Lay the dough into the terrine and, using your fingers, press it into the bottom, the corners and up the sides of the dish until it comes to the top and hangs over the rim a little. Take half the meat mixture and pat it into a shape that will fit the terrine dish, then lay it in. Use your fingers to make a trench down the middle of the meat. Trim the tops and bottoms off the eggs, lay them, in a row, along the trench, then season. Trimming the eggs like this ensures that each slice of pie will contain both egg white and yolk.Take the rest of the meat mixture, pat it out to a rectangle that will fit over the eggs, and press it over the top.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Brush the overhang of the pastry with the beaten egg, then roll out the rest of the pastry to fit over the pie.Pinch edges together to fix the top.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Brush top generously with egg and pierce three holes along the top.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/fan 180C/gas 6.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Place pie on a baking sheet and bake for 30 mins. Lower the heat to 180C/fan 160C/gas 4, then continue to cook for another hour. Leave to cool. Carefully turn dish upside-down onto a board and use the sides of the paper to pull the pie out of the dish. If sides aren’t brown enough, return it to the oven on a baking tray at 200C/fan 180C/gas 6 until coloured. Cool, then chill in the fridge.If you want to fill the pie with jelly, soak the gelatine in cold water and warm the stock until hot, but not simmering.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}]}, {u'equipment': [], u'step': u'Remove the gelatine from the water and squeeze to remove excess liquid, then stir into the stock to dissolve. Leave to cool to room temperature, then transfer to a squeezy bottle.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}]}, {u'equipment': [], u'step': u'Pour the jelly into one of the holes until it comes to the top.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Place the pie on a dish in the fridge until the jelly has set, then repeat twice more, so the jelly has filled each hole. Leave to set in the fridge overnight.', u'number': 12, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. One wine you could try is Snake River Late Harvest Riesling. It has 5 out of 5 stars and a bottle costs about 16 dollars.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'honey , minerality , lime', u'title': u'Snake River Late Harvest Riesling', u'price': u'$16.0', u'id': 431450, u'link': u'https://www.amazon.com/2010-Snake-River-Harvest-Riesling/dp/B00GWUM1A4', u'imageUrl': u'https://spoonacular.com/productImages/431450-312x231.jpg'}]}, u'aggregateLikes': 161, u'instructions': u'Bring a large pan of salted water to the boil, then boil the eggs for exactly 7\xbd mins. Cool in cold water, peel and set aside. Tip the pork, sausagemeat, ham, sage and onion into a large bowl. Season generously and add a few shakes of Tabasco. Mix well with your hands until completely combined. Take about 1 tbsp of the mix, shape into a small burger and fry in a pan. Taste for seasoning. Slightly over-seasoned is perfect.Melt a few tbsps lard, brush a 1-litre terrine dish with an even layer of the melted fat, then dust with flour. Tomake the pastry, tip the flour into a bowl with 2 tsp salt. Put the lard and milk into a pan with 150ml water, then heat until the lard has completely melted. Pour into the flour and beat with a wooden spoon until combined. Tip onto the surface and knead until it all comes together.Cut a piece of baking parchment to fit the bottom and long sides of the terrine dish with some hanging over the edge. Take about two-thirds of the pastry dough and shape it into a rectangle roughly the width and length of the dish. Lay the dough into the terrine and, using your fingers, press it into the bottom, the corners and up the sides of the dish until it comes to the top and hangs over the rim a little. Take half the meat mixture and pat it into a shape that will fit the terrine dish, then lay it in. Use your fingers to make a trench down the middle of the meat. Trim the tops and bottoms off the eggs, lay them, in a row, along the trench, then season. Trimming the eggs like this ensures that each slice of pie will contain both egg white and yolk.Take the rest of the meat mixture, pat it out to a rectangle that will fit over the eggs, and press it over the top. Brush the overhang of the pastry with the beaten egg, then roll out the rest of the pastry to fit over the pie.Pinch edges together to fix the top. Brush top generously with egg and pierce three holes along the top. Heat oven to 200C/fan 180C/gas 6. Place pie on a baking sheet and bake for 30 mins. Lower the heat to 180C/fan 160C/gas 4, then continue to cook for another hour. Leave to cool. Carefully turn dish upside-down onto a board and use the sides of the paper to pull the pie out of the dish. If sides aren’t brown enough, return it to the oven on a baking tray at 200C/fan 180C/gas 6 until coloured. Cool, then chill in the fridge.If you want to fill the pie with jelly, soak the gelatine in cold water and warm the stock until hot, but not simmering. Remove the gelatine from the water and squeeze to remove excess liquid, then stir into the stock to dissolve. Leave to cool to room temperature, then transfer to a squeezy bottle. Pour the jelly into one of the holes until it comes to the top. Place the pie on a dish in the fridge until the jelly has set, then repeat twice more, so the jelly has filled each hole. Leave to set in the fridge overnight.', u'spoonacularSourceUrl': u'https://spoonacular.com/pork-ham-pie-220771', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 165, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}