{u'recipes': [{u'sourceName': u'Garnish with Lemon', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/590278-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 22, u'id': 590278, u'veryPopular': False, u'lowFodmap': False, u'title': u'Rosemary Garlic Cloverleaf Rolls', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 195, u'pricePerServing': 21.89, u'creditText': u'Garnish with Lemon', u'extendedIngredients': [{u'originalString': u'4 tablespoons butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'3\xbd cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'2 teaspoons chopped fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoons'}, {u'originalString': u'1 garlic clove, finely minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 teaspoons instant yeast', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10118375, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup lukewarm milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'lukewarm'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'3 tablespoons nonfat dry milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat milk', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 1085, u'unit': u'tablespoons'}, {u'originalString': u"2 tablespoons potato flour, potato starch or \xbc cup instant potato flakes (I used potato starch because that's what I had on hand)", u'aisle': u'Pasta and Rice', u'name': u'potato flakes', u'metaInformation': [u"(I used potato starch because that's what I had on hand)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-potatoes.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11378, u'unit': u'tablespoons'}, {u'originalString': u'1\xbd teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoons'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.garnishwithlemon.com/rosemary-garlic-cloverleaf-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add flour and next 8 ingredients (through milk) in the bowl of a stand mixer.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Mix on low to combine and then knead on medium low speed for 6 minutes or until dough is smooth but still a bit sticky.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place dough ball in a large greased bowl, cover and let rise until doubled in size, anywhere from 60-90 minutes.After dough has risen, gently punch down dough and divide into twelve pieces. Divide each of those twelve pieces into three more pieces (36 small dough balls total).', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Roll all dough pieces into small balls.Lightly grease a standard muffin pan and fill each well with three dough balls. Cover and let rise for another 60 – 90 minutes.Preheat oven to 350 degrees. Uncover buns and bake for 20-22 minutes or until golden brown and cooked through.Meanwhile, combine melted butter, garlic and rosemary in a small bowl. Immediately after removing baked rolls from oven, brush them with the rosemary garlic butter while still in the pan. Allow rolls to set for 10 minutes and then remove to cooling rack or serve immediately.', u'length': {u'number': 122, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 135, u'instructions': u'Add flour and next 8 ingredients (through milk) in the bowl of a stand mixer. Mix on low to combine and then knead on medium low speed for 6 minutes or until dough is smooth but still a bit sticky. Place dough ball in a large greased bowl, cover and let rise until doubled in size, anywhere from 60-90 minutes.After dough has risen, gently punch down dough and divide into twelve pieces. Divide each of those twelve pieces into three more pieces (36 small dough balls total). Roll all dough pieces into small balls.Lightly grease a standard muffin pan and fill each well with three dough balls. Cover and let rise for another 60 – 90 minutes.Preheat oven to 350 degrees. Uncover buns and bake for 20-22 minutes or until golden brown and cooked through.Meanwhile, combine melted butter, garlic and rosemary in a small bowl. Immediately after removing baked rolls from oven, brush them with the rosemary garlic butter while still in the pan. Allow rolls to set for 10 minutes and then remove to cooling rack or serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/rosemary-garlic-cloverleaf-rolls-590278', u'dishTypes': [u'bread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 217, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}