{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/223871-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 223871, u'veryPopular': False, u'lowFodmap': False, u'title': u'Prawn & coconut curry', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 65.66, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'400ml can chopped tomatoes in rich juice', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 400.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ml'}, {u'originalString': u'100g creamed coconut, chopped', u'aisle': u'Health Foods', u'name': u'creamed coconut', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 12177, u'unit': u'g'}, {u'originalString': u'handful chopped coriander', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh coriander', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'handful'}, {u'originalString': u'4 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'thumb-size piece fresh root ginger, grated', u'aisle': u'Produce', u'name': u'ginger root', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'1 green chilli, halved, deseeded and sliced at an angle', u'aisle': u'Produce', u'name': u'green chilli', u'metaInformation': [u'green', u'halved', u'deseeded', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-peppers-green.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 31015, u'unit': u''}, {u'originalString': u'1 tbsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tbsp'}, {u'originalString': u'juice 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'1 tbsp mango chutney', u'aisle': u'Ethnic Foods', u'name': u'mango chutney', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mango-chutney.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10119297, u'unit': u'tbsp'}, {u'originalString': u'2 onions, sliced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tbsp sunflower oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sunflower oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4584, u'unit': u'tbsp'}, {u'originalString': u'3 x 200g bags large, raw, peeled prawn, thawed if frozen, drained', u'aisle': u'Tea and Coffee', u'name': u'tea bags', u'metaInformation': [u'raw', u'frozen', u'thawed', u'large', u'peeled', u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tea-bags.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10111111, u'unit': u''}, {u'originalString': u'\xbd tsp turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2043, u'unit': u'tsp'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 48.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/5084/prawn-and-coconut-curry', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Fry the onions, ginger and garlic in the oilfor about 10 mins. Stir in the turmeric andcoriander, then fry for 1 min more. Tip themixture into a blender with the tomatoesand creamed coconut, then blend to a pur\xe9e.Return to the pan with 300ml water, thechutney, chilli and pepper and simmer for10 mins. You can freeze it at this stage.Stir in the prawns and cook for a few minsmore until they turn pink – take care not toovercook them or they’ll become tough.', u'length': {u'number': 21, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': None, u'id': 12177, u'name': u'creamed coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'id': 2043, u'name': u'turmeric'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Addthe coriander, then season to taste with salt,pepper and lemon juice just before serving.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Asian works really well with Chenin Blanc, Gewurztraminer, and Riesling. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. The Mulderbosch Chenin Blanc with a 4.2 out of 5 star rating seems like a good match. It costs about 15 dollars per bottle.', u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'Pale yellow in color, with a hint of green. A clean, lively wine with abundant lemon and lime aromas on the nose, with nuances of nutmeg and cloves. Well-balanced and elegant, but with some weight and a powerful follow-through. Stylistically dry and lightly oaked, this is an excellent wine to enjoy with food.', u'title': u'Mulderbosch Chenin Blanc', u'price': u'$14.99', u'id': 434512, u'link': u'https://www.wine.com/product/mulderbosch-chenin-blanc-2004/85657', u'imageUrl': u'https://spoonacular.com/productImages/434512-312x231.jpg'}]}, u'aggregateLikes': 172, u'instructions': u'Fry the onions, ginger and garlic in the oilfor about 10 mins. Stir in the turmeric andcoriander, then fry for 1 min more. Tip themixture into a blender with the tomatoesand creamed coconut, then blend to a pur\xe9e.Return to the pan with 300ml water, thechutney, chilli and pepper and simmer for10 mins. You can freeze it at this stage.Stir in the prawns and cook for a few minsmore until they turn pink – take care not toovercook them or they’ll become tough. Addthe coriander, then season to taste with salt,pepper and lemon juice just before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/prawn-coconut-curry-223871', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 32, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}