{u'recipes': [{u'sourceName': u'Tidy Mom', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/185197-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 185197, u'veryPopular': True, u'lowFodmap': True, u'title': u'Mint Chocolate Chip Cookies & P&G Beauty Giftset', u'diets': [u'gluten free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 39.82, u'creditText': u'Tidy Mom', u'extendedIngredients': [{u'originalString': u'1/2 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 cup creme de menthe baking chips', u'aisle': u'Baking', u'name': u'creme de menthe baking chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 99054, u'unit': u'cup'}, {u'originalString': u'1 cup dark chocolate chips', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019071, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 pouch Betty Crocker\xae sugar cookie mix', u'aisle': u'Baking', u'name': u'gf sugar cookie mix', u'metaInformation': [u'betty crocker\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'pouch', u'unitShort': u'pouch', u'amount': 1.0, u'consistency': u'solid', u'id': 99046, u'unit': u'pouch'}, {u'originalString': u'green food color', u'aisle': u'Baking', u'name': u'green food color', u'metaInformation': [u'green'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'servings'}, {u'originalString': u'1/2 teaspoon mint extract', u'aisle': u'Baking', u'name': u'mint extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1022050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 5.0, u'sourceUrl': u'http://tidymom.net/2011/mint-chocolate-chip-cookies/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Heat oven to 350\xb0. In large bowl, stir in cookie mix, butter, extract, food color and egg until soft dough forms. Stir in creme de menthe baking chips and chocolate chips. Using a small cookie scoop, drop dough 2 inches apart on ungreased cookie sheet.', u'number': 1, u'ingredients': [{u'image': None, u'id': 99054, u'name': u'creme de menthe baking pieces'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'food color'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Bake 8-10 minutes or until set. Coll 3 minutes; remove from cookie sheet to wire rack. Cool completely before storing tightly covered at room temperature. Enjoy!', u'length': {u'number': 13, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies can be paired with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 24481, u'instructions': u'Heat oven to 350\xb0. In large bowl, stir in cookie mix, butter, extract, food color and egg until soft dough forms. Stir in creme de menthe baking chips and chocolate chips. Using a small cookie scoop, drop dough 2 inches apart on ungreased cookie sheet. Bake 8-10 minutes or until set. Coll 3 minutes; remove from cookie sheet to wire rack. Cool completely before storing tightly covered at room temperature. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/mint-chocolate-chip-cookies-p-g-beauty-giftset-185197', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}