{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/738051-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 240, u'id': 738051, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Bourbon Pecan Pie', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 35, u'pricePerServing': 136.56, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'3 to 4 tablespoons bourbon', u'aisle': u'Alcoholic Beverages', u'name': u'bourbon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 10014037, u'unit': u'tablespoons'}, {u'originalString': u'1/3 cup firmly-packed light brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/4 cup coconut oil, melted', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4047, u'unit': u'cup'}, {u'originalString': u'1/2 cup dark chocolate chips', u'aisle': u'Baking', u'name': u'dark chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10019071, u'unit': u'cup'}, {u'originalString': u'3 large eggs, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 1/4 cups plus 2 tablespoons all-purpose flour, plus more for dusting', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'for dusting', u'all-purpose', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoon'}, {u'originalString': u'2 to 4 tablespoons ice water', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups roughly chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 12142, u'unit': u'cups'}, {u'originalString': u"3/4 cup sorghum (See Cook's Note)", u'aisle': u'Gluten Free;Health Foods', u'name': u'sorghum', u'metaInformation': [u"(See Cook's Note)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sorghum.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 20067, u'unit': u'cup'}, {u'originalString': u'4 ounces (8 tablespoons) cold unsalted butter, cut into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpeg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/damaris-phillips/chocolate-bourbon-pecan-pie.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Special equipment: baking weights or beans', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the salt, granulated sugar and 1 1/4 cups of the flour in the bowl of a food processor and pulse a few times.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the butter and pulse until there are pea-size pieces.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Add the ice water, a few tablespoons at a time, and pulse until the mixture barely comes together. Turn it out onto a piece of parchment paper and press into a disc. Refrigerate for 1 hour.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'id': 10014412, u'name': u'ice'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Roll out the dough from the center outward, like the rays of the sun.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place the dough in the pie pan and fold over the overhang to create a nice crust  no need to cut off scraps. Pierce the base all over with a fork, line with foil and fill with baking weights or beans.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake on the bottom rack of the oven for 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the foil and pie weights. Return the pie crust to the oven and bake for an additional 5 minutes to ensure the crust will be crisp. Allow to cool, about 30 minutes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Lower the oven temperature to 350 degrees F.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u'Beat the brown sugar and eggs in a stand mixer fitted with a paddle attachment until fluffy, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the coconut oil and remaining 2 tablespoons of flour and mix for another 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add the sorghum and bourbon and mix until combined. Finish by stirring in half of the pecans.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bourbon.jpg', u'id': 10014037, u'name': u'bourbon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sorghum.jpg', u'id': 20067, u'name': u'sorghum'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Sprinkle the bottom of the crust with the chocolate chips and remaining pecans. Gently pour in the pie filling.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [], u'step': u'Bake until the top is firm but the center is slightly gooey, 35 to 45 minutes. Cool on the counter for 4 hours or in the fridge for 2 hours before serving.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}], u'name': u'Roll out the dough on a lightly-dusted surface so it is large enough to fit into a 9-inch pie pan with a slight overhang. A little trick to make sure the pie crust is round'}], u'winePairing': {u'pairingText': u'Pecan Pie works really well with Madeira, Pedro Xim\xe9nez, and Tawny Port. Sweet, nutty pecan pie deserves a wine to match - these dessert wines all have the right sweetness and the nutty notes. The Kenneth Volk El Pomar Junction Vineyard Verdelho with a 1.7999999999999998 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'madeira', u'pedro ximenez', u'tawny port'], u'productMatches': [{u'description': u"Verdelho is a semi-aromatic white grape that was traditionally used in the production of the revered wines of the island of Madeira. Verdelho has found popularity with forward thinking vintners from around the world in the production of delicious table wines. This bottling is full bodied with tropical and citrus fruit aromas with grapefruit, melon and apple flavors. This refreshing wine can be enjoyed as an aperitif or served with seafoods or Pacific Rim cuisine. Verdelho's aroma and bouquet is unique and reminds me of citrus flowers and ripe Casaba melon.Its palate weight is more full-bodied than many other white wines. View More", u'title': u'Kenneth Volk El Pomar Junction Vineyard Verdelho', u'price': u'$11.99', u'id': 444264, u'link': u'https://www.wine.com/product/kenneth-volk-el-pomar-junction-vineyard-verdelho-2008/105981', u'imageUrl': u'https://spoonacular.com/productImages/444264-312x231.jpg'}]}, u'aggregateLikes': 2913, u'instructions': u'Special equipment: baking weights or beans              Preheat the oven to 400 degrees F.                          Combine the salt, granulated sugar and 1 1/4 cups of the flour in the bowl of a food processor and pulse a few times. Add the butter and pulse until there are pea-size pieces. Add the ice water, a few tablespoons at a time, and pulse until the mixture barely comes together. Turn it out onto a piece of parchment paper and press into a disc. Refrigerate for 1 hour.                          Roll out the dough on a lightly-dusted surface so it is large enough to fit into a 9-inch pie pan with a slight overhang. A little trick to make sure the pie crust is round: Roll out the dough from the center outward, like the rays of the sun. Place the dough in the pie pan and fold over the overhang to create a nice crust  no need to cut off scraps. Pierce the base all over with a fork, line with foil and fill with baking weights or beans. Bake on the bottom rack of the oven for 12 minutes. Remove the foil and pie weights. Return the pie crust to the oven and bake for an additional 5 minutes to ensure the crust will be crisp. Allow to cool, about 30 minutes.                          Lower the oven temperature to 350 degrees F.                          Beat the brown sugar and eggs in a stand mixer fitted with a paddle attachment until fluffy, about 2 minutes. Add the coconut oil and remaining 2 tablespoons of flour and mix for another 2 minutes. Add the sorghum and bourbon and mix until combined. Finish by stirring in half of the pecans.                          Sprinkle the bottom of the crust with the chocolate chips and remaining pecans. Gently pour in the pie filling. Bake until the top is firm but the center is slightly gooey, 35 to 45 minutes. Cool on the counter for 4 hours or in the fridge for 2 hours before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-bourbon-pecan-pie-738051', u'dishTypes': [u'dessert'], u'occasions': [u'thanksgiving'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 275, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}