{u'recipes': [{u'sourceName': u'Table', u'cuisines': [u'scandinavian', u'european', u'nordic'], u'image': u'https://spoonacular.com/recipeImages/610686-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 610686, u'veryPopular': True, u'lowFodmap': False, u'title': u'Kanelbullar (Swedish Cinnamon Rolls)', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 80, u'pricePerServing': 15.61, u'creditText': u'Table', u'extendedIngredients': [{u'originalString': u'75 g butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 75.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1\xbd tsp. cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 egg, lightly beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'lightly beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 tsp ground cardamom (optional)', u'aisle': u'Spices and Seasonings', u'name': u'ground cardamom', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2006, u'unit': u'tsp'}, {u'originalString': u'1 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'\xbc cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'sprinkle of pearl sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}, {u'originalString': u'25 g fresh yeast (little cubes hidden in the refrigerated section)', u'aisle': u'Baking', u'name': u'yeast', u'metaInformation': [u'fresh', u'refrigerated', u'(little cubes hidden in the section)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 18375, u'unit': u'g'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://table.io/kanelbullar-swedish-cinnamon-rolls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Crumble the cube of yeast into a mixing bowl. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Heat the milk until it becomes about 98 degrees (body temperature).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Pour a small amount of warm milk into the yeast and mix well.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the rest of the milk slowly while whisking until it has become incorporated.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}], u'step': u'Add the room temperature butter into the mixture and mix well.Using a dough hook and stand mixer, mix the salt, sugar, and ground cardamom into the yeast mixture.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cardamom-ground.jpg', u'id': 2006, u'name': u'cardamom powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}]}, {u'equipment': [], u'step': u'Mix well. Slowly add about 2 cups of flour to the mixture and stir on a slow setting.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dish-towel.jpg', u'id': 221439, u'name': u'kitchen towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add the remaining cup slowly, keeping in mind that you want the dough to still be tacky, but workable (plus or minus about a half cup). Some recipes suggest to keep adding flour until the dough releases from the sides of the bowl during mixing, but I think that's too much. I always stop before that happens, knowing that I can add more flour later if needed. Cover with a kitchen towel and let rise for 30 minutes.In the meantime, make the filling.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Mix the butter, sugar, and cinnamon together using a hand mixer or whisk. It should be the consistency of paste. If you want more filling, make twice as much (I usually do).After the dough has had time to rise, pour it out onto a floured surface.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Roll the dough out into a large rectangle (around 8 x 20 in.). You want the long sides over twice as long as the short sides.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the filling over the entire rectangle and roll it up pretty tightly. You should have one long 20 in. roll.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/serrated-knife.jpg', u'id': 404740, u'name': u'serrated knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Cut the roll with a sharp serrated knife into slices about  in. thick and place into cupcake liners, cut side up. Cover and let rise for another 30 minutes.Preheat the oven to 425 degrees Fahrenheit.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Place the slices and cupcake liners into a muffin tin and brush with the beaten egg. This will give the rolls a beautiful golden color when baked. If you have pearl sugar, sprinkle a little on top of each one.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for about 10 minutes or until golden brown.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Place the baked rolls on a cooling rack while baking the second and third batches. Enjoy while warm.These are great to place in the freezer as well. Just pop them into the microwave for about 30 seconds and you have warm kanelbullar whenever you want!', u'number': 14, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 760, u'instructions': u"Crumble the cube of yeast into a mixing bowl. Set aside. Heat the milk until it becomes about 98 degrees (body temperature). Pour a small amount of warm milk into the yeast and mix well. Add the rest of the milk slowly while whisking until it has become incorporated. Add the room temperature butter into the mixture and mix well.Using a dough hook and stand mixer, mix the salt, sugar, and ground cardamom into the yeast mixture. Mix well. Slowly add about 2 cups of flour to the mixture and stir on a slow setting. Add the remaining cup slowly, keeping in mind that you want the dough to still be tacky, but workable (plus or minus about a half cup). Some recipes suggest to keep adding flour until the dough releases from the sides of the bowl during mixing, but I think that's too much. I always stop before that happens, knowing that I can add more flour later if needed. Cover with a kitchen towel and let rise for 30 minutes.In the meantime, make the filling. Mix the butter, sugar, and cinnamon together using a hand mixer or whisk. It should be the consistency of paste. If you want more filling, make twice as much (I usually do).After the dough has had time to rise, pour it out onto a floured surface. Roll the dough out into a large rectangle (around 8 x 20 in.). You want the long sides over twice as long as the short sides. Brush the filling over the entire rectangle and roll it up pretty tightly. You should have one long 20 in. roll. Cut the roll with a sharp serrated knife into slices about  in. thick and place into cupcake liners, cut side up. Cover and let rise for another 30 minutes.Preheat the oven to 425 degrees Fahrenheit. Place the slices and cupcake liners into a muffin tin and brush with the beaten egg. This will give the rolls a beautiful golden color when baked. If you have pearl sugar, sprinkle a little on top of each one. Bake for about 10 minutes or until golden brown. Place the baked rolls on a cooling rack while baking the second and third batches. Enjoy while warm.These are great to place in the freezer as well. Just pop them into the microwave for about 30 seconds and you have warm kanelbullar whenever you want!", u'spoonacularSourceUrl': u'https://spoonacular.com/kanelbullar-swedish-cinnamon-rolls-610686', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}