{u'recipes': [{u'sourceName': u'Go Dairy Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/248369-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 248369, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mushroom Pasta Bake with White Wine Cream Sauce (Vegan)', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 164.04, u'creditText': u'Go Dairy Free', u'extendedIngredients': [{u'originalString': u'2 cups So Delicious Dairy Free Unsweetened Coconut Milk Beverage', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'coconut milk beverage', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 99001, u'unit': u'cups'}, {u'originalString': u'2 tablespoons dairy-free margarine', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'dairy free margarine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/light-buttery-spread.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4673, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1/4 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 cloves minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'3 cups chopped mushrooms, different varieties (I used button, portobello and shiitake)', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'chopped', u'(I used button, portobello and shiitake)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'1 tablespoon nutritional yeast', u'aisle': u'Spices and Seasonings;Health Foods', u'name': u'nutritional yeast', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutritional-yeast.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93690, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'1/3 cup finely diced onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/2 cup panko or breadcrumbs', u'aisle': u'Bakery/Bread;Ethnic Foods;Oil, Vinegar, Salad Dressing;Baking', u'name': u'panko', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10018079, u'unit': u'cup'}, {u'originalString': u'Pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1/4 teaspoon red chili flakes', u'aisle': u'Spices and Seasonings', u'name': u'red chili flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/4-3/4 teaspoon salt, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2-1/2 cups uncooked short pasta', u'aisle': u'Pasta and Rice', u'name': u'short pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/elbow.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20499, u'unit': u'cups'}, {u'originalString': u'1 teaspoon soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon thyme', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.godairyfree.org/recipes/vegan-mushroom-pasta-bake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400\xbaF. Cook pasta al dente according to package directions.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Drain and rinse.In a saucepan, heat olive oil over medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add mushrooms, onion, garlic, thyme and chili flakes. Cook for 4 minutes, until onions are softened.De-glaze the pan by adding the wine. Cook for another couple minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add in the coconut milk beverage, nutritional yeast, soy sauce, salt (to taste) and pepper. Bring to a boil, stirring and bring down to a simmer. Allow to simmer for 10 minutes.While simmering prepare the roux in another saucepan. Melt margarine over medium heat. Once melted and in the flour, stirring until fully mixed and the roux is pulled away from the sides of the pan. Continue to cook for another couple minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': None, u'id': 99001, u'name': u'coconut milk beverage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nutritional-yeast.jpg', u'id': 93690, u'name': u'nutritional yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove from heat until mushroom sauce is ready.Once simmered for 10 minutes, pour 1/3 of the sauce into the pot with the roux, whisking continuously over medium heat. Continue to whisk until thickened.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add another 1/3 of sauce and repeat the process. Repeat with the rest of the sauce. Continue to cook and thicken for another 3 to 5 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/casserole-dish.png', u'id': 404635, u'name': u'casserole dish'}], u'step': u'Add in the pasta and stir until fully mixed. Portion into individual baking dishes or a loaf or casserole dish. Sprinkle the top with panko and bake for about 30 minutes or until as crispy as desired.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/panko.jpg', u'id': 10018079, u'name': u'panko'}]}, {u'equipment': [], u'step': u'Serve with a fresh salad and enjoy the amazing flavor of dairy free!', u'number': 8, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 117, u'instructions': u'Preheat oven to 400\xbaF. Cook pasta al dente according to package directions. Drain and rinse.In a saucepan, heat olive oil over medium-high heat. Add mushrooms, onion, garlic, thyme and chili flakes. Cook for 4 minutes, until onions are softened.De-glaze the pan by adding the wine. Cook for another couple minutes.Add in the coconut milk beverage, nutritional yeast, soy sauce, salt (to taste) and pepper. Bring to a boil, stirring and bring down to a simmer. Allow to simmer for 10 minutes.While simmering prepare the roux in another saucepan. Melt margarine over medium heat. Once melted and in the flour, stirring until fully mixed and the roux is pulled away from the sides of the pan. Continue to cook for another couple minutes. Remove from heat until mushroom sauce is ready.Once simmered for 10 minutes, pour 1/3 of the sauce into the pot with the roux, whisking continuously over medium heat. Continue to whisk until thickened. Add another 1/3 of sauce and repeat the process. Repeat with the rest of the sauce. Continue to cook and thicken for another 3 to 5 minutes.Add in the pasta and stir until fully mixed. Portion into individual baking dishes or a loaf or casserole dish. Sprinkle the top with panko and bake for about 30 minutes or until as crispy as desired.Serve with a fresh salad and enjoy the amazing flavor of dairy free!', u'spoonacularSourceUrl': u'https://spoonacular.com/mushroom-pasta-bake-with-white-wine-cream-sauce-vegan-248369', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}