{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/201838-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 201838, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tomato-Chickpea Soup with Rice and Swiss Chard', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 313.65, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 (15.5 ounce) can chickpeas, drained and rinsed', u'aisle': u'Canned and Jarred', u'name': u'canned chickpeas', u'metaInformation': [u'drained and rinsed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.5, u'consistency': u'solid', u'id': 16058, u'unit': u'ounce'}, {u'originalString': u'1 (28 ounce) can crushed tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'crushed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 bunch rainbow chard, stems removed and chopped into 1/2-inch pieces, leaves roughly chopped', u'aisle': u'Produce', u'name': u'chard', u'metaInformation': [u'chopped', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11147, u'unit': u'bunch'}, {u'originalString': u'1/2 cup basmati rice, cooked according to package directions', u'aisle': u'Pasta and Rice', u'name': u'cooked basmati rice', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-long-grain-or-basmatii-cooked.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10020445, u'unit': u'cup'}, {u'originalString': u'2 medium cloves garlic, minced (about 2 teaspoons)', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'5 teaspoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'teaspoons'}, {u'originalString': u'2 cups low-sodium vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}, {u'originalString': u'1 small yellow onion, diced (about 3/4 cup)', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'diced', u'yellow', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 10511282, u'unit': u'cup'}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 100.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/01/lunch-box-tomato-chickpea-soup-swiss-chard-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat 3 teaspoons oil in medium pot over medium heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add onions and chard stems (not leaves) and saut\xe9 until onions are translucent and stems are softened, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}, {u'equipment': [], u'step': u'Add garlic and cook, stirring until fragrant, about 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add tomatoes and sprinkle with salt. Cook 2 minutes, then add stock. Bring to a boil, reduce to a simmer, and cook until slightly reduced, about 10 minutes. Keep warm.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'2', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat remaining 2 teaspoons oil in a large saut\xe9 pan over high heat until oil is hot and shimmering.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Add chickpeas, sprinkle with salt, and fry over medium-high heat until browned and crispy, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towel, and then stir into soup along with rice.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'3', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Stir chard leaves into soup over medium-high heat in batches, waiting until just wilted and soft before adding more. Simmer 1 minute to heat everything through, and then season with salt and pepper.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/swiss-chard.jpg', u'id': 11147, u'name': u'swiss chard'}]}, {u'equipment': [], u'step': u'Let cool before storing in an airtight container for the next day, or freeze for future use.', u'number': 12, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 326, u'instructions': u'Procedures                                                                              1                                                                            Heat 3 teaspoons oil in medium pot over medium heat. Add onions and chard stems (not leaves) and saut\xe9 until onions are translucent and stems are softened, about 5 minutes. Add garlic and cook, stirring until fragrant, about 1 minute. Add tomatoes and sprinkle with salt. Cook 2 minutes, then add stock. Bring to a boil, reduce to a simmer, and cook until slightly reduced, about 10 minutes. Keep warm.                                                                                                                            2                                                                            Heat remaining 2 teaspoons oil in a large saut\xe9 pan over high heat until oil is hot and shimmering. Add chickpeas, sprinkle with salt, and fry over medium-high heat until browned and crispy, about 3 minutes. Drain on paper towel, and then stir into soup along with rice.                                                                                                                            3                                                                            Stir chard leaves into soup over medium-high heat in batches, waiting until just wilted and soft before adding more. Simmer 1 minute to heat everything through, and then season with salt and pepper. Let cool before storing in an airtight container for the next day, or freeze for future use.', u'spoonacularSourceUrl': u'https://spoonacular.com/tomato-chickpea-soup-with-rice-and-swiss-chard-201838', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}