{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/217105-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 217105, u'veryPopular': False, u'lowFodmap': False, u'title': u'Oriental duck salad', u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 231.31, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 tsp Chinese five-spice powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'5 spice powder', u'metaInformation': [u'chinese'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chinese-five-spice-powder.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002002, u'unit': u'tsp'}, {u'originalString': u'1 carrot, cut into matchsticks', u'aisle': u'Produce', u'name': u'carrot', u'metaInformation': [u'cut into matchsticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 celery stick, cut into matchsticks', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut into matchsticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'\xbd cucumber, deseeded and cut into matchsticks', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'deseeded', u'cut into matchsticks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'1 duck leg', u'aisle': u'Meat', u'name': u'duck leg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/duck-legs.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 5317, u'unit': u''}, {u'originalString': u'2 tbsp hoisin sauce', u'aisle': u'Ethnic Foods', u'name': u'hoisin sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 6175, u'unit': u'tbsp'}, {u'originalString': u'140g rice noodles', u'aisle': u'Pasta and Rice;Gluten Free;Ethnic Foods', u'name': u'rice noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-noodles.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 20133, u'unit': u'g'}, {u'originalString': u'1 tbsp soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tbsp'}, {u'originalString': u'2 spring onions, sliced lengthways', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 77.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1162659/oriental-duck-salad', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 220C/200C fan/gas 7.Rub the duck leg all over withfive-spice and seasoning, place ona baking tray and roast for 25 mins.Meanwhile, cook the rice noodlesfollowing pack instructions.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/duck-legs.jpg', u'id': 5317, u'name': u'duck leg'}]}, {u'equipment': [], u'step': u'Drainand cool under cold running water,then drain again well and tosswith the celery, carrot, cucumberand spring onions. When coolenough to handle, remove theduck meat and crispy skin fromthe bone and finely shred.To make the dressing, mixthe hoisin and soy sauce with2 tbsp water. Divide the noodlesbetween two plates and topwith the shredded duck.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6175, u'name': u'hoisin sauce'}]}, {u'equipment': [], u'step': u'Drizzleover the dressing and serve.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is CalNaturale Chardonnay Lodi. It has 4.1 out of 5 stars and a bottle costs about 11 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'Complexity and intensity define this Chardonnay. The nose is full of citrus, green apple and pear with floral overtones. The flavors are rich on entry with lively fruit in the mid palate and a long fruity, warm finish.', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 26, u'instructions': u'Heat oven to 220C/200C fan/gas 7.Rub the duck leg all over withfive-spice and seasoning, place ona baking tray and roast for 25 mins.Meanwhile, cook the rice noodlesfollowing pack instructions. Drainand cool under cold running water,then drain again well and tosswith the celery, carrot, cucumberand spring onions. When coolenough to handle, remove theduck meat and crispy skin fromthe bone and finely shred.To make the dressing, mixthe hoisin and soy sauce with2 tbsp water. Divide the noodlesbetween two plates and topwith the shredded duck. Drizzleover the dressing and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/oriental-duck-salad-217105', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}