{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/224169-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 224169, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fruit, oat & seed bars', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 5, u'pricePerServing': 55.8, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g ready-to-eat apricots, finely chopped', u'aisle': u'Produce', u'name': u'apricots', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 9021, u'unit': u'g'}, {u'originalString': u'140g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'3 tbsp golden syrup', u'aisle': u'Baking', u'name': u'golden syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93829, u'unit': u'tbsp'}, {u'originalString': u'25g dried cranberries', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 9079, u'unit': u'g'}, {u'originalString': u'140g light muscovado sugar', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'g'}, {u'originalString': u'85g raisins or sultanas', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 9299, u'unit': u'g'}, {u'originalString': u'250g rolled oats', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 8120, u'unit': u'g'}, {u'originalString': u'50g sesame or mixed seeds', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sesame', u'metaInformation': [u'mixed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 12023, u'unit': u'g'}, {u'originalString': u'85g walnut pieces (or use your favourite nuts, roughly chopped)', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnut pieces', u'metaInformation': [u'roughly chopped', u'(or use your favourite nuts, )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 12155, u'unit': u'g'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/9834/fruit-oat-and-seed-bars', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 160.0, u'unit': u'Celsius'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oven to 160C/fan 140C/gas 3.Gently heat the sugar, golden syrupand butter in a pan until the sugar andbutter have both melted. Stir the oats,raisins, walnuts, seeds and cranberriesinto the pan until coated in the butter.Spoon half the oaty mix into a traybaketin (23 x 23cm or thereabouts). Scatterthe apricots over the top, then top withthe remaining oat mix. Pack the mixdown well and smooth with the backof a metal spoon.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot.jpg', u'id': 9021, u'name': u'apricot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'id': 12155, u'name': u'walnuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'id': 8120, u'name': u'oats'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Bake for 35 minsor until dark golden. Leave to coolcompletely before cutting into 16 barswith a sharp knife.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 177, u'instructions': u'Heat oven to 160C/fan 140C/gas 3.Gently heat the sugar, golden syrupand butter in a pan until the sugar andbutter have both melted. Stir the oats,raisins, walnuts, seeds and cranberriesinto the pan until coated in the butter.Spoon half the oaty mix into a traybaketin (23 x 23cm or thereabouts). Scatterthe apricots over the top, then top withthe remaining oat mix. Pack the mixdown well and smooth with the backof a metal spoon. Bake for 35 minsor until dark golden. Leave to coolcompletely before cutting into 16 barswith a sharp knife.', u'spoonacularSourceUrl': u'https://spoonacular.com/fruit-oat-seed-bars-224169', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}