{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/220110-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 220110, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken skewers with cucumber & shallot dip', u'diets': [u'gluten free', u'dairy free'], u'pricePerServing': 184.58, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 tbsp chopped coriander', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tbsp'}, {u'originalString': u'1 cucumber', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11206, u'unit': u''}, {u'originalString': u'2 garlic cloves, crushed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 limes, juice only', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 tsp light muscovado sugar', u'aisle': u'Baking', u'name': u'light muscovado sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10119334, u'unit': u'tsp'}, {u'originalString': u'1 red chilli, deseeded and finely chopped', u'aisle': u'Produce', u'name': u'red chilli', u'metaInformation': [u'red', u'deseeded', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'125ml rice vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 125.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'ml'}, {u'originalString': u'1 shallot, thinly sliced', u'aisle': u'Produce', u'name': u'shallot', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'500g boneless, skinless chicken breasts', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'g'}, {u'originalString': u'2 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}, {u'originalString': u'1 tsp coarsely ground black peppercorns', u'aisle': u'?', u'name': u'coarsely ground peppercorns', u'metaInformation': [u'black'], u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'unit': u'tsp'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1969/chicken-skewers-with-cucumber-and-shallot-dip', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut the chicken into thin slices.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Mix the coriander, pepper, lime juice, sugar, garlic and oil. Toss the chicken in this mixture, then thread on to 12 bamboo skewers. You can make these up to a day ahead and chill until ready to cook.Make the dip.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the vinegar and sugar in a small pan until the sugar has dissolved, then increase the heat and boil for 3 minutes, until slightly syrupy.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Remove from the heat and stir in the chilli and shallot. Leave to cool.Thinly slice a 5cm piece of cucumber, quarter each slice and add to the dip.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Cut the rest of the cucumber into thin sticks.Cook the chicken under a preheated grill for 3-4 minutes each side, then serve with the dipping sauce, cucumber sticks, rice and pak choi.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are my top picks for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'citrus , fruity , pineapple', u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 6, u'instructions': u'Cut the chicken into thin slices. Mix the coriander, pepper, lime juice, sugar, garlic and oil. Toss the chicken in this mixture, then thread on to 12 bamboo skewers. You can make these up to a day ahead and chill until ready to cook.Make the dip. Heat the vinegar and sugar in a small pan until the sugar has dissolved, then increase the heat and boil for 3 minutes, until slightly syrupy. Remove from the heat and stir in the chilli and shallot. Leave to cool.Thinly slice a 5cm piece of cucumber, quarter each slice and add to the dip. Cut the rest of the cucumber into thin sticks.Cook the chicken under a preheated grill for 3-4 minutes each side, then serve with the dipping sauce, cucumber sticks, rice and pak choi.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-skewers-with-cucumber-shallot-dip-220110', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}