{u'recipes': [{u'sourceName': u'Laurens Latest', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/802985-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 802985, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chinese Chicken Salad', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 133.97, u'creditText': u'Laurens Latest', u'extendedIngredients': [{u'originalString': u'2 1/2 tablespoons brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoons'}, {u'originalString': u'1 can mandarin oranges, drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'canned mandarin oranges', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 9218, u'unit': u'can'}, {u'originalString': u'3 tablespoons canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup crispy chow mein noodles', u'aisle': u'Ethnic Foods', u'name': u'crispy chow mein noodles', u'metaInformation': [u'crispy'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crispy-lo-mein-noodles.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20113, u'unit': u'cup'}, {u'originalString': u'2 teaspoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'2 teaspoons grated ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoons'}, {u'originalString': u'5 oz. pre-washed lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 11252, u'unit': u'oz'}, {u'originalString': u'1 red pepper, diced', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'diced', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1/4 head red cabbage, shredded', u'aisle': u'Produce', u'name': u'red cabbage', u'metaInformation': [u'shredded', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'unitLong': u'heads', u'unitShort': u'head', u'amount': 0.25, u'consistency': u'solid', u'id': 11112, u'unit': u'head'}, {u'originalString': u'4 scallions. sliced', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tablespoon sesame oil', u'aisle': u'Ethnic Foods', u'name': u'sesame oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoon'}, {u'originalString': u'1/2 lb. cooked and shredded chicken', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'liquid', u'id': 5348, u'unit': u'lb'}, {u'originalString': u'2 tablespoons soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'2 tablespoons white vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'white vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2053, u'unit': u'tablespoons'}], u'healthScore': 18.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.laurenslatest.com/chinese-chicken-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Place all salad ingredients into a bowl. Set aside.In a small bowl, whisk together all ingredients for the dressing. Toss salad with dressing and serve immediately.Feel free to adapt the ingredients in the dressing to suit your tastebuds. For instance, if you have ginger, reduce the amount you use. If you like sweet dressings, add more brown sugar. You see where I'm going with this?", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chardonnay, Pinot Noir, and Sauvignon Blanc are great choices for Chicken. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Waterbrook Reserve Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 20 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Beautiful and golden in color, this chardonnay has persistent ripe pear and lychee flavors that are complemented by a subtle, sweet toasty oak. Very balanced acid harmonizes the thick viscosity of this ripe and decadent wine.', u'title': u'Waterbrook Reserve Chardonnay', u'price': u'$19.99', u'id': 428827, u'link': u'https://www.amazon.com/Waterbrook-Reserve-Chardonnay-Columbia-Valley/dp/B01B6QW4IM', u'imageUrl': u'https://spoonacular.com/productImages/428827-312x231.jpg'}]}, u'aggregateLikes': 225, u'instructions': u"<p>Place all salad ingredients into a bowl. Set aside.In a small bowl, whisk together all ingredients for the dressing. Toss salad with dressing and serve immediately.Feel free to adapt the ingredients in the dressing to suit your tastebuds. For instance, if you have ginger, reduce the amount you use. If you like sweet dressings, add more brown sugar. You see where I'm going with this?</p>", u'spoonacularSourceUrl': u'https://spoonacular.com/chinese-chicken-salad-802985', u'dishTypes': [u'side dish', u'lunch', u'main course', u'salad', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}