{u'recipes': [{u'sourceName': u'Roxanas Home Baking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547772-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 55, u'id': 547772, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ricotta lime tart', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 204.65, u'creditText': u'Roxanas Home Baking', u'extendedIngredients': [{u'originalString': u'2 cups (240 grams) all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 240.0, u'consistency': u'solid', u'id': 20081, u'unit': u'grams'}, {u'originalString': u'sliced almonds', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 12061, u'unit': u'servings'}, {u'originalString': u'1/2 cup (113 grams) cold diced butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'diced', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 113.0, u'consistency': u'solid', u'id': 1001, u'unit': u'grams'}, {u'originalString': u'2 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3/4 cup (90 grams) ground almonds', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'ground almonds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-meal-or-almond-flour.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 90.0, u'consistency': u'solid', u'id': 93740, u'unit': u'grams'}, {u'originalString': u'grated zest from 2-3 limes', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'1X15 oz (425 grams) Sargento whole milk ricotta cheese', u'aisle': u'Cheese', u'name': u'skim milk ricotta cheese', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 425.0, u'consistency': u'solid', u'id': 93630, u'unit': u'grams'}, {u'originalString': u'powder sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}, {u'originalString': u'1/2 cup (100 grams) sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 19335, u'unit': u'grams'}, {u'originalString': u'- 5 tbsp iced water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tbsp'}, {u'originalString': u'3 whole eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole eggs', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 62.0, u'sourceUrl': u'http://roxanashomebaking.com/ricotta-lime-tart-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'In a food processor add the flour, sugar, butter, egg yolks and lime zest. Pulse a few times until it resembles fine crumbs. Gently add enough water to make a smooth dough, about 5 tbsp of iced water. With your fingers press the crust on the bottom and the sides of a 11" tart pan. Cover with plastic wrap and chill in the refrigerator for 30-40 minutes. In the meantime, heat the oven to 350F. In a mixing bowl beat the ricotta and sugar until just combined.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the eggs and egg whites, one at a time, beating well after each addition.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the ground almonds and lime zest. Stir to combine.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 93740, u'name': u'almond meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}]}, {u'equipment': [], u'step': u'Pour the filling into the chilled crust.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in preheated oven for 55 minutes or until slightly golden. Cool the tart at room temperature and sprinkle with sliced almonds or powder sugar just before serving.', u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1938, u'instructions': u'In a food processor add the flour, sugar, butter, egg yolks and lime zest. Pulse a few times until it resembles fine crumbs. Gently add enough water to make a smooth dough, about 5 tbsp of iced water. With your fingers press the crust on the bottom and the sides of a 11" tart pan. Cover with plastic wrap and chill in the refrigerator for 30-40 minutes. In the meantime, heat the oven to 350F. In a mixing bowl beat the ricotta and sugar until just combined.Add the eggs and egg whites, one at a time, beating well after each addition. Add the ground almonds and lime zest. Stir to combine. Pour the filling into the chilled crust. Bake in preheated oven for 55 minutes or until slightly golden. Cool the tart at room temperature and sprinkle with sliced almonds or powder sugar just before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/ricotta-lime-tart-547772', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}