{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/3304-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 3304, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pacific Halibut In Green Tea Broth', u'diets': [u'gluten free', u'dairy free', u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 256.46, u'extendedIngredients': [{u'originalString': u'1 baby bok choy (6 ozs), thinly sliced lengthwise', u'aisle': u'Produce', u'name': u'baby bok choy', u'metaInformation': [u'thinly sliced lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bok-choy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 93636, u'unit': u'ozs'}, {u'originalString': u'Basil leaves, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 2044, u'unit': u'leaves'}, {u'originalString': u'Coarse salt and ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 20.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1 cup frozen shelled edamame, thawed', u'aisle': u'Health Foods;Frozen', u'name': u'edamame', u'metaInformation': [u'frozen', u'shelled', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-soy-beans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11212, u'unit': u'cup'}, {u'originalString': u'1 piece fresh ginger (about 2 inches), peeled and finely chopped', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'peeled', u'finely chopped', u'( 2 inches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'1 cup brewed green tea', u'aisle': u'Tea and Coffee', u'name': u'green tea', u'metaInformation': [u'green', u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-tea-leaves.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10014355, u'unit': u'cup'}, {u'originalString': u'4 halibut fillets (6 ozs each)', u'aisle': u'Seafood', u'name': u'halibut fillets', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halibut-fillet.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 24.0, u'consistency': u'solid', u'id': 15036, u'unit': u'ozs'}, {u'originalString': u'1 tsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tsp'}, {u'originalString': u'1 Tbsp light soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'light soy sauce', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'Tbsp', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 10216124, u'unit': u'Tbsp'}, {u'originalString': u'2 Tbsps peanut oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'peanut oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4042, u'unit': u'Tbsps'}, {u'originalString': u'1 cup quinoa', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cup'}, {u'originalString': u'3 scallions, sliced on the diagonal', u'aisle': u'Produce', u'name': u'scallions', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'4 ozs shiitake mushrooms, stemmed and thinly sliced', u'aisle': u'Produce', u'name': u'shiitake mushrooms', u'metaInformation': [u'stemmed', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11238, u'unit': u'ozs'}, {u'originalString': u'1/2 cup snow peas, strings removed, thinly sliced lengthwise', u'aisle': u'Produce', u'name': u'snow peas', u'metaInformation': [u'thinly sliced lengthwise'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11300, u'unit': u'cup'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://www.wholeliving.com/132852/pacific-halibut-green-tea-broth', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees. Season halibut with salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/halibut-fillet.jpg', u'id': 15036, u'name': u'halibut'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a medium saucepan, bring 2 cups salted water to a boil.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add quinoa, reduce to a simmer, cover, and cook until quinoa is tender and water has been absorbed, about 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [], u'step': u'Remove from heat; set aside.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Meanwhile, in a large nonstick skillet, heat oil over medium-high. Cook fillets until golden, 2 to 3 minutes per side.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove fillets from pan (reserve pan with any oil in it).', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place fish in an ovenproof dish and bake 8 to 10 minutes or until just cooked through (a paring knife will easily go through fish).', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'To pan, add ginger, bok choy, edamame, shiitakes, and snow peas; reduce heat to medium and cook, stirring constantly, for 3 minutes or until the shiitakes begin to soften.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'id': 11238, u'name': u'shiitake mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'id': 11300, u'name': u'snow peas'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-soy-beans.jpg', u'id': 11212, u'name': u'edamame'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add green tea, soy sauce, and honey. Cook until edamame are tender, about 3 minutes longer.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-tea-leaves.jpg', u'id': 10014355, u'name': u'green tea'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-soy-beans.jpg', u'id': 11212, u'name': u'edamame'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add scallions to pan.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place some broth and vegetables in each of four shallow bowls. Top with fish fillet and garnish with basil leaves.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Season quinoa with salt if necessary and serve on the side in separate serving bowls.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The King Estate Signature Collection Pinot Gris with a 4.3 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'Light straw with emerald green hue. Aromas of green apple, citrus, honeysuckle, white peach, apricot and floral notes. Flavors of pear, melon, lemon and lime, wet stone, kiwi and honey. The palate has a soft, rich entry, nice texture, good weight and a long, lively crisp finish. View More', u'title': u'King Estate Signature Collection Pinot Gris', u'price': u'$15.99', u'id': 441154, u'link': u'https://www.wine.com/product/king-estate-signature-collection-pinot-gris-2011/116609', u'imageUrl': u'https://spoonacular.com/productImages/441154-312x231.jpg'}]}, u'aggregateLikes': 10, u'instructions': u'Directions                                                  Preheat oven to 400 degrees. Season halibut with salt and pepper.                                        In a medium saucepan, bring 2 cups salted water to a boil. Add quinoa, reduce to a simmer, cover, and cook until quinoa is tender and water has been absorbed, about 15 minutes. Remove from heat; set aside.                                        Meanwhile, in a large nonstick skillet, heat oil over medium-high. Cook fillets until golden, 2 to 3 minutes per side. Remove fillets from pan (reserve pan with any oil in it). Place fish in an ovenproof dish and bake 8 to 10 minutes or until just cooked through (a paring knife will easily go through fish).                                        To pan, add ginger, bok choy, edamame, shiitakes, and snow peas; reduce heat to medium and cook, stirring constantly, for 3 minutes or until the shiitakes begin to soften. Add green tea, soy sauce, and honey. Cook until edamame are tender, about 3 minutes longer. Add scallions to pan. Place some broth and vegetables in each of four shallow bowls. Top with fish fillet and garnish with basil leaves.                                        Season quinoa with salt if necessary and serve on the side in separate serving bowls.', u'spoonacularSourceUrl': u'https://spoonacular.com/pacific-halibut-in-green-tea-broth-3304', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 44, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}