{u'recipes': [{u'sourceName': u'Goodeness Gracious ', u'cuisines': [u'european', u'eastern european'], u'image': u'https://spoonacular.com/recipeImages/611112-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 611112, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crock Pot Freezer Packs: Beef Stroganoff', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 213.94, u'creditText': u'Goodeness Gracious ', u'extendedIngredients': [{u'originalString': u'1 lb beef sirloin cut into cubes or stew meat', u'aisle': u'Meat', u'name': u'beef top sirloin steak', u'metaInformation': [u'cut into cubes or stew meat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/top-sirloin-steak.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 23584, u'unit': u'lb'}, {u'originalString': u'Cooked Egg Noodles', u'aisle': u'Pasta and Rice', u'name': u'cooked egg noodles', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 20410, u'unit': u'servings'}, {u'originalString': u'10 3/4 oz can Cream of Mushroom Soup', u'aisle': u'Canned and Jarred', u'name': u'cream of mushroom soup', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-of-mushroom-soup.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.75, u'consistency': u'liquid', u'id': 6147, u'unit': u'oz'}, {u'originalString': u'1 clove garlic OR 1/4 tsp Freeze Dried Garlic', u'aisle': u'Spices and Seasonings', u'name': u'dried garlic', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 2020, u'unit': u'clove'}, {u'originalString': u'8 oz Can of Mushrooms- Drained', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'drained'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'1.35 oz Onion Soup Mix', u'aisle': u'Canned and Jarred', u'name': u'onion soup mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/onion-soup-mix.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.35, u'consistency': u'solid', u'id': 6094, u'unit': u'oz'}, {u'originalString': u'8 oz Sour Cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1056, u'unit': u'oz'}], u'healthScore': 11.0, u'imageType': u'jpg', u'spoonacularScore': 66.0, u'sourceUrl': u'http://goodenessgracious.com/2014/09/beef-stroganoff.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Mix together all the ingredients except sour cream and noodles and place in a freezer bag..Freeze.Run bag under water to loosen from bag and place in slow cooker.Cook on low for 8-10 hours or until beef is tender.Before serving, stir in sour cream.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [], u'step': u'Serve over noodles.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Nero D Avola, Primitivo, and Shiraz are my top picks for Beef Stroganoff. For a creamy, mushroomy beef stroganoff, you'll want a bold red to match. The Tasca d'Almerita Lamuri Nero d'Avola Sicilia with a 4.1 out of 5 star rating seems like a good match. It costs about 23 dollars per bottle.", u'pairedWines': [u'nero d avola', u'primitivo', u'shiraz'], u'productMatches': [{u'description': u'Lam\xf9ri, or "love" in Sicilian dialect, is Tasca d\'Almerita\'s most luscious, fruit-forward, and youthful Nero d\'Avola. Made from 100% Nero d\'Avola from 10-15 year old vines grown in sandy soils. The unique micro-climate provides Lam\xf9ri its pleasant freshness and elegance.Intense ruby-red in color, Lam\xf9ri offers lush aromas of blackberry, mulberry and cherry.  On the palate, this wine is incredibly rich, with velvety tannins and a refreshing acidity. Recommended with Mediterranean fare, such as pasta, roasted lamb and barbecued kebabs or ribs.  View More', u'title': u"Tasca d'Almerita Lamuri Nero d'Avola Sicilia", u'price': u'$22.99', u'id': 443637, u'link': u'https://www.wine.com/product/tasca-dalmerita-lamuri-nero-davola-sicilia-2008/106193', u'imageUrl': u'https://spoonacular.com/productImages/443637-312x231.jpg'}]}, u'aggregateLikes': 79, u'instructions': u'Mix together all the ingredients except sour cream and noodles and place in a freezer bag..Freeze.Run bag under water to loosen from bag and place in slow cooker.Cook on low for 8-10 hours or until beef is tender.Before serving, stir in sour cream.Serve over noodles.', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-freezer-packs-beef-stroganoff-611112', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 485, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}