{u'recipes': [{u'sourceName': u'The Endless Meal', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/474706-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 474706, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gluten Free Andalusian Gazpacho', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 136.79, u'creditText': u'The Endless Meal', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'2 tablespoons finely minced chives', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'finely minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11156, u'unit': u'tablespoons'}, {u'originalString': u'\xbd pound cucumber, peeled, seeded, and cut chunks', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'peeled', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u'pound'}, {u'originalString': u'2 cloves garlic, peeled and smashed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled', u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 jalape\xf1o pepper, cored, seeded and cut into chunks', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno pepper', u'metaInformation': [u'cored', u'seeded', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1\xbd teaspoons kosher salt, plus more to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'plus more to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1 cup extra-virgin olive oil, plus more for serving', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin', u'plus more for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 tablespoons sherry vinegar, plus more for serving', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'sherry vinegar', u'metaInformation': [u'plus more for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1012068, u'unit': u'tablespoons'}, {u'originalString': u'3 pounds very ripe tomatoes, cored and cut into chunks', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'cored', u'very ripe', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 11529, u'unit': u'pounds'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.theendlessmeal.com/gluten-free-andalusian-gazpacho/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Put all veggies in a large bowl and toss with salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Let sit on your counter for about a half hour, or till the veggies have released a lot of their liquid.Separate the veggies from the liquid, reserving the liquid.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Place on a tray (or if your freezer is tiny like mine, in a couple large ziplock bags) and place in the freezer for at least a half hour, or until they are partially frozen.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from freezer and let thaw completely.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the thawed veggies, reserved juice, oil and sherry vinegar in a large bowl. Ladle into a blender, working in batches if necessary, and blend on high until quite smooth.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 1012068, u'name': u'sherry vinegar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour into a large bowl and whisk to combine the different batches.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately or chill for up to 24 hours.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with extra sherry vinegar, olive oil and a sprinkle of chives, pepper and (if you want) some warm halloumi.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 1012068, u'name': u'sherry vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Albarino, Manzanilla Sherry, and Verdejo are great choices for Gazpacho. Though gazpacho is said to be a tricky pairing, all these Spanish wines can work. The Salneval Albarino with a 4.2 out of 5 star rating seems like a good match. It costs about 9 dollars per bottle.', u'pairedWines': [u'albarino', u'manzanilla sherry', u'verdejo'], u'productMatches': [{u'description': u'Light straw in color, the nose of this Albari\xf1o is seductive with honey, pear and tropical fruit and a slight mineral component. It is racy andzesty with citrus and floral flavors in the mouth, yet is round and soft at the same time.It matches perfectly with fresh seafood and shellfish; is an ideal accompaniment to salty, spicy Asian cuisine; and is also great on its own as a cocktail wine. Truly adventurous food lovers will amaze and inspire their friends by serving it with the unlikely, but fantastic pairing of traditional barbequed ribs with a sweet, slightly spicy tomato based sauce.', u'title': u'Salneval Albarino', u'price': u'$9.39', u'id': 446012, u'link': u'https://www.wine.com/product/salneval-albarino-2008/98474', u'imageUrl': u'https://spoonacular.com/productImages/446012-312x231.jpg'}]}, u'aggregateLikes': 297, u'instructions': u'Put all veggies in a large bowl and toss with salt. Let sit on your counter for about a half hour, or till the veggies have released a lot of their liquid.Separate the veggies from the liquid, reserving the liquid. Place on a tray (or if your freezer is tiny like mine, in a couple large ziplock bags) and place in the freezer for at least a half hour, or until they are partially frozen.Remove from freezer and let thaw completely.Combine the thawed veggies, reserved juice, oil and sherry vinegar in a large bowl. Ladle into a blender, working in batches if necessary, and blend on high until quite smooth. Pour into a large bowl and whisk to combine the different batches. Serve immediately or chill for up to 24 hours.Serve with extra sherry vinegar, olive oil and a sprinkle of chives, pepper and (if you want) some warm halloumi.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-andalusian-gazpacho-474706', u'dishTypes': [u'soup'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}