{u'recipes': [{u'sourceName': u'Fifteen Spatulas', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/558948-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 558948, u'veryPopular': True, u'lowFodmap': False, u'title': u'Tiramisu', u'diets': [], u'pricePerServing': 573.47, u'creditText': u'Fifteen Spatulas', u'extendedIngredients': [{u'originalString': u'2 tbsp amaretto liqueur', u'aisle': u'Alcoholic Beverages', u'name': u'amaretto liqueur', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/temporary-orange-liqueur.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10014534, u'unit': u'tbsp'}, {u'originalString': u'3 egg whites*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'6 egg yolks*', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1 cup freshly pulled espresso, cooled to room temperature', u'aisle': u'Tea and Coffee', u'name': u'espresso', u'metaInformation': [u'cooled', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 14210, u'unit': u'cup'}, {u'originalString': u'3-4 dozen ladyfingers, storebought or homemade', u'aisle': u'Sweet Snacks', u'name': u'ladyfingers', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 312.0, u'consistency': u'solid', u'id': 18423, u'unit': u''}, {u'originalString': u'8 oz mascarpone cheese, at room temperature', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93820, u'unit': u'oz'}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.fifteenspatulas.com/tiramisu/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 73, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a super clean bowl, whip the egg whites and 3 tbsp of sugar together with a hand mixer, for about 3-5 minutes until the egg whites hold stiff peaks (see photo above). In a separate bowl, whip the egg yolks with the other 3 tbsp sugar for 3-5 minutes until the egg yolks are thick, frothy, and pale yellow in color.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u"Add the mascarpone and amaretto liqueur to the egg yolks and whip until combined. Gently fold the stiff egg whites into the egg yolk mixture and set aside.Gather up a 8x6 glass container (or you can do individual servings in glasses), and dunk each ladyfinger into the espresso for 2-5 seconds and place the ladyfinger into the bottom of the glass dish. Don't let the ladyfinger soak so much that it falls apart, just a quick dunk to let it absorb a little bit of espresso. Once the ladyfingers have formed a single layer in the bottom of the dish, spread 1/2 of the mascarpone mixture over the ladyfingers. Arrange another layer of espresso soaked ladyfingers on top, and spread over the remaining mascarpone cream.Wrap the top of the glass container with plastic wrap and let the tiramisu refrigerate for 4-6 hours. This part is important, it allows the layers to soak into each other and the flavors to meld together.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/temporary-orange-liqueur.jpg', u'id': 10014534, u'name': u'amaretto liqueur'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'id': 18423, u'name': u'ladyfingers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14210, u'name': u'espresso'}]}, {u'equipment': [], u'step': u'Serve cold.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Tiramisu on the menu? Try pairing with Cream Sherry, Chianti, and Moscato d'Asti. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'chianti', u'moscato dasti', u'port', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 3331, u'instructions': u"In a super clean bowl, whip the egg whites and 3 tbsp of sugar together with a hand mixer, for about 3-5 minutes until the egg whites hold stiff peaks (see photo above). In a separate bowl, whip the egg yolks with the other 3 tbsp sugar for 3-5 minutes until the egg yolks are thick, frothy, and pale yellow in color. Add the mascarpone and amaretto liqueur to the egg yolks and whip until combined. Gently fold the stiff egg whites into the egg yolk mixture and set aside.Gather up a 8x6 glass container (or you can do individual servings in glasses), and dunk each ladyfinger into the espresso for 2-5 seconds and place the ladyfinger into the bottom of the glass dish. Don't let the ladyfinger soak so much that it falls apart, just a quick dunk to let it absorb a little bit of espresso. Once the ladyfingers have formed a single layer in the bottom of the dish, spread 1/2 of the mascarpone mixture over the ladyfingers. Arrange another layer of espresso soaked ladyfingers on top, and spread over the remaining mascarpone cream.Wrap the top of the glass container with plastic wrap and let the tiramisu refrigerate for 4-6 hours. This part is important, it allows the layers to soak into each other and the flavors to meld together. Serve cold.", u'spoonacularSourceUrl': u'https://spoonacular.com/tiramisu-558948', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}