{u'recipes': [{u'sourceName': u'Shared Appetite', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/609736-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 609736, u'veryPopular': False, u'lowFodmap': False, u'title': u'How to Make Perfect Carnitas', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 455.34, u'creditText': u'Shared Appetite', u'extendedIngredients': [{u'originalString': u'1 teaspoon ancho chile powder', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'ancho chile powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1022009, u'unit': u'teaspoon'}, {u'originalString': u'2 bay leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'8 - 10 pound bone-in pork shoulder*', u'aisle': u'Meat', u'name': u'bone-in pork shoulder', u'metaInformation': [u'bone-in'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 8.0, u'consistency': u'solid', u'id': 10072, u'unit': u'pound'}, {u'originalString': u'*or 6-8 pound boneless pork shoulder', u'aisle': u'Meat', u'name': u'boneless pork shoulder', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 6.0, u'consistency': u'solid', u'id': 10958, u'unit': u'pound'}, {u'originalString': u'1 teaspoon chile powder', u'aisle': u'Spices and Seasonings', u'name': u'chile powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'\xbd teaspoon cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002014, u'unit': u'teaspoon'}, {u'originalString': u'3 cloves garlic, thinly sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 medium onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tablespoons neutral-tasting oil', u'aisle': u'?', u'name': u'neutral-tasting oil', u'metaInformation': [], u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'unit': u'tablespoons'}], u'healthScore': 57.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://sharedappetite.com/recipes/how-to-make-perfect-carnitas/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut you pork shoulder in large pieces, very approximately 4-5 inches.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'id': 10072, u'name': u'pork shoulder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Remove excess fat.  Season the pork generously on all sides with Kosher salt and refrigerate overnight.  (You can skip the overnight part if needed, but I think it helps.  At the very least, make sure to salt the pork before the next step).Preheat your oven to 350F.In a large pot (I used my dutch oven), heat the oil over medium-high heat.  Once hot, sear pork shoulder on all sides until deep golden brown, approximately 3-4 minutes per side.  If your pot is to small to cook all the pork at one time in a single layer, sear in two batches.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'id': 10072, u'name': u'pork shoulder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove browned pork from the pot and use a paper towel to blot away excess grease.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour in 1 cup of water and use a wooden spoon to scrap up all the browned bits on the bottom of your pot.Stir in chile powder, ancho chile powder, bay leaves, cumin, garlic, onion, and a big pinch of salt.  Return all the pork to your pot and add enough water so that it submerges  of the pork.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 1022009, u'name': u'ancho chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place uncovered pot in the oven for 2 to 3 hours, turning the pork a couple times throughout the braising process.  Pork is done when almost all of the liquid is evaporated and the meat literally falls apart as you try to pick it up with a fork.', u'number': 5, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pork from pan, let cool completely and refrigerate for up to a few days.  Alternatively, you can wrap shredded pork in foil and then seal in a ziploc bag and freeze for several weeks.  Thaw overnight in the refrigerator and reheat in 350F oven wrapped in foil placed on a baking sheet.  Once pork is heated through, unwrap foil and let pork get all crispy and caramelized if desired.', u'number': 1, u'ingredients': []}], u'name': u'Remove bay leaves and discard.  Shred meat with two forks or allow to cool a bit and shred with your fingers.  Discard any visible big chunks of fat.If serving right away Discard any excess braising liquid left in pot with a large spoon.  Return pot to oven, turning shredded pork occasionally, until the pork is as crispy and caramelized as you want it.If making ahead'}], u'winePairing': {}, u'aggregateLikes': 78, u'instructions': u'<p>Cut you pork shoulder in large pieces, very approximately 4-5 inches.  Remove excess fat.  Season the pork generously on all sides with Kosher salt and refrigerate overnight.  (You can skip the overnight part if needed, but I think it helps.  At the very least, make sure to salt the pork before the next step).Preheat your oven to 350F.In a large pot (I used my dutch oven), heat the oil over medium-high heat.  Once hot, sear pork shoulder on all sides until deep golden brown, approximately 3-4 minutes per side.  If your pot is to small to cook all the pork at one time in a single layer, sear in two batches.Remove browned pork from the pot and use a paper towel to blot away excess grease.  Pour in 1 cup of water and use a wooden spoon to scrap up all the browned bits on the bottom of your pot.Stir in chile powder, ancho chile powder, bay leaves, cumin, garlic, onion, and a big pinch of salt.  Return all the pork to your pot and add enough water so that it submerges  of the pork.Place uncovered pot in the oven for 2 to 3 hours, turning the pork a couple times throughout the braising process.  Pork is done when almost all of the liquid is evaporated and the meat literally falls apart as you try to pick it up with a fork.Remove bay leaves and discard.  Shred meat with two forks or allow to cool a bit and shred with your fingers.  Discard any visible big chunks of fat.If serving right away: Discard any excess braising liquid left in pot with a large spoon.  Return pot to oven, turning shredded pork occasionally, until the pork is as crispy and caramelized as you want it.If making ahead:  Remove pork from pan, let cool completely and refrigerate for up to a few days.  Alternatively, you can wrap shredded pork in foil and then seal in a ziploc bag and freeze for several weeks.  Thaw overnight in the refrigerator and reheat in 350F oven wrapped in foil placed on a baking sheet.  Once pork is heated through, unwrap foil and let pork get all crispy and caramelized if desired.</p>', u'spoonacularSourceUrl': u'https://spoonacular.com/how-to-make-perfect-carnitas-609736', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}