{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/747343-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 130, u'id': 747343, u'veryPopular': False, u'lowFodmap': False, u'title': u'Kids Can Make: Pizza Popcorn', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 15.86, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 teaspoon garlic salt', u'aisle': u'Spices and Seasonings', u'name': u'garlic salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1062047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'3 cups popcorn', u'aisle': u'Savory Snacks', u'name': u'popcorn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 19034, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon crushed red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 6-ounce can tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 11887, u'unit': u'ounce'}], u'healthScore': 3.0, u'imageType': u'jpeg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/kids-can-make-pizza-popcorn.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 1, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Special equipment: A spice grinder', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Position an oven rack in the bottom of the oven, and preheat it to 200 degrees F. Line a baking sheet with parchment, and generously coat with cooking spray.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Spread the tomato paste out into a thin layer on the parchment (an offset metal spatula works best).', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Bake until the paste deepens to brick red and is dull in color and not shiny in any spots, about 2 hours. (It will look and feel like fruit leather.)', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Let it cool. Tear the paste into small pieces, and finely grind them in batches in the spice grinder.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add all the ground tomato paste back into the spice grinder, along with the Parmesan, oregano, garlic salt and pepper flakes, and grind to a fine powder. Store in an airtight container for up to 5 days. The spice blend makes enough for about 6 batches of popcorn.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1032027, u'name': u'seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat 1/2 tablespoon olive or vegetable oil in a large pot over medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add 1/2 cup kernels; when one pops, cover the pot, and cook, shaking the pot constantly, until the popping subsides to 1 pop every 20 seconds.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add some melted butter and 2 heaping tablespoons of pizza spice, toss to coat.', u'number': 3, u'ingredients': []}], u'name': u'To make 1 batch of pizza popcorn'}], u'winePairing': {u'pairingText': u"Fingerfood works really well with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Champagne Marc Hebrart Cuvee de Reserve Brut Premier Cru with a 4.4 out of 5 star rating seems like a good match. It costs about 48 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u"The signature are there, and there's a stealthy richness on the mid-palate; with five minutes in the glass it really exhales. A sumptuous yet articulate wine.  View More", u'title': u'Champagne Marc Hebrart Cuvee de Reserve Brut Premier Cru', u'price': u'$47.99', u'id': 464318, u'link': u'https://www.wine.com/product/champagne-marc-hebrart-cuvee-de-reserve-brut-premier-cru/147542', u'imageUrl': u'https://spoonacular.com/productImages/464318-312x231.jpg'}]}, u'aggregateLikes': 276, u'instructions': u'Special equipment: A spice grinder              Position an oven rack in the bottom of the oven, and preheat it to 200 degrees F. Line a baking sheet with parchment, and generously coat with cooking spray. Spread the tomato paste out into a thin layer on the parchment (an offset metal spatula works best). Bake until the paste deepens to brick red and is dull in color and not shiny in any spots, about 2 hours. (It will look and feel like fruit leather.) Let it cool. Tear the paste into small pieces, and finely grind them in batches in the spice grinder.                          Add all the ground tomato paste back into the spice grinder, along with the Parmesan, oregano, garlic salt and pepper flakes, and grind to a fine powder. Store in an airtight container for up to 5 days. The spice blend makes enough for about 6 batches of popcorn.                          To make 1 batch of pizza popcorn: Heat 1/2 tablespoon olive or vegetable oil in a large pot over medium heat. Add 1/2 cup kernels; when one pops, cover the pot, and cook, shaking the pot constantly, until the popping subsides to 1 pop every 20 seconds. Add some melted butter and 2 heaping tablespoons of pizza spice, toss to coat.', u'spoonacularSourceUrl': u'https://spoonacular.com/kids-can-make-pizza-popcorn-747343', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 135, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}