{u'recipes': [{u'sourceName': u'Framed Cooks', u'cuisines': [u'asian', u'thai'], u'image': u'https://spoonacular.com/recipeImages/730422-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 730422, u'veryPopular': False, u'lowFodmap': False, u'title': u'Heath Bar Birthday Cake', u'diets': [u'gluten free'], u'pricePerServing': 111.29, u'creditText': u'Framed Cooks', u'extendedIngredients': [{u'originalString': u'1 angel food cake, cut horizontally so you have three layers', u'aisle': u'Bakery/Bread', u'name': u'angel food cake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 18088, u'unit': u''}, {u'originalString': u'6 full size Heath bars, crushed', u'aisle': u'Sweet Snacks', u'name': u'heath bar', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/heath-bar.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 98978, u'unit': u''}, {u'originalString': u'1 pint heavy whipping cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy whipping cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'pint', u'unitShort': u'pts', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'pint'}, {u'originalString': u'1 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'4 tablespoons unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 19.0, u'sourceUrl': u'http://www.framedcooks.com/2016/04/heath-bar-birthday-cake.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 18, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine cream, cocoa and sugar and refrigerate overnight.Whip the cream mixture in a mixer until soft peaks form. Gently stir in the crushed', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Heath bars.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the frosting in between the layers, and then all around the sides and top of the cake.Chill at least 2 hours before serving.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 33, u'instructions': u'Combine cream, cocoa and sugar and refrigerate overnight.Whip the cream mixture in a mixer until soft peaks form. Gently stir in the crushed Heath bars.Spread the frosting in between the layers, and then all around the sides and top of the cake.Chill at least 2 hours before serving.', u'spoonacularSourceUrl': u'https://spoonacular.com/heath-bar-birthday-cake-730422', u'dishTypes': [u'dessert'], u'occasions': [u'birthday'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}