{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/464849-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 464849, u'veryPopular': False, u'lowFodmap': False, u'title': u'Easy Slow-Cooked Swiss Steak', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 186.02, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 can (8 ounces) tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'1/3 cup chopped celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 tablespoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'1/2 medium onion, cut into 1/4-inch slices', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'cut into 1/4-inch slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1/8 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'3/4 pound beef top round steak, cut in half', u'aisle': u'Meat', u'name': u'top round steak', u'metaInformation': [u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/round-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'liquid', u'id': 23636, u'unit': u'pound'}], u'healthScore': 55.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/easy-slow-cooked-swiss-steak', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'In a large resealable plastic bag, combine the flour, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Add beef; seal bag and shake to coat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Place onion in a 3-qt. slow cooker coated with cooking spray. Layer with the beef, celery and tomato sauce. Cover and cook on low for 6-8 hours or until meat is tender.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Merlot, Cabernet Sauvignon, and Pinot Noir are great choices for Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is Beringer Howell Mountain Bancroft Ranch Merlot. It has 4.2 out of 5 stars and a bottle costs about 35 dollars.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u"The 2006 Bancroft Ranch Merlot is a rich garnet color, and brims with flavors of ripe black fruits, brown spices and a hint of orange zest. Its refined tannins and depth of flavor make it one of Beringer's most memorable wines from Howell Mountain.Blend: 93% Merlot, 4% Cabernet Sauvignon, and 3% Cabernet Franc View More", u'title': u'Beringer Howell Mountain Bancroft Ranch Merlot', u'price': u'$34.99', u'id': 438453, u'link': u'https://www.wine.com/product/beringer-howell-mountain-bancroft-ranch-merlot-2006/116574', u'imageUrl': u'https://spoonacular.com/productImages/438453-312x231.jpg'}]}, u'aggregateLikes': 144, u'instructions': u'Directions                                                                                In a large resealable plastic bag, combine the flour, salt and pepper. Add beef; seal bag and shake to coat.                                                                                            Place onion in a 3-qt. slow cooker coated with cooking spray. Layer with the beef, celery and tomato sauce. Cover and cook on low for 6-8 hours or until meat is tender.                                        Yield: 2 servings.                                                                                                                         Originally published as Slow-Cooked Swiss Steak in  Cooking for 2Spring 2006, p12                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 272 calories, 5 g fat (2 g saturated fat), 96 mg cholesterol, 882 mg sodium, 13 g carbohydrate, 2 g fiber, 41 g protein.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-slow-cooked-swiss-steak-464849', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}