{u'recipes': [{u'sourceName': u'Somethings Wanky', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/598138-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 598138, u'veryPopular': True, u'lowFodmap': False, u'title': u'Almond Joy Muddy Buddies', u'diets': [], u'pricePerServing': 58.61, u'creditText': u'Somethings Wanky', u'extendedIngredients': [{u'originalString': u'1/2 cup almond butter', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'almond butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12195, u'unit': u'cup'}, {u'originalString': u'1 cup chopped Almond Joy bars', u'aisle': u'Sweet Snacks', u'name': u'almond joy bar', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-joy.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 19065, u'unit': u'cup'}, {u'originalString': u'1/4 cup butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 cup chocolate chips', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'cup'}, {u'originalString': u'8 cups rice squares cereal (Chex)', u'aisle': u'Cereal', u'name': u'crisp rice cereal', u'metaInformation': [u'(Chex)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'solid', u'id': 8066, u'unit': u'cups'}, {u'originalString': u'1 1/2 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 cup sweetened flaked coconut', u'aisle': u'Baking', u'name': u'sweetened coconut', u'metaInformation': [u'sweetened', u'flaked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-shredded.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12109, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://www.somethingswanky.com/almond-joy-muddy-buddies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, microwave the almond butter, chocolate chips, and butter for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'id': 10019146, u'name': u'chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-butter.jpg', u'id': 12195, u'name': u'almond butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Mix together until smooth, microwaving for an additional 30 seconds if necessary.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the cereal, chopped almond joy bars, and coconut into the bowl and use a large spatula to mix and coat everything well.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour the powdered sugar over the cereal mixture and toss to coat -OR- spoon the cereal into a zip top bag, and pour the powdered sugar in (seal and shake to coat).', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [], u'step': u'Serve immediately or chill and serve.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Riesling, Sparkling Wine, and Zinfandel are my top picks for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Eroica Riesling with a 4.2 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.', u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u'This Eroica shows the crisp acidity of the 2007 vintage, which was the best acidity holding year in the past five years. The wine delivers mandarin orange and sweet lime aromas and flavors with subtle mineral notes. The cooler September, along with selecting fruit from higher elevation and cooler sites, contributed to the mouth-watering acidity balanced by beautiful Washington Riesling fruit.An amazing pairing with sweet, flavorful Dungeness crab.', u'title': u'Eroica Riesling', u'price': u'$23.99', u'id': 434655, u'link': u'https://www.wine.com/product/eroica-riesling-2007/96190', u'imageUrl': u'https://spoonacular.com/productImages/434655-312x231.jpg'}]}, u'aggregateLikes': 2454, u'instructions': u'In a large bowl, microwave the almond butter, chocolate chips, and butter for 1 minute. Mix together until smooth, microwaving for an additional 30 seconds if necessary.Pour the cereal, chopped almond joy bars, and coconut into the bowl and use a large spatula to mix and coat everything well.Pour the powdered sugar over the cereal mixture and toss to coat -OR- spoon the cereal into a zip top bag, and pour the powdered sugar in (seal and shake to coat).Serve immediately or chill and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/almond-joy-muddy-buddies-598138', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}