{u'recipes': [{u'sourceName': u'Cookie Madness', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/259144-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 259144, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Marshmallow Hazelnut Spread Brownie', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 56.57, u'creditText': u'Cookie Madness', u'extendedIngredients': [{u'originalString': u'1 box brownie mix for a 9\xd713 inch pan or 1 batch homemade', u'aisle': u'Baking', u'name': u'brownie mix', u'metaInformation': [u'homemade', u'for a 9\xd713 inch pan or 1 batch '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 18632, u'unit': u'box'}, {u'originalString': u'Some Jif Chocolate Hazelnut Mocha Flavored Spread', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'chocolate hazelnut spread', u'metaInformation': [u'flavored'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hazelnut-chocolate-spread.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 32.0, u'consistency': u'solid', u'id': 19125, u'unit': u'servings'}, {u'originalString': u'1 teaspoon of fine instant coffee or instant espresso', u'aisle': u'Tea and Coffee', u'name': u'instant espresso', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10014214, u'unit': u'teaspoon'}, {u'originalString': u'1 jar Marshmallow Cr\xe8me or 1 \xbd cups Marshmallow Fluff', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'marshmallow creme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'jar', u'unitShort': u'jar', u'amount': 1.0, u'consistency': u'solid', u'id': 93644, u'unit': u'jar'}, {u'originalString': u'1 cup dark or semisweet chocolate chips', u'aisle': u'Baking', u'name': u'semisweet chocolate chips', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019903, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 17.0, u'sourceUrl': u'http://www.cookiemadness.net/2012/06/chocolate-marshmallow-hazelnut-spread-brownie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Prepare one 9\xd713 inch pan of brownies as directed on the package using oil and eggs as needed, but add 1 teaspoon of fine instant coffee (the kind that comes in little packets) or 1 teaspoon of instant espresso powder to the batter as well as 1 cup dark or semi-sweet chocolate chips.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 10014214, u'name': u'instant espresso'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'id': 19903, u'name': u'semisweet chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 14214, u'name': u'instant coffee'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake as directed. Alternatively, you can make an 8 inch pan and use half of all the ingredients.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let the brownies cool until they are just a tad bit warm, then spread 1 jar of Marshmallow Cr\xe8me across the top, by dropping it on in small gobs and spreading the gobs until they come together. The small bit of heat from the brownies should melt the marshmallow a little bit.Spoon lines of Jif Chocolate Hazelnut Mocha Flavored', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}], u'step': u'Spread horizontally or vertically (doesn’t matter) over brownies. Drag a skewer through the lines, first toward you, then away from you, alternating directions to make the whale-tail/leaf pattern.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Put the brownies in the refrigerator (or cheat and use the freezer) for about 30 minutes or until the top is set just until so that when you cut it, the brownies aren’t gooey.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into any size squares or bars and keep chilled until ready to serve. The topping should stay in place fairly well.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 10, u'instructions': u'Prepare one 9\xd713 inch pan of brownies as directed on the package using oil and eggs as needed, but add 1 teaspoon of fine instant coffee (the kind that comes in little packets) or 1 teaspoon of instant espresso powder to the batter as well as 1 cup dark or semi-sweet chocolate chips. Bake as directed. Alternatively, you can make an 8 inch pan and use half of all the ingredients.Let the brownies cool until they are just a tad bit warm, then spread 1 jar of Marshmallow Cr\xe8me across the top, by dropping it on in small gobs and spreading the gobs until they come together. The small bit of heat from the brownies should melt the marshmallow a little bit.Spoon lines of Jif Chocolate Hazelnut Mocha Flavored Spread horizontally or vertically (doesn’t matter) over brownies. Drag a skewer through the lines, first toward you, then away from you, alternating directions to make the whale-tail/leaf pattern.Put the brownies in the refrigerator (or cheat and use the freezer) for about 30 minutes or until the top is set just until so that when you cut it, the brownies aren’t gooey.Cut into any size squares or bars and keep chilled until ready to serve. The topping should stay in place fairly well.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-marshmallow-hazelnut-spread-brownie-259144', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 32, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}