{u'recipes': [{u'sourceName': u'Emily Bites', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/825470-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 825470, u'veryPopular': False, u'lowFodmap': False, u'title': u'Savory Sausage Pumpkin Flatbreads', u'diets': [], u'pricePerServing': 173.72, u'creditText': u'Emily Bites', u'extendedIngredients': [{u'originalString': u'\xbd cup canned pumpkin', u'aisle': u'Baking', u'name': u'canned pumpkin', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin-puree.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11424, u'unit': u'cup'}, {u'originalString': u'1/8 teaspoon dried marjoram', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried marjoram', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2023, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon dried rubbed sage', u'aisle': u'Spices and Seasonings', u'name': u'dried rubbed sage', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2038, u'unit': u'teaspoon'}, {u'originalString': u'2 Flatout Light Original Flatbread', u'aisle': u'Bakery/Bread', u'name': u'flatbread', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10018413, u'unit': u''}, {u'originalString': u'1 garlic clove, minced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 tablespoon diced onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'tablespoon'}, {u'originalString': u'1 oz Parmesan cheese, finely shredded', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'shredded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'oz'}, {u'originalString': u'Salt and black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'5 oz uncooked hot Italian poultry sausage (chicken or turkey)', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'italian', u'hot', u'uncooked', u'(chicken or turkey)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 5.0, u'consistency': u'solid', u'id': 1017063, u'unit': u'oz'}, {u'originalString': u'1 cup fresh torn spinach leaves', u'aisle': u'Produce', u'name': u'spinach leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cup'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 76.0, u'sourceUrl': u'http://www.emilybites.com/2016/10/savory-sausage-pumpkin-flatbreads.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Pre-heat the oven to 350.Lightly mist a small skillet with cooking spray and bring to medium heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sausage and cook, breaking it up into small pieces, until it begins to brown.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Add the onions, garlic, sage and marjoram and cook, breaking up the meat and stirring regularly until the sausage is cooked through and the onions are translucent.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'id': 2023, u'name': u'marjoram'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [], u'step': u'Add the spinach and cook, stirring regularly, for another minute or two until the spinach is wilted.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Remove from heat.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the flatbreads directly onto the middle rack of the pre-heated oven and bake for about 3  minutes until they stand firm when lifted. While the flatbreads are baking, place the pumpkin in a bowl and sprinkle with a pinch of salt and pepper, to taste. Stir and place in the microwave to cook on high for about 30 seconds.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the flatbreads from the oven and spread with the warmed pumpkin, leaving a bit of space around the edge for the crust. Divide the sausage mixture between the two flatbreads and spread across the pumpkin. Sprinkle the parmesan over the sausage mixture. Return the flatbread to the middle rack of the oven and bake for another 5 minutes until the cheese is melted and the edges are browned. Slice and serve immediately.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pita-bread.jpg', u'id': 10018413, u'name': u'flatbread'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 147, u'instructions': u'Pre-heat the oven to 350.Lightly mist a small skillet with cooking spray and bring to medium heat. Add the sausage and cook, breaking it up into small pieces, until it begins to brown. Add the onions, garlic, sage and marjoram and cook, breaking up the meat and stirring regularly until the sausage is cooked through and the onions are translucent. Add the spinach and cook, stirring regularly, for another minute or two until the spinach is wilted. Remove from heat.Place the flatbreads directly onto the middle rack of the pre-heated oven and bake for about 3  minutes until they stand firm when lifted. While the flatbreads are baking, place the pumpkin in a bowl and sprinkle with a pinch of salt and pepper, to taste. Stir and place in the microwave to cook on high for about 30 seconds.Remove the flatbreads from the oven and spread with the warmed pumpkin, leaving a bit of space around the edge for the crust. Divide the sausage mixture between the two flatbreads and spread across the pumpkin. Sprinkle the parmesan over the sausage mixture. Return the flatbread to the middle rack of the oven and bake for another 5 minutes until the cheese is melted and the edges are browned. Slice and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/savory-sausage-pumpkin-flatbreads-825470', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}