{u'recipes': [{u'sourceName': u'Copy Kat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/600710-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 600710, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cinnamon Roll Pops', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 30, u'pricePerServing': 59.25, u'creditText': u'Copy Kat', u'extendedIngredients': [{u'originalString': u'3/4 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2/3 cup of butter - for dough', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for dough'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u'1 to 2 tablespoons of cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tablespoons'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 cups, and 2 1/2 cups flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1 package of instant quick rising yeast or 2 tablespoons of yeast', u'aisle': u'Baking', u'name': u'instant yeast', u'metaInformation': [u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10118375, u'unit': u'package'}, {u'originalString': u'1 cup warmed milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'warmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 to 3 tablespoons of milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tablespoons'}, {u'originalString': u'2 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon of sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon vanilla', u'aisle': u'Baking', u'name': u'vanilla', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons of warm water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'Yield: 60+ mini cinnamon roll pops', u'aisle': u'?', u'name': u'yield: 60', u'metaInformation': [u'mini'], u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 32.0, u'sourceUrl': u'http://www.copykat.com/2011/08/21/cinnamon-roll-pops/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u"Proof your yeast by placing the yeast into two tablespoons of warm water and then add 1 tablespoon of sugar, and package in instant yeast. By proofing your yeast you can make sure it is active, if it fails to bubble within the first five minutes or so, it may be old. If the yeast is old, don't use it, your bread will not rise.In a small saucepan heat together milk and 2/3 cup of butter.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 10118375, u'name': u'instant yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u"Heat it until the milk is warm, and the butter begins to melt. Do not let this boil, you just want to get the temperature up to around 120 degrees anymore, and it isn't usable it will kill the yeast.", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Add warmed milk mixture to the flour in the mixing bowl and begin to mix with the dough hook attachment. The yeast should be bubbling now, add the yeast, and 1/2 teaspoon of salt.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yeast.jpg', u'id': 18375, u'name': u'yeast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u"Add two eggs, and when they have incorporated, add an addition 2 cups of flour, if the dough is firm, and not sticky, you can simply let the mixer do the kneading, if the dough is sticky you may need to add an addition 1/3 to 1/2 cup of flour. After about five minutes of kneading, this can be done by hand on a floured surface, or by the mixer place the dough into a covered container or a bowl with a towel on it, and allow it to rise. It will take 1 to 1 1/2 hours for the dough to double in size.Prepare the filling of the cinnamon rolls by mixing together the 1/2 cup of butter, the brown sugar, and 1 to 2 tablespoons of cinnamon. I like more cinnamon so I am heavy handed in my cinnamon, I'll add about 2 tablespoons. Cream together this mixture, have it ready to prepare your cinnamon rolls.Once the dough has risen divide dough into two balls, and then roll out the dough to about 1/4 inch thickness. Use a knife to square up the dough so you can roll out nice even cinnamon rolls.", u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u"Spread filling onto the rolls, you don't need a lot, too much and the filling will melt out of the cinnamon rolls.", u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u"Cut the dough in half again, you only need to make a couple of turns of the dough for the cinnamon rolls. Be sure to roll the cinnamon rolls tightly so they don't spread out too much.Make three quarter inch cuts in your cinnamon rolls and place them on a greased cookie sheet.", u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Place a candy stick into each one of them about midway up before baking.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake for approximately 12 - 15 minutes in a 350 degree oven. It is better to err on the side of underdone, because if these cook too long, they become very hard.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from pan immediately and allow to cool.Make the frosting by adding the powdered sugar, vanilla, and a couple of tablespoons of milk in a bowl. This icing will be hard to stir, and you must mix these together for several minutes. If the frosting is too thick, add a teaspoon or two of milk until it is thinned so you can drizzle the frosting over the cinnamon rolls. Finish by drizzling frosting over the cinnamon rolls by loading a spoon full of the frosting and waving it very quickly above the cinnamon roll pops.Whew ;) These are very easy to make, and if you have never tried making a cinnamon roll from scratch, you should give it a try. Kids love these, as well as folks in the office. It is really hard to refuse a small nibble of most anything.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 357, u'instructions': u"Proof your yeast by placing the yeast into two tablespoons of warm water and then add 1 tablespoon of sugar, and package in instant yeast. By proofing your yeast you can make sure it is active, if it fails to bubble within the first five minutes or so, it may be old. If the yeast is old, don't use it, your bread will not rise.In a small saucepan heat together milk and 2/3 cup of butter. Heat it until the milk is warm, and the butter begins to melt. Do not let this boil, you just want to get the temperature up to around 120 degrees anymore, and it isn't usable it will kill the yeast. Add warmed milk mixture to the flour in the mixing bowl and begin to mix with the dough hook attachment. The yeast should be bubbling now, add the yeast, and 1/2 teaspoon of salt. Add two eggs, and when they have incorporated, add an addition 2 cups of flour, if the dough is firm, and not sticky, you can simply let the mixer do the kneading, if the dough is sticky you may need to add an addition 1/3 to 1/2 cup of flour. After about five minutes of kneading, this can be done by hand on a floured surface, or by the mixer place the dough into a covered container or a bowl with a towel on it, and allow it to rise. It will take 1 to 1 1/2 hours for the dough to double in size.Prepare the filling of the cinnamon rolls by mixing together the 1/2 cup of butter, the brown sugar, and 1 to 2 tablespoons of cinnamon. I like more cinnamon so I am heavy handed in my cinnamon, I'll add about 2 tablespoons. Cream together this mixture, have it ready to prepare your cinnamon rolls.Once the dough has risen divide dough into two balls, and then roll out the dough to about 1/4 inch thickness. Use a knife to square up the dough so you can roll out nice even cinnamon rolls. Spread filling onto the rolls, you don't need a lot, too much and the filling will melt out of the cinnamon rolls. Cut the dough in half again, you only need to make a couple of turns of the dough for the cinnamon rolls. Be sure to roll the cinnamon rolls tightly so they don't spread out too much.Make three quarter inch cuts in your cinnamon rolls and place them on a greased cookie sheet. Place a candy stick into each one of them about midway up before baking. Bake for approximately 12 - 15 minutes in a 350 degree oven. It is better to err on the side of underdone, because if these cook too long, they become very hard. Remove from pan immediately and allow to cool.Make the frosting by adding the powdered sugar, vanilla, and a couple of tablespoons of milk in a bowl. This icing will be hard to stir, and you must mix these together for several minutes. If the frosting is too thick, add a teaspoon or two of milk until it is thinned so you can drizzle the frosting over the cinnamon rolls. Finish by drizzling frosting over the cinnamon rolls by loading a spoon full of the frosting and waving it very quickly above the cinnamon roll pops.Whew ;) These are very easy to make, and if you have never tried making a cinnamon roll from scratch, you should give it a try. Kids love these, as well as folks in the office. It is really hard to refuse a small nibble of most anything.", u'spoonacularSourceUrl': u'https://spoonacular.com/cinnamon-roll-pops-600710', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 150, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}