{u'recipes': [{u'sourceName': u'Happy Herbivore', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/263854-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 263854, u'veryPopular': False, u'lowFodmap': False, u'title': u'Southern-Style Biscuits & Gravy', u'diets': [], u'pricePerServing': 40.09, u'creditText': u'Happy Herbivore', u'extendedIngredients': [{u'originalString': u'5 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 5.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'6 tbsp Tofutti cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1017, u'unit': u'tbsp'}, {u'originalString': u'2 cups plant-based milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'\xbc tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'\xbe cup vegan sausage, crumbled', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1017063, u'unit': u'cup'}, {u'originalString': u'\xbc cup whole wheat pastry flour', u'aisle': u'Baking', u'name': u'whole wheat pastry flour', u'metaInformation': [u'whole wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 10020080, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 34.0, u'sourceUrl': u'https://happyherbivore.com/recipe/southern-style-biscuits-gravy/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the biscuits: Preheat oven to 400 F.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the flour, baking powder and salt together in a large bowl and transfer to your food processor with the dough blade (if you have it). Pulse the food processor a few times, until all of the tofutti has been mixed in and little balls have formed.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer back to the bowl and stir in non-dairy milk. Using a 1/4 measuring cup, transfer mixture on to a greased cookie sheet.', u'number': 3, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk non-dairy milk and flour together and heat over medium. Crumble the sausages and add it to the non-dairy milk mixture. If using gimme lean, it might be best to toss all the ingredients together in your food processor or blender -- especially if you want a fairly smooth gravy. Bring to a boil over high heat then reduce to medium. Allow gravy to thicken to a desired consistency.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Add black pepper (I like it really peppery!) to taste.Nutritional Information', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'black pepper'}]}], u'name': u'Place on the bottom rack and bake for approximately 14 minutes or until the biscuits are slightly brown.For the gravy'}, {u'steps': [{u'equipment': [], u'step': u'8Amount Per Serving', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Calories', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'234Fat', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'30g', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Carbohydrate', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'31gDietary Fiber3.50gSugars4.70gProtein11g', u'number': 6, u'ingredients': []}], u'name': u'Serving Size 1Servings Per Batch'}], u'winePairing': {}, u'aggregateLikes': 63, u'instructions': u'InstructionsFor the biscuits: Preheat oven to 400 F. Whisk the flour, baking powder and salt together in a large bowl and transfer to your food processor with the dough blade (if you have it). Pulse the food processor a few times, until all of the tofutti has been mixed in and little balls have formed. Transfer back to the bowl and stir in non-dairy milk. Using a 1/4 measuring cup, transfer mixture on to a greased cookie sheet. Place on the bottom rack and bake for approximately 14 minutes or until the biscuits are slightly brown.For the gravy: Whisk non-dairy milk and flour together and heat over medium. Crumble the sausages and add it to the non-dairy milk mixture. If using gimme lean, it might be best to toss all the ingredients together in your food processor or blender -- especially if you want a fairly smooth gravy. Bring to a boil over high heat then reduce to medium. Allow gravy to thicken to a desired consistency. Add black pepper (I like it really peppery!) to taste.Nutritional InformationServing Size: 1Servings Per Batch:                                     8Amount Per ServingCalories                                     234Fat                                     4.30g                                      Carbohydrate                                     31gDietary Fiber3.50gSugars4.70gProtein11g', u'spoonacularSourceUrl': u'https://spoonacular.com/southern-style-biscuits-gravy-263854', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}