{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/199805-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 199805, u'veryPopular': False, u'lowFodmap': False, u'title': u'Wake-Up Call: Blood Orange Citrus Cooler', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'pricePerServing': 332.58, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1/4 cup blood orange juice', u'aisle': u'Beverages', u'name': u'blood orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blood-orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1009206, u'unit': u'cup'}, {u'originalString': u'1 tablespoon orange blossom honey', u'aisle': u'Gourmet', u'name': u'orange blossom water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12411111, u'unit': u'tablespoon'}, {u'originalString': u'1/4 cup tangerine or orange juice', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'Sparkling water or hot water', u'aisle': u'Beverages', u'name': u'sparkling water', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'serving', u'unitShort': u'serving', u'amount': 1.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'serving'}, {u'originalString': u'1/4 cup tangelo juice', u'aisle': u'Beverages', u'name': u'tangelo juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tangerine-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1009221, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/02/wake-up-call-blood-orange-citrus-cooler.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Combine all juices together to equal 3/4 of a cup (6 oz) juice. Gently whisk in honey till dissolved.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour over ice and top up with sparkling water for a cooler. For a citrusy toddy, add hot water and stir.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Garnet Monterey Pinot Noir. It has 4.2 out of 5 stars and a bottle costs about 16 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u"This is a Pinot with power, but also with finesse. Aromas include ripe blackberries, cherry preserves, vanilla toffee and toasted French oak. You'll love the velvety richness of the attack. The flavors of dark red fruits and exotic spices just make this a juicy, delicious mouthful of wine.", u'title': u'Garnet Monterey Pinot Noir', u'price': u'$15.99', u'id': 444323, u'link': u'https://www.wine.com/product/garnet-monterey-pinot-noir-2011/123633', u'imageUrl': u'https://spoonacular.com/productImages/444323-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u'Procedures                                                                              1                                                                            Combine all juices together to equal 3/4 of a cup (6 oz) juice. Gently whisk in honey till dissolved.                                                                                                                             2                                                                            Pour over ice and top up with sparkling water for a cooler. For a citrusy toddy, add hot water and stir.', u'spoonacularSourceUrl': u'https://spoonacular.com/wake-up-call-blood-orange-citrus-cooler-199805', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}