{u'recipes': [{u'sourceName': u'Veg Recipes of India', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/488703-556x370.jpg', u'cheap': False, u'gaps': u'GAPS_5', u'cookingMinutes': 30, u'id': 488703, u'veryPopular': False, u'lowFodmap': False, u'title': u'broccoli basil , how to make broccoli basil', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 180.43, u'creditText': u'Veg Recipes of India', u'extendedIngredients': [{u'originalString': u'1\xbd cup basil leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'2 broccoli', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11090, u'unit': u''}, {u'originalString': u'2 tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'4-5 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 3.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'2 large tomatoes or 1\xbd cup tomato puree', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 100.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.vegrecipesofindia.com/broccoli-basil-italian-broccoli-basil/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'remove the florets from broccoli and rinse them well in waterchop the garlic and tomatoesclean and rinse the basil leaves and chop them and keep asidein a pan, heat olive oil. add garlic and saute for a minute on a medium flameadd the tomatoes and saute the tomatoes for a few minutes.cook the tomatoes till they become soft, pulpy and mushy almost paste like. alternatively you could add tomato puree instead of chopped tomatoes.when the tomatoes are cooked, add salt and pepper. mix well.add the broccoli florets.mix the broccoli with the tomato garlic mixture.cover and let the broccoli cook for 10-12 minutes.later add the chopped basil and cook for 1-2 minutes.serve broccoli basil hot with rice, pasta, noodles or even bread.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 10011090, u'name': u'broccoli florets'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 22, u'instructions': u'remove the florets from broccoli and rinse them well in waterchop the garlic and tomatoesclean and rinse the basil leaves and chop them and keep asidein a pan, heat olive oil. add garlic and saute for a minute on a medium flameadd the tomatoes and saute the tomatoes for a few minutes.cook the tomatoes till they become soft, pulpy and mushy almost paste like. alternatively you could add tomato puree instead of chopped tomatoes.when the tomatoes are cooked, add salt and pepper. mix well.add the broccoli florets.mix the broccoli with the tomato garlic mixture.cover and let the broccoli cook for 10-12 minutes.later add the chopped basil and cook for 1-2 minutes.serve broccoli basil hot with rice, pasta, noodles or even bread.', u'spoonacularSourceUrl': u'https://spoonacular.com/broccoli-basil-how-to-make-broccoli-basil-488703', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 3, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}