{u'recipes': [{u'sourceName': u'Diethood', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/692531-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 692531, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry Turkey Quesadillas', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 52.8, u'creditText': u'Diethood', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter, for pan', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for pan'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'Flour Tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'servings'}, {u'originalString': u'provolone cheese slices', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'pulled or chopped cooked turkey meat (you can also use cooked chicken and/or ham)', u'aisle': u'Meat', u'name': u'turkey meat', u'metaInformation': [u'cooked', u'chopped', u'(you can also use chicken and/or ham)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'can', u'unitShort': u'can', u'amount': 1.0, u'consistency': u'solid', u'id': 5166, u'unit': u'can'}, {u'originalString': u'cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole cranberry sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9081, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://diethood.com/cranberry-turkey-quesadillas/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Set an cast iron skillet or a frying pan over medium heat. (cast iron skillet preferred)Drop a tablespoon of butter to melt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Spread cranberry sauce over each tortilla.Divide up the toppings, cheese and turkey meat, evenly over the cranberry sauce.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5166, u'name': u'turkey meat'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Transfer one tortilla to skillet, toppings-side-up.Cook for 30 seconds, or until cheese begins to melt.Using a spatula, fold one side of the tortilla over the toppings.Cook for a few more seconds; flip it over and continue to cook just until lightly browned.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from skillet and transfer to a paper towel-lined plate.Continue to cook the rest, adding more butter as needed.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Cut and serve immediately.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Quesadilla. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Dutton-Goldfield Dutton Ranch Pinot Noir. It has 4.4 out of 5 stars and a bottle costs about 43 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The ripening season was classic Russian River, with warm days and cool nights—and with no major heat spells, the fruit ripening was perfect to give lush tannins, bright berry fruit and bright acidity. The wine shows rich, dense black cherry and blackberry fruit and nuances of strawberry, raspberry, and nutmeg in the nose. In the mouth, the first impression is fresh berry fruit, then the soft, broad tannins carry notes of marionberries, nutmeg and sandalwood through a lingering finish. Thanks partially to the moderate alcohol and bright acidity, the finish lingers with fresh cherry fruit and creamy berry compote.This wine has a broad range of food pairings, whether alone with some well chosen cheeses, richer fish preparations or a good old steak on the barbeque. View More', u'title': u'Dutton-Goldfield Dutton Ranch Pinot Noir', u'price': u'$42.99', u'id': 438099, u'link': u'https://www.wine.com/product/dutton-goldfield-dutton-ranch-pinot-noir-2014/154141', u'imageUrl': u'https://spoonacular.com/productImages/438099-312x231.jpg'}]}, u'aggregateLikes': 159, u'instructions': u'Set an cast iron skillet or a frying pan over medium heat. (cast iron skillet preferred)Drop a tablespoon of butter to melt.Spread cranberry sauce over each tortilla.Divide up the toppings, cheese and turkey meat, evenly over the cranberry sauce.Transfer one tortilla to skillet, toppings-side-up.Cook for 30 seconds, or until cheese begins to melt.Using a spatula, fold one side of the tortilla over the toppings.Cook for a few more seconds; flip it over and continue to cook just until lightly browned.Remove from skillet and transfer to a paper towel-lined plate.Continue to cook the rest, adding more butter as needed.Cut and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-turkey-quesadillas-692531', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}