{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/448591-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 448591, u'veryPopular': False, u'lowFodmap': False, u'title': u'Almond Turkey Casserole', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 121.76, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 package (9 ounces) frozen broccoli cuts', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 11090, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2 cups uncooked egg noodles', u'aisle': u'Pasta and Rice', u'name': u'egg noodles', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20409, u'unit': u'cups'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon ground mustard', u'aisle': u'Spices and Seasonings', u'name': u'ground mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002024, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 cups milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup slivered almonds, toasted', u'aisle': u'Baking', u'name': u'slivered almonds', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds-slivered.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10012061, u'unit': u'cup'}, {u'originalString': u'1 cup (4 ounces) shredded Swiss cheese', u'aisle': u'Cheese', u'name': u'swiss cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Swiss-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1040, u'unit': u'ounces'}, {u'originalString': u'2 cups cubed cooked turkey', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'cubed', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 5165, u'unit': u'cups'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/almond-turkey-casserole', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook noodles according to package directions; drain. Cook broccoli according to package directions; drain.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place noodles and broccoli in a large bowl; set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'id': 11090, u'name': u'broccoli'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, melt the butter. Stir in the flour, salt, mustard and pepper until smooth. Gradually stir in milk. Bring to a boil; cook and stir for 2 minutes or until thickened. remove from the heat; stir in cheese until melted.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the turkey; pour over noodle mixture.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Transfer to a greased 1-1/2-qt. baking dish. Sprinkle with almonds.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}]}, {u'equipment': [], u'step': u'Bake, uncovered, at 350\xb0 for 20-25 minutes or until heated through.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 61, u'instructions': u'Directions                                                                                Cook noodles according to package directions; drain. Cook broccoli according to package directions; drain. Place noodles and broccoli in a large bowl; set aside.                                                                                           In a large saucepan, melt the butter. Stir in the flour, salt, mustard and pepper until smooth. Gradually stir in milk. Bring to a boil; cook and stir for 2 minutes or until thickened. remove from the heat; stir in cheese until melted. Add the turkey; pour over noodle mixture.                                                                                           Transfer to a greased 1-1/2-qt. baking dish. Sprinkle with almonds. Bake, uncovered, at 350\xb0 for 20-25 minutes or until heated through.                                        Yield: 4 servings.                                                                                                                         Originally published as Almond Turkey Casserole in  Casserole Cookbook2001, p25                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 cup) equals 515 calories, 27 g fat (12 g saturated fat), 124 mg cholesterol, 833 mg sodium, 28 g carbohydrate, 4 g fiber, 39 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/almond-turkey-casserole-448591', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}