{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/211866-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 211866, u'veryPopular': False, u'lowFodmap': True, u'title': u'Spinach & feta stuffed chicken', u'diets': [u'gluten free', u'primal', u'fodmap friendly'], u'preparationMinutes': 10, u'pricePerServing': 100.52, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 boneless chicken breast fillets, skin on', u'aisle': u'Meat', u'name': u'boneless chicken breast', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'fillets', u'unitShort': u'fillet', u'amount': 4.0, u'consistency': u'solid', u'id': 5062, u'unit': u'fillet'}, {u'originalString': u'85g feta cheese, crumbled', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 1019, u'unit': u'g'}, {u'originalString': u'85g frozen leaf spinach, defrosted', u'aisle': u'Frozen', u'name': u'frozen spinach', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach-frozen.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 85.0, u'consistency': u'solid', u'id': 11463, u'unit': u'g'}, {u'originalString': u'2 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp pine nuts', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 12147, u'unit': u'tbsp'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/4732/spinach-and-feta-stuffed-chicken', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Loosen the skin from the chicken.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Drainthe spinach in a sieve and press out as muchwater as possible.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Mix with the feta and alittle black pepper, then stuff between theflesh and skin of the chicken, smoothingthe skin back over the stuffing. Season thechicken all over with a little salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a frying pan with a lid.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Addthe chicken, skin-side down, and fry until theskin is browned. Turn it over and cook onthe other side, then add the pine nuts andfry until lightly toasted.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'id': 12147, u'name': u'pine nuts'}]}, {u'equipment': [], u'step': u'Add 6 tbsp water,then cover for 15-20 mins until the chickenis cooked through.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Raymond Reserve Selection Chardonnay with a 4.4 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish. View More', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 284, u'instructions': u'Loosen the skin from the chicken. Drainthe spinach in a sieve and press out as muchwater as possible. Mix with the feta and alittle black pepper, then stuff between theflesh and skin of the chicken, smoothingthe skin back over the stuffing. Season thechicken all over with a little salt and pepper.Heat the oil in a frying pan with a lid. Addthe chicken, skin-side down, and fry until theskin is browned. Turn it over and cook onthe other side, then add the pine nuts andfry until lightly toasted. Add 6 tbsp water,then cover for 15-20 mins until the chickenis cooked through.', u'spoonacularSourceUrl': u'https://spoonacular.com/spinach-feta-stuffed-chicken-211866', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}