{u'recipes': [{u'sourceName': u'Kirbie Cravings', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/228292-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 228292, u'veryPopular': False, u'lowFodmap': False, u'title': u'Eggless Chocolate Mug Cake', u'diets': [u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 41.49, u'creditText': u'Kirbie Cravings', u'extendedIngredients': [{u'originalString': u'1/2 tsp baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'tsp'}, {u'originalString': u'7 tbsp coca cola', u'aisle': u'Beverages', u'name': u'coca cola', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coca-cola.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 7.0, u'consistency': u'solid', u'id': 14400, u'unit': u'tbsp'}, {u'originalString': u'4 tbsp flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'4 tbsp sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'2 1/2 tbsp unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.5, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://kirbiecravings.com/2012/05/eggless-chocolate-mug-cake.html', u'glutenFree': False, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u"Mix all ingredients together into an oversized mug. This cake rises a lot so if you don't have a very large mug, I suggest you split the batter into two mugs after mixing.", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Mix with a small whisk until no lumps remain.2. For one oversized mug, microwave for 1 1/2 minutes. Cake should have a dry surface and knife inserted should come out clean. You may want to reduce the time for two smaller mugs.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake can be paired with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 224, u'instructions': u"1. Mix all ingredients together into an oversized mug. This cake rises a lot so if you don't have a very large mug, I suggest you split the batter into two mugs after mixing. Mix with a small whisk until no lumps remain.2. For one oversized mug, microwave for 1 1/2 minutes. Cake should have a dry surface and knife inserted should come out clean. You may want to reduce the time for two smaller mugs.", u'spoonacularSourceUrl': u'https://spoonacular.com/eggless-chocolate-mug-cake-228292', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}