{u'recipes': [{u'sourceName': u'Life as a Strawberry', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/532878-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 300, u'id': 532878, u'veryPopular': False, u'lowFodmap': True, u'title': u'Slow Cooker Strawberry Basil Jam', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 57.44, u'creditText': u'Life as a Strawberry', u'extendedIngredients': [{u'originalString': u'1/4 cup fresh basil, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'1 tsp. lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tsp'}, {u'originalString': u'1 lb. fresh strawberries, hulled and sliced', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'fresh', u'hulled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'lb'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.lifeasastrawberry.com/slow-cooker-strawberry-basil-jam/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Put all ingredients into a small slow cooker and give them a stir to combine.Cook on low for 2 hours.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u"Remove lid from slow cooker and give jam a stir. If you like your jam a little smoother, mash the strawberries up a bit with a potato masher or a large fork. Cook jam, uncovered, on low for an additional 2-3 hours or until it has a thick, syrup-y consistency. (It will still be a little runny, but that's fine! It will set up more in the fridge). When jam has thickened, turn the slow cooker off and let the jam cool, uncovered, for at least 30 minutes, or until it has reached room temperature. (If you want to use it hot, go for it! But I like my jam a little chilly. The hot jam would make a great topping for ice cream, though). When jam has cooled, transfer it to an airtight container and refrigerate for at least 4 hours or overnight.", u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}]}, {u'equipment': [], u'step': u'Serve on scones, pancakes, ice cream, or use as a glaze for fish or chicken!', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 359, u'instructions': u"Put all ingredients into a small slow cooker and give them a stir to combine.Cook on low for 2 hours. Remove lid from slow cooker and give jam a stir. If you like your jam a little smoother, mash the strawberries up a bit with a potato masher or a large fork. Cook jam, uncovered, on low for an additional 2-3 hours or until it has a thick, syrup-y consistency. (It will still be a little runny, but that's fine! It will set up more in the fridge). When jam has thickened, turn the slow cooker off and let the jam cool, uncovered, for at least 30 minutes, or until it has reached room temperature. (If you want to use it hot, go for it! But I like my jam a little chilly. The hot jam would make a great topping for ice cream, though). When jam has cooled, transfer it to an airtight container and refrigerate for at least 4 hours or overnight. Serve on scones, pancakes, ice cream, or use as a glaze for fish or chicken!", u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-strawberry-basil-jam-532878', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 305, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}