{u'recipes': [{u'sourceName': u'Simply Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/245134-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 35, u'id': 245134, u'veryPopular': True, u'lowFodmap': False, u'title': u'Turkey Meatballs with Tomatoes and Basil', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 393.52, u'creditText': u'Simply Recipes', u'extendedIngredients': [{u'originalString': u'1/2 cup bread crumbs', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'1 1/2 pounds fresh tomatoes, roughly chopped (can substitute a 28-ounce can of crushed tomatoes)', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'fresh', u'crushed', u'roughly chopped', u'canned', u'(can substitute a 28-ounce can of tomatoes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'pounds'}, {u'originalString': u'3 tablespoons white wine or chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon dried thyme', u'aisle': u'Spices and Seasonings', u'name': u'dried thyme', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2042, u'unit': u'teaspoon'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 teaspoon fennel seeds', u'aisle': u'Spices and Seasonings', u'name': u'fennel seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2018, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup flour, for dredging', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'for dredging'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 cup fresh basil, thinly sliced', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh basil', u'metaInformation': [u'fresh', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'2 teaspoons minced fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoons'}, {u'originalString': u'2 large garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1 1/2 pounds ground turkey (thigh meat if available)', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [u'(thigh meat if available)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 5662, u'unit': u'pounds'}, {u'originalString': u'1/2 jalapeno chile, seeded, minced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno chile', u'metaInformation': [u'minced', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'2 teaspoons Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u'1/4 cup olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}], u'healthScore': 33.0, u'imageType': u'jpg', u'spoonacularScore': 94.0, u'sourceUrl': u'http://www.simplyrecipes.com/recipes/turkey_meatballs_with_tomatoes_and_basil/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'1 In a large bowl, place the turkey, bread crumbs, sour cream, egg, minced basil, salt, minced rosemary, oregano, thyme, fennel seeds, and red pepper flakes.  Gently mix together using your (clean) hands.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel-seeds.jpg', u'id': 2018, u'name': u'fennel seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place flour in a shallow bowl or plate. Use the palms of your hands to form 1 1/2 to 2-inch wide meatballs.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Roll them in the dredging flour and set them on a plate or tray. You should have about 18 to 22 meatballs.2', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil over medium high heat in a large, shallow saut\xe9 pan.  Gently place the meatballs in the pan.  You may need to work in batches as to not crowd the pan.  Once the meatballs are sizzling, reduce the heat to medium low and gently cook them on at least 3 sides, so that they get browned pretty much all over, and cooked through.  Use a fork to nudge the meatballs in the pan.  Cooking the meatballs should take about 10 minutes per batch.  A gentle heat will ensure that the browned meatballs get cooked through.  Use a slotted spoon to remove the meatballs from the pan to bowl, set aside.3', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the jalape\xf1o and garlic to the pan and cook for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the white wine or chicken stock.  Increase the heat to high and boil down the liquid to the point where a wooden spoon leaves a trail through the pan as you scrape it along the bottom of the pan. 4 Return the meatballs to the pan with the sauce and coat all over with the pan sauce.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}]}, {u'equipment': [], u'step': u'Add the fresh tomatoes and toss to coat. Cook for four minutes or until the tomatoes just begin to break down. Do not overcook the tomatoes.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat and stir in the fresh basil.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}]}, {u'equipment': [], u'step': u'Serve with fresh mozzarella, parmesan or pecorino cheese.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Serve alone or with pasta, rice, or in a sandwich roll.', u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 988, u'instructions': u'1 In a large bowl, place the turkey, bread crumbs, sour cream, egg, minced basil, salt, minced rosemary, oregano, thyme, fennel seeds, and red pepper flakes.  Gently mix together using your (clean) hands.  Place flour in a shallow bowl or plate. Use the palms of your hands to form 1 1/2 to 2-inch wide meatballs.  Roll them in the dredging flour and set them on a plate or tray. You should have about 18 to 22 meatballs.2 Heat the olive oil over medium high heat in a large, shallow saut\xe9 pan.  Gently place the meatballs in the pan.  You may need to work in batches as to not crowd the pan.  Once the meatballs are sizzling, reduce the heat to medium low and gently cook them on at least 3 sides, so that they get browned pretty much all over, and cooked through.  Use a fork to nudge the meatballs in the pan.  Cooking the meatballs should take about 10 minutes per batch.  A gentle heat will ensure that the browned meatballs get cooked through.  Use a slotted spoon to remove the meatballs from the pan to bowl, set aside.3 Add the jalape\xf1o and garlic to the pan and cook for 1 minute. Add the white wine or chicken stock.  Increase the heat to high and boil down the liquid to the point where a wooden spoon leaves a trail through the pan as you scrape it along the bottom of the pan. 4 Return the meatballs to the pan with the sauce and coat all over with the pan sauce. Add the fresh tomatoes and toss to coat. Cook for four minutes or until the tomatoes just begin to break down. Do not overcook the tomatoes. Remove the pan from the heat and stir in the fresh basil. Serve with fresh mozzarella, parmesan or pecorino cheese.  Serve alone or with pasta, rice, or in a sandwich roll.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-meatballs-with-tomatoes-and-basil-245134', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}