{u'recipes': [{u'sourceName': u'Busy But Healthy', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/558632-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 558632, u'veryPopular': False, u'lowFodmap': False, u'title': u'Roasted Vegetable Quinoa', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 119.33, u'creditText': u'Busy But Healthy', u'extendedIngredients': [{u'originalString': u'\xbd of 1 butternut squash, peeled, seeded and chopped into small cubes', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'small', u'peeled', u'seeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11485, u'unit': u''}, {u'originalString': u'1 cup feta cheese', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1019, u'unit': u'cup'}, {u'originalString': u'1 tsp rosemary (dried) or 1 Tbsp fresh chopped rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'dried', u'fresh', u'chopped', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tsp'}, {u'originalString': u'Zest and juice of 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'2 Tbsp oil (I used avocado oil)', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'(I used avocado oil)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'Tbsp'}, {u'originalString': u'2 medium onions, chopped into small cubes', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'small', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'2 cups dry quinoa (rinse first and drain)', u'aisle': u'Pasta and Rice;Health Foods', u'name': u'quinoa', u'metaInformation': [u'dry', u'(rinse first and drain)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20035, u'unit': u'cups'}, {u'originalString': u'1 red pepper, diced, also cut into the same sized cubes', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'diced', u'red', u'cut into the same sized cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'1 tsp salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u"4 cups Campbell's No Salt Added Ready to Use Vegetable Broth (1 carton)", u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'no salt added', u'(1 carton)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.busybuthealthy.com/roasted-vegetable-quinoa/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat your oven to 425 degrees F.First, rinse and drain your quinoa.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine in a medium sized pot with the vegetable broth over medium/high heat. With the lid on, when it comes to a boil, reduce the heat to low/medium and continue to simmer with the lid on. Quinoa should be cooked in about 15 minutes. All the broth with be absorbed and it will be fluffy.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6615, u'name': u'vegetable broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/uncooked-quinoa.png', u'id': 20035, u'name': u'quinoa'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from heat.Meanwhile, chop up your veggies and place in an oven safe dish.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle with the oil, add the salt, pepper, rosemary and toss until coated.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place the roasted veggies in the oven and cook for approx 30 minutes, tossing halfway through the cooking time. When veggies are slightly browned and fork tender, they are ready.In a large bowl, add the cooked quinoa and roasted vegetables. Then add in the lemon juice and lemon zest. Once its had a change to cool a little (10 minutes) fold in the feta cheese.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'id': 1019, u'name': u'feta cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}]}, {u'equipment': [], u'step': u'Serve warm, or put in the fridge to cool to serve cold. Leftovers are great cold, or reheated.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 140, u'instructions': u'Preheat your oven to 425 degrees F.First, rinse and drain your quinoa. Combine in a medium sized pot with the vegetable broth over medium/high heat. With the lid on, when it comes to a boil, reduce the heat to low/medium and continue to simmer with the lid on. Quinoa should be cooked in about 15 minutes. All the broth with be absorbed and it will be fluffy. Remove from heat.Meanwhile, chop up your veggies and place in an oven safe dish. Drizzle with the oil, add the salt, pepper, rosemary and toss until coated.Place the roasted veggies in the oven and cook for approx 30 minutes, tossing halfway through the cooking time. When veggies are slightly browned and fork tender, they are ready.In a large bowl, add the cooked quinoa and roasted vegetables. Then add in the lemon juice and lemon zest. Once its had a change to cool a little (10 minutes) fold in the feta cheese.Serve warm, or put in the fridge to cool to serve cold. Leftovers are great cold, or reheated.', u'spoonacularSourceUrl': u'https://spoonacular.com/roasted-vegetable-quinoa-558632', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}