{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/598658-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 80, u'id': 598658, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chocolate Guinness Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 135.39, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'1 3/4 teaspoons baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.75, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'2 1/4 cups firmly packed light brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 19334, u'unit': u'cups'}, {u'originalString': u'2 sticks plus 5 tablespoons unsalted butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'sticks'}, {u'originalString': u'3/4 cup natural (not Dutch-processed) cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [u'(not Dutch-processed)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'3 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 3/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.75, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups Guinness stout (do not include foam when measuring)', u'aisle': u'Alcoholic Beverages', u'name': u'guinness stout', u'metaInformation': [u'(do not include foam when measuring)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'liquid', u'id': 93619, u'unit': u'cups'}, {u'originalString': u'1 cup coarsely chopped pecans', u'aisle': u'Nuts;Baking', u'name': u'pecans', u'metaInformation': [u'coarsely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12142, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://leitesculinaria.com/2849/recipes-chocolate-guinness-cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404650, u'name': u'springform pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Position a rack in the center of the oven and preheat the oven to 325\xb0F (160\xb0C). Grease the bottom and sides of a 9-by-3-inch round cake pan or springform pan. Dust the pan with flour.2. Sift together the flour, cocoa powder, baking powder, baking soda, and cinnamon into a medium bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk to combine, and set aside.3. In the bowl of an electric mixer, using the paddle attachment, beat the butter at medium-high speed until creamy, about 1 minute. Gradually add the brown sugar and beat at high speed until very light and creamy, about 3 minutes. Reduce the speed to medium-low and add the eggs one at a time, beating well after each addition and scraping down the sides of the bowl with a rubber spatula as necessary. Beat in the vanilla extract. Reduce the speed to low and add the dry ingredients in three additions, alternating with the stout in two additions and mixing just until blended.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/guinness.png', u'id': 93619, u'name': u'stout'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the pecans and mix just until combined.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pecans.jpg', u'id': 12142, u'name': u'pecans'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove bowl from the mixer stand and stir a few times with the rubber spatula to make sure the batter is evenly blended. Scrape the batter into the prepared pan and smooth the top.4.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake the cake for 70 to 75 minutes, until a cake tester inserted into the center comes out clean. Cool the cake in the pan on a rack for 20 minutes.5. Invert the cake onto the rack and cool completely.6. Just before serving, dust the top of the cake lightly with confectioners’ sugar. Store in an airtight container at room temperature for up to a week.', u'length': {u'number': 90, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 335, u'instructions': u'1. Position a rack in the center of the oven and preheat the oven to 325\xb0F (160\xb0C). Grease the bottom and sides of a 9-by-3-inch round cake pan or springform pan. Dust the pan with flour.2. Sift together the flour, cocoa powder, baking powder, baking soda, and cinnamon into a medium bowl. Whisk to combine, and set aside.3. In the bowl of an electric mixer, using the paddle attachment, beat the butter at medium-high speed until creamy, about 1 minute. Gradually add the brown sugar and beat at high speed until very light and creamy, about 3 minutes. Reduce the speed to medium-low and add the eggs one at a time, beating well after each addition and scraping down the sides of the bowl with a rubber spatula as necessary. Beat in the vanilla extract. Reduce the speed to low and add the dry ingredients in three additions, alternating with the stout in two additions and mixing just until blended. Add the pecans and mix just until combined. Remove bowl from the mixer stand and stir a few times with the rubber spatula to make sure the batter is evenly blended. Scrape the batter into the prepared pan and smooth the top.4. Bake the cake for 70 to 75 minutes, until a cake tester inserted into the center comes out clean. Cool the cake in the pan on a rack for 20 minutes.5. Invert the cake onto the rack and cool completely.6. Just before serving, dust the top of the cake lightly with confectioners’ sugar. Store in an airtight container at room temperature for up to a week.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-guinness-cake-598658', u'dishTypes': [u'dessert'], u'occasions': [u"father's day", u'st patricks day'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 105, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}