{u'recipes': [{u'sourceName': u'The Recipe Rebel', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/608500-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': -2, u'id': 608500, u'veryPopular': False, u'lowFodmap': False, u'title': u'Raspberry Watermelon Sorbet', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 341.74, u'creditText': u'The Recipe Rebel', u'extendedIngredients': [{u'originalString': u'2 tbsp lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'2 cups light cool whip', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1200, u'unit': u'cups'}, {u'originalString': u'2 cups frozen raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cups'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'6 cups watermelon', u'aisle': u'Produce', u'name': u'watermelon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 6.0, u'consistency': u'solid', u'id': 9326, u'unit': u'cups'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.thereciperebel.com/raspberry-watermelon-sorbet/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a small pot, combine water and sugar and bring to a boil. Boil until sugar is dissolved, then set aside to cool.In a food processor, puree raspberries and watermelon.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add lemon juice and cooled water.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add cool whip and puree until combined.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place in a freezer safe container in the freezer. Freeze until desired consistency.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are great choices for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 154, u'instructions': u'In a small pot, combine water and sugar and bring to a boil. Boil until sugar is dissolved, then set aside to cool.In a food processor, puree raspberries and watermelon. Add lemon juice and cooled water.Add cool whip and puree until combined.Place in a freezer safe container in the freezer. Freeze until desired consistency.', u'spoonacularSourceUrl': u'https://spoonacular.com/raspberry-watermelon-sorbet-608500', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 8, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}