{u'recipes': [{u'sourceName': u'Peanut Butter and Peepers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511030-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 511030, u'veryPopular': True, u'lowFodmap': False, u'title': u'Banana Peanut Butter Frozen Yogurt', u'diets': [u'gluten free'], u'preparationMinutes': 5, u'pricePerServing': 90.23, u'creditText': u'Peanut Butter and Peepers', u'extendedIngredients': [{u'originalString': u'1/4 cup sliced banana', u'aisle': u'Produce', u'name': u'banana', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9040, u'unit': u'cup'}, {u'originalString': u'2 Tbsp. PB2', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'PB2', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 99089, u'unit': u'Tbsp'}, {u'originalString': u'5 mini chocolate peanut butter cups, sliced in half', u'aisle': u'Sweet Snacks', u'name': u'peanut butter cups', u'metaInformation': [u'mini', u'sliced in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'liquid', u'id': 19150, u'unit': u''}, {u'originalString': u'1 cup plain greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'plain greek yogurt', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1/2 tsp. stevia', u'aisle': u'Baking', u'name': u'stevia', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93628, u'unit': u'tsp'}, {u'originalString': u'1/2 tsp. vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'2 Tbsp. water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'Tbsp'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 41.0, u'sourceUrl': u'http://www.peanutbutterandpeppers.com/2012/08/27/banana-peanut-butter-frozen-yogurt/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'In a small freezer safe container, add yogurt, vanilla extract and stevia.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'id': 2050, u'name': u'vanilla extract'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'id': 93628, u'name': u'stevia'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix until incorporated.In a small bowl add your PB2 and water, mix until incoporated and pour into yogurt mixture.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': None, u'id': 99089, u'name': u'powdered peanut butter'}]}, {u'equipment': [], u'step': u'Mix until combined.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add banana and peanut butter cups.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-cup.jpg', u'id': 19150, u'name': u'peanut butter cups'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bananas.jpg', u'id': 9040, u'name': u'banana'}]}, {u'equipment': [], u'step': u'Mix until combined.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Place in freezer for 1 - 1 1/2 hours until frozen.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix will with a spoon. Scoop into a bowl and enjoy!!', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Port, and Moscato d'Asti are great choices for Frozen Dessert. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'port', u'moscato dasti'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 777, u'instructions': u'In a small freezer safe container, add yogurt, vanilla extract and stevia. Mix until incorporated.In a small bowl add your PB2 and water, mix until incoporated and pour into yogurt mixture. Mix until combined. Add banana and peanut butter cups. Mix until combined.Place in freezer for 1 - 1 1/2 hours until frozen. Mix will with a spoon. Scoop into a bowl and enjoy!!', u'spoonacularSourceUrl': u'https://spoonacular.com/banana-peanut-butter-frozen-yogurt-511030', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}