{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/471441-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 471441, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mexican Stuffed Peppers', u'diets': [u'gluten free'], u'preparationMinutes': 30, u'pricePerServing': 241.37, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 (4 ounce) can sliced black olives, drained', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'drained', u'sliced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1059195, u'unit': u'ounce'}, {u'originalString': u'4 large green bell peppers, tops and seeds removed', u'aisle': u'Produce', u'name': u'green bell peppers', u'metaInformation': [u'green', u'seeds removed', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 (16 ounce) can refried beans, or as needed', u'aisle': u'Canned and Jarred;Ethnic Foods', u'name': u'refried beans', u'metaInformation': [u'or as needed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 16202, u'unit': u'ounce'}, {u'originalString': u'1/4 (8 ounce) jar salsa', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'salsa', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 6164, u'unit': u'ounce'}, {u'originalString': u'1 (8 ounce) package shredded Mexican blend cheese, divided', u'aisle': u'Cheese', u'name': u'shredded mexican cheese blend', u'metaInformation': [u'shredded', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1251, u'unit': u'ounce'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 (11 ounce) can whole kernel corn, drained', u'aisle': u'Produce', u'name': u'whole kernel corn', u'metaInformation': [u'whole', u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 11172, u'unit': u'ounce'}, {u'originalString': u'1 (8 ounce) package yellow rice mix', u'aisle': u'?', u'name': u'rice mix', u'metaInformation': [u'yellow'], u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'unit': u'ounce'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Mexican-Stuffed-Peppers/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325 degrees F (165 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Bring water to a boil in a saucepan and stir in yellow rice mix and olive oil; boil for 1 minute. Cover, reduce heat to low, and simmer until rice is tender and water has been absorbed, about 25 minutes.', u'length': {u'number': 26, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Spoon 3 tablespoons yellow rice into the bottom of each pepper. Cover rice with layers of refried beans, corn, and black olives, filling peppers almost to the top. Spoon salsa into peppers. Stand stuffed peppers upright in a baking dish.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/refried-beans.png', u'id': 16202, u'name': u'refried beans'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'id': 1059195, u'name': u'black olives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salsa.jpg', u'id': 6164, u'name': u'salsa'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Bake in the preheated oven until peppers are tender and filling is hot, about 30 minutes. Divide Mexican cheese blend over the peppers, return to oven, and bake until cheese has melted, about 5 more minutes.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1251, u'name': u'mexican cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'id': 10111333, u'name': u'peppers'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Mexican on the menu? Try pairing with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The The Donum Estate Russian River Valley Pinot Noir with a 4.9 out of 5 star rating seems like a good match. It costs about 67 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'This Pinot Noir displays abundant and intense aromas of ripe black fruits, including cherry, plum and raspberry, in a complex and concentrated nose. Smooth and richly textured, the wine offers great depth of black cherry, berry and cola flavors with notes of mineral and spice on a bright and long-lasting finish.', u'title': u'The Donum Estate Russian River Valley Pinot Noir', u'price': u'$66.99', u'id': 433784, u'link': u'https://www.wine.com/product/the-donum-estate-russian-river-valley-pinot-noir-2009/121584', u'imageUrl': u'https://spoonacular.com/productImages/433784-312x231.jpg'}]}, u'aggregateLikes': 18, u'instructions': u'Preheat oven to 325 degrees F (165 degrees C).                            Bring water to a boil in a saucepan and stir in yellow rice mix and olive oil; boil for 1 minute. Cover, reduce heat to low, and simmer until rice is tender and water has been absorbed, about 25 minutes.                            Spoon 3 tablespoons yellow rice into the bottom of each pepper. Cover rice with layers of refried beans, corn, and black olives, filling peppers almost to the top. Spoon salsa into peppers. Stand stuffed peppers upright in a baking dish.                            Bake in the preheated oven until peppers are tender and filling is hot, about 30 minutes. Divide Mexican cheese blend over the peppers, return to oven, and bake until cheese has melted, about 5 more minutes.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/mexican-stuffed-peppers-471441', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}