{u'recipes': [{u'sourceName': u'Julies Eats and Treats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/519161-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 519161, u'veryPopular': False, u'lowFodmap': True, u'title': u'Patriotic Poke Cake', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 15, u'pricePerServing': 86.81, u'creditText': u'Julies Eats and Treats', u'extendedIngredients': [{u'originalString': u'1 oz blue food coloring', u'aisle': u'Baking', u'name': u'blue food coloring', u'metaInformation': [u'blue'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 10711111, u'unit': u'oz'}, {u'originalString': u'Patriotic colored sprinkles', u'aisle': u'Baking', u'name': u'colored sprinkles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'1 (12 oz) container Pillsbury white frosting', u'aisle': u'Baking', u'name': u'frosting', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 19230, u'unit': u'oz'}, {u'originalString': u'2 pkg. (3 oz. each) strawberry Jell-o', u'aisle': u'Baking', u'name': u'strawberry jell-o', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jello-strawberry.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10219172, u'unit': u'oz'}, {u'originalString': u'2 cups boiling water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'boiling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 3.0, u'sourceUrl': u'http://www.julieseatsandtreats.com/2013/05/patriotic-poke-cake/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Prepare cake according to the directions on the box using a 9x13 inch pan. Cool. Using the handle of a wooden spoon poke holes into the cake about a 1/2 - 1 inch apart. Boil 2 c. water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add jello to boiling water, remove from burner and stir approximately 2 minutes or until jello is dissolved.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Pour jello mixture over poke cake. Refrigerate 2-4 hours or until jello is set.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix blue food coloring and frosting together in a bowl.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/food-coloring.png', u'id': 10711111, u'name': u'blue food color'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}, {u'equipment': [], u'step': u'Remove cake from fridge and frost with blue frosting. Sprinkles with patriotic colored sprinkles.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'colored sprinkles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'id': 93645, u'name': u'sprinkles'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/frosting-or-icing.png', u'id': 19230, u'name': u'frosting'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cake works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Solera Cream Sherry. It has 4.5 out of 5 stars and a bottle costs about 17 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Prepare cake according to the directions on the box using a 9x13 inch pan. Cool. Using the handle of a wooden spoon poke holes into the cake about a 1/2 - 1 inch apart. Boil 2 c. water. Add jello to boiling water, remove from burner and stir approximately 2 minutes or until jello is dissolved. Pour jello mixture over poke cake. Refrigerate 2-4 hours or until jello is set.Mix blue food coloring and frosting together in a bowl. Remove cake from fridge and frost with blue frosting. Sprinkles with patriotic colored sprinkles.', u'spoonacularSourceUrl': u'https://spoonacular.com/patriotic-poke-cake-519161', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 16, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}