{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/213285-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 12, u'id': 213285, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pasta with creamy walnut pesto', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 214.63, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'50g butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 50.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'50ml double cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'double cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 50.0, u'consistency': u'liquid', u'id': 1011053, u'unit': u'ml'}, {u'originalString': u'1 garlic clove', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4 tbsp extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'100g parmesan (or vegetarian alternative), freshly grated, plus extra to serve (optional)', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'freshly grated', u'(or vegetarian alternative)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'400g pasta (I used orecchiette)', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'(I used orecchiette)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 20420, u'unit': u'g'}, {u'originalString': u'175g walnut halves or pieces', u'aisle': u'Nuts;Savory Snacks;Baking', u'name': u'walnut halves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/walnuts.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 175.0, u'consistency': u'solid', u'id': 12155, u'unit': u'g'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 82.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/10030/pasta-with-creamy-walnut-pesto', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 33, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Boil the pasta. Meanwhile, put thewalnuts and garlic in a food processorand whizz until finely chopped.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add thebasil, cheese, butter and oil and pulsea few more times. Season.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour the cream into a pan and warmthrough.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Add two-thirds of the pesto, thengently heat to loosen it. When the pastais ready, drain, reserving 2 tbsp of thecooking water, then mix both with thesauce.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately, sprinkled withthe extra Parmesan and basil, if using. Theleftover pesto will keep in the fridge forup to a week, or frozen for up to a month.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 87, u'instructions': u'Boil the pasta. Meanwhile, put thewalnuts and garlic in a food processorand whizz until finely chopped. Add thebasil, cheese, butter and oil and pulsea few more times. Season.Pour the cream into a pan and warmthrough. Add two-thirds of the pesto, thengently heat to loosen it. When the pastais ready, drain, reserving 2 tbsp of thecooking water, then mix both with thesauce. Serve immediately, sprinkled withthe extra Parmesan and basil, if using. Theleftover pesto will keep in the fridge forup to a week, or frozen for up to a month.', u'spoonacularSourceUrl': u'https://spoonacular.com/pasta-with-creamy-walnut-pesto-213285', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}