{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/377505-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 377505, u'veryPopular': True, u'lowFodmap': False, u'title': u'Beef-Stuffed Crescents', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 25.85, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 tubes (8 ounces each) refrigerated crescent rolls', u'aisle': u'Refrigerated', u'name': u'refrigerated crescent rolls', u'metaInformation': [u'refrigerated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crescent-rolls.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 93618, u'unit': u'ounces'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup (4 ounces) shredded cheddar cheese', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounces'}, {u'originalString': u'Dash sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Dash', u'unitShort': u'Dash', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'Dash'}, {u'originalString': u'1 tablespoon sweet pickle relish', u'aisle': u'Condiments', u'name': u'sweet pickle relish', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11945, u'unit': u'tablespoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 6.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/beef-stuffed-crescents', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a large skillet, cook beef, onion and garlic over medium heat until meat is no longer pink; drain. Stir in the cheese, pickle relish, salt, chili powder, pepper and sugar; set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Unroll crescent dough and separate into triangles.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each in half lengthwise, forming two triangles.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Place 1 tablespoon beef mixture along the wide end of each triangle; carefully roll up.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place point side down 2 in. apart on ungreased baking sheets.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375\xb0 for 12-14 minutes or until golden brown.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm.', u'number': 7, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 690, u'instructions': u"Directions                                                                                In a large skillet, cook beef, onion and garlic over medium heat until meat is no longer pink; drain. Stir in the cheese, pickle relish, salt, chili powder, pepper and sugar; set aside.                                                                                            Unroll crescent dough and separate into triangles. Cut each in half lengthwise, forming two triangles. Place 1 tablespoon beef mixture along the wide end of each triangle; carefully roll up.                                                                                            Place point side down 2 in. apart on ungreased baking sheets. Bake at 375\xb0 for 12-14 minutes or until golden brown. Serve warm.                                        Yield: 32 appetizers.                                                                                                                         Originally published as Beef-Stuffed Crescents in  Taste of Home's Holiday & Celebrations CookbookAnnual 2005, p46                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving equals 86 calories, 5 g fat (2 g saturated fat), 9 mg cholesterol, 181 mg sodium, 6 g carbohydrate, trace fiber, 4 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/beef-stuffed-crescents-377505', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 32, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}