{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/464861-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 464861, u'veryPopular': True, u'lowFodmap': False, u'title': u'Brownie Mocha Trifle', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 61.19, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 package fudge brownie mix (8-inch square pan size)', u'aisle': u'Baking', u'name': u'brownie mix', u'metaInformation': [u'(8-inch square pan size)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brownies-isolated-all.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18632, u'unit': u'package'}, {u'originalString': u'1/4 cup cold brewed coffee', u'aisle': u'Tea and Coffee', u'name': u'coffee', u'metaInformation': [u'cold', u'brewed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 14209, u'unit': u'cup'}, {u'originalString': u'1 Heath candy bar (1.4 ounces), crushed', u'aisle': u'Sweet Snacks', u'name': u'heath bar', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/heath-bar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 1.4, u'consistency': u'solid', u'id': 98978, u'unit': u'ounces'}, {u'originalString': u'2 packages (3.4 ounces each) instant vanilla pudding mix', u'aisle': u'Baking', u'name': u'instant vanilla pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.8, u'consistency': u'solid', u'id': 19206, u'unit': u'ounces'}, {u'originalString': u'1-3/4 cups cold 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'2 cups whipped topping', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 42135, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 7.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/brownie-mocha-trifle', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Prepare brownie batter and bake according to package directions. Cool; cut into 1-in. pieces.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, beat milk and pudding mixes for 2 minutes or until thickened. Stir in coffee. Fold in whipped topping.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14209, u'name': u'coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a trifle bowl or 2-qt. glass bowl, layer a third of the brownie pieces, pudding mixture and crushed candy bar. Repeat layers twice. Chill until serving.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 928, u'instructions': u'Directions                                                                                Prepare brownie batter and bake according to package directions. Cool; cut into 1-in. pieces.                                                                                            In a large bowl, beat milk and pudding mixes for 2 minutes or until thickened. Stir in coffee. Fold in whipped topping.                                                                                            In a trifle bowl or 2-qt. glass bowl, layer a third of the brownie pieces, pudding mixture and crushed candy bar. Repeat layers twice. Chill until serving.                                        Yield: 12 servings.                                                                                                                         Originally published as Brownie Mocha Trifle in  Country WomanMarch/April 2000, p37                                                                                                                            Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/brownie-mocha-trifle-464861', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}