{u'recipes': [{u'sourceName': u'Chocolate and Zucchini', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/546685-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 546685, u'veryPopular': False, u'lowFodmap': False, u'title': u'Granola Bars', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 89.27, u'creditText': u'Chocolate and Zucchini', u'extendedIngredients': [{u'originalString': u'30 grams (1 cup) puffed brown rice', u'aisle': u'Pasta and Rice', u'name': u'brown rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-brown-cooked.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20040, u'unit': u'cup'}, {u'originalString': u'120 ml (1/2 cup) brown rice syrup (I use half rice syrup and half apple or pear sauce)', u'aisle': u'Health Foods;Baking', u'name': u'brown rice syrup', u'metaInformation': [u'(I use half rice syrup and half apple or pear sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93784, u'unit': u'cup'}, {u'originalString': u'140 grams (about 1 cup) dried fruit such as cherries or cranberries or figs, chopped as needed (I skip those)', u'aisle': u'Dried Fruits;Produce', u'name': u'dried cranberries', u'metaInformation': [u'dried', u'as needed', u'chopped', u'(I skip those)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dried-cranberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9079, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'120 grams (about 1 cup) nuts such as almonds and cashews, slivered or coarsely chopped (I skip those)', u'aisle': u'Nuts', u'name': u'nuts', u'metaInformation': [u'coarsely chopped', u'(I skip those)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/nuts-mixed.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 12135, u'unit': u'cup'}, {u'originalString': u'130 grams (1 1/4 cups) rolled oats (in France, you have a choice between small and large; I use small for easier cutting)', u'aisle': u'Cereal', u'name': u'rolled oats', u'metaInformation': [u'small', u'large', u'for easier cutting)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 8120, u'unit': u'cups'}, {u'originalString': u'1/4 teaspoon fine sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1012047, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons homemade vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'homemade'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://chocolateandzucchini.com/recipes/breakfast/granola-bars-recipe/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 150.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Preheat the oven to 150\xb0C (300\xb0F) and line a 20-cm (8-inch) square cake pan with parchment paper, leaving an overhang for easy removal. (Note: the cake pan I use is non-stick and has a removable bottom, so I simply grease it.)', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Place all the ingredients in a large mixing bowl and stir well with a fork until thoroughly combined.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour into the prepared pan and spread into an even layer with a spatula, pressing on the surface to pack.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u"Bake for 25 minutes, until the top is set and lightly brown; don't overbake or the bars won't cut neatly.", u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404672, u'name': u'chefs knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Let cool completely. Lift from the pan and, using a sharp chef's knife, cut into eight bars.These keep for a couple of weeks in an airtight container at cool room temperature.", u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 21, u'instructions': u"Preheat the oven to 150\xb0C (300\xb0F) and line a 20-cm (8-inch) square cake pan with parchment paper, leaving an overhang for easy removal. (Note: the cake pan I use is non-stick and has a removable bottom, so I simply grease it.)Place all the ingredients in a large mixing bowl and stir well with a fork until thoroughly combined. Pour into the prepared pan and spread into an even layer with a spatula, pressing on the surface to pack.Bake for 25 minutes, until the top is set and lightly brown; don't overbake or the bars won't cut neatly. Let cool completely. Lift from the pan and, using a sharp chef's knife, cut into eight bars.These keep for a couple of weeks in an airtight container at cool room temperature.", u'spoonacularSourceUrl': u'https://spoonacular.com/granola-bars-546685', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}