{u'recipes': [{u'sourceName': u'Sallys Baking Addiction', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/573529-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 573529, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Gingerbread Bundt Cake with Cream Cheese Frosting', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 63.6, u'creditText': u'Sallys Baking Addiction', u'extendedIngredients': [{u'originalString': u'3/4 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon coarse salt', u'aisle': u'Spices and Seasonings', u'name': u'coarse salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u"2-3 cups (240-360g) confectioners' (powdered) sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [u'(powdered)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 240.0, u'consistency': u'solid', u'id': 19336, u'unit': u'g'}, {u'originalString': u'4 oz (112g) cream cheese, softened to room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 112.0, u'consistency': u'solid', u'id': 1017, u'unit': u'g'}, {u'originalString': u'3/4 cup (150g) packed dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'g'}, {u'originalString': u'1/2 cup (156g) dark molasses', u'aisle': u'Baking', u'name': u'dark molasses', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 156.0, u'consistency': u'solid', u'id': 19304, u'unit': u'g'}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup (125g) all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 125.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2011, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoons'}, {u'originalString': u'2-4 Tablespoons milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'Tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'Tablespoons'}, {u'originalString': u'1/4 teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup (60g) unsalted butter, softened to room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'softened', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 1145, u'unit': u'g'}, {u'originalString': u'1/2 cup (42g) unsweetened cocoa powder, plus more for dusting', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened', u'for dusting', u'plus more '], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 42.0, u'consistency': u'solid', u'id': 19165, u'unit': u'g'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup (120ml) vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 120.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'ml'}, {u'originalString': u'1/4 cup (60ml) whole milk or buttermilk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 60.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'ml'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://sallysbakingaddiction.com/2012/11/20/chocolate-gingerbread-bundt-cake-with-cream-cheese-frosting/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bundt-cake-pan.jpg', u'id': 404748, u'name': u'kugelhopf pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 325.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 325F. Spray a 9-inch bundt pan with nonstick spray. Dust with cocoa powder and tap out excess. Set aside.Over medium-low heat, melt together the oil, molasses, brown sugar, and 1/4 cup water in a medium saucepan until all of the brown sugar has dissolved.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a large bowl and allow to cool for 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the eggs and milk into the molasses mixture after it has cooled (to avoid heating and scrambling the eggs). Set aside.Sift together flour, cocoa powder, baking soda, salt, ground ginger, cinnamon, cloves, and nutmeg into a medium bowl. Gently fold the flour mixture into the molasses mixture until just combined. There will be lumps remaining.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 2021, u'name': u'ginger powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour batter into prepared pan and bake for about 30 minutes until cake is pulling away from the sides and a toothpick inserted in the middle comes out clean. Allow cake to cool completely in the pan on a wire rack.As the cake cools, make your frosting. In a large bowl, beat the butter and cream cheese with an electric mixer until creamy. Gradually add the confectioners sugar.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u"Add the vanilla and the milk, 1 tablespoon at a time until you've reached the desired thickness.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add a little more sugar or milk if necessary to achieve a spreadable frosting.Invert cake onto a cake stand or a large serving platter. Frost cake immediately before serving and drizzle with chocolate sauce (optional).Cake remains fresh for up to 4 days stored in the refrigerator.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Bundt Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 2668, u'instructions': u"Preheat oven to 325F. Spray a 9-inch bundt pan with nonstick spray. Dust with cocoa powder and tap out excess. Set aside.Over medium-low heat, melt together the oil, molasses, brown sugar, and 1/4 cup water in a medium saucepan until all of the brown sugar has dissolved. Transfer to a large bowl and allow to cool for 5 minutes. Whisk the eggs and milk into the molasses mixture after it has cooled (to avoid heating and scrambling the eggs). Set aside.Sift together flour, cocoa powder, baking soda, salt, ground ginger, cinnamon, cloves, and nutmeg into a medium bowl. Gently fold the flour mixture into the molasses mixture until just combined. There will be lumps remaining. Pour batter into prepared pan and bake for about 30 minutes until cake is pulling away from the sides and a toothpick inserted in the middle comes out clean. Allow cake to cool completely in the pan on a wire rack.As the cake cools, make your frosting. In a large bowl, beat the butter and cream cheese with an electric mixer until creamy. Gradually add the confectioners sugar. Add the vanilla and the milk, 1 tablespoon at a time until you've reached the desired thickness. Add a little more sugar or milk if necessary to achieve a spreadable frosting.Invert cake onto a cake stand or a large serving platter. Frost cake immediately before serving and drizzle with chocolate sauce (optional).Cake remains fresh for up to 4 days stored in the refrigerator.", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-gingerbread-bundt-cake-with-cream-cheese-frosting-573529', u'dishTypes': [], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}