{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/726875-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 726875, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey Meatloaf', u'diets': [], u'preparationMinutes': 0, u'pricePerServing': 256.24, u'extendedIngredients': [{u'originalString': u'ounces bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'ounces'}, {u'originalString': u'cup fresh bread crumbs of any provenance', u'aisle': u'Pasta and Rice', u'name': u'bread crumbs', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18079, u'unit': u'cup'}, {u'originalString': u'28-ounce can whole tomatoes, preferably San Marzano, seeds removed', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'whole', u'seeds removed', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 28.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'cloves garlic, minced', u'aisle': u'Produce', u'name': u'cloves garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'cloves', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'pound ground turkey', u'aisle': u'Meat', u'name': u'ground turkey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 5662, u'unit': u'pound'}, {u'originalString': u'teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'cup whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'bunch mint', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'bunch'}, {u'originalString': u'cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'pound sweet Italian pork sausage, casing removed, crumbled', u'aisle': u'Meat', u'name': u'pork sausage', u'metaInformation': [u'sweet', u'italian', u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1007063, u'unit': u'pound'}, {u'originalString': u'medium red onion, finely chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'medium', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 10011282, u'unit': u'servings'}, {u'originalString': u'teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'tablespoon finely chopped fresh rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2036, u'unit': u'tablespoon'}, {u'originalString': u'cup red wine', u'aisle': u'Alcoholic Beverages', u'name': u'wine', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14084, u'unit': u'cup'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 67.0, u'sourceUrl': u'http://cooking.nytimes.com/recipes/1012687-turkey-meatloaf', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat the oven to 450 degrees.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Combine 2/3 of the garlic, the rosemary, pepper flakes, bread crumbs, salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breadcrumbs.jpg', u'id': 18079, u'name': u'breadcrumbs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}]}, {u'equipment': [], u'step': u'Add the milk and mix.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Add the turkey and sausage and mix once more to combine; dont overmix.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Transfer onto a board and shape into a fine meatloaf, about 9 inches long and 4 inches wide.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Place in a baking pan with high sides (a 9 x12 pan with 2-inch sides works well), drizzle with about 2 tablespoons of olive oil and bake for 25 minutes, turning halfway through to brown evenly.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from the oven and reduce the heat to 325 degrees.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Meanwhile, in a medium saucepan over medium heat, fry the bacon in the remaining 2 tablespoons of oil until it starts to curl and its fat is rendered.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add the onions and remaining garlic, cooking until the onions are translucent, about 4 minutes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the tomatoes and wine and bring to a boil.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'id': 14084, u'name': u'wine'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-thermometer.jpg', u'id': 404789, u'name': u'kitchen thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Pour the sauce over the meatloaf, cover tightly with foil and bake until a meat thermometer inserted at the center reads 150 degrees, 20 to 30 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer the meatloaf to a platter and let stand, tented with foil, for 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Cut into thick slices, spoon tomato sauce over the top and scatter with torn mint leaves.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Turkey Meatloaf can be paired with Cabernet Sauvignon and Zinfandel. Meatloaf will work with many red wines. We recommend something bold and fruity, like a Cabernet Sauvignon or Zinfandel. You could try Double Canyon Horse Heaven Hills Cabernet Sauvignon. Reviewers quite like it with a 4.2 out of 5 star rating and a price of about 20 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'zinfandel'], u'productMatches': [{u'description': u'This Cabernet embodies an enticing array of ripe red and black plum, intermixed with notes of fresh red cherry. Characteristic of the appellation and 2014 vintage, the nose offers spiced potpourri with a touch of raspberry preserves. The addition of Syrah leads to a full and rich texture on the mid-palate, further accented by bright acidity from the Petit Verdot, sweet red fruit from the Merlot and luscious blackberry notes supplied by the Malbec. The soft and supple mouthfeel is supported by the complexity of sweet oak tannins and fresh fruit character, finishing with the juicy acidity that is characteristic of Horse Heaven Hills. View More', u'title': u'Double Canyon Horse Heaven Hills Cabernet Sauvignon', u'price': u'$19.99', u'id': 441790, u'link': u'https://www.wine.com/product/double-canyon-horse-heaven-hills-cabernet-sauvignon-2014/160719', u'imageUrl': u'https://spoonacular.com/productImages/441790-312x231.jpg'}]}, u'aggregateLikes': 244, u'instructions': u'Preheat the oven to 450 degrees. Combine 2/3 of the garlic, the rosemary, pepper flakes, bread crumbs, salt and pepper. Add the milk and mix. Add the turkey and sausage and mix once more to combine; dont overmix. Transfer onto a board and shape into a fine meatloaf, about 9 inches long and 4 inches wide.                  Place in a baking pan with high sides (a 9 x12 pan with 2-inch sides works well), drizzle with about 2 tablespoons of olive oil and bake for 25 minutes, turning halfway through to brown evenly. Remove from the oven and reduce the heat to 325 degrees.                  Meanwhile, in a medium saucepan over medium heat, fry the bacon in the remaining 2 tablespoons of oil until it starts to curl and its fat is rendered. Add the onions and remaining garlic, cooking until the onions are translucent, about 4 minutes. Add the tomatoes and wine and bring to a boil.                  Pour the sauce over the meatloaf, cover tightly with foil and bake until a meat thermometer inserted at the center reads 150 degrees, 20 to 30 minutes.                  Transfer the meatloaf to a platter and let stand, tented with foil, for 10 minutes. Cut into thick slices, spoon tomato sauce over the top and scatter with torn mint leaves.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-meatloaf-726875', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}