{u'recipes': [{u'sourceName': u'Eating Well', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/62856-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 65, u'id': 62856, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cranberry-Apple Coffee Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 45, u'pricePerServing': 39.06, u'creditText': u'Eating Well', u'extendedIngredients': [{u'originalString': u'1/2 cup cranberry juice cocktail, orange juice or apple juice', u'aisle': u'Beverages', u'name': u'apple juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 9016, u'unit': u'cup'}, {u'originalString': u'1 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons butter, slightly softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1/4 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'1 tablespoon cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoon'}, {u'originalString': u'1 1/2 cups cranberries, fresh or frozen, thawed, chopped (see Tip)', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh', u'thawed', u'chopped', u'(see Tip)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 9078, u'unit': u'cups'}, {u'originalString': u'1 large egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'3/4 cup granulated sugar, plus 1 tablespoon for sprinkling', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [u'for sprinkling'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'3/4 teaspoon freshly grated lemon zest', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.75, u'consistency': u'solid', u'id': 9156, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'3/4 cup low-fat milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'low fat milk', u'metaInformation': [u'low-fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 1174, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 cups finely chopped peeled tart apple, such as Granny Smith (about 1 large)', u'aisle': u'Produce', u'name': u'tart apple', u'metaInformation': [u' such as granny smith ( 1 large)', u'peeled', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1029003, u'unit': u'cups'}, {u'originalString': u'2 teaspoons vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup whole-wheat flour', u'aisle': u'Baking', u'name': u'whole-wheat flour', u'metaInformation': [u'whole-wheat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20080, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 21.0, u'sourceUrl': u'http://www.eatingwell.com/recipes/cranberry_apple_coffee_cake.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk all-purpose flour, whole-wheat flour, baking powder, salt and baking soda in a medium bowl. Beat oil, butter and lemon zest in a large mixing bowl with an electric mixer, first on medium speed, then on medium-high, until well combined, about 1 1/2 minutes. Gradually add 3/4 cup sugar, beating until the mixture is light in color and well blended.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20080, u'name': u'whole wheat flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Add egg and beat until the batter is smooth, about 1 minute longer. With the mixer on low speed, beat in half the flour mixture until just incorporated. Gradually beat in milk and vanilla until just incorporated.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining flour mixture and beat until a smooth batter forms, about 1 minute, scraping down the sides of the bowl as needed. Scrape the batter into the prepared pan, spreading to the edges.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Spread the topping in an even layer over the batter; do not stir.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake the cake on the middle rack until the top is puffed in places and a toothpick inserted in the center comes out clean (the fruit topping will still be moist), 40 to 50 minutes. Sprinkle the remaining 1 tablespoon sugar over the top.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the pan to a wire rack; let stand until cooled to warm, about 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan sides and cut the cake into wedges.', u'number': 7, u'ingredients': []}], u'name': u'Remove from the heat and let cool.To prepare cake'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk brown sugar, cornstarch and cinnamon in a medium nonreactive saucepan (see Note) until combined. Stir in cranberries, apple and juice. Bring the mixture to a boil over medium-high heat, stirring. Continue to cook, stirring, until the mixture thickens and the berries soften, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 1019016, u'name': u'juice'}]}], u'name': u'Preheat oven to 375F. Coat a 9-inch springform pan with cooking spray.To prepare topping'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 69, u'instructions': u'Preheat oven to 375F. Coat a 9-inch springform pan with cooking spray.To prepare topping: Whisk brown sugar, cornstarch and cinnamon in a medium nonreactive saucepan (see Note) until combined. Stir in cranberries, apple and juice. Bring the mixture to a boil over medium-high heat, stirring. Continue to cook, stirring, until the mixture thickens and the berries soften, about 2 minutes. Remove from the heat and let cool.To prepare cake: Whisk all-purpose flour, whole-wheat flour, baking powder, salt and baking soda in a medium bowl. Beat oil, butter and lemon zest in a large mixing bowl with an electric mixer, first on medium speed, then on medium-high, until well combined, about 1 1/2 minutes. Gradually add 3/4 cup sugar, beating until the mixture is light in color and well blended. Add egg and beat until the batter is smooth, about 1 minute longer. With the mixer on low speed, beat in half the flour mixture until just incorporated. Gradually beat in milk and vanilla until just incorporated. Add the remaining flour mixture and beat until a smooth batter forms, about 1 minute, scraping down the sides of the bowl as needed. Scrape the batter into the prepared pan, spreading to the edges. Spread the topping in an even layer over the batter; do not stir.Bake the cake on the middle rack until the top is puffed in places and a toothpick inserted in the center comes out clean (the fruit topping will still be moist), 40 to 50 minutes. Sprinkle the remaining 1 tablespoon sugar over the top. Transfer the pan to a wire rack; let stand until cooled to warm, about 20 minutes. Remove the pan sides and cut the cake into wedges.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-apple-coffee-cake-62856', u'dishTypes': [u'morning meal', u'dessert', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}