{u'recipes': [{u'sourceName': u'Foxes Love Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/690674-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 24, u'id': 690674, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Chicken, Tortellini & Mushroom Soup', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 368.51, u'creditText': u'Foxes Love Lemons', u'extendedIngredients': [{u'originalString': u'8 ounces button mushrooms, sliced', u'aisle': u'Produce', u'name': u'button mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'2 medium carrots, peeled and chopped', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'medium', u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'1 package (9 ounces) refrigerated three cheese tortellini', u'aisle': u'Refrigerated', u'name': u'cheese tortellini', u'metaInformation': [u'refrigerated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.0, u'consistency': u'solid', u'id': 10093727, u'unit': u'ounces'}, {u'originalString': u'1/4 cup dry white wine (optional)', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'1 teaspoon fresh thyme leaves', u'aisle': u'Produce', u'name': u'fresh thyme leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'teaspoon'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/4 teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 bunch lacinato kale, thinly sliced (curly kale works, too!)', u'aisle': u'Produce', u'name': u'lacinato kale', u'metaInformation': [u'thinly sliced', u'(curly kale works, too!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lacinato-kale.jpg', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 10011233, u'unit': u'bunch'}, {u'originalString': u'4 cups (32 ounces) less-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'ounces'}, {u'originalString': u'1 pound boneless, skinless chicken breast, cut into 1-inch cubes', u'aisle': u'Meat', u'name': u'skinless boneless chicken breast', u'metaInformation': [u'boneless', u'skinless', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pound'}, {u'originalString': u'3 tablespoons unsalted butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/4 white onion, chopped', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'white', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 30.0, u'imageType': u'jpg', u'spoonacularScore': 86.0, u'sourceUrl': u'http://foxeslovelemons.com/creamy-chicken-tortellini-mushroom-soup/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In large pot, heat 2 tablespoons butterover medium-high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add carrots and onion; cook 3 to 4minutes or until vegetables begin to soften, stirring occasionally.Reduce heat to medium; add garlic and mushrooms. Cook 5 to 6 minutes or until mushrooms are browned; stirring occasionally.', u'length': {u'number': 9, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'id': 11124, u'name': u'carrot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Remove from heat and stir in thyme, salt and pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Transfer mushroom mixture to medium bowl; return pot to stove and increase heat to medium-high.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Add chicken and remaining 1 tablespoon of butter to pot. Cook 4 to 5 minutes or until chicken is lightly browned (it does not need to be cooked all the way through at this point); stirring occasionally. If using, stir in wine; cook 1 minute.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Add chicken broth; heat to boiling over medium-high heat.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Add tortellini; cook 3 minutes, stirring occasionally.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'id': 93727, u'name': u'tortellini'}]}, {u'equipment': [], u'step': u'Add kale; cook an additional 4 minutes, stirring occasionally.Reduce heat to medium-low. Stir in cream and mushroom mixture; cook 2 minutes or until mushrooms are warmed through.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 9, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. You could try CalNaturale Chardonnay Lodi. Reviewers quite like it with a 4.1 out of 5 star rating and a price of about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'In large pot, heat 2 tablespoons butterover medium-high heat. Add carrots and onion; cook 3 to 4minutes or until vegetables begin to soften, stirring occasionally.Reduce heat to medium; add garlic and mushrooms. Cook 5 to 6 minutes or until mushrooms are browned; stirring occasionally. Remove from heat and stir in thyme, salt and pepper. Transfer mushroom mixture to medium bowl; return pot to stove and increase heat to medium-high.Add chicken and remaining 1 tablespoon of butter to pot. Cook 4 to 5 minutes or until chicken is lightly browned (it does not need to be cooked all the way through at this point); stirring occasionally. If using, stir in wine; cook 1 minute.Add chicken broth; heat to boiling over medium-high heat. Add tortellini; cook 3 minutes, stirring occasionally. Add kale; cook an additional 4 minutes, stirring occasionally.Reduce heat to medium-low. Stir in cream and mushroom mixture; cook 2 minutes or until mushrooms are warmed through. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-chicken-tortellini-mushroom-soup-690674', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 34, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}