{u'recipes': [{u'sourceName': u'Fit Foodie Finds', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/609987-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 609987, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gluten-Free Apple Plum Crisp', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 98.64, u'creditText': u'Fit Foodie Finds', u'extendedIngredients': [{u'originalString': u'5 apples', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9003, u'unit': u''}, {u'originalString': u'1 teaspoon cinnamon, ground', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'3 tablespoons coconut oil, melted', u'aisle': u'Health Foods;Baking', u'name': u'coconut oil', u'metaInformation': [u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4047, u'unit': u'tablespoons'}, {u'originalString': u"1/2 cup gluten-free flour, I used Bob's Red Mill All-Purpose", u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'gluten-free', u'red', u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/4 cup gluten free flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'gluten free flour', u'metaInformation': [u'gluten free'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-flour-or-other-gluten-free-flour.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 93620, u'unit': u'cup'}, {u'originalString': u'1/2 cup light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup orange juice + 1/3 cup, divided', u'aisle': u'Beverages', u'name': u'orange juice', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9206, u'unit': u'cup'}, {u'originalString': u'5 plums', u'aisle': u'Produce', u'name': u'plums', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9279, u'unit': u''}, {u'originalString': u'1 cup quick cooking oats, gluten-free', u'aisle': u'Cereal', u'name': u'quick cooking oats', u'metaInformation': [u'gluten-free', u'quick'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rolled-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 8402, u'unit': u'cup'}, {u'originalString': u'4 tablespoons butter, unsalted, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://fitfoodiefinds.com/2014/08/gluten-free-apple-plum-crisp/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'First, preheat oven to 375\xbaF. Next, prep apples and plums by rinsing and patting dry and peeling the skin. Then, cut into bite-sized pieces. and place fruit into a large, ceramic baking dish.Sprinkle in flour, cinnamon, maple syrup, and 1/2 cup OJ. Toss until everything is evenly coated. Set aside.To make the topping, melt butter and coconut oil together. Then transfer into a medium-sized bowl and add in the rest of the topping ingredients.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oil-coconut.jpg', u'id': 4047, u'name': u'coconut oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'id': 9279, u'name': u'plum'}]}, {u'equipment': [], u'step': u'Mix until everything is combined. Sprinkle topping on top of fruit making sure things are spread evenly.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Bake at 375\xbaF for 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove, add a splash more of OJ, then bake for 10 more minutes or until fruit begins to bubble.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Crisp. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 72, u'instructions': u'First, preheat oven to 375\xbaF. Next, prep apples and plums by rinsing and patting dry and peeling the skin. Then, cut into bite-sized pieces. and place fruit into a large, ceramic baking dish.Sprinkle in flour, cinnamon, maple syrup, and 1/2 cup OJ. Toss until everything is evenly coated. Set aside.To make the topping, melt butter and coconut oil together. Then transfer into a medium-sized bowl and add in the rest of the topping ingredients. Mix until everything is combined. Sprinkle topping on top of fruit making sure things are spread evenly.  Bake at 375\xbaF for 30 minutes. Remove, add a splash more of OJ, then bake for 10 more minutes or until fruit begins to bubble.', u'spoonacularSourceUrl': u'https://spoonacular.com/gluten-free-apple-plum-crisp-609987', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}