{u'recipes': [{u'sourceName': u'Smells Like Home', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/587825-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 587825, u'veryPopular': True, u'lowFodmap': False, u'title': u'BBQ Chicken Burgers', u'diets': [], u'pricePerServing': 368.25, u'creditText': u'Smells Like Home', u'extendedIngredients': [{u'originalString': u'Additional bbq sauce', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 6150, u'unit': u'servings'}, {u'originalString': u'5 tbsp bbq sauce, divided', u'aisle': u'Condiments', u'name': u'bbq sauce', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 6150, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tbsp'}, {u'originalString': u'2 tsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tsp'}, {u'originalString': u'Pinch cayenne', u'aisle': u'Spices and Seasonings', u'name': u'cayenne', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'pinch'}, {u'originalString': u'2 tbsp cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tbsp'}, {u'originalString': u'\xbd cup crumbled cornbread or \xbc cup cornmeal', u'aisle': u'Bakery/Bread', u'name': u'cup cake', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 18139, u'unit': u'cup'}, {u'originalString': u'2 tbsp Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tbsp'}, {u'originalString': u'1 tsp dry mustard', u'aisle': u'Spices and Seasonings', u'name': u'dry mustard', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dry-mustard.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002024, u'unit': u'tsp'}, {u'originalString': u'1 tbsp minced fresh cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'\xbc tsp garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'tsp'}, {u'originalString': u'1 lb ground chicken', u'aisle': u'Meat', u'name': u'ground chicken', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 5332, u'unit': u'lb'}, {u'originalString': u'Hamburger buns', u'aisle': u'Bakery/Bread', u'name': u'hamburger buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hamburger-bun.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 18350, u'unit': u'servings'}, {u'originalString': u'Hot sauce, to taste', u'aisle': u'Condiments', u'name': u'hot sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 6168, u'unit': u'servings'}, {u'originalString': u'\xbd cup ketchup', u'aisle': u'Condiments', u'name': u'ketchup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ketchup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 11935, u'unit': u'cup'}, {u'originalString': u'\xbd tsp kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'\xbc cup molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19304, u'unit': u'cup'}, {u'originalString': u'Grilled red onion slices', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u'slices'}, {u'originalString': u'2 tbsp very finely chopped (or grated) onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'grated', u'very finely chopped', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u'tbsp'}, {u'originalString': u'\xbd tsp paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2028, u'unit': u'tsp'}, {u'originalString': u'2/3 cup chopped pulled pork (optional)', u'aisle': u'Meat', u'name': u'pulled pork', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 10983, u'unit': u'cup'}, {u'originalString': u'1 scallion, minced', u'aisle': u'Produce', u'name': u'scallion', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'Sharp cheddar cheese, sliced', u'aisle': u'Cheese', u'name': u'sharp cheddar cheese', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1031009, u'unit': u'servings'}, {u'originalString': u'2 tbsp Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tbsp'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 88.0, u'sourceUrl': u'http://www.smells-like-home.com/2011/06/bbq-chicken-burgers/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 39, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine all sauce ingredients in a small saucepan and heat over medium heat.  Cook the sauce about 7 minutes or until thickened, stirring occasionally.  The sauce should be reduced down to approximately 1 cup.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u'To make the sauce'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Heat the grill to medium-high.In a large bowl, combine the chicken, cornbread, scallion, cilantro, paprika, garlic, mustard, salt, cayenne, brown sugar, pork, and 2 tablespoons of the bbq sauce.  Lightly but thoroughly mix with your hands to incorporate all the ingredients.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add the remaining 3 tablespoons of bbq sauce to a small bowl.Form the mixture into 4 equal-sized patties.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Brush the grates of the grill with olive oil.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place the burgers and onions on the grill, and cook the burgers 5-6 minutes, then flip.  Turn the onions as well.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Brush the cooked sides with half the reserved bbq sauce.  After 3-4 minutes, flip the burgers again. glazing the other side with the remaining bbq sauce.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Place a slice of cheese on each patty, and lay the buns, cut side down, on the grill.  Close the lid and allow the cheese to melt and the buns to toast.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Remove all the food from the grill, assembling the burgers as desired.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with additional bbq sauce if desired.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}]}], u'name': u'Remove from heat and allow to cool.  Refrigerate until ready to use.  The sauce will keep, refrigerated, for about 1 week.To make the burgers'}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The District 7 Estate Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'Our 2012 vintage has aromas of tropical fruit and butterscotch that lead into a lively blend of pear, pineapple and citrus flavors', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 1124, u'instructions': u'To make the sauce:  Combine all sauce ingredients in a small saucepan and heat over medium heat.  Cook the sauce about 7 minutes or until thickened, stirring occasionally.  The sauce should be reduced down to approximately 1 cup.  Remove from heat and allow to cool.  Refrigerate until ready to use.  The sauce will keep, refrigerated, for about 1 week.To make the burgers:  Heat the grill to medium-high.In a large bowl, combine the chicken, cornbread, scallion, cilantro, paprika, garlic, mustard, salt, cayenne, brown sugar, pork, and 2 tablespoons of the bbq sauce.  Lightly but thoroughly mix with your hands to incorporate all the ingredients.  Add the remaining 3 tablespoons of bbq sauce to a small bowl.Form the mixture into 4 equal-sized patties.  Brush the grates of the grill with olive oil.  Place the burgers and onions on the grill, and cook the burgers 5-6 minutes, then flip.  Turn the onions as well.  Brush the cooked sides with half the reserved bbq sauce.  After 3-4 minutes, flip the burgers again. glazing the other side with the remaining bbq sauce.  Place a slice of cheese on each patty, and lay the buns, cut side down, on the grill.  Close the lid and allow the cheese to melt and the buns to toast.Remove all the food from the grill, assembling the burgers as desired.  Serve with additional bbq sauce if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/bbq-chicken-burgers-587825', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}