{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/749978-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 31, u'id': 749978, u'veryPopular': False, u'lowFodmap': False, u'title': u'Quick Bolognese', u'diets': [u'gluten free', u'primal', u'ketogenic'], u'preparationMinutes': 20, u'pricePerServing': 191.0, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'4 to 6 dried porcini mushrooms', u'aisle': u'Produce;Ethnic Foods', u'name': u'dried porcini mushrooms', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/porcini-mushrooms-dried.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10011268, u'unit': u''}, {u'originalString': u'1 tablespoon finely chopped fresh parsley', u'aisle': u'Produce', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon minced fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon chopped garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoon'}, {u'originalString': u'4 ounces (1/2 cup) ground pork', u'aisle': u'Meat', u'name': u'ground pork', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 10219, u'unit': u'cup'}, {u'originalString': u'8 ounces (1 cup) ground veal', u'aisle': u'Meat', u'name': u'ground veal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/meat-ground.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 17142, u'unit': u'cup'}, {u'originalString': u'6 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup chopped onions', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 tablespoons grated parmesan cheese, plus more for garnish', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1033, u'unit': u'tablespoons'}, {u'originalString': u'Salt (preferably gray sea salt) and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'freshly ground', u'(preferably gray sea salt)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1/4 cup marinara sauce or tomato puree', u'aisle': u'Canned and Jarred', u'name': u'tomato puree', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11547, u'unit': u'cup'}, {u'originalString': u'3/4 cup veal stock (or quality chicken stock)', u'aisle': u'Canned and Jarred', u'name': u'veal stock', u'metaInformation': [u'(or quality chicken stock)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 6170, u'unit': u'cup'}, {u'originalString': u'1/3 cup white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}], u'healthScore': 15.0, u'imageType': u'jpeg', u'spoonacularScore': 73.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/michael-chiarello/quick-bolognese-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the olive oil in a large skillet over medium heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the onions and cook gently to "sweat," about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic and rosemary and cook for about a minute, or until the garlic is lightly browned.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Add the veal and pork: Stir in the meat, breaking it up with a wooden spoon. Cook 2 minutes; season with salt and pepper.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-tenderloin-raw.png', u'id': 10010219, u'name': u'pork'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/veal.jpg', u'id': 17142, u'name': u'veal'}]}, {u'equipment': [], u'step': u'Add the mushrooms; cook for about 4 minutes to caramelize the meat. Meanwhile, boil the pasta.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u'Saute the onions'}, {u'steps': [{u'equipment': [], u'step': u'Add the wine and 2 tablespoons porcini juice; cook for 1 minute to evaporate.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the stock and parsley; cook for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [], u'step': u'Add the marinara and 1/4 cup pasta cooking water; simmer for 3 to 4 minutes. Toss with cooked pasta and the parmesan.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Garnish with more cheese.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Photograph by James Baigrie', u'number': 5, u'ingredients': []}], u'name': u'Finish the sauce'}, {u'steps': [{u'equipment': [], u'step': u'Place the porcini in warm water; soak for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain, reserving the liquid, then chop the porcini. Start a large pot of salted water boiling for your pasta.', u'number': 2, u'ingredients': []}], u'name': u'Soak the mushrooms'}], u'aggregateLikes': 180, u'instructions': u'Soak the mushrooms: Place the porcini in warm water; soak for 15 minutes. Drain, reserving the liquid, then chop the porcini. Start a large pot of salted water boiling for your pasta.                          Saute the onions: Heat the olive oil in a large skillet over medium heat. Add the onions and cook gently to "sweat," about 2 minutes. Add the garlic and rosemary and cook for about a minute, or until the garlic is lightly browned.                          Add the veal and pork: Stir in the meat, breaking it up with a wooden spoon. Cook 2 minutes; season with salt and pepper. Add the mushrooms; cook for about 4 minutes to caramelize the meat. Meanwhile, boil the pasta.                          Finish the sauce: Add the wine and 2 tablespoons porcini juice; cook for 1 minute to evaporate. Add the stock and parsley; cook for 2 minutes. Add the marinara and 1/4 cup pasta cooking water; simmer for 3 to 4 minutes. Toss with cooked pasta and the parmesan. Garnish with more cheese.                          Photograph by James Baigrie', u'spoonacularSourceUrl': u'https://spoonacular.com/quick-bolognese-749978', u'dishTypes': [u'sauce'], u'occasions': [], u'vegetarian': False, u'ketogenic': True, u'readyInMinutes': 51, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}