{u'recipes': [{u'sourceName': u'Daily Dish Recipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/582635-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 582635, u'veryPopular': False, u'lowFodmap': False, u'title': u'Baked Rigatoni with Bechamel Sauce & Garlic Sauteed Spinach', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 248.48, u'creditText': u'Daily Dish Recipes', u'extendedIngredients': [{u'originalString': u'\xbc cup extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'1 quart fat free half and half, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'fat free half and half', u'metaInformation': [u'fat free', u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'solid', u'id': 1199, u'unit': u'quart'}, {u'originalString': u'\xbd cup + 2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 cup grated fontina, divided', u'aisle': u'Cheese', u'name': u'fontina cheese', u'metaInformation': [u'divided', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fontina.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1020, u'unit': u'cup'}, {u'originalString': u'3 cloves garlic, peeled and very thinly sliced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'peeled', u'very thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'pinch of nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'pinch'}, {u'originalString': u'1 pound dried rigatoni', u'aisle': u'Pasta and Rice', u'name': u'rigatoni', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rigatoni.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11220420, u'unit': u'pound'}, {u'originalString': u'salt and freshly ground black pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1\xbc pounds spinach, trimmed, well washed, and dried', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [u'dried', u'washed', u'trimmed', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 10011457, u'unit': u'pounds'}, {u'originalString': u'\xbd pound smoked turkey sausage, julienned', u'aisle': u'Meat', u'name': u'turkey sausage', u'metaInformation': [u'smoked', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 7955, u'unit': u'pound'}, {u'originalString': u'8 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 8.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://dailydishrecipes.com/baked-rigatoni-with-bechamel-sauce-garlic-sauteed-spinach/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In your largest saute pan, heat the oil over high heat until very hot, almost smoking.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the spinach and cook, stirring furiously, for about 1 to 2 minutes, the spinach should turn bright green and wilt slightly.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Add the garlic and continue to cook, stirring rapidly, for 30 seconds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from heat and set aside.Preheat oven to 425 degrees and grease a 9\xd713 inch baking dish with cooking spray. Set aside.Melt the butter in a saucepan over medium heat.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in the flour until smooth, approximately 2 minutes or so. Gradually add the half and half and stir constantly until the sauce is smooth and creamy. Reduce the heat to a simmer and cook until the sauce is thick enough to coat the back of a wooden spoon. This should take about 10-12 minutes.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the sauce from the heat, then stir in nutmeg, \xbd cup fontina, the sauteed spinach and the smoked turkey sausage. Season with salt and pepper. Set aside.Bring a large pot of water to boil.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'id': 7955, u'name': u'turkey sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [], u'step': u'Add the rigatoni and cook for about 5-6 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rigatoni.jpg', u'id': 11220420, u'name': u'rigatoni'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Drain pasta and return to pot. Stir in bechamel sauce, spinach and smoked turkey sausage and stir well to coat.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'id': 7955, u'name': u'turkey sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour mixture into your prepared pan. Top with the remaining shredded fontina.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u"Bake for 25 minutes or until bubbly and golden brown.I took it out every 10 minutes or so and stirred it all up again. I'm not a fan of crunchy, crispy pasta so I wanted it to stay super soft. Delish!Can be made up to a day ahead, refrigerated, and then baked right before serving—just leave out at room temperature for about 15-20 minutes before baking or add a few minutes on to the baking time.", u'length': {u'number': 55, u'unit': u'minutes'}, u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 92, u'instructions': u"In your largest saute pan, heat the oil over high heat until very hot, almost smoking. Add the spinach and cook, stirring furiously, for about 1 to 2 minutes, the spinach should turn bright green and wilt slightly. Add the garlic and continue to cook, stirring rapidly, for 30 seconds. Remove from heat and set aside.Preheat oven to 425 degrees and grease a 9\xd713 inch baking dish with cooking spray. Set aside.Melt the butter in a saucepan over medium heat. Whisk in the flour until smooth, approximately 2 minutes or so. Gradually add the half and half and stir constantly until the sauce is smooth and creamy. Reduce the heat to a simmer and cook until the sauce is thick enough to coat the back of a wooden spoon. This should take about 10-12 minutes.Remove the sauce from the heat, then stir in nutmeg, \xbd cup fontina, the sauteed spinach and the smoked turkey sausage. Season with salt and pepper. Set aside.Bring a large pot of water to boil. Add the rigatoni and cook for about 5-6 minutes. Drain pasta and return to pot. Stir in bechamel sauce, spinach and smoked turkey sausage and stir well to coat. Pour mixture into your prepared pan. Top with the remaining shredded fontina. Bake for 25 minutes or until bubbly and golden brown.I took it out every 10 minutes or so and stirred it all up again. I'm not a fan of crunchy, crispy pasta so I wanted it to stay super soft. Delish!Can be made up to a day ahead, refrigerated, and then baked right before serving—just leave out at room temperature for about 15-20 minutes before baking or add a few minutes on to the baking time.", u'spoonacularSourceUrl': u'https://spoonacular.com/baked-rigatoni-with-bechamel-sauce-garlic-sauteed-spinach-582635', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}