{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/755899-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 540, u'id': 755899, u'veryPopular': True, u'lowFodmap': False, u'title': u'Sausage Kale Strata', u'diets': [], u'preparationMinutes': 40, u'pricePerServing': 226.96, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 pounds breakfast sausage patties', u'aisle': u'Meat', u'name': u'breakfast sausage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/breakfast-sausage.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 7919, u'unit': u'pounds'}, {u'originalString': u'Butter, for greasing the lasagna pan', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'for greasing the lasagna pan'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1001, u'unit': u'servings'}, {u'originalString': u'1 loaf crusty French bread or ciabatta, cut into cubes', u'aisle': u'Bakery/Bread', u'name': u'crusty bread', u'metaInformation': [u'french', u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/crusty-bread.jpg', u'unitLong': u'loaf', u'unitShort': u'loaf', u'amount': 1.0, u'consistency': u'solid', u'id': 10018029, u'unit': u'loaf'}, {u'originalString': u'12 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 12.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 cup half-and-half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half & half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1 large bunch regular kale, torn into pieces', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11233, u'unit': u'bunch'}, {u'originalString': u'2 1/2 cups freshly grated Monterey Jack cheese', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'freshly grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 1001025, u'unit': u'cups'}, {u'originalString': u'Olive oil, for drizzling and frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'for drizzling and frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'servings'}, {u'originalString': u'1/4 cup minced fresh oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2027, u'unit': u'cup'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'16 ounces white mushrooms, halved', u'aisle': u'Produce', u'name': u'white mushrooms', u'metaInformation': [u'white', u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}, {u'originalString': u'2 cups whole milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole milk', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}], u'healthScore': 16.0, u'imageType': u'jpeg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/ree-drummond/sausage-kale-strata.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 425 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Put the mushrooms on a baking sheet, drizzle with olive oil and sprinkle with salt and pepper. Roast until golden brown, 15 to 20 minutes. Set aside.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix together the milk, half-and-half, oregano, eggs and some salt and pepper in a large pitcher or bowl. Set aside.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Set a large skillet over medium heat and add the sausage patties. Cook until golden brown, 4 to 5 minutes per side. Set aside to cool, then chop into cubes.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In the same skillet from the sausage, heat some olive oil over medium-high heat. Throw in the kale and cook until slightly wilted, 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Grease a lasagna pan with some butter. Layer half the bread, half the kale, half the mushrooms, half the sausage and half the cheese in the prepared pan. Repeat with the other half of the same ingredients, ending with the cheese. Slowly pour the egg mixture all over the top. Cover with plastic wrap and refrigerate overnight.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Twenty to thirty minutes before baking, remove the lasagna pan from the fridge. Preheat the oven to 350 degrees F.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Replace the plastic wrap on top of the strata with aluminum foil.', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Bake for 30 to 40 minutes, then remove the foil and continue to bake until the top is golden brown and slightly crisp, 10 to 15 minutes more (keep a close eye on it).', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1006, u'instructions': u'Watch how to make this recipe.                    Preheat the oven to 425 degrees F.                          Put the mushrooms on a baking sheet, drizzle with olive oil and sprinkle with salt and pepper. Roast until golden brown, 15 to 20 minutes. Set aside.                          Mix together the milk, half-and-half, oregano, eggs and some salt and pepper in a large pitcher or bowl. Set aside.                          Set a large skillet over medium heat and add the sausage patties. Cook until golden brown, 4 to 5 minutes per side. Set aside to cool, then chop into cubes.                          In the same skillet from the sausage, heat some olive oil over medium-high heat. Throw in the kale and cook until slightly wilted, 2 minutes.                          Grease a lasagna pan with some butter. Layer half the bread, half the kale, half the mushrooms, half the sausage and half the cheese in the prepared pan. Repeat with the other half of the same ingredients, ending with the cheese. Slowly pour the egg mixture all over the top. Cover with plastic wrap and refrigerate overnight.                          Twenty to thirty minutes before baking, remove the lasagna pan from the fridge. Preheat the oven to 350 degrees F.                          Replace the plastic wrap on top of the strata with aluminum foil. Bake for 30 to 40 minutes, then remove the foil and continue to bake until the top is golden brown and slightly crisp, 10 to 15 minutes more (keep a close eye on it).', u'spoonacularSourceUrl': u'https://spoonacular.com/sausage-kale-strata-755899', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 580, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}