{u'recipes': [{u'sourceName': u'Spoonful of Flavor', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/521326-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 521326, u'veryPopular': True, u'lowFodmap': False, u'title': u'Key Lime Pie Popsicles', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 76.25, u'creditText': u'Spoonful of Flavor', u'extendedIngredients': [{u'originalString': u'3 cups graham cracker crumbs', u'aisle': u'Sweet Snacks;Baking', u'name': u'graham cracker crumbs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10018617, u'unit': u'cups'}, {u'originalString': u'1/2 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'3/4 cup freshly squeezed key lime juice*', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'2 teaspoons key lime zest*', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 (14 ounce) can sweetened condensed milk', u'aisle': u'Baking', u'name': u'sweetened condensed milk', u'metaInformation': [u'sweetened', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'solid', u'id': 1095, u'unit': u'ounce'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 43.0, u'sourceUrl': u'http://www.spoonfulofflavor.com/2014/03/31/key-lime-pie-popsicles/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, combine juice, zest, condensed milk, heavy cream, milk and salt. Stir well until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/evaporated-milk.jpg', u'id': 1095, u'name': u'sweetened condensed milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-molds.jpg', u'id': 405929, u'name': u'popsicle molds'}], u'step': u'Pour mixture into popsicle molds. Freeze for at least 6 hours, or until completely frozen. To remove popsicles from molds, dip in warm water for 10 to 30 seconds.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Remove from mold and press each side into the graham cracker crumbs. Enjoy!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Late Harvest Riesling, Late Harvest Sauvignon Blanc, and Moscato d'Asti are great choices for Key Lime Pie. Since key lime pie is fairly tart, you can go with any of these sweet wines to balance it out. The McFadden Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.", u'pairedWines': [u'late harvest riesling', u'late harvest sauvignon blanc', u'moscato dasti'], u'productMatches': [{u'description': u'apricot , apple , honey', u'title': u'McFadden Late Harvest Riesling', u'price': u'$18.0', u'id': 430244, u'link': u'https://www.amazon.com/McFadden-Harvest-Riesling-Mendocino-County/dp/B00NP97O6G', u'imageUrl': u'https://spoonacular.com/productImages/430244-312x231.jpg'}]}, u'aggregateLikes': 11114, u'instructions': u'In a large bowl, combine juice, zest, condensed milk, heavy cream, milk and salt. Stir well until combined. Pour mixture into popsicle molds. Freeze for at least 6 hours, or until completely frozen. To remove popsicles from molds, dip in warm water for 10 to 30 seconds. Remove from mold and press each side into the graham cracker crumbs. Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/key-lime-pie-popsicles-521326', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}