{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/288250-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 288250, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon, Date and Manchego Quesadillas', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 460.19, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'12 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 12.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'5 dates, pitted and julienned', u'aisle': u'Dried Fruits;Produce', u'name': u'dates', u'metaInformation': [u'pitted', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 9087, u'unit': u''}, {u'originalString': u'4 10-inch flour tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'flour tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'unitLong': u'10-inchs', u'unitShort': u'10-inch', u'amount': 4.0, u'consistency': u'solid', u'id': 10218364, u'unit': u'10-inch'}, {u'originalString': u'1 clove garlic, roughly chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'Juice of 1/2 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 cups shredded manchego cheese (about 8 ounces)', u'aisle': u'Cheese', u'name': u'manchego cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/manchego.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93821, u'unit': u'ounces'}, {u'originalString': u'1 cup Mexican crema or sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'mexican crema', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93772, u'unit': u'cup'}, {u'originalString': u'1/4 cup extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4053, u'unit': u'cup'}, {u'originalString': u'2 tablespoons extra-virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'extra-virgin'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup salted pistachios', u'aisle': u'Nuts;Savory Snacks', u'name': u'pistachios', u'metaInformation': [u'salted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12151, u'unit': u'cup'}, {u'originalString': u'1 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'2 cups spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}], u'healthScore': 17.0, u'imageType': u'jpeg', u'spoonacularScore': 72.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/bacon-date-and-manchego-quesadillas.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 38, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 400 degrees F. Arrange the bacon slices side by side on a parchment-lined baking sheet and bake until browned and crisp, 15 to 18 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Drain on paper towels.', u'number': 2, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Combine the pistachios, red pepper flakes, garlic, lemon juice and spinach in a food processor and pulse until chopped; with the motor running, slowly stream in the olive oil until incorporated. Season with salt and pepper and process 5 more seconds.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the mixture into a bowl and whisk in the crema; set aside.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 93772, u'name': u'mexican crema'}]}, {u'equipment': [], u'step': u'Assemble the quesadillas: On 1 half of each tortilla, layer 1/2 cup cheese, 3 slices bacon and a few date slices. Fold the tortillas in half to cover the filling.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'id': 9087, u'name': u'dates'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 1 tablespoon olive oil in a nonstick skillet over medium heat.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 2 quesadillas and cook until golden on both sides and gooey in the middle, 4 to 5 minutes per side. Repeat with the remaining 2 quesadillas, adding the remaining 1 tablespoon oil to the pan.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each quesadilla into 4 triangles; serve with the pistachio cream.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pistachios.jpg', u'id': 12151, u'name': u'pistachio nuts'}]}, {u'equipment': [], u'step': u'Photography by Johnny Miller', u'number': 7, u'ingredients': []}], u'name': u'Meanwhile, make the pistachio cream'}], u'winePairing': {u'pairingText': u'Quesadilla can be paired with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Parducci Small Lot Pinot Noir New Label Wine with a 5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'Our Pinot Noir offers aromas of Juicy, ripe raspberries and strawberries. Its berry flavors are full and rich on the palate, picking up a hint of cedar in the finish. Enjoy this medium bodied red wine with grilled salmon, pork tenderloin, and fine cuts of red meat.', u'title': u'Parducci Small Lot Pinot Noir New Label Wine', u'price': u'$18.0', u'id': 428202, u'link': u'https://www.amazon.com/Parducci-Small-Mendocino-County-Wine/dp/B01HQX6G8I', u'imageUrl': u'https://spoonacular.com/productImages/428202-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u'Preheat the oven to 400 degrees F. Arrange the bacon slices side by side on a parchment-lined baking sheet and bake until browned and crisp, 15 to 18 minutes. Drain on paper towels.                          Meanwhile, make the pistachio cream: Combine the pistachios, red pepper flakes, garlic, lemon juice and spinach in a food processor and pulse until chopped; with the motor running, slowly stream in the olive oil until incorporated. Season with salt and pepper and process 5 more seconds. Pour the mixture into a bowl and whisk in the crema; set aside.                          Assemble the quesadillas: On 1 half of each tortilla, layer 1/2 cup cheese, 3 slices bacon and a few date slices. Fold the tortillas in half to cover the filling. Heat 1 tablespoon olive oil in a nonstick skillet over medium heat. Add 2 quesadillas and cook until golden on both sides and gooey in the middle, 4 to 5 minutes per side. Repeat with the remaining 2 quesadillas, adding the remaining 1 tablespoon oil to the pan.                          Cut each quesadilla into 4 triangles; serve with the pistachio cream.                          Photography by Johnny Miller', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-date-and-manchego-quesadillas-288250', u'dishTypes': [u'fingerfood', u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}