{u'recipes': [{u'sourceName': u'Crumb', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/539347-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 539347, u'veryPopular': True, u'lowFodmap': True, u'title': u'Make-Ahead Chocolate Oatmeal', u'diets': [u'gluten free', u'dairy free', u'fodmap friendly'], u'preparationMinutes': 5, u'pricePerServing': 60.71, u'creditText': u'Crumb', u'extendedIngredients': [{u'originalString': u'2 cups chocolate almond milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'almond milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 93607, u'unit': u'cups'}, {u'originalString': u'2 tbsp cocoa powder', u'aisle': u'Baking', u'name': u'cocoa powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tbsp'}, {u'originalString': u'1 tbsp flax meal', u'aisle': u'Health Foods;Baking', u'name': u'flax meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12220, u'unit': u'tbsp'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 cup steel-cut oats', u'aisle': u'Cereal', u'name': u'steel cut oats', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/steel-cut-oats.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93695, u'unit': u'cup'}, {u'originalString': u'2 tbsp sugar or honey', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tbsp'}, {u'originalString': u'1 tsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'tsp'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}], u'healthScore': 4.0, u'imageType': u'png', u'spoonacularScore': 47.0, u'sourceUrl': u'http://www.crumbblog.com/2013/03/have-a-heart-make-ahead-chocolate-oatmeal.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In a medium-sized pot, bring the water and almond milk to a boil. Stir in the steel-cut oats, cocoa powder, flax meal, sugar and salt, and reduce the heat to low.Simmer, uncovered, for 20-25 minutes, stirring every 5 mins or so, until the liquid is thickened and the oats are tender and ever-so-slightly chewy.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almond-milk.jpg', u'id': 93607, u'name': u'almond milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flax-seeds.jpg', u'id': 12220, u'name': u'ground flaxseed'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mason-jar.jpg', u'id': 405938, u'name': u'canning jar'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Remove from heat and stir in vanilla. (The oatmeal might still look a little runny at this point, but don’t worry – it’ll continue thickening up as it cools.)Spoon the hot oatmeal into five 250ml mason jars, and set aside to cool, uncovered. Once the jars are completely cooled, seal them up with lids and transfer to the refrigerator until ready to use.To serve, simply microwave the uncovered jars for 1-2 minutes on high or until warmed through, then dig in!', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 1358, u'instructions': u'In a medium-sized pot, bring the water and almond milk to a boil. Stir in the steel-cut oats, cocoa powder, flax meal, sugar and salt, and reduce the heat to low.Simmer, uncovered, for 20-25 minutes, stirring every 5 mins or so, until the liquid is thickened and the oats are tender and ever-so-slightly chewy. Remove from heat and stir in vanilla. (The oatmeal might still look a little runny at this point, but don’t worry – it’ll continue thickening up as it cools.)Spoon the hot oatmeal into five 250ml mason jars, and set aside to cool, uncovered. Once the jars are completely cooled, seal them up with lids and transfer to the refrigerator until ready to use.To serve, simply microwave the uncovered jars for 1-2 minutes on high or until warmed through, then dig in!', u'spoonacularSourceUrl': u'https://spoonacular.com/make-ahead-chocolate-oatmeal-539347', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 35, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}