{u'recipes': [{u'sourceName': u"Lexi's Clean Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/675882-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 675882, u'veryPopular': False, u'lowFodmap': True, u'title': u'Funnel Cake from Down South Paleo Cookbook', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'fodmap friendly'], u'pricePerServing': 55.28, u'creditText': u"Lexi's Clean Kitchen", u'extendedIngredients': [{u'originalString': u'2 tablespoons avocado oil', u'aisle': u'Oil, Vinegar, Salad Dressing;Health Foods', u'name': u'avocado oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4581, u'unit': u'tablespoons'}, {u'originalString': u'Coconut Oil or Avocado Oil for Frying', u'aisle': u'Oil, Vinegar, Salad Dressing;Health Foods', u'name': u'avocado oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'liquid', u'id': 4581, u'unit': u'servings'}, {u'originalString': u'1 tablespoon maple sugar or coconut palm sugar', u'aisle': u'Baking', u'name': u'coconut palm sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/palm-sugar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93831, u'unit': u'tablespoon'}, {u'originalString': u'2 pastured eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 tablespoons pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'Pinch of salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1 cup tapioca flour', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 93696, u'unit': u'cup'}, {u'originalString': u'3 tablespoons tapioca flour', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 93696, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 8.0, u'sourceUrl': u'http://lexiscleankitchen.com/2015/09/03/funnel-cake-from-down-south-paleo-cookbook/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/funnel.png', u'id': 404643, u'name': u'funnel'}], u'step': u'To make the funnel cakes, pour the oil into a saucepan to a depth of 1 inch and heat over medium-heat (using a small saucepan will help conserve how much oil you pour in).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/funnel.png', u'id': 404643, u'name': u'funnel'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the tapioca flour, eggs, syrup, avocado oil, and salt in a bowl. Stir until batter is well combined.Spoons the batter into a pastry bag and once the oil is shimmering (hot enough to frying), quickly drizzle the batter into the hot oil, overlapping and making sure not to concentrate on one area (you are basically making squiggles and curlicues as you drizzle). Allow the underside to brown, around 1 minute, then use a flat slotted spoon to flip the funnel cake over and brown the other side.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93696, u'name': u'tapioca starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado-oil.jpg', u'id': 4581, u'name': u'avocado oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/funnel.png', u'id': 404643, u'name': u'funnel'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sifter.jpg', u'id': 404708, u'name': u'sifter'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the funnel cake form the oil and place on a towel-lined plate.To make the sprinkle, combine the maple sugar and tapioca flour ing a small bowl. Using a sifter, shake the sugar mixture on top of the funnel cake.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93696, u'name': u'tapioca starch'}]}, {u'equipment': [], u'step': u'Serve hot!', u'number': 4, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 15, u'instructions': u'To make the funnel cakes, pour the oil into a saucepan to a depth of 1 inch and heat over medium-heat (using a small saucepan will help conserve how much oil you pour in). Combine the tapioca flour, eggs, syrup, avocado oil, and salt in a bowl. Stir until batter is well combined.Spoons the batter into a pastry bag and once the oil is shimmering (hot enough to frying), quickly drizzle the batter into the hot oil, overlapping and making sure not to concentrate on one area (you are basically making squiggles and curlicues as you drizzle). Allow the underside to brown, around 1 minute, then use a flat slotted spoon to flip the funnel cake over and brown the other side. Remove the funnel cake form the oil and place on a towel-lined plate.To make the sprinkle, combine the maple sugar and tapioca flour ing a small bowl. Using a sifter, shake the sugar mixture on top of the funnel cake. Serve hot!', u'spoonacularSourceUrl': u'https://spoonacular.com/funnel-cake-from-down-south-paleo-cookbook-675882', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}