{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/330680-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 330680, u'veryPopular': False, u'lowFodmap': False, u'title': u'Key Lime Cupcakes with Key Lime Curd', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 50, u'pricePerServing': 65.92, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 tablespoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18371, u'unit': u'tablespoon'}, {u'originalString': u'8 ounces cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'3 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'6 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'3/4 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'2 cups granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1/4 cup key lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9160, u'unit': u'cup'}, {u'originalString': u'2 tablespoons key lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'1 tablespoon key lime zest', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons key lime zest', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'2 cups pop rock candy', u'aisle': u'Savory Snacks', u'name': u'pop corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19034, u'unit': u'cups'}, {u'originalString': u'5 to 6 cups powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 5.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 sticks (1/2 pound) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'pound'}, {u'originalString': u'4 tablespoon cold unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 13.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/key-lime-cupcakes-with-key-lime-curd-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the cupcakes: Preheat the oven to 300 degrees F. Line cupcake or muffin pans with 24 cupcake liners.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Sift the flour, baking powder and salt and set aside in a bowl.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of electric stand mixer with a paddle attachment, cream the butter and granulated sugar together for about 2 minutes. Then scrape down the bowl and add the eggs one at a time. After adding all the eggs, scrape down bowl and add the milk and dry ingredients.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix on low until well incorporated. Scrape down the bowl again and hike up from low speed to medium speed for about 20 seconds, and then scrape down the bowl for the last time.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u'Fill the cupcake liners three-quarters full with batter.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Bake for 20 to 22 minutes, rotating the cupcakes after 12 minutes, and bake until the cupcakes are baked through. Cool the cupcakes completely.', u'length': {u'number': 32, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the frosting: Sift the powdered sugar and set aside in a bowl.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In the bowl of electric stand mixer with a paddle attachment, cream the butter and cream cheese on low speed. Scrape down the bowl and add the sifted powdered sugar 1 cup at a time. Slowly add the key lime juice and zest until well incorporated. Scrape down the bowl and mix on low speed. Then hike up to medium to high speed for about 2 minutes until creamy and fluffy.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}]}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Whisk the eggs, sugar and key lime juice in a steel bowl and set aside while you prepare a double boiler.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Put a small pot half full with water on the stove over medium to high heat.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the steel bowl with the whisked eggs on top of the pot and mix with a spatula until your mixture has become creamy like sour cream, 6 to 8 minutes.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove the mixture and strain, getting rid of excess egg particles. Grab a second steel bowl and dump your egg mixture inside, adding your zest and cold butter.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Mix until well incorporated and place in the fridge until it slightly thickens, 10 to 15 minutes (or until desired consistency is achieved).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/apple-corer.jpg', u'id': 404787, u'name': u'apple corer'}], u'step': u'Hollow out the middle of the cooled cupcakes with an apple corer or melon ball scooper and set aside. Fill the cupcakes with the curd.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pastry-bag.jpg', u'id': 404757, u'name': u'pastry bag'}], u'step': u'Put the frosting into a pastry bag and cut 1/2-inch off the tip. Swirl on the frosting, and then edge the sides in pop rock candies.', u'number': 7, u'ingredients': []}], u'name': u'For the curd'}], u'aggregateLikes': 12, u'instructions': u'For the cupcakes: Preheat the oven to 300 degrees F. Line cupcake or muffin pans with 24 cupcake liners.                          Sift the flour, baking powder and salt and set aside in a bowl.                          In the bowl of electric stand mixer with a paddle attachment, cream the butter and granulated sugar together for about 2 minutes. Then scrape down the bowl and add the eggs one at a time. After adding all the eggs, scrape down bowl and add the milk and dry ingredients. Mix on low until well incorporated. Scrape down the bowl again and hike up from low speed to medium speed for about 20 seconds, and then scrape down the bowl for the last time.                          Fill the cupcake liners three-quarters full with batter. Bake for 20 to 22 minutes, rotating the cupcakes after 12 minutes, and bake until the cupcakes are baked through. Cool the cupcakes completely.                          For the frosting: Sift the powdered sugar and set aside in a bowl.                          In the bowl of electric stand mixer with a paddle attachment, cream the butter and cream cheese on low speed. Scrape down the bowl and add the sifted powdered sugar 1 cup at a time. Slowly add the key lime juice and zest until well incorporated. Scrape down the bowl and mix on low speed. Then hike up to medium to high speed for about 2 minutes until creamy and fluffy.                          For the curd: Whisk the eggs, sugar and key lime juice in a steel bowl and set aside while you prepare a double boiler.                          Put a small pot half full with water on the stove over medium to high heat. Place the steel bowl with the whisked eggs on top of the pot and mix with a spatula until your mixture has become creamy like sour cream, 6 to 8 minutes. Remove the mixture and strain, getting rid of excess egg particles. Grab a second steel bowl and dump your egg mixture inside, adding your zest and cold butter. Mix until well incorporated and place in the fridge until it slightly thickens, 10 to 15 minutes (or until desired consistency is achieved).                          Hollow out the middle of the cooled cupcakes with an apple corer or melon ball scooper and set aside. Fill the cupcakes with the curd. Put the frosting into a pastry bag and cut 1/2-inch off the tip. Swirl on the frosting, and then edge the sides in pop rock candies.', u'spoonacularSourceUrl': u'https://spoonacular.com/key-lime-cupcakes-with-key-lime-curd-330680', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}