{u'recipes': [{u'sourceName': u'Sumptuous Spoonfuls', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/553065-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 553065, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sneaky Gypsy Pumpkin Chili', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 274.45, u'creditText': u'Sumptuous Spoonfuls', u'extendedIngredients': [{u'originalString': u'2 cups broth (chicken, beef, or vegetable)', u'aisle': u'Canned and Jarred', u'name': u'broth', u'metaInformation': [u'(chicken, beef, or vegetable)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1006615, u'unit': u'cups'}, {u'originalString': u'3 cups peeled, chopped tomatoes (ok to use canned)', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'canned', u'peeled', u'chopped', u'(ok to use )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'cups'}, {u'originalString': u'1 teaspoon powdered chimayo chiles', u'aisle': u'Produce', u'name': u'chiles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11819, u'unit': u'teaspoon'}, {u'originalString': u'1 teaspoon chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1/2 cup fresh cilantro leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'7 cloves of garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 7.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1/2 teaspoon ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'1 lb. lean ground meat (beef, turkey, venison, elk ... whatever you prefer!)', u'aisle': u'Meat', u'name': u'ground meat', u'metaInformation': [u'lean', u'(beef, turkey, venison, elk ... whatever you prefer!)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'2 onions, peeled & chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'A Tablespoon or so of fresh oregano leaves', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'Tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'Tablespoon'}, {u'originalString': u'1 - 4 hot peppers (jalapenos or cayenne, I used both)', u'aisle': u'Produce', u'name': u'peppers', u'metaInformation': [u'hot', u'(jalapenos or cayenne, I used both)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10111333, u'unit': u''}, {u'originalString': u'3 cups pumpkin chunks', u'aisle': u'Produce', u'name': u'pumpkin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 11422, u'unit': u'cups'}, {u'originalString': u'1/2 cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'3 teaspoons Red Robin seasoning', u'name': u'seasoning', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1042027, u'unit': u'teaspoons'}, {u'originalString': u'4 cups cooked mixed beans (I cooked up a mix of garbonzo, pinto, yellow & green split peas, black beans, red beans, and Great Northern white beans)', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'red beans', u'metaInformation': [u'mixed', u'split', u'white', u'green', u'black', u'red', u'yellow', u'cooked', u'(I up a mix of garbonzo, pinto, & peas, beans, beans, and Great Northern beans)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kidney-beans.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 16033, u'unit': u'cups'}, {u'originalString': u'3 teaspoons turmeric', u'aisle': u'Spices and Seasonings', u'name': u'turmeric', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turmeric.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2043, u'unit': u'teaspoons'}, {u'originalString': u'2 bell peppers (red, green or yellow)', u'aisle': u'Produce', u'name': u'yellow bell peppers', u'metaInformation': [u'green', u'red', u'yellow', u'(, or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 72.0, u'imageType': u'jpg', u'spoonacularScore': 95.0, u'sourceUrl': u'http://www.sumptuousspoonfuls.com/sneaky-gypsy-pumpkin-chili/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'In your soup pot over medium heat, cook the meat till brown. Towards the end of the browning, add in the onion and garlic and cook until the onion is soft & translucent.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Drain off any excess fat from the meat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add in the pumpkin, beans, tomatoes, bell peppers, hot peppers, broth, raisins, and spices. Cover and cook for 30 minutes to an hour or until the pumpkin is tender and the flavors are nicely blended, stirring every so often.Just a few minutes before serving, stir in the cilantro and oregano leaves.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pumpkin.jpg', u'id': 11422, u'name': u'pumpkin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}]}, {u'equipment': [], u'step': u'Serve hot with shredded cheese, chopped onion and fresh cilantro or oregano leaves for garnish, if you like.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'fresh cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chili on the menu? Try pairing with Cava, Grenache, and Shiraz. These juicy reds don't have too much tannin (important for spicy foods), but a sparkling wine like cava can tame the heat even better. The Bohigas Brut Reserva Cava with a 4.3 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cava', u'grenache', u'shiraz'], u'productMatches': [{u'description': u'Pale yellow colour. Constant and small bubble. Foam of great persistence. Very fruity aromas, especially of white fruit (acid apple and pear) on shades of peel of citrics and white flowers. In the background, some spicy notes owed to ageing (cinnamon) and cookies. It is a well-structured "cava" in the mouth. Well picked up over its acidity that tenses it overall from beginning to end. The bubble lends a creamy feeling, and it gives volume and softness to the structure that returns acidity and widens the aromas of white fruits and spices that are repeated in the mouth. Its balanced end harmonizes its acidity, and leaves a memory of freshness and volume owing to its light sugar content View More', u'title': u'Bohigas Brut Reserva Cava', u'price': u'$16.99', u'id': 440298, u'link': u'https://www.wine.com/product/bohigas-brut-reserva-cava/131248', u'imageUrl': u'https://spoonacular.com/productImages/440298-312x231.jpg'}]}, u'aggregateLikes': 19, u'instructions': u'In your soup pot over medium heat, cook the meat till brown. Towards the end of the browning, add in the onion and garlic and cook until the onion is soft & translucent. Drain off any excess fat from the meat.Add in the pumpkin, beans, tomatoes, bell peppers, hot peppers, broth, raisins, and spices. Cover and cook for 30 minutes to an hour or until the pumpkin is tender and the flavors are nicely blended, stirring every so often.Just a few minutes before serving, stir in the cilantro and oregano leaves. Serve hot with shredded cheese, chopped onion and fresh cilantro or oregano leaves for garnish, if you like.', u'spoonacularSourceUrl': u'https://spoonacular.com/sneaky-gypsy-pumpkin-chili-553065', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'super bowl'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 90, u'servings': 5, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}