{u'recipes': [{u'sourceName': u'Recipe Girl', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/517271-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 517271, u'veryPopular': False, u'lowFodmap': False, u'title': u'Pesto Pizza Appetizer Bites', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 15, u'pricePerServing': 65.24, u'creditText': u'Recipe Girl', u'extendedIngredients': [{u'originalString': u'1 baguette, sliced into thin slices', u'aisle': u'Bakery/Bread', u'name': u'baguette', u'metaInformation': [u'sliced into thin slices'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18033, u'unit': u''}, {u'originalString': u'store bought pesto (or homemade)', u'aisle': u'Pasta and Rice', u'name': u'pesto', u'metaInformation': [u'homemade', u'store bought', u'(or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 16.0, u'consistency': u'solid', u'id': 93698, u'unit': u'servings'}, {u'originalString': u'3 medium Roma tomatoes, thinly sliced', u'aisle': u'Produce', u'name': u'roma tomatoes', u'metaInformation': [u'medium', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/roma-tomatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 10211529, u'unit': u''}, {u'originalString': u'1 (8 ounce) package shredded mozzarella cheese', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'ounce'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.recipegirl.com/2006/05/29/pesto-pizza-appetizer-bites/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 405914, u'name': u'broiler'}], u'step': u'Preheat broiler. 2.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Spread a layer of pesto on each slice of baguette. Top each slice with a tomato slice; sprinkle cheese on top.3.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/half-baguette.jpg', u'id': 18033, u'name': u'baguette'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pesto.jpg', u'id': 93698, u'name': u'pesto'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place bread in a single layer on a large rimmed baking sheet. Broil 5 minutes, or until cheese is bubbly and lightly browned.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pizza works really well with Sangiovese, Barbera Wine, and Shiraz. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. You could try Selvapiana Chianti Rufina. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 14 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses.', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 7, u'instructions': u'1.  Preheat broiler. 2.  Spread a layer of pesto on each slice of baguette. Top each slice with a tomato slice; sprinkle cheese on top.3.  Place bread in a single layer on a large rimmed baking sheet. Broil 5 minutes, or until cheese is bubbly and lightly browned.', u'spoonacularSourceUrl': u'https://spoonacular.com/pesto-pizza-appetizer-bites-517271', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}