{u'recipes': [{u'sourceName': u'How Sweet Eats', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/796385-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 796385, u'veryPopular': False, u'lowFodmap': False, u'title': u'Blue Cheese Portobello Burgers', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 287.84, u'creditText': u'How Sweet Eats', u'extendedIngredients': [{u'originalString': u'1 tablespoon balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'tablespoon'}, {u'originalString': u'6 ounces blue cheese, plus more for topping', u'aisle': u'Cheese', u'name': u'blue cheese', u'metaInformation': [u'blue', u'plus more for topping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1004, u'unit': u'ounces'}, {u'originalString': u'4 large pieces butter lettuce', u'aisle': u'Produce', u'name': u'butter lettuce', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Butter-or-Boston-Bibb-lettuce.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11250, u'unit': u'pieces'}, {u'originalString': u'vegetable or canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'2 ears grilled corn', u'aisle': u'Produce', u'name': u'ears corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'4 english muffins or buns', u'aisle': u'Bakery/Bread', u'name': u'english muffins', u'metaInformation': [u'english'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/English-muffins.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 18439, u'unit': u''}, {u'originalString': u'2/3 cup flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'4 large portobello mushroom caps, stems removed', u'aisle': u'Produce', u'name': u'portobello mushroom caps', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/portabello-mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11265, u'unit': u''}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 large shallots, peeled and sliced', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'large', u'peeled', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'1/2 teaspoon smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1012028, u'unit': u'teaspoon'}], u'healthScore': 13.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.howsweeteats.com/2016/08/blue-cheese-stuffed-portobello-burgers-with-grilled-corn-and-crispy-shallots/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet over medium heat and add the olive oil.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Add the mushroom caps and toss so they are coated in the oil, the stir in the garlic. Cook the mushroomsfor about 3 to 4 minutes on each side, until they are tender and juicy.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the balsamic vinegar into the skillet and toss the mushrooms. Reduce the heat to low, sprinkle salt and pepper on the caps, and then fill the inside of the cap with 1 ounce or so of blue cheese. Cover the skillet just until the cheese melts.To serve the burger, place a piece of butter lettuce on the bottom of the english muffin. Top with the mushroom, then extra blue cheese.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/Butter-or-Boston-Bibb-lettuce.jpg', u'id': 11250, u'name': u'butter lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/English-muffins.jpg', u'id': 18439, u'name': u'english muffin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blue-cheese.png', u'id': 1004, u'name': u'blue cheese'}]}, {u'equipment': [], u'step': u'Add the onions and the grilled corn.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.crispy shallots', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u"Heat about 2 inches of oil in a medium saucepan over medium-low heat. You want the heat to be about 350 degrees F, but after a few minutes of heating, I'll test it out by throwing a shallot slice in. While the oil isheating, stir together the flour, salt, paprika, garlic powder and pepper. Dredge the shallot slices through the flour. Once coated, add them in batches to the oil. Fry until just golden and crispy, then remove with tongs or a slotted spoon and place on a paper towel to drain excess grease. Repeat with remaining batches.", u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1022020, u'name': u'garlic powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'id': 11677, u'name': u'shallot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Malbec, Merlot, and Zinfandel are my top picks for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. You could try Gordon Estate Malbec Wine. Reviewers quite like it with a 5 out of 5 star rating and a price of about 23 dollars per bottle.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'blackberry , currant , spice', u'title': u'Gordon Estate Malbec Wine', u'price': u'$22.99', u'id': 469190, u'link': u'https://www.amazon.com/2013-Gordon-Estate-Malbec-Wine/dp/B01E68602I', u'imageUrl': u'https://spoonacular.com/productImages/469190-312x231.jpg'}]}, u'aggregateLikes': 125, u'instructions': u"Heat a large skillet over medium heat and add the olive oil. Add the mushroom caps and toss so they are coated in the oil, the stir in the garlic. Cook the mushroomsfor about 3 to 4 minutes on each side, until they are tender and juicy. Add the balsamic vinegar into the skillet and toss the mushrooms. Reduce the heat to low, sprinkle salt and pepper on the caps, and then fill the inside of the cap with 1 ounce or so of blue cheese. Cover the skillet just until the cheese melts.To serve the burger, place a piece of butter lettuce on the bottom of the english muffin. Top with the mushroom, then extra blue cheese. Add the onions and the grilled corn. Serve immediately.crispy shallotsHeat about 2 inches of oil in a medium saucepan over medium-low heat. You want the heat to be about 350 degrees F, but after a few minutes of heating, I'll test it out by throwing a shallot slice in. While the oil isheating, stir together the flour, salt, paprika, garlic powder and pepper. Dredge the shallot slices through the flour. Once coated, add them in batches to the oil. Fry until just golden and crispy, then remove with tongs or a slotted spoon and place on a paper towel to drain excess grease. Repeat with remaining batches.", u'spoonacularSourceUrl': u'https://spoonacular.com/blue-cheese-portobello-burgers-796385', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}