{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/739371-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 739371, u'veryPopular': False, u'lowFodmap': False, u'title': u'Coriander Pork Roast', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 30, u'pricePerServing': 251.2, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 pound baby potatoes', u'aisle': u'Produce', u'name': u'baby potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11352, u'unit': u'pound'}, {u'originalString': u'1 bay leaf, crumbled', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'1 14.5-ounce can diced fire-roasted tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'diced', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.5, u'consistency': u'solid', u'id': 10011693, u'unit': u'ounce'}, {u'originalString': u'1 teaspoon chopped fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tablespoon'}, {u'originalString': u'3 cloves garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 1/2 teaspoons ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2012, u'unit': u'teaspoons'}, {u'originalString': u'Juice of 2 lemons', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Juice of 2 oranges', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9206, u'unit': u''}, {u'originalString': u'Kosher salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 cup low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'1 cup torn fresh mint', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'cup'}, {u'originalString': u'1 7-pound bone-in pork picnic shoulder, skinless', u'aisle': u'Meat', u'name': u'pork shoulder', u'metaInformation': [u'bone-in', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-shoulder.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 7.0, u'consistency': u'solid', u'id': 10072, u'unit': u'pound'}, {u'originalString': u'1/2 teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1 rutabaga (about 1 1/4 pounds), peeled and cut into 3/4-inch pieces', u'aisle': u'Produce', u'name': u'rutabaga', u'metaInformation': [u'peeled', u'cut into 3/4-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rutabaga.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.25, u'consistency': u'solid', u'id': 11435, u'unit': u'pounds'}, {u'originalString': u'1/4 cup torn fresh sage (about 14 leaves)', u'aisle': u'Spices and Seasonings', u'name': u'sage', u'metaInformation': [u'fresh', u'( 14 leaves)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2038, u'unit': u'cup'}, {u'originalString': u'1 1/2 teaspoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 19335, u'unit': u'teaspoons'}], u'healthScore': 88.0, u'imageType': u'jpeg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/food-network-kitchens/coriander-pork-roast.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Combine 2 tablespoons salt, 1 teaspoon pepper, the coriander, red pepper flakes, sage, thyme, rosemary, bay leaf and garlic in a food processor and pulse to make a paste. Pierce the pork all over with a paring knife, then rub with the spice paste. Tie the roast with kitchen twine so it keeps its shape.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'id': 2012, u'name': u'coriander'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer the meat to a 6-quart slow cooker.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add the juice of 1 orange and 1 lemon along with the chicken broth, potatoes and rutabaga. Cover and cook on high, 7 1/2 hours.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rutabaga.jpg', u'id': 11435, u'name': u'rutabaga'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cutting-board.jpg', u'id': 404716, u'name': u'cutting board'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer the meat to a cutting board; cover with foil and set aside. Skim off the fat from the cooking liquid.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Add the tomatoes, sugar and the juice of the remaining orange and lemon to the slow cooker; cover and cook on high, 30 more minutes. Stir in the mint just before serving.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/kitchen-string.jpg', u'id': 404733, u'name': u'kitchen twine'}], u'step': u'Remove the twine from the pork and slice.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with the vegetables and cooking liquid.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Photograph by Christopher Testani', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 86, u'instructions': u'Combine 2 tablespoons salt, 1 teaspoon pepper, the coriander, red pepper flakes, sage, thyme, rosemary, bay leaf and garlic in a food processor and pulse to make a paste. Pierce the pork all over with a paring knife, then rub with the spice paste. Tie the roast with kitchen twine so it keeps its shape.                          Transfer the meat to a 6-quart slow cooker. Add the juice of 1 orange and 1 lemon along with the chicken broth, potatoes and rutabaga. Cover and cook on high, 7 1/2 hours.                          Transfer the meat to a cutting board; cover with foil and set aside. Skim off the fat from the cooking liquid. Add the tomatoes, sugar and the juice of the remaining orange and lemon to the slow cooker; cover and cook on high, 30 more minutes. Stir in the mint just before serving.                          Remove the twine from the pork and slice. Serve with the vegetables and cooking liquid.                          Photograph by Christopher Testani', u'spoonacularSourceUrl': u'https://spoonacular.com/coriander-pork-roast-739371', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 510, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}