{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/497381-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 497381, u'veryPopular': False, u'lowFodmap': True, u'title': u'Pom-Lemon Martini', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 36.89, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1/4 lemon juiced', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.25, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'4 oz lemon vodka', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'oz'}, {u'originalString': u'Lemon wedges', u'aisle': u'Produce', u'name': u'lemon wedges', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'4 oz pomegranate liqueur', u'aisle': u'Produce', u'name': u'pomegranate', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1009286, u'unit': u'oz'}, {u'originalString': u'Splash (or more) of Sparkling Water (we used berry flavor)', u'aisle': u'Beverages', u'name': u'sparkling water', u'metaInformation': [u'()', u'(we used berry flavor)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water-sparkling.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 14121, u'unit': u'servings'}, {u'originalString': u'White sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 19335, u'unit': u'servings'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2012/02/pom-lemon-martini.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rub a wedge of lemon around the rim of a martini glass.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Pour some white sugar onto a small plate.  Dip the rim of the martini glass into the sugar.  Fill a shaker (or another glass) with ice then add the vodka, pomegranate liqueur, juice from a 1/4 of a lemon, and a splash of sparkling water.  Shake really well then carefully pour into your prepared martini glass.  Finish the drink off with a wedge of lemon as a garnish and some pomegranate seeds.  Enjoy!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate-seeds.jpg', u'id': 9286, u'name': u'pomegranate seeds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water sparkling', u'id': 14121, u'name': u'sparkling water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pomegranate.jpg', u'id': 1009286, u'name': u'pomegranate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 169, u'instructions': u'Rub a wedge of lemon around the rim of a martini glass.  Pour some white sugar onto a small plate.  Dip the rim of the martini glass into the sugar.  Fill a shaker (or another glass) with ice then add the vodka, pomegranate liqueur, juice from a 1/4 of a lemon, and a splash of sparkling water.  Shake really well then carefully pour into your prepared martini glass.  Finish the drink off with a wedge of lemon as a garnish and some pomegranate seeds.  Enjoy!', u'spoonacularSourceUrl': u'https://spoonacular.com/pom-lemon-martini-497381', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}