{u'recipes': [{u'sourceName': u'Gimme Some Oven', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/799555-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 799555, u'veryPopular': False, u'lowFodmap': False, u'title': u'Toasted Gnocchi with Mushrooms, Basil and Parmesan', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 445.66, u'creditText': u'Gimme Some Oven', u'extendedIngredients': [{u'originalString': u'1/2 cup julienned or roughly-chopped fresh basil leaves, loosely-packed', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil leaves', u'metaInformation': [u'fresh', u'loosely-packed', u'julienned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'3 tablespoons butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'2/3 cup dry white wine', u'aisle': u'Alcoholic Beverages', u'name': u'dry white wine', u'metaInformation': [u'dry white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'liquid', u'id': 14106, u'unit': u'cup'}, {u'originalString': u'3 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'1/2 cup freshly-grated Parmesan cheese, plus extra for serving', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'freshly-grated', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 pound (uncooked) potato gnocchi*, homemade or store-bought', u'aisle': u'Pasta and Rice;Refrigerated;Frozen', u'name': u'potato gnocchi', u'metaInformation': [u'homemade', u'store-bought', u'uncooked', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 98853, u'unit': u'pound'}, {u'originalString': u'8 ounces shiitake mushrooms, sliced', u'aisle': u'Produce', u'name': u'shiitake mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shiitake-mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11238, u'unit': u'ounces'}, {u'originalString': u'8 ounces baby bella or white button mushrooms, sliced', u'aisle': u'Produce', u'name': u'white button mushrooms', u'metaInformation': [u'white', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 11260, u'unit': u'ounces'}], u'healthScore': 5.0, u'imageType': u'jpg', u'spoonacularScore': 50.0, u'sourceUrl': u'http://www.gimmesomeoven.com/toasted-gnocchi-with-mushrooms-basil-and-parmesan/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Cook gnocchi according to package directions in a large stockpot of salted boiling water.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'id': 98853, u'name': u'gnocchi'}]}, {u'equipment': [], u'step': u'Drain, and set aside.Meanwhile, asthe gnocchi is cooking, melt the butter in a large sautpanover medium-high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'id': 98853, u'name': u'gnocchi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Add the mushrooms and sautfor about 3 minutes, stirring occasionally, until the mushrooms are soft and slightly browned. Then addin the cooked gnocchi and garlic and continue cooking, stirring occasionally, until the garlic is fragrant and the gnocchi is lightly toasted and browned around the edges.Carefully addin the wine, and give the mixture a good stir. Continue cookingfor 3-4 minutes, until the wine has reduced by half.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gnocchi-isolated.jpg', u'id': 98853, u'name': u'gnocchi'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from the heat, stir in the fresh basil and Parmesan until combined.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-basil.jpg', u'id': 2044, u'name': u'fresh basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}, {u'equipment': [], u'step': u'Serve immediately, garnished with extra Parmesan if desired.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Verdicchio, Trebbiano, and Chianti are my top picks for Gnocchi. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Sartarelli Verdicchio Classico with a 3.2 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'verdicchio', u'trebbiano', u'chianti'], u'productMatches': [{u'description': u'Vinification: sourced from 3 vineyards, soft pressing and temperature controlled fermentation in stainless steel lasting 3-4 weeks, partial malolactic.Aging: 6 months in stainless steel before bottling.TASTING NOTES:  Nutty, discrete aromas of pit fruits, smoke and minerals, rich and dry, intensely flavored; finishes with floral and herbal notes. View More', u'title': u'Sartarelli Verdicchio Classico', u'price': u'$12.99', u'id': 434907, u'link': u'https://www.wine.com/product/sartarelli-verdicchio-classico-2000/52251', u'imageUrl': u'https://spoonacular.com/productImages/434907-312x231.jpg'}]}, u'aggregateLikes': 334, u'instructions': u'Cook gnocchi according to package directions in a large stockpot of salted boiling water. Drain, and set aside.Meanwhile, asthe gnocchi is cooking, melt the butter in a large sautpanover medium-high heat. Add the mushrooms and sautfor about 3 minutes, stirring occasionally, until the mushrooms are soft and slightly browned. Then addin the cooked gnocchi and garlic and continue cooking, stirring occasionally, until the garlic is fragrant and the gnocchi is lightly toasted and browned around the edges.Carefully addin the wine, and give the mixture a good stir. Continue cookingfor 3-4 minutes, until the wine has reduced by half.Remove pan from the heat, stir in the fresh basil and Parmesan until combined.Serve immediately, garnished with extra Parmesan if desired.', u'spoonacularSourceUrl': u'https://spoonacular.com/toasted-gnocchi-with-mushrooms-basil-and-parmesan-799555', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}