{u'recipes': [{u'sourceName': u"Can't Stay out of the Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/499963-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 60, u'id': 499963, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Sweet Potato and Pear Bisque', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 20, u'pricePerServing': 79.98, u'creditText': u"Can't Stay out of the Kitchen", u'extendedIngredients': [{u'originalString': u'1 tsp. black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'4 ribs celery, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'ribs', u'amount': 4.0, u'consistency': u'solid', u'id': 11143, u'unit': u'ribs'}, {u'originalString': u'2 tsp. kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tsp'}, {u'originalString': u'1 tsp. marjoram', u'aisle': u'Produce;Spices and Seasonings', u'name': u'marjoram', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/marjoram.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2023, u'unit': u'tsp'}, {u'originalString': u'1 onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 red pears, diced, but NOT peeled', u'aisle': u'Produce', u'name': u'pears', u'metaInformation': [u'diced', u'red', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pears-bosc.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9252, u'unit': u''}, {u'originalString': u'2 heaping teaspoons roasted minced garlic', u'aisle': u'Produce', u'name': u'roasted garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'teaspoons'}, {u'originalString': u'1 tsp. rosemary', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2036, u'unit': u'tsp'}, {u'originalString': u'1 tsp. sage', u'aisle': u'Spices and Seasonings', u'name': u'sage', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2038, u'unit': u'tsp'}, {u'originalString': u'6 large sweet potatoes, chunked', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'1 tsp. thyme', u'aisle': u'Produce', u'name': u'thyme', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'32-oz. vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 32.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'oz'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 69.0, u'sourceUrl': u'http://cantstayoutofthekitchen.com/2014/01/04/creamy-sweet-potato-pear-bisque/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/potato-masher.jpg', u'id': 404763, u'name': u'potato masher'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place everything in a large pot and cook over medium-medium high heat until mixture starts to boil.Reduce heat to low and simmer until veggies are tender, about 45 minutes to an hour or so.Mash with a potato masher then use an emulsion blender to puree all the ingredients.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 268, u'instructions': u'Place everything in a large pot and cook over medium-medium high heat until mixture starts to boil.Reduce heat to low and simmer until veggies are tender, about 45 minutes to an hour or so.Mash with a potato masher then use an emulsion blender to puree all the ingredients.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-sweet-potato-and-pear-bisque-499963', u'dishTypes': [u'soup'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 80, u'servings': 10, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}