{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/197435-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 197435, u'veryPopular': False, u'lowFodmap': False, u'title': u'Slow Cooker Apple Butter', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'pricePerServing': 150.93, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'2/3 cup apple cider, apple juice, or water', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 1009016, u'unit': u'cup'}, {u'originalString': u'6 pounds apples, peeled, cored and cut into one-inch chunks', u'aisle': u'Produce', u'name': u'apples', u'metaInformation': [u'cored', u'peeled', u'cut into one-inch chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 6.0, u'consistency': u'solid', u'id': 9003, u'unit': u'pounds'}, {u'originalString': u'1 cup brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'2 teaspoons cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}], u'healthScore': 3.0, u'imageType': u'jpg', u'spoonacularScore': 35.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/10/slow-cooker-apple-butter-recipe.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Combine the apples and apple cider, juice, or water in a large, heavy-bottomed pot. Bring to a boil, then reduce the heat and simmer until the apples are soft enough to break apart with a spoon, about 30 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'id': 1009016, u'name': u'apple cider'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-juice.jpg', u'id': 1019016, u'name': u'juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/immersion-blender.png', u'id': 404776, u'name': u'immersion blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the pot from the heat and puree the apples with an immersion blender. (Alternatively, this can be done in batches in a blender or food processor.)', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Transfer the applesauce to a slow cooker and stir in the brown sugar, granulated sugar, cinnamon, ginger, and nutmeg. Cook on low for eight hours, until the butter is thick enough to hold its shape when spooned on a chilled plate.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'To preserve the apple butter ladle the hot butter into hot sterilized jars, leaving 1/4-inch headspace. Wipe the rims of the jars, cover with the lids, and screw the bands on until just barely tight.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Place the jars on rack in pot and cover completely with water. Cover the pot and bring to a boil over high heat. Boil for 20 minutes. Turn off the heat, uncover the pot, and allow the jars to rest in the water for five minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Remove the jars from the pot and allow them to rest undisturbed on the countertop for six hours or overnight. Preserved apple butter will keep in a cool, dark place for up to six months.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Alternatively, refrigerate the butter for up to two months.', u'number': 11, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 143, u'instructions': u'Procedures                                                                              1                                                                            Combine the apples and apple cider, juice, or water in a large, heavy-bottomed pot. Bring to a boil, then reduce the heat and simmer until the apples are soft enough to break apart with a spoon, about 30 minutes. Remove the pot from the heat and puree the apples with an immersion blender. (Alternatively, this can be done in batches in a blender or food processor.)                                                                                                                             2                                                                            Transfer the applesauce to a slow cooker and stir in the brown sugar, granulated sugar, cinnamon, ginger, and nutmeg. Cook on low for eight hours, until the butter is thick enough to hold its shape when spooned on a chilled plate.                                                                                                                              3                                                                            To preserve the apple butter ladle the hot butter into hot sterilized jars, leaving 1/4-inch headspace. Wipe the rims of the jars, cover with the lids, and screw the bands on until just barely tight. Place the jars on rack in pot and cover completely with water. Cover the pot and bring to a boil over high heat. Boil for 20 minutes. Turn off the heat, uncover the pot, and allow the jars to rest in the water for five minutes. Remove the jars from the pot and allow them to rest undisturbed on the countertop for six hours or overnight. Preserved apple butter will keep in a cool, dark place for up to six months.                                                                                                                            4                                                                            Alternatively, refrigerate the butter for up to two months.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-apple-butter-197435', u'dishTypes': [u'condiment', u'dip', u'spread'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 540, u'servings': 7, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}