{u'recipes': [{u'sourceName': u'Multiply Delicious ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/575564-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 575564, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow Cooker Beef Stew', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 250.34, u'creditText': u'Multiply Delicious ', u'extendedIngredients': [{u'originalString': u'4 thick slices sugar-free bacon, chopped', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'sugar-free', u'thick', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'1 Tbs. balsamic vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'balsamic vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'liquid', u'id': 2069, u'unit': u'Tbs'}, {u'originalString': u'1 bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'bay leaf', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'2 lbs. boneless beef chuck', u'aisle': u'Meat', u'name': u'beef chuck roast', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-chuck-roast.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 13786, u'unit': u'lbs'}, {u'originalString': u'4 cups beef stock or broth', u'aisle': u'Canned and Jarred', u'name': u'beef stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6170, u'unit': u'cups'}, {u'originalString': u'3 carrots, cut into 1/4-inch pieces', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'cut into 1/4-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'3 stalks celery, cut into 1/4-inch pieces', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'cut into 1/4-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 3.0, u'consistency': u'solid', u'id': 11143, u'unit': u'stalks'}, {u'originalString': u'1 Tbs. chopped fresh flat-leaf parsley, plus more for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh flat-leaf parsley', u'metaInformation': [u'fresh', u'plus more for garnish', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'Tbs'}, {u'originalString': u'1 tsp. minced fresh rosemary', u'aisle': u'Produce', u'name': u'fresh rosemary', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2063, u'unit': u'tsp'}, {u'originalString': u'1 tsp. minced fresh thyme', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2049, u'unit': u'tsp'}, {u'originalString': u'2 cloves garlic, chopped', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'sea salt and freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'1 medium sweet potato, diced', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'diced', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11507, u'unit': u''}, {u'originalString': u'2 Tbs. tomato paste', u'aisle': u'Pasta and Rice', u'name': u'tomato paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 2.0, u'consistency': u'solid', u'id': 11887, u'unit': u'Tbs'}, {u'originalString': u'1 yellow onion, chopped', u'aisle': u'Produce', u'name': u'yellow onion', u'metaInformation': [u'yellow', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10511282, u'unit': u''}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.multiplydelicious.com/thefood/2014/02/slow-cooker-beef-stew/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook the bacon: In a large fry pan over medium heat, cook the bacon, stirring occasionally, until crisp, 5 to 7 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Transfer the bacon to paper towels to drain.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour off the drippings into a small heatproof bowl, leaving about 1 Tbs. drippings in the pan. Set the pan, reserved drippings and bacon aside. Brown the beef: In a sealable plastic bag, add the beef chunks, 1 tsp sea salt, and 1/2 tsp black pepper and shake to coat. Return the fry pan to medium-high heat. When the drippings are hot, add half of the beef chunks and cook, turning once, until well browned, about 5 minutes on each side.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}, {u'steps': [{u'equipment': [], u'step': u'Add broth, tomato paste, and balsamic vinegar to the vegetables and beef and stir to combine.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/balsamic-vinegar.jpg', u'id': 2069, u'name': u'balsamic vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-paste.jpg', u'id': 11887, u'name': u'tomato paste'}]}, {u'equipment': [], u'step': u'Place bay leaf on top and cover and cook on the high-heat setting for 4 to 5 hours or the low-heat setting for 8 to 9 hours. The beef should be very tender. Stir in the reserved bacon, parsley, thyme and the rosemary. Cook, uncovered, on the high-heat setting for 10 minutes more to thicken the sauce slightly. Season with salt and pepper and serve.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}]}], u'name': u'Transfer the beef to the slow cooker. Repeat with the remaining beef chunks, adding the reserved drippings if needed. Scatter the onions, carrots, celery, sweet potato, and garlic on top. Cook the stew'}], u'winePairing': {u'pairingText': u'Beef Stew on the menu? Try pairing with Cabernet Sauvignon, Malbec, and Shiraz. These full-bodied red wines are the perfect accompaniment for hearty beef stew. The Gnarly Head Cabernet Sauvignon with a 4.8 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.', u'pairedWines': [u'cabernet sauvignon', u'malbec', u'shiraz'], u'productMatches': [{u'description': u'Gold Medal Winner: 2014 Los Angeles International Wine CompetitionGnarly Head 2012 Cabernet Sauvignon is King - big, gallant and powerful. This dark, bold Cabernet has solid tannins and jammy fruit, with aromas of black cherry, blackberry, freshly-cracked black peppercorn, violet and charred notes. On the palate, flavors of dense black fruit compote and currant followed by a trio of clove, spice and earth, lead to a generous, lingering finish.Try pairing this Cabernet with grilled lamb skewers, strong cheeses or a spaghetti Bolognese. View More', u'title': u'Gnarly Head Cabernet Sauvignon', u'price': u'$11.99', u'id': 442127, u'link': u'https://www.wine.com/product/gnarly-head-cabernet-sauvignon-2012/129675', u'imageUrl': u'https://spoonacular.com/productImages/442127-312x231.jpg'}]}, u'aggregateLikes': 426, u'instructions': u'Cook the bacon: In a large fry pan over medium heat, cook the bacon, stirring occasionally, until crisp, 5 to 7 minutes. Transfer the bacon to paper towels to drain. Pour off the drippings into a small heatproof bowl, leaving about 1 Tbs. drippings in the pan. Set the pan, reserved drippings and bacon aside. Brown the beef: In a sealable plastic bag, add the beef chunks, 1 tsp sea salt, and 1/2 tsp black pepper and shake to coat. Return the fry pan to medium-high heat. When the drippings are hot, add half of the beef chunks and cook, turning once, until well browned, about 5 minutes on each side. Transfer the beef to the slow cooker. Repeat with the remaining beef chunks, adding the reserved drippings if needed. Scatter the onions, carrots, celery, sweet potato, and garlic on top. Cook the stew: Add broth, tomato paste, and balsamic vinegar to the vegetables and beef and stir to combine. Place bay leaf on top and cover and cook on the high-heat setting for 4 to 5 hours or the low-heat setting for 8 to 9 hours. The beef should be very tender. Stir in the reserved bacon, parsley, thyme and the rosemary. Cook, uncovered, on the high-heat setting for 10 minutes more to thicken the sauce slightly. Season with salt and pepper and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-beef-stew-575564', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}