{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219019-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 270, u'id': 219019, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lamb shank, pea & mint pie', u'diets': [], u'preparationMinutes': 60, u'pricePerServing': 373.04, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'100g butter, diced', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u'1\xbd l good-quality chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'liters', u'unitShort': u'l', u'amount': 1.5, u'consistency': u'liquid', u'id': 6172, u'unit': u'l'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4-5 lamb shanks', u'aisle': u'Meat', u'name': u'lamb shanks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'liquid', u'id': 17009, u'unit': u''}, {u'originalString': u'small bunch mint, finely chopped', u'aisle': u'Produce', u'name': u'mint', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-balm.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 2064, u'unit': u'bunch'}, {u'originalString': u'2 onions, chopped', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'small bunch parsley, finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'small', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'bunch'}, {u'originalString': u'250g frozen peas', u'aisle': u'Produce', u'name': u'peas', u'metaInformation': [u'frozen'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 11304, u'unit': u'g'}, {u'originalString': u'3 tbsp plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'2 tbsp sunflower or rapeseed oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'rapeseed oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'tbsp'}, {u'originalString': u'2 rosemary sprigs, leaves finely chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'rosemary', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2036, u'unit': u''}, {u'originalString': u'5 spring onions, finely chopped', u'aisle': u'Produce', u'name': u'spring onions', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'100g suet', u'aisle': u'Meat', u'name': u'suet', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-fat-or-lard.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 13335, u'unit': u'g'}, {u'originalString': u'2 thyme sprigs', u'aisle': u'Produce', u'name': u'thyme sprigs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 2049, u'unit': u''}, {u'originalString': u'300ml white wine', u'aisle': u'Alcoholic Beverages', u'name': u'white wine', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-wine.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 14106, u'unit': u'ml'}], u'healthScore': 19.0, u'imageType': u'jpg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/3074674/lamb-shank-pea-and-mint-pie', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 21, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Heat the oil in a large flameproofcasserole dish and brown the lambshanks well all over (you may need todo this in batches).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Transfer the lamb toa plate. Reduce the heat, tip the onionsinto the dish and gently soften, addinga splash more oil if you need to. Stir inthe rosemary for the final 1 min, thenadd the thyme and wine. Bring to a fiercesimmer, scraping all the lamb bits off thebottom of the dish as you go – these willadd lots of flavour. When the wine hasboiled for 1 min, add the stock, return theshanks and any juices, and gently bringto a simmer. Cover with a tight-fitting lid,reduce the heat a little and cook until themeat is very tender and falling from thebone – this can take 2-3 hrs. Leave untilcool enough to handle. Can be done24 hrs ahead, covered and chilled, orfrozen for up to a month.Lift the shanks out of the stock (at thisstage you can spoon off any fat that hasseparated to the surface). Gently pull themeat off the bones in nice big chunks,discarding any fatty bits, and put in a piedish – about 30 x 20cm and 5cm deepwill be big enough.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rosemary.jpg', u'id': 2036, u'name': u'rosemary'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the stock back on the heat and boilfiercely until reduced by just under half.Meanwhile, in a big frying pan, melt thebutter, then stir in the flour to a pasteand cook for 1-2 mins. Gradually whiskin ladlefuls of the reduced stock until youhave a smooth sauce. Bubble for a fewmins to thicken up nicely (the sauce willthin a little when cooked in the pie). Tastefor seasoning, then tip over the lamb.To make the pastry, put the flour,butter, suet and 1 tsp salt in a foodprocessor, and whizz together untilno lumps of fat remain. With the motorrunning, gradually pour in 150ml waterto bring the pastry together – you mayneed 1 tsp more water. Tip onto a lightlyfloured work surface and gently bringtogether to a smooth dough, then rollout until just over 0.5cm thick.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-fat-or-lard.jpg', u'id': 13335, u'name': u'suet'}]}, {u'equipment': [], u'step': u'Add the frozen peas, spring onions,parsley and mint to the lamb, and gentlymix to combine.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'spring onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mint.jpg', u'id': 2064, u'name': u'mint'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peas.jpg', u'id': 11304, u'name': u'peas'}]}, {u'equipment': [], u'step': u'Brush the rim of the dishwith a little egg, then cut thin strips ofpastry and stick them on the rim, like apicture frame. Lift the rest of the pastryonto the pie and press down to theedges to stick. Trim the excess andcrimp the edges to seal well. Makea small cross in the centre with a knifeto help steam escape, and roll thetrimmings into leaves, if you like.Stick these all over the pie, againusing egg, to decorate. Can now bechilled for another 24 hrs or frozen forup to a month.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.', u'number': 6, u'ingredients': []}, {u'equipment': [], u'step': u'Brush the whole pie with more egg,then bake for 40-45 mins until reallygolden and crisp.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Pie can be paired with Lambrusco Dolce, Late Harvest Riesling, and Vin Santo. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Angel Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u"Messina Hof's Angel is a crisp, sweet dessert wine, harvested from the last pick of Riesling when the grapes are almost raisins. Perfect with fruit, cheesecake and light, sweet chocolate desserts.", u'title': u'Angel Late Harvest Riesling', u'price': u'$18.99', u'id': 431447, u'link': u'https://www.amazon.com/Messina-Hof-Wine-Cellars-Inc/dp/B01MEE7NSP', u'imageUrl': u'https://spoonacular.com/productImages/431447-312x231.jpg'}]}, u'aggregateLikes': 68, u'instructions': u'Heat the oil in a large flameproofcasserole dish and brown the lambshanks well all over (you may need todo this in batches). Transfer the lamb toa plate. Reduce the heat, tip the onionsinto the dish and gently soften, addinga splash more oil if you need to. Stir inthe rosemary for the final 1 min, thenadd the thyme and wine. Bring to a fiercesimmer, scraping all the lamb bits off thebottom of the dish as you go – these willadd lots of flavour. When the wine hasboiled for 1 min, add the stock, return theshanks and any juices, and gently bringto a simmer. Cover with a tight-fitting lid,reduce the heat a little and cook until themeat is very tender and falling from thebone – this can take 2-3 hrs. Leave untilcool enough to handle. Can be done24 hrs ahead, covered and chilled, orfrozen for up to a month.Lift the shanks out of the stock (at thisstage you can spoon off any fat that hasseparated to the surface). Gently pull themeat off the bones in nice big chunks,discarding any fatty bits, and put in a piedish – about 30 x 20cm and 5cm deepwill be big enough.Put the stock back on the heat and boilfiercely until reduced by just under half.Meanwhile, in a big frying pan, melt thebutter, then stir in the flour to a pasteand cook for 1-2 mins. Gradually whiskin ladlefuls of the reduced stock until youhave a smooth sauce. Bubble for a fewmins to thicken up nicely (the sauce willthin a little when cooked in the pie). Tastefor seasoning, then tip over the lamb.To make the pastry, put the flour,butter, suet and 1 tsp salt in a foodprocessor, and whizz together untilno lumps of fat remain. With the motorrunning, gradually pour in 150ml waterto bring the pastry together – you mayneed 1 tsp more water. Tip onto a lightlyfloured work surface and gently bringtogether to a smooth dough, then rollout until just over 0.5cm thick.Add the frozen peas, spring onions,parsley and mint to the lamb, and gentlymix to combine. Brush the rim of the dishwith a little egg, then cut thin strips ofpastry and stick them on the rim, like apicture frame. Lift the rest of the pastryonto the pie and press down to theedges to stick. Trim the excess andcrimp the edges to seal well. Makea small cross in the centre with a knifeto help steam escape, and roll thetrimmings into leaves, if you like.Stick these all over the pie, againusing egg, to decorate. Can now bechilled for another 24 hrs or frozen forup to a month.Heat oven to 200C/180C fan/gas 6.Brush the whole pie with more egg,then bake for 40-45 mins until reallygolden and crisp.', u'spoonacularSourceUrl': u'https://spoonacular.com/lamb-shank-pea-mint-pie-219019', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 330, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}