{u'recipes': [{u'sourceName': u'Cheap Recipe Blog', u'cuisines': [u'chines', u'asian'], u'image': u'https://spoonacular.com/recipeImages/622044-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 10, u'id': 622044, u'veryPopular': False, u'lowFodmap': False, u'title': u'Turkey & Cranberry Wontons', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 48.53, u'creditText': u'Cheap Recipe Blog', u'extendedIngredients': [{u'originalString': u'4 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'Oil, for frying', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'oil', u'metaInformation': [u'for frying'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'liquid', u'id': 4582, u'unit': u'servings'}, {u'originalString': u'1/2 cup chopped turkey', u'aisle': u'Meat', u'name': u'turkey', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 5165, u'unit': u'cup'}, {u'originalString': u'2 tablespoons cranberry sauce', u'aisle': u'Canned and Jarred', u'name': u'whole cranberry sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9081, u'unit': u'tablespoons'}, {u'originalString': u'Extra cranberry sauce, for dipping', u'aisle': u'Canned and Jarred', u'name': u'whole cranberry sauce', u'metaInformation': [u'for dipping'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-sauce.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'solid', u'id': 9081, u'unit': u'servings'}, {u'originalString': u'14 wonton wrappers', u'aisle': u'Ethnic Foods', u'name': u'wonton wrappers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry-squares.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 14.0, u'consistency': u'solid', u'id': 10018368, u'unit': u''}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 9.0, u'sourceUrl': u'http://www.cheaprecipeblog.com/2014/11/thanksgiving-leftover-recipes-turkey-cranberry-wontons/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'In a small mixing bowl, combine cream cheese, turkey, and cranberry sauce and mix until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/turkey-raw-whole.jpg', u'id': 5165, u'name': u'whole turkey'}]}, {u'equipment': [], u'step': u'Place approximately 1 heaping teaspoon of filling in the middle of each wonton shell. Fold the bottom of the wonton shell up to make a triangle shape, securing the edges with a bit of water to make it stick.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Place under a dampened paper towel while you assemble the rest of the wontons.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat oil in a large frying pan over medium-high heat. The oil is hot enough when you dip the end of the wonton wrapper in it, and it sizzles.Fry each wonton until golden brown. Flip and fry the other side.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from pan and place on paper towels to absorb excess oil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Serve warm with additional cranberry sauce.', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Wontons works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Bellissima Sparkling ros\xe9 with a 4.5 out of 5 star rating seems like a good match. It costs about 24 dollars per bottle.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 41, u'instructions': u'In a small mixing bowl, combine cream cheese, turkey, and cranberry sauce and mix until smooth.Place approximately 1 heaping teaspoon of filling in the middle of each wonton shell. Fold the bottom of the wonton shell up to make a triangle shape, securing the edges with a bit of water to make it stick. Place under a dampened paper towel while you assemble the rest of the wontons.Heat oil in a large frying pan over medium-high heat. The oil is hot enough when you dip the end of the wonton wrapper in it, and it sizzles.Fry each wonton until golden brown. Flip and fry the other side. Remove from pan and place on paper towels to absorb excess oil. Serve warm with additional cranberry sauce.', u'spoonacularSourceUrl': u'https://spoonacular.com/turkey-cranberry-wontons-622044', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}