{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/211976-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 211976, u'veryPopular': False, u'lowFodmap': False, u'title': u'Salami & peppadew pizza', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 174.87, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'large pinch crushed chilli flakes', u'aisle': u'Spices and Seasonings', u'name': u'chilli flakes', u'metaInformation': [u'large', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1032009, u'unit': u'pinch'}, {u'originalString': u'500g pack bread mix', u'aisle': u'Baking', u'name': u'corn bread mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornbread.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 18022, u'unit': u'g'}, {u'originalString': u'1 tbsp flour or semolina', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tbsp'}, {u'originalString': u'140g mozzarella, cut into 3cm cubes', u'aisle': u'Cheese', u'name': u'mozzarella', u'metaInformation': [u'cut into 3cm cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 1026, u'unit': u'g'}, {u'originalString': u'handful oregano, leaves picked', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'leaves picked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'handful', u'unitShort': u'handful', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'handful'}, {u'originalString': u'1 small jar pizza tomato sauce (about 150g)', u'aisle': u'Canned and Jarred', u'name': u'pizza sauce', u'metaInformation': [u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 11549, u'unit': u'g'}, {u'originalString': u'1 red onion, thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'100g pack salami, sliced', u'aisle': u'Meat', u'name': u'salami', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 100.0, u'consistency': u'solid', u'id': 7071, u'unit': u'g'}], u'healthScore': 17.0, u'imageType': u'jpg', u'spoonacularScore': 79.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1813674/salami-and-peppadew-pizza', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 27, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 220.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 220C/200C fan/gas 7.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix the bread dough following pack instructions, keeping it light and sticky. Knead it for a few mins, then place in a covered, oiled bowl for 30 mins to rise at room temperature.Take the dough out and squash to knock out the air.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Roll out on a floured surface to fit the largest baking tray you have. Sprinkle flour or semolina over the tray, then place the dough on top.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Spread the tomato sauce over the dough, then scatter with the salami, peppadews, onion, chilli flakes, mozzarella and oregano.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salami.jpg', u'id': 7071, u'name': u'salami'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Bake for 12-15 mins or until the dough turns crusty and golden.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are great choices for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. The Story Winery, Sangiovese, Estate, Shenandoah Valley with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Aromas of raspberry, cherry, pie crust, tobacco and oak greet the nose. Dark cherries and raspberry predominate the palate with mild tannins and nice acidity. The finish is gentle and lasting Enjoy!', u'title': u'Story Winery, Sangiovese, Estate, Shenandoah Valley', u'price': u'$19.0', u'id': 469504, u'link': u'https://www.amazon.com/Story-Winery-Sangiovese-California-Shenandoah/dp/B00NMXHFNC', u'imageUrl': u'https://spoonacular.com/productImages/469504-312x231.jpg'}]}, u'aggregateLikes': 85, u'instructions': u'Heat oven to 220C/200C fan/gas 7. Mix the bread dough following pack instructions, keeping it light and sticky. Knead it for a few mins, then place in a covered, oiled bowl for 30 mins to rise at room temperature.Take the dough out and squash to knock out the air. Roll out on a floured surface to fit the largest baking tray you have. Sprinkle flour or semolina over the tray, then place the dough on top. Spread the tomato sauce over the dough, then scatter with the salami, peppadews, onion, chilli flakes, mozzarella and oregano. Bake for 12-15 mins or until the dough turns crusty and golden.', u'spoonacularSourceUrl': u'https://spoonacular.com/salami-peppadew-pizza-211976', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}