{u'recipes': [{u'sourceName': u'Foxes Love Lemons', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511928-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 511928, u'veryPopular': False, u'lowFodmap': False, u'title': u'Smoked Salmon & Avocado Mousse Phyllo Cups #LaMarcaSparkle', u'diets': [u'pescatarian'], u'preparationMinutes': 20, u'pricePerServing': 54.07, u'creditText': u'Foxes Love Lemons', u'extendedIngredients': [{u'originalString': u'2 ripe avocados, peeled and pitted', u'aisle': u'Produce', u'name': u'avocados', u'metaInformation': [u'pitted', u'ripe', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'3 chives, roughly chopped', u'aisle': u'Produce', u'name': u'chives', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11156, u'unit': u''}, {u'originalString': u'1 box (15 count) mini fillo (phyllo) shells, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'fillo shells', u'metaInformation': [u'mini', u'thawed', u'(15 count)', u'(phyllo)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mini-phyllo-shells.png', u'unitLong': u'box', u'unitShort': u'box', u'amount': 1.0, u'consistency': u'solid', u'id': 93817, u'unit': u'box'}, {u'originalString': u'2 ounces smoked salmon', u'aisle': u'Seafood', u'name': u'smoked salmon', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-salmon.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 15077, u'unit': u'ounces'}, {u'originalString': u'1/4 cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://foxeslovelemons.com/smoked-salmon-avocado-mousse-phyllo-cups-lamarcasparkle/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'In food processor, puree avocados and sour cream until smooth.  Using 3/4-inch round cutter, cut 15 circles from smoked salmon. Alternatively, just use a sharp knife to cut salmon into small squares or pieces. Use a star-tipped piping bag to pipe avocado mixture into phyllo shells, or use a small spoon to scoop it in. Top each phylllo shell with a piece of smoked salmon and chopped chives.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mini-phyllo-shells.png', u'id': 93817, u'name': u'mini filo shells'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-salmon.jpg', u'id': 15077, u'name': u'smoked salmon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fish can be paired with Pinot Grigio, Gruener Veltliner, and Pinot Noir. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Maso Canali Pinot Grigio. Reviewers quite like it with a 4.6 out of 5 star rating and a price of about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal.', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 352, u'instructions': u'In food processor, puree avocados and sour cream until smooth.  Using 3/4-inch round cutter, cut 15 circles from smoked salmon. Alternatively, just use a sharp knife to cut salmon into small squares or pieces. Use a star-tipped piping bag to pipe avocado mixture into phyllo shells, or use a small spoon to scoop it in. Top each phylllo shell with a piece of smoked salmon and chopped chives.', u'spoonacularSourceUrl': u'https://spoonacular.com/smoked-salmon-avocado-mousse-phyllo-cups-lamarcasparkle-511928', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 15, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}