{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/212319-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 90, u'id': 212319, u'veryPopular': False, u'lowFodmap': False, u'title': u'Fennel & potato gratin', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 118.61, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'250g cherry tomatoes, preferably on the vine', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'g'}, {u'originalString': u'2 fennel bulbs, trimmed', u'aisle': u'Produce', u'name': u'fennel bulbs', u'metaInformation': [u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11957, u'unit': u''}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'25g Parmesan (or vegetarian alternative), finely grated', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'finely grated', u'(or vegetarian alternative)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 25.0, u'consistency': u'solid', u'id': 1033, u'unit': u'g'}, {u'originalString': u'1kg floury potatoes, thinly sliced (see tip, below)', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'thinly sliced', u'(see tip, below)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'kg', u'unitShort': u'kg', u'amount': 1.0, u'consistency': u'solid', u'id': 11362, u'unit': u'kg'}, {u'originalString': u'300ml vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 300.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}], u'healthScore': 54.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipe/fennel-potato-gratin', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 180C/160C fan/gas 4.Quarter the fennel lengthways, andcut out and discard the root. Thinlyslice the fennel.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat 2 tbsp of the oilin a large frying pan, season the fenneland gently cook for about 5 mins untilstarting to soften.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Drizzle a little oil over the base ofa 1.5-litre gratin dish. Arrange half thepotatoes over the base, then season.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the fennel over, then cover withthe remaining potatoes.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fennel.jpg', u'id': 11957, u'name': u'fennel'}]}, {u'equipment': [], u'step': u'Pour over thestock, season and drizzle with theremaining oil. Scrunch a piece of bakingparchment around the edge of the dishto make a seal, then bake for 1 hr. Can bemade a few hours ahead up to this point.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove the dish from the oven andput the tomatoes on top. Scatter overthe Parmesan and return to the ovenfor 20 mins until the top is golden.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}]}], u'name': u''}], u'aggregateLikes': 10, u'instructions': u'Heat oven to 180C/160C fan/gas 4.Quarter the fennel lengthways, andcut out and discard the root. Thinlyslice the fennel. Heat 2 tbsp of the oilin a large frying pan, season the fenneland gently cook for about 5 mins untilstarting to soften.Drizzle a little oil over the base ofa 1.5-litre gratin dish. Arrange half thepotatoes over the base, then season.Spread the fennel over, then cover withthe remaining potatoes. Pour over thestock, season and drizzle with theremaining oil. Scrunch a piece of bakingparchment around the edge of the dishto make a seal, then bake for 1 hr. Can bemade a few hours ahead up to this point.Remove the dish from the oven andput the tomatoes on top. Scatter overthe Parmesan and return to the ovenfor 20 mins until the top is golden.', u'spoonacularSourceUrl': u'https://spoonacular.com/fennel-potato-gratin-212319', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 110, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}