{u'recipes': [{u'sourceName': u'My Recipes', u'cuisines': [u'japanes', u'asian'], u'image': u'https://spoonacular.com/recipeImages/864150-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 864150, u'veryPopular': True, u'lowFodmap': False, u'title': u'Ahi Sushi Cups', u'diets': [u'gluten free', u'pescatarian'], u'pricePerServing': 322.87, u'creditText': u'My Recipes', u'extendedIngredients': [{u'originalString': u'1 pound raw sushi-grade ahi tuna, cut into 1/2-inch cubes', u'aisle': u'Seafood', u'name': u'ahi tuna', u'metaInformation': [u'raw', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tuna-steak-or-ahi-tuna.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 15117, u'unit': u'pound'}, {u'originalString': u'1 large diced, peeled avocado', u'aisle': u'Produce', u'name': u'avocado', u'metaInformation': [u'diced', u'large', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9037, u'unit': u''}, {u'originalString': u'1/2 tablespoon black sesame seeds, lightly toasted', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'black sesame seeds', u'metaInformation': [u'black', u'lightly toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-sesame-seeds-or-chia-seeds.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'solid', u'id': 10012023, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon crushed red pepper', u'aisle': u'Spices and Seasonings', u'name': u'crushed red pepper', u'metaInformation': [u'red', u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup cubed, seeded, peeled cucumber', u'aisle': u'Produce', u'name': u'cucumber', u'metaInformation': [u'cubed', u'peeled', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11206, u'unit': u'cup'}, {u'originalString': u'1 teaspoon dark sesame oil', u'aisle': u'Ethnic Foods', u'name': u'dark sesame oil', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1004058, u'unit': u'teaspoon'}, {u'originalString': u'2 green onions, thinly sliced', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11291, u'unit': u''}, {u'originalString': u'1 tablespoon kosher salt, divided', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'tablespoon'}, {u'originalString': u'1 ounce 1/3-less-fat cream cheese, softened', u'aisle': u'Cheese', u'name': u'low fat cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 43274, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons lower-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'lower sodium soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'tablespoons'}, {u'originalString': u'8 teaspoons rice vinegar, divided', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 8.0, u'consistency': u'liquid', u'id': 1022053, u'unit': u'teaspoons'}, {u'originalString': u'1 tablespoon sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'tablespoon'}, {u'originalString': u'1 cup sushi rice, rinsed well', u'aisle': u'Pasta and Rice', u'name': u'sushi rice', u'metaInformation': [u'rinsed', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-white-uncooked.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10220054, u'unit': u'cup'}], u'healthScore': 36.0, u'imageType': u'jpg', u'spoonacularScore': 97.0, u'sourceUrl': u'http://www.myrecipes.com/recipe/ahi-sushi-cups', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine rice and 1 1/4 cups water in a medium saucepan over medium-high heat. Bring to a boil; reduce heat to low, cover, and cook 20 minutes or until liquid is absorbed (do not uncover while cooking).', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove pan from heat; let stand covered 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'While rice stands, combine 2 tablespoons vinegar and sugar in a small microwave-safe bowl; microwave on HIGH 30 to 45 seconds or until boiling. Stir mixture with a whisk until sugar dissolves.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add cream cheese and 1/2 tsp. salt to bowl, stirring with a whisk to combine. Gently fold vinegar mixture into rice using a rubber spatula; let stand 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u'Generously coat 12 muffin cups with cooking spray. Lightly coat each of 12 (5-inch square) parchment paper pieces with cooking spray; press paper squares into muffin cups to form a liner. Using moistened hands, press rice mixture evenly along bottom and sides of muffin cups (about 21/2 tablespoons rice per cup). Refrigerate 30 to 40 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine remaining 2 teaspoons vinegar, remaining 1/2 teaspoon salt, soy sauce, oil, and red pepper in a medium bowl, stirring with a whisk.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 2053, u'name': u'vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Add cucumber, tuna, onions, and avocado to bowl. Toss gently to combine.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cucumber.jpg', u'id': 11206, u'name': u'cucumber'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/avocado.jpg', u'id': 9037, u'name': u'avocado'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Divide tuna mixture evenly among rice cups; sprinkle evenly with sesame seeds. Gently remove cups from pan by lifting parchment paper edges.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-seeds.jpg', u'id': 12023, u'name': u'sesame seeds'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Riesling, Sake, and Sauvignon Blanc are my top picks for Sushi. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Chateau Ste. Michelle Dry Riesling. It has 4.5 out of 5 stars and a bottle costs about 10 dollars.", u'pairedWines': [u'riesling', u'sake', u'sauvignon blanc', u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'The Chateau Ste. Michelle Dry Riesling is a dry, crisp, refreshing style of Riesling with beautiful fruit flavors, crisp acidity and an elegant finish. It offers inviting floral and mandarin aromas with a clean finish. This is an incredibly versatile food wine and my favorite with oysters.', u'title': u'Chateau Ste. Michelle Dry Riesling', u'price': u'$9.99', u'id': 443227, u'link': u'https://www.wine.com/product/chateau-ste-michelle-dry-riesling-2012/125428', u'imageUrl': u'https://spoonacular.com/productImages/443227-312x231.jpg'}]}, u'aggregateLikes': 3374, u'instructions': u'Combine rice and 1 1/4 cups water in a medium saucepan over medium-high heat. Bring to a boil; reduce heat to low, cover, and cook 20 minutes or until liquid is absorbed (do not uncover while cooking). Remove pan from heat; let stand covered 10 minutes.                                                                                                While rice stands, combine 2 tablespoons vinegar and sugar in a small microwave-safe bowl; microwave on HIGH 30 to 45 seconds or until boiling. Stir mixture with a whisk until sugar dissolves. Add cream cheese and 1/2 tsp. salt to bowl, stirring with a whisk to combine. Gently fold vinegar mixture into rice using a rubber spatula; let stand 5 minutes.                                                                                                Generously coat 12 muffin cups with cooking spray. Lightly coat each of 12 (5-inch square) parchment paper pieces with cooking spray; press paper squares into muffin cups to form a liner. Using moistened hands, press rice mixture evenly along bottom and sides of muffin cups (about 21/2 tablespoons rice per cup). Refrigerate 30 to 40 minutes.                                                                                                Combine remaining 2 teaspoons vinegar, remaining 1/2 teaspoon salt, soy sauce, oil, and red pepper in a medium bowl, stirring with a whisk. Add cucumber, tuna, onions, and avocado to bowl. Toss gently to combine.                                                                                                Divide tuna mixture evenly among rice cups; sprinkle evenly with sesame seeds. Gently remove cups from pan by lifting parchment paper edges.', u'spoonacularSourceUrl': u'https://spoonacular.com/ahi-sushi-cups-864150', u'dishTypes': [u'lunch', u'antipasti', u'main course', u'starter', u'snack', u'appetizer', u'main dish', u'antipasto', u'dinner', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}