{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/604522-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 2, u'id': 604522, u'veryPopular': False, u'lowFodmap': False, u'title': u'White Chocolate Grapes', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 20, u'pricePerServing': 34.01, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 pound seedless grapes', u'aisle': u'Produce', u'name': u'grapes', u'metaInformation': [u'seedless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 9132, u'unit': u'pound'}, {u'originalString': u'1 cup finely chopped salted peanuts', u'aisle': u'Nuts;Savory Snacks', u'name': u'salted peanuts', u'metaInformation': [u'salted', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanuts.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 16092, u'unit': u'cup'}, {u'originalString': u'2 teaspoons shortening', u'aisle': u'Oil, Vinegar, Salad Dressing;Baking', u'name': u'shortening', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 4615, u'unit': u'teaspoons'}, {u'originalString': u'2 cups white chocolate chips', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 10019087, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 16.0, u'sourceUrl': u'http://allrecipes.com/Recipe/White-Chocolate-Grapes/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine the white chocolate chips and shortening in a small microwave-safe bowl.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'id': 10019087, u'name': u'white chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shortening.jpg', u'id': 4615, u'name': u'shortening'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Heat in the microwave for 30 second intervals, stirring between each, until melted and smooth.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Spread the chopped peanuts out on a piece of waxed paper or a dinner plate.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}], u'step': u'Dip clean, dry grapes into the chocolate, then roll in the peanuts. Set on waxed paper until dry. Warm chocolate as needed in the microwave to keep it liquid.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 58, u'instructions': u'Combine the white chocolate chips and shortening in a small microwave-safe bowl. Heat in the microwave for 30 second intervals, stirring between each, until melted and smooth. Spread the chopped peanuts out on a piece of waxed paper or a dinner plate.                            Dip clean, dry grapes into the chocolate, then roll in the peanuts. Set on waxed paper until dry. Warm chocolate as needed in the microwave to keep it liquid.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/white-chocolate-grapes-604522', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 22, u'servings': 20, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}