{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/201803-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 201803, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spam and Egg Breakfast Sandwiches', u'diets': [], u'pricePerServing': 80.46, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'4 Hawaiian sweet rolls or brioche buns, cut in half', u'aisle': u'Baking', u'name': u'brioche buns', u'metaInformation': [u'sweet', u'cut in half'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kaiser-roll.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10093730, u'unit': u''}, {u'originalString': u'2 tablespoons butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'4 slices Spam, each 1/4-inch thick', u'aisle': u'Meat', u'name': u'spam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spam.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 7908, u'unit': u'slices'}, {u'originalString': u'Pineapple, mango, or strawberry jelly, for spreading on the rolls', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'strawberry jelly', u'metaInformation': [u'for spreading on the rolls'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11019297, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2013/01/spam-and-egg-breakfast-sandwiches-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Melt 1 tablespoon of the butter in a large non-stick skillet over moderately high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the sweet rolls, cut side-down, into the skillet and cook until just toasted, 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the toasted rolls to a large platter, and spread the jelly onto each toasted side of the rolls.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-jelly.jpg', u'id': 19297, u'name': u'jelly'}]}, {u'equipment': [], u'step': u'2', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place the Spam slices into the skillet and fry until golden brown and crisp, 1 to 2 minutes per side.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spam.png', u'id': 7908, u'name': u'spam'}]}, {u'equipment': [], u'step': u'Transfer the Spam slices to the bottom halves of each sweet roll.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spam.png', u'id': 7908, u'name': u'spam'}]}, {u'equipment': [], u'step': u'3', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Reduce the heat to medium low, then melt the remaining butter in the skillet. Crack the eggs into the skillet, being careful not to break the yolks. Cover the skillet and fry the eggs just until the whites are set, 3 to 4 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Place the fried eggs on each slice of Spam, then drizzle the eggs with the Sriracha if using. Top each sandwich with the remaining sweet roll tops.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spam.png', u'id': 7908, u'name': u'spam'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 11, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 88, u'instructions': u'Procedures                                                                              1                                                                            Melt 1 tablespoon of the butter in a large non-stick skillet over moderately high heat. Place the sweet rolls, cut side-down, into the skillet and cook until just toasted, 1-2 minutes. Transfer the toasted rolls to a large platter, and spread the jelly onto each toasted side of the rolls.                                                                                                                            2                                                                            Place the Spam slices into the skillet and fry until golden brown and crisp, 1 to 2 minutes per side. Transfer the Spam slices to the bottom halves of each sweet roll.                                                                                                                            3                                                                            Reduce the heat to medium low, then melt the remaining butter in the skillet. Crack the eggs into the skillet, being careful not to break the yolks. Cover the skillet and fry the eggs just until the whites are set, 3 to 4 minutes. Place the fried eggs on each slice of Spam, then drizzle the eggs with the Sriracha if using. Top each sandwich with the remaining sweet roll tops. Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/spam-and-egg-breakfast-sandwiches-201803', u'dishTypes': [u'morning meal', u'brunch', u'breakfast'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}