{u'recipes': [{u'sourceName': u'The Healthy Foodie', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/551372-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 551372, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apple and Butternut Squash Pork Stew', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 354.61, u'creditText': u'The Healthy Foodie', u'extendedIngredients': [{u'originalString': u'1 cup unsweetened apple cider', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1009016, u'unit': u'cup'}, {u'originalString': u'2 tbsp arrowroot flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'arrowroot flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20003, u'unit': u'tbsp'}, {u'originalString': u'150g baby spinach leaves, roughly chopped', u'aisle': u'Produce', u'name': u'baby spinach leaves', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 150.0, u'consistency': u'solid', u'id': 11457, u'unit': u'g'}, {u'originalString': u'\xbd butternut squash, (about 2 cups) cut into bite size chunks', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'cut into bite size chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'2 large carrots, sliced', u'aisle': u'Produce', u'name': u'carrots', u'metaInformation': [u'large', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/carrots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11124, u'unit': u''}, {u'originalString': u'2 celery ribs, chopped', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'ribs', u'unitShort': u'rib', u'amount': 2.0, u'consistency': u'solid', u'id': 11143, u'unit': u'rib'}, {u'originalString': u'2 cups chicken stock', u'aisle': u'Canned and Jarred', u'name': u'chicken stock', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 6172, u'unit': u'cups'}, {u'originalString': u'1 cup full fat coconut milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'full fat coconut milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'\xbd tsp garam masala', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'garam masala', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garam-masala.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 93663, u'unit': u'tsp'}, {u'originalString': u'3 garlic cloves, smashed', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'smashed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'\xbc tsp ginger', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 11216, u'unit': u'tsp'}, {u'originalString': u'\xbc tsp ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'The juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'\xbd tsp freshly cracked black pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp Himalayan salt', u'aisle': u'Spices and Seasonings;Gourmet', u'name': u'pink himalayan salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/himalayan-pink-salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1032047, u'unit': u'tsp'}, {u'originalString': u'600g pork loin, cut into bite size pieces', u'aisle': u'Meat', u'name': u'pork loin', u'metaInformation': [u'cut into bite size pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pork-loin.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 600.0, u'consistency': u'solid', u'id': 10225, u'unit': u'g'}, {u'originalString': u'\xbd medium rutabaga, (about 2 cups) cut into bite size chunks', u'aisle': u'Produce', u'name': u'rutabaga', u'metaInformation': [u'medium', u'cut into bite size chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rutabaga.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11435, u'unit': u'cups'}, {u'originalString': u'1 star anise', u'aisle': u'Spices and Seasonings', u'name': u'star anise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/star-anise.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1012002, u'unit': u''}], u'healthScore': 82.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://thehealthyfoodie.com/apple-and-butternut-squash-pork-stew/', u'glutenFree': True, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Heat a little bit of cooking fat in a large, heavy saucepan set over high heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the pieces of meat and sear until golden on all sides. Stir in salt, pepper, garlic cloves, spices and apple cider. Bring to the boil then turn the heat down, cover and simmer on low for an hour to an hour and a half, until the meat is nice and tender.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'whole garlic cloves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'id': 1009016, u'name': u'apple cider'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add chicken stock, lime juice and chopped vegetables. Continue cooking until the vegetables are fork tender, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6172, u'name': u'chicken stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add chopped baby spinach leaves and continue cooking for another minute, until the spinach is wilted. In a small container, make a slurry by mixing the coconut milk and arrowroot together with a whisk, then add that to the stew. Stir well and bring back to the boil for a full minute to allow the arrowroot flour to fully cook and reach its full thickening power.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 11457, u'name': u'baby spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20003, u'name': u'arrowroot'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Serve piping hot with lime wedges, additional coconut milk and a generous pinch of hot chili pepper flakes, if desired', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Cabernet Sauvignon, Chablis, and Malbec are my top picks for Stew. Full-bodied red wines like malbec and cabernet sauvignon are the perfect accompaniment for beef stew. Fish stew probably calls for a white wine, such as chablis. One wine you could try is Groth Cabernet Sauvignon. It has 4.2 out of 5 stars and a bottle costs about 59 dollars.', u'pairedWines': [u'cabernet sauvignon', u'chablis', u'malbec'], u'productMatches': [{u'description': u'The 2006 Cabernet Sauvignon is big and lush with huge gobs of fruit in the aroma and flavor. The texture of the wine is soft and supple, typical of Cabernet Sauvignons grown in our area of the Oakville AVA. Patience during bottle aging will reward the "steward" with an outstanding bottle over the next 10 to 15 years.Try this Cabernet with a lamb loin marinated in olive oil and garden herbs with lemon mashed Yukon Gold potatoes and Swiss chard. View More', u'title': u'Groth Cabernet Sauvignon', u'price': u'$58.99', u'id': 442462, u'link': u'https://www.wine.com/product/groth-cabernet-sauvignon-2006/98801', u'imageUrl': u'https://spoonacular.com/productImages/442462-312x231.jpg'}]}, u'aggregateLikes': 62, u'instructions': u'Heat a little bit of cooking fat in a large, heavy saucepan set over high heat. Add the pieces of meat and sear until golden on all sides. Stir in salt, pepper, garlic cloves, spices and apple cider. Bring to the boil then turn the heat down, cover and simmer on low for an hour to an hour and a half, until the meat is nice and tender. Add chicken stock, lime juice and chopped vegetables. Continue cooking until the vegetables are fork tender, about 10 minutes. Add chopped baby spinach leaves and continue cooking for another minute, until the spinach is wilted. In a small container, make a slurry by mixing the coconut milk and arrowroot together with a whisk, then add that to the stew. Stir well and bring back to the boil for a full minute to allow the arrowroot flour to fully cook and reach its full thickening power. Serve piping hot with lime wedges, additional coconut milk and a generous pinch of hot chili pepper flakes, if desired', u'spoonacularSourceUrl': u'https://spoonacular.com/apple-and-butternut-squash-pork-stew-551372', u'dishTypes': [u'lunch', u'soup', u'main course', u'main dish', u'dinner'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}