{u'recipes': [{u'sourceName': u'Lifes Ambrosia', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/800621-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 800621, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lemon Pepper Chicken Salad Sandwich', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 83.66, u'creditText': u'Lifes Ambrosia', u'extendedIngredients': [{u'originalString': u'8 slices bread', u'aisle': u'Bakery/Bread', u'name': u'bread', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/croutons.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'solid', u'id': 18064, u'unit': u'slices'}, {u'originalString': u'1/2 cup diced celery', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11143, u'unit': u'cup'}, {u'originalString': u'1 teaspoon chopped fresh chives', u'aisle': u'Produce', u'name': u'fresh chives', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11156, u'unit': u'teaspoon'}, {u'originalString': u'1/4 teaspoon granulated garlic', u'aisle': u'Spices and Seasonings', u'name': u'granulated garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002020, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 teaspoon lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons lemon pepper seasoning', u'aisle': u'Spices and Seasonings', u'name': u'lemon pepper seasoning', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1012030, u'unit': u'teaspoons'}, {u'originalString': u'2 tablespoons mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tablespoons'}, {u'originalString': u'3 cups cooked shredded chicken', u'aisle': u'Meat', u'name': u'shredded chicken', u'metaInformation': [u'shredded', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rotisserie-chicken.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'liquid', u'id': 5348, u'unit': u'cups'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://www.lifesambrosia.com/lemon-pepper-chicken-salad-sandwich-recipe/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together greek yogurt, mayonnaise, lemon pepper seasoning, granulated garlic, lemon juice and chives. Fold in chicken and celery. Cover and refrigerate for at least 30 minutes. To assemble the sandwiches, spoon chicken salad on to a slice of bread and top with another slice.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemonpepper.jpg', u'id': 1012030, u'name': u'lemon pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'id': 1002020, u'name': u'granulated garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-chives.jpg', u'id': 11156, u'name': u'chives'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-bread.jpg', u'id': 18064, u'name': u'bread'}]}, {u'equipment': [], u'step': u'Serve.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Chehalem INOX Chardonnay with a 4.1 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"INOX\xae takes its name from the abbreviation of the French word for stainless steel, inoxydable. The wine was created differently from most Chardonnay you've had. We think we've succeeded in expressing the crisp, steely, and fruit-rich side that we love about some Old-World Chardonnays. What makes this possible is the use of exclusively Dijon clones, exceptionally well suited to Oregon's cool climate and exhibiting a richness that does not depend on oak. INOX screams of the hallmarks of a cool climate-brightness, pinpoint fruit, and explosive aromas and flavors. We intend INOX for a full range of use, from hot weather chilling to elegant dinner complements.Quintessential INOX, with lovely white aromas of gardenia and other flowers, peach, apricot, pear, pineapple, and green apple candy showing on the nose and palate; it shows a great balance with relatively low alcohol for the year and bright acid; the length is lovely and the weight rich, with a supple, silky texture; flavors linger, with cherry and peach accents. Very pleased. View More", u'title': u'Chehalem INOX Chardonnay', u'price': u'$12.99', u'id': 442371, u'link': u'https://www.wine.com/product/chehalem-inox-chardonnay-2009/109305', u'imageUrl': u'https://spoonacular.com/productImages/442371-312x231.jpg'}]}, u'aggregateLikes': 42, u'instructions': u'Whisk together greek yogurt, mayonnaise, lemon pepper seasoning, granulated garlic, lemon juice and chives. Fold in chicken and celery. Cover and refrigerate for at least 30 minutes. To assemble the sandwiches, spoon chicken salad on to a slice of bread and top with another slice. Serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/lemon-pepper-chicken-salad-sandwich-800621', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}