{u'recipes': [{u'sourceName': u'Jo Cooks', u'cuisines': [u'south american', u'latin american'], u'image': u'https://spoonacular.com/recipeImages/796978-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 14, u'id': 796978, u'veryPopular': False, u'lowFodmap': False, u'title': u'Carne Asada Tacos', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 223.02, u'creditText': u'Jo Cooks', u'extendedIngredients': [{u'originalString': u'1 tsp chili powder', u'aisle': u'Spices and Seasonings', u'name': u'chili powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2009, u'unit': u'tsp'}, {u'originalString': u'\xbc cup chopped cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'10 corn tortillas', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'2 lb flank steak', u'aisle': u'Meat', u'name': u'flank steak', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'liquid', u'id': 23657, u'unit': u'lb'}, {u'originalString': u'2 tbsp fresh cilantro, chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh cilantro', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11165, u'unit': u'tbsp'}, {u'originalString': u'3 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd cup chopped green onions', u'aisle': u'Produce', u'name': u'green onions', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11291, u'unit': u'cup'}, {u'originalString': u'1 tsp ground cumin', u'aisle': u'Spices and Seasonings', u'name': u'ground cumin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002014, u'unit': u'tsp'}, {u'originalString': u'1 tbsp honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tbsp'}, {u'originalString': u'1 jalapeno, minced', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'\xbc cup fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1 cup shredded cheese like Monterey Jack', u'aisle': u'Cheese', u'name': u'monterey jack cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1001025, u'unit': u'cup'}, {u'originalString': u'3 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'\xbe cup olives, chopped', u'aisle': u'Canned and Jarred', u'name': u'olives', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9195, u'unit': u'cup'}, {u'originalString': u'1 small red onion, chopped', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'small', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 10.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 tsp smoked paprika', u'aisle': u'Spices and Seasonings', u'name': u'smoked paprika', u'metaInformation': [u'smoked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012028, u'unit': u'tsp'}, {u'originalString': u'1 cup chopped tomatoes', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u'cup'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 87.0, u'sourceUrl': u'http://www.jocooks.com/recipes/carne-asada-tacos/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'In a large ziploc bag combine together the olive oil, lemon juice, honey, red onion, garlic, jalapeno, cumin, paprika, chili powder, cilantro, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2009, u'name': u'chili powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'id': 11979, u'name': u'jalapeno pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'id': 1002014, u'name': u'cumin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Add the flank steak to the bag, close the ziploc bag and shake the bag around a bit, making sure the steak is covered in the marinade.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flank-steak.jpg', u'id': 23657, u'name': u'flank steak'}]}, {u'equipment': [], u'step': u'Place it in the fridge and let it marinate for 2 to 4 hours.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat your grill till it gets to about 400 F degrees.Grill the steak for about 5 to 7 minutes per side or until done to your likeness.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Transfer it to a plate and cover it with aluminum foil.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u"Let it rest for about 5 minutes before slicing it into thin strips. If you slice it right away all the juices will come out and you'll end up with a dry steak.Assemble your tacos by filling each tortilla with some sliced steak, olives, chopped tomatoes, green onions, cilantro and some cheese.", u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spring-onions.jpg', u'id': 11291, u'name': u'green onions'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olives-mixed.jpg', u'id': 9195, u'name': u'olives'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Tacos works really well with Pinot Noir, Riesling, and Sparkling ros\xe9. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. The Siduri Sta. Rita Hills Pinot Noir with a 4.2 out of 5 star rating seems like a good match. It costs about 33 dollars per bottle.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The 2014 Sta. Rita Hills Pinot Noir is a blend of fruit from the John Sebastiano, Clos Pepe, Cargasacchi, and Lindley Vineyards. The actual blend is 64% John Sebastiano Vineyard Pinot Noir, 22% Clos Pepe, 9% Lindley, and 6% Cargasacchi. Clonally, this wine is a blend of 8 different clones which also provides for a wide range of flavors within one wine. The 2014 Pinot Noir Sta. Rita Hills should be a classic expression of the region, showing lots of spice, red fruit and dried soils aromas and flavors. Balanced, polished and elegant with plenty of fruit, it should certainly be an outstanding wine, and at the price, is an excellent value in Pinot Noir.', u'title': u'Siduri Sta. Rita Hills Pinot Noir', u'price': u'$32.99', u'id': 454206, u'link': u'https://www.wine.com/product/siduri-sta-rita-hills-pinot-noir-2014/168102', u'imageUrl': u'https://spoonacular.com/productImages/454206-312x231.jpg'}]}, u'aggregateLikes': 84, u'instructions': u"In a large ziploc bag combine together the olive oil, lemon juice, honey, red onion, garlic, jalapeno, cumin, paprika, chili powder, cilantro, salt and pepper. Add the flank steak to the bag, close the ziploc bag and shake the bag around a bit, making sure the steak is covered in the marinade. Place it in the fridge and let it marinate for 2 to 4 hours.Heat your grill till it gets to about 400 F degrees.Grill the steak for about 5 to 7 minutes per side or until done to your likeness. Transfer it to a plate and cover it with aluminum foil. Let it rest for about 5 minutes before slicing it into thin strips. If you slice it right away all the juices will come out and you'll end up with a dry steak.Assemble your tacos by filling each tortilla with some sliced steak, olives, chopped tomatoes, green onions, cilantro and some cheese.Serve immediately.", u'spoonacularSourceUrl': u'https://spoonacular.com/carne-asada-tacos-796978', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 29, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}