{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/595429-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 595429, u'veryPopular': True, u'lowFodmap': False, u'title': u'Red-Eye Burger', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 335.58, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'4 slices American cheese', u'aisle': u'Cheese', u'name': u'american cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 1253, u'unit': u'slices'}, {u'originalString': u'4 slices bacon', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'Pinch of freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'pinch'}, {u'originalString': u'1 teaspoon brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'teaspoon'}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'12 ounces 80/20 ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'ounces'}, {u'originalString': u'1 tablespoon instant coffee granules', u'aisle': u'Tea and Coffee', u'name': u'instant coffee granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 14214, u'unit': u'tablespoon'}, {u'originalString': u'1 teaspoon dry oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2028, u'unit': u'tablespoon'}, {u'originalString': u'\xbc teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 98940, u'unit': u''}, {u'originalString': u'Mayonnaise to spread on rolls', u'aisle': u'Bakery/Bread', u'name': u'sub rolls', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 98940, u'unit': u'servings'}], u'healthScore': 23.0, u'imageType': u'jpg', u'spoonacularScore': 91.0, u'sourceUrl': u'http://www.afamilyfeast.com/red-eye-burger/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 34, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook bacon until crisp and remove from pan.  Save the rendered bacon fat.In a medium bowl, mix paprika, brown sugar, coffee granules, oregano, salt and pepper.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-coffee-or-instant-espresso.png', u'id': 14214, u'name': u'instant coffee'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add beef and gently work spices in with beef. Do not over mix. Form into two patties.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Heat two pans over medium heat.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Brush some bacon fat in each pan.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the burgers to one and cook for 2-3 minutes on one side and flip while toasting the rolls in the other.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove rolls once done and brush in more bacon fat. Once you turn the burger, cook two eggs in the pan you just toasted the rolls in to your desired level of doneness.  Cook the burgers as you like them and add two slices of American cheese just before fully cooked. Leave burgers in pan just long enough to melt cheese.To serve, spread mayonnaise on rolls, then cheeseburgers, egg and finally bacon. Cover with roll top and serve with hot brewed coffee.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/american-cheese.jpg', u'id': 1253, u'name': u'american cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Burger works really well with Malbec, Merlot, and Zinfandel. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Gascon Malbec. It has 4.5 out of 5 stars and a bottle costs about 13 dollars.', u'pairedWines': [u'malbec', u'merlot', u'zinfandel'], u'productMatches': [{u'description': u'A classic expression of the grape, our Don Miguel Gasc\xf3n Malbec opens with intense aromas of blackberry, plum and a hint of mocha. On the palate, dark fruit flavors are finely intertwined with notes of spice, licorice and chocolate for a magnificent full-bodied Malbec. Round tannins and a plush mouthfeel lead the way to a long, velvety finish.', u'title': u'Gascon Malbec', u'price': u'$12.99', u'id': 437536, u'link': u'https://www.wine.com/product/gascon-malbec-2012/128058', u'imageUrl': u'https://spoonacular.com/productImages/437536-312x231.jpg'}]}, u'aggregateLikes': 1023, u'instructions': u'Cook bacon until crisp and remove from pan.  Save the rendered bacon fat.In a medium bowl, mix paprika, brown sugar, coffee granules, oregano, salt and pepper. Add beef and gently work spices in with beef. Do not over mix. Form into two patties. Heat two pans over medium heat. Brush some bacon fat in each pan. Add the burgers to one and cook for 2-3 minutes on one side and flip while toasting the rolls in the other. Remove rolls once done and brush in more bacon fat. Once you turn the burger, cook two eggs in the pan you just toasted the rolls in to your desired level of doneness.  Cook the burgers as you like them and add two slices of American cheese just before fully cooked. Leave burgers in pan just long enough to melt cheese.To serve, spread mayonnaise on rolls, then cheeseburgers, egg and finally bacon. Cover with roll top and serve with hot brewed coffee.', u'spoonacularSourceUrl': u'https://spoonacular.com/red-eye-burger-595429', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}