{u'recipes': [{u'sourceName': u'Peanut Butter and Peepers', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/511478-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 511478, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tomato and Wild Blue Shrimp Pasta for Two', u'diets': [u'dairy free', u'pescatarian'], u'preparationMinutes': 5, u'pricePerServing': 334.05, u'creditText': u'Peanut Butter and Peepers', u'extendedIngredients': [{u'originalString': u'4 oz cooked spaghetti', u'aisle': u'Pasta and Rice', u'name': u'cooked spaghetti', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 11420421, u'unit': u'oz'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'1 tsp. basil infused olive oil or regular olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'1/4 cup onion, diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'16 oz jar of Tomato Smash or your favorite tomato pasta sauce', u'aisle': u'Pasta and Rice', u'name': u'pasta sauce', u'metaInformation': [u'your favorite'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 16.0, u'consistency': u'solid', u'id': 10011549, u'unit': u'oz'}, {u'originalString': u'8 oz Wild Blue Shrimp, uncooked', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'wild', u'blue', u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'oz'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.peanutbutterandpeppers.com/2013/01/04/tomato-and-wild-blue-shrimp-pasta-for-two/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook pasta according to manufactures direction. When you add the pasta in your boiling water, start cooking the shrimp.In a large skillet add olive oil, onion and garlic.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Saute for about 2 minutes until vegetables are slightly tender.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add shrimp and cook until no longer pink.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [], u'step': u'Add Tomato Smash or pasta sauce and heat until sauce is warm.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 10011549, u'name': u'pasta sauce'}]}, {u'equipment': [], u'step': u'Serve over cooked pasta or spaghetti squash', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20421, u'name': u'cooked pasta'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 100, u'instructions': u'Cook pasta according to manufactures direction. When you add the pasta in your boiling water, start cooking the shrimp.In a large skillet add olive oil, onion and garlic. Saute for about 2 minutes until vegetables are slightly tender. Add shrimp and cook until no longer pink. Add Tomato Smash or pasta sauce and heat until sauce is warm.Serve over cooked pasta or spaghetti squash', u'spoonacularSourceUrl': u'https://spoonacular.com/tomato-and-wild-blue-shrimp-pasta-for-two-511478', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}