{u'recipes': [{u'sourceName': u"Lexi's Clean Kitchen", u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/801199-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 801199, u'veryPopular': False, u'lowFodmap': False, u'title': u'Broccoli Rabe and Sausage Pasta', u'diets': [u'gluten free', u'primal'], u'preparationMinutes': 15, u'pricePerServing': 157.84, u'creditText': u"Lexi's Clean Kitchen", u'extendedIngredients': [{u'originalString': u'1 bunch broccoli rabe', u'aisle': u'Produce', u'name': u'broccoli rabe', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-rabe.jpg', u'unitLong': u'bunch', u'unitShort': u'bunch', u'amount': 1.0, u'consistency': u'solid', u'id': 11096, u'unit': u'bunch'}, {u'originalString': u'1 tablespoon chopped fresh parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoon'}, {u'originalString': u'2 garlic cloves, minced', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 hot Italian sausage links, casings removed', u'aisle': u'Meat', u'name': u'italian sausage links', u'metaInformation': [u'italian', u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-sausage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 7036, u'unit': u''}, {u'originalString': u'\xbd cup low-sodium chicken broth', u'aisle': u'Canned and Jarred', u'name': u'low sodium chicken broth', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6970, u'unit': u'cup'}, {u'originalString': u'\xbd teaspoon dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2027, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'2 parsnips, peeled, spiralized with blade d, noodles trimmed', u'aisle': u'Produce', u'name': u'parsnips', u'metaInformation': [u'with blade d, noodles trimmed', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11298, u'unit': u''}, {u'originalString': u'\xbc teaspoon red pepper flakes', u'aisle': u'Spices and Seasonings', u'name': u'red pepper flakes', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 34.0, u'imageType': u'jpg', u'spoonacularScore': 90.0, u'sourceUrl': u'http://lexiscleankitchen.com/2016/09/07/broccoli-rabe-sausage-pasta-recipe/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 8, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Rinse the broccoli rabe and pat dry.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-rabe.jpg', u'id': 11096, u'name': u'broccoli rabe'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/peeler.png', u'id': 404693, u'name': u'peeler'}], u'step': u'Cut off most of the stems (the thickest parts). Using a vegetable peeler, pull some skin off the stems, and continue to until you hit the leaves. Chop into 1-inch pieces and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'Place a large skillet over medium heat. When water flicked onto the skillet sizzles, add the sausage and oregano and cook, breaking up the meat with a wooden spoon, for 6 to 8 minutes or until browned and cooked through. Using tongs or a slotted spoon, transfer the sausage to a plate.Immediately add the broccoli rabe, parsnip noodles, garlic, and red pepper flakes to the skillet. Season with salt and black pepper, then add the broth. Cook until the broth has reduced and the parsnip noodles are al dente, about 5 minutes.Return the sausage to the skillet, add the cheese, and stir to combine.', u'length': {u'number': 11, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'id': 1032009, u'name': u'red pepper flakes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli-rabe.jpg', u'id': 11096, u'name': u'broccoli rabe'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsnip.jpg', u'id': 11298, u'name': u'parsnip'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Remove from the heat and toss the ingredients to combine fully.Divide among four plates, garnish with the parsley, and serve.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 25, u'instructions': u'Rinse the broccoli rabe and pat dry. Cut off most of the stems (the thickest parts). Using a vegetable peeler, pull some skin off the stems, and continue to until you hit the leaves. Chop into 1-inch pieces and set aside.Place a large skillet over medium heat. When water flicked onto the skillet sizzles, add the sausage and oregano and cook, breaking up the meat with a wooden spoon, for 6 to 8 minutes or until browned and cooked through. Using tongs or a slotted spoon, transfer the sausage to a plate.Immediately add the broccoli rabe, parsnip noodles, garlic, and red pepper flakes to the skillet. Season with salt and black pepper, then add the broth. Cook until the broth has reduced and the parsnip noodles are al dente, about 5 minutes.Return the sausage to the skillet, add the cheese, and stir to combine. Remove from the heat and toss the ingredients to combine fully.Divide among four plates, garnish with the parsley, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/broccoli-rabe-and-sausage-pasta-801199', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}