{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/214750-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 214750, u'veryPopular': False, u'lowFodmap': False, u'title': u'Lentil & lamb moussaka', u'diets': [u'gluten free'], u'preparationMinutes': 15, u'pricePerServing': 188.24, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'1 aubergine, diced', u'aisle': u'Produce', u'name': u'aubergine', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'400g can chopped tomatoes', u'aisle': u'Canned and Jarred', u'name': u'canned tomatoes', u'metaInformation': [u'chopped', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomatoes-canned.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'solid', u'id': 10011693, u'unit': u'g'}, {u'originalString': u'\xbd tsp cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 garlic clove, crushed', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'500g tub Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'liquid', u'id': 1256, u'unit': u'g'}, {u'originalString': u'250g lean minced lamb', u'aisle': u'Meat', u'name': u'lamb', u'metaInformation': [u'lean', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 10017224, u'unit': u'g'}, {u'originalString': u'1 tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tbsp'}, {u'originalString': u'1 onion, chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 tsp dried oregano', u'aisle': u'Produce;Spices and Seasonings', u'name': u'oregano', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2027, u'unit': u'tsp'}, {u'originalString': u'500g cooked potatoes, diced', u'aisle': u'Produce', u'name': u'potatoes', u'metaInformation': [u'diced', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 500.0, u'consistency': u'solid', u'id': 11362, u'unit': u'g'}, {u'originalString': u'150ml hot vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'hot'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 150.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'ml'}, {u'originalString': u'400g can lentils in water, drained', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 400.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'g'}], u'healthScore': 20.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1162663/lentil-and-lamb-moussaka', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large frying pan.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion and cook for 3 minsuntil starting to colour and soften.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the garlic, aubergine and lamb,then cook for 5-10 mins until themince is brown and the aubergineis softened.Stir in the lentils, tomatoes,potatoes, oregano, cinnamon,some seasoning and the stock.Increase the heat and simmerfor 10-15 mins until the mixturethickens.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 1042027, u'name': u'seasoning'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/potatoes-yukon-gold.jpg', u'id': 11362, u'name': u'potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oregano.jpg', u'id': 2027, u'name': u'oregano'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'id': 10017224, u'name': u'lamb'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Heat grill to high.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer thelentil and lamb mix to an ovenproofdish.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'id': 10017224, u'name': u'lamb'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/grill.jpg', u'id': 404706, u'name': u'grill'}], u'step': u'Mix the Greek yogurt with thebeaten egg, then pour on top of thelentil and lamb mix. Grill for 5 minsuntil the top is bubbling and golden.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lamb-shanks.jpg', u'id': 10017224, u'name': u'lamb'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Moussaka can be paired with Assyrtiko and Moschofilero. If you feel like going Greek with your Greek food, assyrtiko and moschofilero are both lovely white wines to pair with chicken, seafood, etc. Agiorgitiko is a full bodied red suitable for roasted meats and lamb. One wine you could try is Sigalas Assyrtiko Santorini. It has 4.2 out of 5 stars and a bottle costs about 22 dollars.', u'pairedWines': [u'assyrtiko', u'moschofilero'], u'productMatches': [{u'description': u'Straw blonde color with light shades of green, with a subtle nose ofcitrus fruit. Excellent structure with a depth of flavor and high acidity, which brings the flavors to the front and adds freshness, with a lasting after-taste. Has the characteristic minerally taste of an world class Assyrtiko.', u'title': u'Sigalas Assyrtiko Santorini', u'price': u'$21.99', u'id': 438698, u'link': u'https://www.wine.com/product/sigalas-assyrtiko-santorini-2015/151225', u'imageUrl': u'https://spoonacular.com/productImages/438698-312x231.jpg'}]}, u'aggregateLikes': 73, u'instructions': u'Heat the oil in a large frying pan.Add the onion and cook for 3 minsuntil starting to colour and soften.Add the garlic, aubergine and lamb,then cook for 5-10 mins until themince is brown and the aubergineis softened.Stir in the lentils, tomatoes,potatoes, oregano, cinnamon,some seasoning and the stock.Increase the heat and simmerfor 10-15 mins until the mixturethickens.Heat grill to high. Transfer thelentil and lamb mix to an ovenproofdish. Mix the Greek yogurt with thebeaten egg, then pour on top of thelentil and lamb mix. Grill for 5 minsuntil the top is bubbling and golden.', u'spoonacularSourceUrl': u'https://spoonacular.com/lentil-lamb-moussaka-214750', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}