{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/286358-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 286358, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sweet Potato Gnocchi with Maple Cinnamon Sage Brown Butter', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 40, u'pricePerServing': 76.03, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/4 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'20 fresh sage leaves', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage leaves', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 2038, u'unit': u''}, {u'originalString': u'1 teaspoon ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 1/2 teaspoons salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoons'}, {u'originalString': u'2/3 cup whole milk ricotta cheese', u'aisle': u'Cheese', u'name': u'skim milk ricotta cheese', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 93630, u'unit': u'cup'}, {u'originalString': u'2 pounds sweet potatoes', u'aisle': u'Produce', u'name': u'sweet potatoes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 11507, u'unit': u'pounds'}, {u'originalString': u'1/2 cup unsalted butter (1 stick)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(1 stick)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}], u'healthScore': 4.0, u'imageType': u'jpeg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/sweet-potato-gnocchi-with-maple-cinnamon-sage-brown-butter-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 425.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the Gnocchi: Preheat the oven to 425 degrees F.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Pierce the sweet potato with a fork.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Bake the sweet potatoes until tender and fully cooked, between 40 to 55 minutes depending on size. Cool slightly.', u'length': {u'number': 40, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/measuring-cup.jpg', u'id': 404766, u'name': u'measuring cup'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Cut in half and scoop the flesh into a large bowl. Mash the sweet potatoes and transfer to a large measuring cup to make sure the sweet potatoes measure about 2 cups.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer the mashed sweet potatoes back to the large bowl.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}]}, {u'equipment': [], u'step': u'Add the ricotta cheese, salt, cinnamon, and pepper and blend until well mixed.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the flour, 1/2 cup at a time until a soft dough forms. Lightly flour a work surface and place the dough in a ball on the work surface. Divide the dough into 6 equal balls.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Roll out each ball into a 1-inch wide rope.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each rope into 1-inch pieces.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Roll the gnocchi over the tines of a fork.', u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Transfer the formed gnocchi to a large baking sheet. Continue with the remaining gnocchi.', u'number': 12, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Meanwhile, bring a large pot of salted water to a boil over high heat.', u'number': 13, u'ingredients': []}, {u'equipment': [], u'step': u'Add the gnocchi in 3 batches and cook until tender but still firm to the bite, stirring occasionally, about 5 to 6 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 14, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Drain the gnocchi using a slotted spoon onto a baking sheet. Tent with foil to keep warm and continue with the remaining gnocchi.', u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'For the Brown Butter sauce: While the gnocchi are cooking melt the butter in a large saute pan over medium heat. When the butter has melted add the sage leaves. Continue to cook, swirling the butter occasionally, until the foam subsides and the milk solids begin to brown.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat. Stir in the cinnamon, maple syrup, salt, and pepper. Careful, the mixture will bubble up. Gently stir the mixture. When the bubbles subside, toss the cooked gnocchi in the brown butter.', u'number': 17, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Transfer the gnocchi to a serving dish and serve immediately.', u'number': 18, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Verdicchio, Trebbiano, and Chianti are great choices for Gnocchi. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. The Sartarelli Verdicchio Classico with a 3.2 out of 5 star rating seems like a good match. It costs about 13 dollars per bottle.', u'pairedWines': [u'verdicchio', u'trebbiano', u'chianti'], u'productMatches': [{u'description': u'Vinification: sourced from 3 vineyards, soft pressing and temperature controlled fermentation in stainless steel lasting 3-4 weeks, partial malolactic.Aging: 6 months in stainless steel before bottling.TASTING NOTES: Nutty, discrete aromas of pit fruits, smoke and minerals, rich and dry, intensely flavored; finishes with floral and herbal notes.', u'title': u'Sartarelli Verdicchio Classico', u'price': u'$12.99', u'id': 434907, u'link': u'https://www.wine.com/product/sartarelli-verdicchio-classico-2000/52251', u'imageUrl': u'https://spoonacular.com/productImages/434907-312x231.jpg'}]}, u'aggregateLikes': 16, u'instructions': u'Watch how to make this recipe.                    For the Gnocchi: Preheat the oven to 425 degrees F.                          Pierce the sweet potato with a fork. Bake the sweet potatoes until tender and fully cooked, between 40 to 55 minutes depending on size. Cool slightly. Cut in half and scoop the flesh into a large bowl. Mash the sweet potatoes and transfer to a large measuring cup to make sure the sweet potatoes measure about 2 cups. Transfer the mashed sweet potatoes back to the large bowl. Add the ricotta cheese, salt, cinnamon, and pepper and blend until well mixed. Add the flour, 1/2 cup at a time until a soft dough forms. Lightly flour a work surface and place the dough in a ball on the work surface. Divide the dough into 6 equal balls. Roll out each ball into a 1-inch wide rope. Cut each rope into 1-inch pieces. Roll the gnocchi over the tines of a fork. Transfer the formed gnocchi to a large baking sheet. Continue with the remaining gnocchi.                          Meanwhile, bring a large pot of salted water to a boil over high heat. Add the gnocchi in 3 batches and cook until tender but still firm to the bite, stirring occasionally, about 5 to 6 minutes. Drain the gnocchi using a slotted spoon onto a baking sheet. Tent with foil to keep warm and continue with the remaining gnocchi.                          For the Brown Butter sauce: While the gnocchi are cooking melt the butter in a large saute pan over medium heat. When the butter has melted add the sage leaves. Continue to cook, swirling the butter occasionally, until the foam subsides and the milk solids begin to brown. Remove the pan from the heat. Stir in the cinnamon, maple syrup, salt, and pepper. Careful, the mixture will bubble up. Gently stir the mixture. When the bubbles subside, toss the cooked gnocchi in the brown butter. Transfer the gnocchi to a serving dish and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-potato-gnocchi-with-maple-cinnamon-sage-brown-butter-286358', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}