{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/471300-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 471300, u'veryPopular': False, u'lowFodmap': True, u'title': u'Magical Egg Salad', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'whole 30', u'ketogenic'], u'preparationMinutes': 15, u'pricePerServing': 107.3, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 pinch cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'pinch'}, {u'originalString': u'2 tablespoons Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon dried dill weed', u'aisle': u'Spices and Seasonings', u'name': u'dried dill weed', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2017, u'unit': u'teaspoon'}, {u'originalString': u'5 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'3 tablespoons mayonnaise', u'aisle': u'Condiments', u'name': u'mayonnaise', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 4025, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon paprika', u'aisle': u'Spices and Seasonings', u'name': u'paprika', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2028, u'unit': u'teaspoon'}, {u'originalString': u'salt and ground black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 teaspoon steak sauce', u'aisle': u'Condiments', u'name': u'steak sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 27048, u'unit': u'teaspoon'}, {u'originalString': u'2 tablespoons sweet pickle relish', u'aisle': u'Condiments', u'name': u'sweet pickle relish', u'metaInformation': [u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pickle-relish.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11945, u'unit': u'tablespoons'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 54.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Magical-Egg-Salad/Detail.aspx?src=rss', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place eggs in a saucepan and cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Remove eggs from hot water, cool under cold running water, and peel.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Chop eggs and transfer to a large bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Stir mayonnaise, Dijon mustard, sweet pickle relish, steak sauce, paprika, and dill into eggs until well mixed; season with salt and black pepper. Cover and refrigerate until chilled, if desired.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'id': 1002046, u'name': u'dijon mustard'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 27048, u'name': u'steak sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mayonnaise.jpg', u'id': 4025, u'name': u'mayonnaise'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/paprika.jpg', u'id': 2028, u'name': u'paprika'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Sprinkle with cayenne pepper before serving.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'cayenne pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 148, u'instructions': u'Place eggs in a saucepan and cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.                            Chop eggs and transfer to a large bowl.                            Stir mayonnaise, Dijon mustard, sweet pickle relish, steak sauce, paprika, and dill into eggs until well mixed; season with salt and black pepper. Cover and refrigerate until chilled, if desired.                            Sprinkle with cayenne pepper before serving.                                                Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/magical-egg-salad-471300', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': True, u'readyInMinutes': 60, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}