{u'recipes': [{u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/610013-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'id': 610013, u'veryPopular': False, u'lowFodmap': False, u'title': u'Doro Wot (Ethiopian National Chicken Dish)', u'diets': [], u'pricePerServing': 582.37, u'extendedIngredients': [{u'originalString': u'1/2 pound barley flour', u'aisle': u'Baking', u'name': u'barley flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-flour.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 20130, u'unit': u'pound'}, {u'originalString': u'1 1/2 cups berbere (Ethiopian spice mixture which includes chile pepper, garlic, ginger, dried basil, Ethiopian cardamom, black and white pepper, fenugreek and rue, a bitter shrub)', u'aisle': u'Spices and Seasonings', u'name': u'berbere', u'metaInformation': [u'dried', u'white', u'black', u'(Ethiopian spice mixture which includes chile pepper, garlic, ginger, basil, Ethiopian cardamom, and pepper, fenugreek and rue, a bitter shrub)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 98995, u'unit': u'cups'}, {u'originalString': u'1/3 cup bishop seed (also known as ajwain, similar to thyme)', u'aisle': u'Health Foods', u'name': u'chia seed', u'metaInformation': [u'(also known as ajwain, similar to thyme)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 12006, u'unit': u'cup'}, {u'originalString': u'1/3 cup black cumin', u'aisle': u'Spices and Seasonings', u'name': u'cumin', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-cumin.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1002014, u'unit': u'cup'}, {u'originalString': u'1/2 cup fresh ginger, finely ground', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11216, u'unit': u'cup'}, {u'originalString': u'1/2 cup fresh garlic, finely ground', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'fresh', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11215, u'unit': u'cup'}, {u'originalString': u'6 peeled hard-boiled eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'hard-boiled eggs', u'metaInformation': [u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1129, u'unit': u''}, {u'originalString': u'Lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'servings'}, {u'originalString': u'2 large red onions, finely chopped', u'aisle': u'Produce', u'name': u'red onions', u'metaInformation': [u'red', u'large', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011282, u'unit': u''}, {u'originalString': u'Salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'1/3 cup cardamom seeds', u'aisle': u'Savory Snacks', u'name': u'seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sunflower-seeds.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 93818, u'unit': u'cup'}, {u'originalString': u'2 pounds skinless chicken legs', u'aisle': u'Meat', u'name': u'skinless chicken legs', u'metaInformation': [u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-drumsticks.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 2.0, u'consistency': u'solid', u'id': 5080, u'unit': u'pounds'}, {u'originalString': u'1 1/2 pounds teff flour', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'teff flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/teff-flour.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'solid', u'id': 93760, u'unit': u'pounds'}, {u'originalString': u'6 pounds unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'pounds'}, {u'originalString': u'1/4 cup wheat flour', u'aisle': u'Baking', u'name': u'wheat flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1/3 cup koseret (dried woodsy flavored herb, dried oregano can be substituted)', u'aisle': u'?', u'name': u'koseret', u'metaInformation': [u'dried', u' woodsy flavored', u'canned', u'( herb, oregano can be substituted)'], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'unit': u'cup'}], u'healthScore': 16.0, u'imageType': u'jpeg', u'spoonacularScore': 75.0, u'sourceUrl': u'http://www.cookingchanneltv.com/recipes/doro-wot-ethiopian-national-chicken-dish.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 95, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Wash and soak the chicken in cold water with lemon squeezed into it for 30 minutes. (This removes any bacteria and tenderizes the meat.)Caramelize the red onions on low heat in a large pot for 1 hour.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'id': 10011282, u'name': u'red onion'}]}, {u'equipment': [], u'step': u'Add the berbere, Niter Kibbeh, garlic and ginger and cook for 30 minutes on medium-low heat.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spices.png', u'id': 98995, u'name': u'berbere'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}]}, {u'equipment': [], u'step': u'Add the marinated chicken and cook on medium-low heat, 30 to 45 minutes.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add in the hard-boiled eggs and salt to taste. Simmer on low heat for an additional 10 minutes and serve on the Injera.This recipe was provided by a professional chef or restaurant and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hard-boiled-egg.jpg', u'id': 1129, u'name': u'hard boiled egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The CalNaturale Chardonnay Lodi with a 4.1 out of 5 star rating seems like a good match. It costs about 11 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'fruit , citrus , crisp', u'title': u'CalNaturale Chardonnay Lodi', u'price': u'$10.99', u'id': 430688, u'link': u'https://www.amazon.com/2014-CalNaturale-Chardonnay-Lodi-1-0/dp/B00DBF4NJK', u'imageUrl': u'https://spoonacular.com/productImages/430688-312x231.jpg'}]}, u'aggregateLikes': 93, u'instructions': u'Wash and soak the chicken in cold water with lemon squeezed into it for 30 minutes. (This removes any bacteria and tenderizes the meat.)Caramelize the red onions on low heat in a large pot for 1 hour. Add the berbere, Niter Kibbeh, garlic and ginger and cook for 30 minutes on medium-low heat. Add the marinated chicken and cook on medium-low heat, 30 to 45 minutes. Add in the hard-boiled eggs and salt to taste. Simmer on low heat for an additional 10 minutes and serve on the Injera.This recipe was provided by a professional chef or restaurant and may have been scaled down from a bulk recipe. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.', u'spoonacularSourceUrl': u'https://spoonacular.com/doro-wot-ethiopian-national-chicken-dish-610013', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}