{u'recipes': [{u'sourceName': u'White Lights On Wednesday', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/592857-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 592857, u'veryPopular': True, u'lowFodmap': False, u'title': u'Inside Out Buckeye Oreo Cookie Balls', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 20.53, u'creditText': u'White Lights On Wednesday', u'extendedIngredients': [{u'originalString': u'8 ounces cream cheese, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 package OREO cookies, finely crushed (36 cookies)', u'aisle': u'Sweet Snacks', u'name': u'oreo cookies', u'metaInformation': [u'crushed', u'finely', u'(36 cookies)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'liquid', u'id': 10018166, u'unit': u'package'}, {u'originalString': u"2 bags Reese's Peanut Butter Chips (regular peanut butter cannot be substituted)", u'aisle': u'Baking', u'name': u'peanut butter chips', u'metaInformation': [u'(regular peanut butter cannot be substituted)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'unitLong': u'bags', u'unitShort': u'bags', u'amount': 2.0, u'consistency': u'solid', u'id': 93762, u'unit': u'bags'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.whitelightsonwednesday.com/2013/11/inside-out-buckeye-oreo-cookie-balls/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, mix cream cheese and cookie crumbs until blended.Portion Oreo mixture into tablespoon sized cookie balls onto waxed paper-lined baking sheets. Using your hands, roll each portion into a ball. Freeze for 10 minutes.Melt peanut butter chips in a double-boiler. Dip balls in melted peanut butter chips, being sure to leave some of the chocolate showing at the top for that Buckeye look.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peanut-butter-or-butterscotch-chips.jpg', u'id': 93762, u'name': u'peanut butter chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/oreos.png', u'id': 10018166, u'name': u'oreo cookies'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the cookie balls back onto the baking sheets. Refrigerate for 1 hour or until firm.', u'number': 2, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 755, u'instructions': u'In a large bowl, mix cream cheese and cookie crumbs until blended.Portion Oreo mixture into tablespoon sized cookie balls onto waxed paper-lined baking sheets. Using your hands, roll each portion into a ball. Freeze for 10 minutes.Melt peanut butter chips in a double-boiler. Dip balls in melted peanut butter chips, being sure to leave some of the chocolate showing at the top for that Buckeye look.Place the cookie balls back onto the baking sheets. Refrigerate for 1 hour or until firm.', u'spoonacularSourceUrl': u'https://spoonacular.com/inside-out-buckeye-oreo-cookie-balls-592857', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 36, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}