{u'recipes': [{u'sourceName': u'Will Cook for Smiles', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/623288-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 480, u'id': 623288, u'veryPopular': False, u'lowFodmap': False, u'title': u'Crock Pot Mulled Green Apple Cider', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 54.96, u'creditText': u'Will Cook for Smiles', u'extendedIngredients': [{u'originalString': u'2 cinnamon sticks (about 3 inches each)', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon sticks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'inches', u'unitShort': u'inches', u'amount': 6.0, u'consistency': u'solid', u'id': 1002010, u'unit': u'inches'}, {u'originalString': u'6 large green apples', u'aisle': u'Produce', u'name': u'green apples', u'metaInformation': [u'green', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}, {u'originalString': u'Juice from 1 orange', u'aisle': u'Beverages', u'name': u'juice of orange', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9206, u'unit': u''}, {u'originalString': u'1 whole nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u''}, {u'originalString': u'\xbd Tbsp vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'Tbsp'}, {u'originalString': u'12 cups of water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 12.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 tsp whole allspice berries', u'aisle': u'Spices and Seasonings', u'name': u'whole allspice berries', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-berries.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002001, u'unit': u'tsp'}, {u'originalString': u"5 packets of Sweet'N Low", u'aisle': u'?', u'name': u"sweet'n low", u'metaInformation': [], u'unitLong': u'packets', u'unitShort': u'packets', u'amount': 5.0, u'unit': u'packets'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 26.0, u'sourceUrl': u'http://www.willcookforsmiles.com/2014/12/crock-pot-mulled-green-apple-cider.html', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u"Cut apples in large chunks and place them in the crock pot. Don't peel or core the apples.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Add water, vanilla, and spices. Squeeze in orange juice. Stir well', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Close the lid and cook for 6-8 hours, on low, until apples are falling apart.Cool until easy to handle.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Cut folded cheese cloth in half and place it over a large strainer.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/cheesecloth.jpg', u'id': 404647, u'name': u'cheesecloth'}], u'step': u'Pour half the mixture in slowly. Bring edges of the cheese cloth together and squeeze as much liquid out as possible. Discard the cheese cloth with apple leftovers and repeat with remaining cider and the other half of the cheese cloth. (You may have to do it in three batches.)', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 12, u'instructions': u"Cut apples in large chunks and place them in the crock pot. Don't peel or core the apples.Add water, vanilla, and spices. Squeeze in orange juice. Stir wellClose the lid and cook for 6-8 hours, on low, until apples are falling apart.Cool until easy to handle.Cut folded cheese cloth in half and place it over a large strainer. Pour half the mixture in slowly. Bring edges of the cheese cloth together and squeeze as much liquid out as possible. Discard the cheese cloth with apple leftovers and repeat with remaining cider and the other half of the cheese cloth. (You may have to do it in three batches.)", u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-mulled-green-apple-cider-623288', u'dishTypes': [u'beverage', u'drink'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 485, u'servings': 12, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}