{u'recipes': [{u'sourceName': u'Food Republic', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/492522-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 492522, u'veryPopular': False, u'lowFodmap': False, u'title': u'Ultimate Brunch Pizza', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 379.43, u'creditText': u'Food Republic', u'extendedIngredients': [{u'originalString': u'1/2 pound asparagus, broccoli or spinach, cooked', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11011, u'unit': u'pound'}, {u'originalString': u'4 large eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large', u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1/2 batch pizza dough', u'aisle': u'Refrigerated', u'name': u'pizza dough', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pizza-dough.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 93610, u'unit': u''}, {u'originalString': u'4 ounces sausage, sliced thickly', u'aisle': u'Meat', u'name': u'sausage', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017063, u'unit': u'ounces'}, {u'originalString': u'6 ounces cheddar cheese, coarsely shredded', u'aisle': u'Cheese', u'name': u'shredded cheddar cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-cheddar.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1001009, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 21.0, u'imageType': u'jpg', u'spoonacularScore': 85.0, u'sourceUrl': u'http://www.foodrepublic.com/2011/10/16/ultimate-brunch-pizza-recipe', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 35, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 425 degrees.On a floured surface, form dough into a pizza crust, brush with olive oil and bake for 10-12 minutes, or until just slightly golden brown.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove crust from oven, transfer to a baking sheet and allow to cool. Lower oven heat to 375.', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat butter over medium-low heat in a non-stick pan and scramble eggs traditionally.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Transfer eggs to pizza crust to form an even layer and add vegetables (if using asparagus, use top 3 inches only).Top with shredded cheese and sliced sausage and bake for 5 minutes, or until cheese is completely melted.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'id': 11011, u'name': u'asparagus'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1041009, u'name': u'cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and serve immediately.\xa0\xa0\xa0', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Sangiovese, Barbera Wine, and Shiraz are great choices for Pizza. The best wine for pizza depends on the toppings! Red sauce pizza will call for a red wine with some acidity, such as a barberan or sangiovese. Add pepperoni or sausage and you can go bolder with a syrah. One wine you could try is Story Winery, Sangiovese, Estate, Shenandoah Valley. It has 5 out of 5 stars and a bottle costs about 19 dollars.', u'pairedWines': [u'sangiovese', u'barbera wine', u'shiraz'], u'productMatches': [{u'description': u'Aromas of raspberry, cherry, pie crust, tobacco and oak greet the nose. Dark cherries and raspberry predominate the palate with mild tannins and nice acidity. The finish is gentle and lasting Enjoy!', u'title': u'Story Winery, Sangiovese, Estate, Shenandoah Valley', u'price': u'$19.0', u'id': 469504, u'link': u'https://www.amazon.com/Story-Winery-Sangiovese-California-Shenandoah/dp/B00NMXHFNC', u'imageUrl': u'https://spoonacular.com/productImages/469504-312x231.jpg'}]}, u'aggregateLikes': 135, u'instructions': u'Directions:\xa0                                    Preheat oven to 425 degrees.On a floured surface, form dough into a pizza crust, brush with olive oil and bake for 10-12 minutes, or until just slightly golden brown.Remove crust from oven, transfer to a baking sheet and allow to cool. Lower oven heat to 375.Heat butter over medium-low heat in a non-stick pan and scramble eggs traditionally.Transfer eggs to pizza crust to form an even layer and add vegetables (if using asparagus, use top 3 inches only).Top with shredded cheese and sliced sausage and bake for 5 minutes, or until cheese is completely melted. Remove from oven and serve immediately.\xa0\xa0\xa0', u'spoonacularSourceUrl': u'https://spoonacular.com/ultimate-brunch-pizza-492522', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 2, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}