{u'recipes': [{u'sourceName': u'Amuse Your Bouche', u'cuisines': [u'mediterranean', u'greek', u'european'], u'image': u'https://spoonacular.com/recipeImages/578501-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 578501, u'veryPopular': True, u'lowFodmap': False, u'title': u'Greek chickpea salad', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 122.57, u'creditText': u'Amuse Your Bouche', u'extendedIngredients': [{u'originalString': u'- 25 black olives, sliced', u'aisle': u'Canned and Jarred', u'name': u'black olives', u'metaInformation': [u'black', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/black-olives.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 25.0, u'consistency': u'solid', u'id': 1059195, u'unit': u''}, {u'originalString': u'Black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'200g cherry tomatoes, halved', u'aisle': u'Produce', u'name': u'cherry tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cherry-tomatoes.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10311529, u'unit': u'g'}, {u'originalString': u'1 x 400g tin chickpeas, drained (240g when drained)', u'aisle': u'Pasta and Rice;Canned and Jarred;Ethnic Foods', u'name': u'chickpeas', u'metaInformation': [u'drained', u'canned', u'(240g when )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpeas.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 16057, u'unit': u''}, {u'originalString': u'1tbsp extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tbsp'}, {u'originalString': u'60g feta cheese, coarsely crumbled', u'aisle': u'Cheese', u'name': u'feta cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/feta-cheese.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 60.0, u'consistency': u'solid', u'id': 1019, u'unit': u'g'}, {u'originalString': u'3tbsp fresh parsley, roughly chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh parsley', u'metaInformation': [u'fresh', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tbsp'}, {u'originalString': u'1tbsp fresh lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u'tbsp'}, {u'originalString': u'\xbd red onion, thinly sliced', u'aisle': u'Produce', u'name': u'red onion', u'metaInformation': [u'red', u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 10011282, u'unit': u''}], u'healthScore': 8.0, u'imageType': u'jpg', u'spoonacularScore': 74.0, u'sourceUrl': u'http://www.amuse-your-bouche.com/greek-chickpea-salad/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine all ingredients in a large bowl, and mix well. You can either serve the salad immediately, or store in the fridge for a few hours to allow the flavours to develop.', u'number': 1, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Assyrtiko and Moschofilero are my top picks for Greek. If you feel like going Greek with your Greek food, assyrtiko and moschofilero are both lovely white wines to pair with chicken, seafood, etc. Agiorgitiko is a full bodied red suitable for roasted meats and lamb. One wine you could try is Sigalas Assyrtiko Santorini. It has 4.2 out of 5 stars and a bottle costs about 22 dollars.', u'pairedWines': [u'assyrtiko', u'moschofilero'], u'productMatches': [{u'description': u'Straw blonde color with light shades of green, with a subtle nose ofcitrus fruit. Excellent structure with a depth of flavor and high acidity, which brings the flavors to the front and adds freshness, with a lasting after-taste. Has the characteristic minerally taste of an world class Assyrtiko. View More', u'title': u'Sigalas Assyrtiko Santorini', u'price': u'$21.99', u'id': 438698, u'link': u'https://www.wine.com/product/sigalas-assyrtiko-santorini-2015/151225', u'imageUrl': u'https://spoonacular.com/productImages/438698-312x231.jpg'}]}, u'aggregateLikes': 3733, u'instructions': u'Combine all ingredients in a large bowl, and mix well. You can either serve the salad immediately, or store in the fridge for a few hours to allow the flavours to develop.', u'spoonacularSourceUrl': u'https://spoonacular.com/greek-chickpea-salad-578501', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}