{u'recipes': [{u'sourceName': u'Serious Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/206049-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 206049, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dinner Tonight: Saut\xe9ed Steak a la Mexicana', u'diets': [u'caveman', u'gluten free', u'dairy free', u'primal', u'whole 30'], u'pricePerServing': 252.29, u'creditText': u'Serious Eats', u'extendedIngredients': [{u'originalString': u'1 pound flat iron steak (flank or skirt also work), sliced into 1/2-inch-thick strips', u'aisle': u'Meat', u'name': u'flat iron steak', u'metaInformation': [u'sliced into 1/2-inch-thick strips', u'(flank or skirt also work)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/boneless-chuck-or-top-blade-steak.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 23059, u'unit': u'pound'}, {u'originalString': u'1 garlic clove, halved', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'2 limes', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'liquid', u'id': 9159, u'unit': u''}, {u'originalString': u'4 tablespoons olive oil, divided', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'1 onion, sliced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'2 plum tomatoes, cored, seeded, and sliced into strips', u'aisle': u'Produce', u'name': u'plum tomatoes', u'metaInformation': [u'cored', u'seeded', u'sliced into strips'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum-tomatoes.png', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10411529, u'unit': u''}, {u'originalString': u'2 poblano chiles', u'aisle': u'Produce', u'name': u'poblano chiles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 10011333, u'unit': u''}, {u'originalString': u'Salt and black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}], u'healthScore': 22.0, u'imageType': u'jpg', u'spoonacularScore': 81.0, u'sourceUrl': u'http://www.seriouseats.com/recipes/2011/10/sauteed-steak-a-la-mexicana-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'1', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'First, roast the poblanos. If using a gas stove, turn a burner to high and place both chiles on the grate above and cook, flipping occasionally, until charred and black on all sides. If using an electric stove, place a dry cast-iron skillet over high heat.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}], u'step': u'Add the chiles and cook, flipping occasionally, until charred on all sides. When done, transfer the chiles to a plastic bag to steam for five minutes. Then peel away the blackened skin, remove the stems and seeds, and slice the flesh into 1/2-inch-wide strips.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'2', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a medium-sized bowl, combine the the beef, the juice of one lime, and a pinch of a salt and pepper. Toss well and set aside.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'3', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tongs.jpg', u'id': 404641, u'name': u'tongs'}], u'step': u'In a large cast-iron skillet, pour in two tablespoons of the oil and add the garlic. Turn the heat to medium. The goal here is to infuse the oil with the garlic. Turn the garlic occasionally with a pair of tongs, and remove once it starts to sizzle. Then add the onions and a pinch of salt and pepper.  Cook, stirring often, until the onions become limp and transparent, eight to ten minutes.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Transfer to a medium-sized bowl and set aside.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'4', u'number': 9, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'If needed, carefully clean out the skillet.', u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the remaining two tablespoons of oil in and turn heat to high. When just starting to smoke, add as many of the beef strips as will fit comfortably in one layer. Cook, stirring occasionally, until beef is caramelized and cooked through, seven to eight minutes. If cooking in batches, remove the first batch of beef and transfer to the bowl with the onions.', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add more oil if needed to cook the second batch.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'5', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Once the beef is cooked, return the first batch of beef to the skillet along with the onions, tomatoes, and poblano strips. Cook, stirring carefully so you don't break up the tomatoes, until everything is warm, about two minutes. Season with salt and pepper to taste.", u'number': 14, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/poblano-peppers.jpg', u'id': 10011333, u'name': u'poblano pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'6', u'number': 15, u'ingredients': []}, {u'equipment': [], u'step': u'Serve with warm corn tortillas, and the remaining lime cut into wedges.', u'number': 16, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Steak can be paired with Merlot, Cabernet Sauvignon, and Pinot Noir. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. The Rombauer Merlot with a 4.8 out of 5 star rating seems like a good match. It costs about 26 dollars per bottle.', u'pairedWines': [u'merlot', u'cabernet sauvignon', u'pinot noir'], u'productMatches': [{u'description': u'Enticing and lively red color; beautifully aromatic with black cherry and ripe plum. On the palate a purity of blackcurrant, cedar and mint flavors blend together seamlessly. Soft and supple, this wine has a medium-bodied mouth-feel with plush tannins that integrate with the generous finish.Our favorite pairings for this wine include chicken parmesan, cedar-planked salmon over wild rice, and mushroom pizza.', u'title': u'Rombauer Merlot', u'price': u'$25.59', u'id': 447938, u'link': u'https://www.wine.com/product/rombauer-merlot-2008/116883', u'imageUrl': u'https://spoonacular.com/productImages/447938-312x231.jpg'}]}, u'aggregateLikes': 29, u'instructions': u"Procedures                                                                              1                                                                            First, roast the poblanos. If using a gas stove, turn a burner to high and place both chiles on the grate above and cook, flipping occasionally, until charred and black on all sides. If using an electric stove, place a dry cast-iron skillet over high heat. Add the chiles and cook, flipping occasionally, until charred on all sides. When done, transfer the chiles to a plastic bag to steam for five minutes. Then peel away the blackened skin, remove the stems and seeds, and slice the flesh into 1/2-inch-wide strips.                                                                                                                             2                                                                            In a medium-sized bowl, combine the the beef, the juice of one lime, and a pinch of a salt and pepper. Toss well and set aside.                                                                                                                             3                                                                            In a large cast-iron skillet, pour in two tablespoons of the oil and add the garlic. Turn the heat to medium. The goal here is to infuse the oil with the garlic. Turn the garlic occasionally with a pair of tongs, and remove once it starts to sizzle. Then add the onions and a pinch of salt and pepper.  Cook, stirring often, until the onions become limp and transparent, eight to ten minutes. Transfer to a medium-sized bowl and set aside.                                                                                                                             4                                                                            If needed, carefully clean out the skillet. Pour the remaining two tablespoons of oil in and turn heat to high. When just starting to smoke, add as many of the beef strips as will fit comfortably in one layer. Cook, stirring occasionally, until beef is caramelized and cooked through, seven to eight minutes. If cooking in batches, remove the first batch of beef and transfer to the bowl with the onions. Add more oil if needed to cook the second batch.                                                                                                                             5                                                                            Once the beef is cooked, return the first batch of beef to the skillet along with the onions, tomatoes, and poblano strips. Cook, stirring carefully so you don't break up the tomatoes, until everything is warm, about two minutes. Season with salt and pepper to taste.                                                                                                                             6                                                                            Serve with warm corn tortillas, and the remaining lime cut into wedges.", u'spoonacularSourceUrl': u'https://spoonacular.com/dinner-tonight-sauted-steak-a-la-mexicana-206049', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [u"valentine's day", u"father's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}