{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/741536-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 300, u'id': 741536, u'veryPopular': False, u'lowFodmap': False, u'title': u'Dreamy Orange Mousse', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 79.89, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup blood orange juice', u'aisle': u'Beverages', u'name': u'blood orange juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blood-orange-juice.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1009206, u'unit': u'cup'}, {u'originalString': u'4 tablespoons butter, at room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'at room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'4 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'5 crunchy gingersnap cookies', u'aisle': u'Sweet Snacks', u'name': u'gingersnap cookies', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gingersnaps.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 5.0, u'consistency': u'solid', u'id': 18172, u'unit': u''}, {u'originalString': u'1 cup heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon orange zest (from 1/2 orange)', u'aisle': u'Produce', u'name': u'orange zest', u'metaInformation': [u'(from 1/2 orange)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-orange.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 9216, u'unit': u'teaspoon'}, {u'originalString': u'1/8 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup plus 2 tablespoons sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 22.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/dreamy-orange-mousse.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Special equipment: six 3-ounce serving bowls or espresso cups', u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small saucepan set over medium heat, bring the orange juice to a boil and cook until reduced by half, about 4 minutes. Meanwhile in a small bowl, whisk together 1/2 cup of the sugar, the salt and yolks until smooth.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Whisking constantly, add half of the reduced orange juice to the yolk mixture to temper. When it is all incorporated, return the tempered yolk mixture to the pan. Cook over low heat, stirring constantly with a rubber spatula to prevent the eggs from scrambling, until thick enough to coat the back of a spoon, about 7 minutes. Strain the mixture into a clean bowl and whisk in the butter, 1 tablespoon at a time, and the zest.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/orange-juice.jpg', u'id': 9206, u'name': u'orange juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Place a piece of plastic wrap directly on the surface of the mixture and refrigerate until chilled through, at least 5 hours.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/hand-mixer.png', u'id': 404628, u'name': u'hand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour the heavy cream into a medium bowl, and add the vanilla and the remaining 2 tablespoons sugar. Using an electric mixer, beat the cream on medium speed just until stiff peaks form, 2 to 3 minutes, being careful avoid over-beating. Using a rubber spatula, gently fold half of the whipped cream into the chilled orange mixture.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'heavy cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour that mixture into the remaining whipped cream and continue to fold until completely incorporated. Divide the mixture among six 3-ounce serving bowls or espresso cups. Cover with plastic wrap and refrigerate until ready to serve.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-bag.jpg', u'id': 221671, u'name': u'ziploc bags'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/rolling-pin.jpg', u'id': 404746, u'name': u'rolling pin'}], u'step': u'When ready to serve, put the gingersnaps in a resealable plastic bag and smash gently with a rolling pin. Sprinkle on top of the mousse, and serve.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gingersnaps.jpg', u'id': 18172, u'name': u'gingersnap cookies'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 132, u'instructions': u'Watch how to make this recipe.      Special equipment: six 3-ounce serving bowls or espresso cups              In a small saucepan set over medium heat, bring the orange juice to a boil and cook until reduced by half, about 4 minutes. Meanwhile in a small bowl, whisk together 1/2 cup of the sugar, the salt and yolks until smooth. Whisking constantly, add half of the reduced orange juice to the yolk mixture to temper. When it is all incorporated, return the tempered yolk mixture to the pan. Cook over low heat, stirring constantly with a rubber spatula to prevent the eggs from scrambling, until thick enough to coat the back of a spoon, about 7 minutes. Strain the mixture into a clean bowl and whisk in the butter, 1 tablespoon at a time, and the zest. Place a piece of plastic wrap directly on the surface of the mixture and refrigerate until chilled through, at least 5 hours.                          Pour the heavy cream into a medium bowl, and add the vanilla and the remaining 2 tablespoons sugar. Using an electric mixer, beat the cream on medium speed just until stiff peaks form, 2 to 3 minutes, being careful avoid over-beating. Using a rubber spatula, gently fold half of the whipped cream into the chilled orange mixture. Pour that mixture into the remaining whipped cream and continue to fold until completely incorporated. Divide the mixture among six 3-ounce serving bowls or espresso cups. Cover with plastic wrap and refrigerate until ready to serve.                          When ready to serve, put the gingersnaps in a resealable plastic bag and smash gently with a rolling pin. Sprinkle on top of the mousse, and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/dreamy-orange-mousse-741536', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 325, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}