{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'asian', u'indian'], u'image': u'https://spoonacular.com/recipeImages/225484-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 225484, u'veryPopular': False, u'lowFodmap': False, u'title': u'Veggie Thai red curry', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 30, u'pricePerServing': 513.45, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u"1 small aubergine, chopped into chunks Aubergine oh-ber-geen Although it's technically a fruit (a berry, to be exact), the aubergine is used as a…", u'aisle': u'Produce', u'name': u'aubergine', u'metaInformation': [u'small', u'chopped', u'(a berry, to be exact)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11209, u'unit': u''}, {u'originalString': u'20g pack basil, leaves picked Basil ba-zil Most closely associated with Mediterranean cooking but also very prevalent in Asian food, the…', u'aisle': u'Produce;Spices and Seasonings', u'name': u'basil', u'metaInformation': [u'with mediterranean cooking but also very prevalent in asian food, the…', u'leaves picked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 20.0, u'consistency': u'solid', u'id': 2044, u'unit': u'g'}, {u'originalString': u'1 tsp brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tsp'}, {u'originalString': u'400ml can reduced-fat coconut milk', u'aisle': u'Canned and Jarred', u'name': u'canned coconut milk', u'metaInformation': [u'reduced-fat', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 400.0, u'consistency': u'liquid', u'id': 12117, u'unit': u'ml'}, {u'originalString': u'1 tsp freshly ground pepper Pepper pepp-ah Sometimes called bell peppers or capsicums, these sweet, mild peppers come in variety of colours…', u'aisle': u'Produce', u'name': u'capsicums', u'metaInformation': [u'sweet', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bell-pepper-orange.png', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 10211821, u'unit': u'tsp'}, {u'originalString': u'2 red chillies, 1 finely chopped, 1 sliced into rounds Chilli chill-ee Part of the capsicum family, chillies come in scores of varieties and colours (from green…', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'red', u'sliced into rounds chilli chill-ee part of the capsicum family, chillies come in scores of varieties and colours (from green…', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'3 red chillies', u'aisle': u'Produce', u'name': u'chillies', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11819, u'unit': u''}, {u'originalString': u'stalks from 20g pack coriander', u'aisle': u'Spices and Seasonings', u'name': u'coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'stalk', u'unitShort': u'stalks', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'stalks'}, {u'originalString': u"1 courgette, chopped into chunks Courgette corr-zjet The courgette is a variety of cucurtbit, which means it's from the same family as cucumber,…", u'aisle': u'Produce', u'name': u'courgette', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11477, u'unit': u''}, {u'originalString': u'2 garlic cloves', u'aisle': u'Produce', u'name': u'garlic cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'thumb-size piece ginger, grated Ginger jin-jer Mainly grown in Jamaica, Africa, India, China and Australia, ginger is the root of the plant. It…', u'aisle': u'Produce', u'name': u'ginger', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'piece'}, {u'originalString': u'1 tsp ground coriander', u'aisle': u'Spices and Seasonings', u'name': u'ground coriander', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-coriander.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2012, u'unit': u'tsp'}, {u'originalString': u'jasmine rice, to serve', u'aisle': u'Pasta and Rice', u'name': u'jasmine rice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-jasmine-cooked.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 10120444, u'unit': u'servings'}, {u'originalString': u'juice 3 limes Lime ly-m The same shape, but smaller than…', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'1 lemongrass, roughly chopped', u'aisle': u'Produce;Ethnic Foods', u'name': u'lemongrass', u'metaInformation': [u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemongrass.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11972, u'unit': u''}, {u'originalString': u'zest 1 lime Lime ly-m The same shape, but smaller than…', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1009159, u'unit': u''}, {u'originalString': u'140g mushrooms, halved Mushroom mush-room The mushroom is a fungus which comes in a wide range of varieties that belong to two distinct…', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 11260, u'unit': u'g'}, {u'originalString': u'\xbd red pepper, deseeded and roughly chopped', u'aisle': u'Produce', u'name': u'red bell pepper', u'metaInformation': [u'red', u'deseeded', u'roughly chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'\xbd red pepper, deseeded and chopped into chunks', u'aisle': u'Produce', u'name': u'red pepper', u'metaInformation': [u'red', u'deseeded', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-bell-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11821, u'unit': u''}, {u'originalString': u'3 shallots, roughly chopped Shallot shal-lot Related to the onion (as opposed to being a younger version of it), shallots grow in clusters at…', u'aisle': u'Produce', u'name': u'shallots', u'metaInformation': [u'roughly chopped', u'(as opposed to being a younger version of it)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shallots.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 11677, u'unit': u''}, {u'originalString': u'140g sugar snap pea', u'aisle': u'Produce', u'name': u'sugar snap peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-snap-peas.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 10011300, u'unit': u'g'}, {u'originalString': u'200g firm tofu, cubed', u'aisle': u'Refrigerated;Produce;Ethnic Foods', u'name': u'tofu', u'metaInformation': [u'firm', u'cubed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 16162, u'unit': u'g'}, {u'originalString': u'2 tbsp vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tbsp'}], u'healthScore': 54.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/420641/veggie-thai-red-curry', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}], u'step': u'Whizz the paste ingredients in a food processor. Marinate the tofu in 2 tbsp soy sauce, juice 1 lime and the chopped chilli.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat half the oil in a large pan.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add 3-4 tbsp paste and fry for 2 mins. Stir in the coconut milk with 100ml water, the courgette, aubergine and pepper and cook for 10 mins until almost tender.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/eggplant.jpg', u'id': 11209, u'name': u'eggplant'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zucchini.jpg', u'id': 11477, u'name': u'zucchini'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain the tofu, pat dry, then fry in the remaining oil in a small pan until golden.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}, {u'equipment': [], u'step': u'Add the mushrooms, sugar snaps and most of the basil to the curry, then season with the sugar, remaining lime juice and soy sauce. Cook for 4 mins until the mushrooms are tender, then add the tofu and heat through. Scatter with sliced chilli and basil and serve with jasmine rice.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-jasmine-cooked.jpg', u'id': 10120444, u'name': u'jasmine rice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-chili.jpg', u'id': 11819, u'name': u'chili pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'id': 2044, u'name': u'basil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tofu.jpg', u'id': 16162, u'name': u'tofu'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Chenin Blanc, Gewurztraminer, and Riesling are great choices for Asian. The best wine for Asian food depends on the cuisine and dish - of course - but these acidic whites pair with a number of traditional meals, spicy or not. You could try L'Ecole 41 Chenin Blanc. Reviewers quite like it with a 4.4 out of 5 star rating and a price of about 18 dollars per bottle.", u'pairedWines': [u'chenin blanc', u'gewurztraminer', u'riesling'], u'productMatches': [{u'description': u'This fresh and vibrant Chenin Blanc shows abundant expressive aromatics of jasmine, passion fruit, and orange blossom with flavors of star fruit and apple on a balanced, crisp mineral finish. View More', u'title': u"L'Ecole 41 Chenin Blanc", u'price': u'$17.99', u'id': 437316, u'link': u'https://www.wine.com/product/lecole-41-chenin-blanc-2013/132051', u'imageUrl': u'https://spoonacular.com/productImages/437316-312x231.jpg'}]}, u'aggregateLikes': 260, u'instructions': u'Whizz the paste ingredients in a food processor. Marinate the tofu in 2 tbsp soy sauce, juice 1 lime and the chopped chilli.Heat half the oil in a large pan. Add 3-4 tbsp paste and fry for 2 mins. Stir in the coconut milk with 100ml water, the courgette, aubergine and pepper and cook for 10 mins until almost tender.Drain the tofu, pat dry, then fry in the remaining oil in a small pan until golden.Add the mushrooms, sugar snaps and most of the basil to the curry, then season with the sugar, remaining lime juice and soy sauce. Cook for 4 mins until the mushrooms are tender, then add the tofu and heat through. Scatter with sliced chilli and basil and serve with jasmine rice.', u'spoonacularSourceUrl': u'https://spoonacular.com/veggie-thai-red-curry-225484', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}