{u'recipes': [{u'sourceName': u'What Jew Wanna Eat', u'cuisines': [u'jewish'], u'image': u'https://spoonacular.com/recipeImages/480879-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 480879, u'veryPopular': False, u'lowFodmap': False, u'title': u'Gefilte Fish Guest Video on Hilah Cooking', u'diets': [u'pescatarian'], u'preparationMinutes': 10, u'pricePerServing': 182.67, u'creditText': u'What Jew Wanna Eat', u'extendedIngredients': [{u'originalString': u'1 celery heart, sliced', u'aisle': u'Produce', u'name': u'celery', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11143, u'unit': u''}, {u'originalString': u'2 large eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 quart fish stock (homemade or store bought)', u'aisle': u'Canned and Jarred', u'name': u'fish stock', u'metaInformation': [u'homemade', u'store bought', u'( or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 6963, u'unit': u'quart'}, {u'originalString': u'3 tablespoons chopped fresh dill', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh dill', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dill.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 2045, u'unit': u'tablespoons'}, {u'originalString': u'1 clove garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'clove', u'unitShort': u'clove', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u'clove'}, {u'originalString': u'\xbd teaspoon ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'ground pepper', u'metaInformation': [u'black'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'\xbd a lemon', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'\xbd cup matzo meal', u'aisle': u'Ethnic Foods;Baking', u'name': u'matzo meal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/matzo.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18217, u'unit': u'cup'}, {u'originalString': u'1 medium onion, fine diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'medium', u'fine'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbd cup chopped parsley', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11297, u'unit': u'cup'}, {u'originalString': u'\xbe pound boned salmon', u'aisle': u'Seafood', u'name': u'salmon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salmon.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 15076, u'unit': u'pound'}, {u'originalString': u'Salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'Salt and pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'\xbd cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 tablespoon vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'tablespoon'}, {u'originalString': u'\xbe pound boned whitefish (turbot, cod, pike, etc.)', u'aisle': u'Seafood', u'name': u'whitefish', u'metaInformation': [u'(turbot, cod, pike, etc.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.75, u'consistency': u'solid', u'id': 10015261, u'unit': u'pound'}], u'healthScore': 12.0, u'imageType': u'jpg', u'spoonacularScore': 64.0, u'sourceUrl': u'http://whatjewwannaeat.com/gefilte-fish-guest-video-on-hilah-cooking/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour into a large soup pot and add 2 cups of water.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the garlic, celery, and salt and pepper. If you are skinning your fish yourself, add the fish skin, too. Squeeze the lemon into the broth and then drop the rind in, too. Bring to a boil, then simmer while you prepare the fish balls.In a small pan, heat the olive oil over medium heat and saute the onion until soft, or about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/celery.jpg', u'id': 11143, u'name': u'celery'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Let cool.Chop the fish into fine pieces and place in a bowl.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Add the cooled onions, eggs, matzo meal, parsley, salt, and pepper and combine. The mixture should be firm enough to be able to form into balls. If it is too soft, add a bit more matzo meal, if it is too hard add a bit of the fish stock.Form 2-3 tablespoons of the fish mixture into smooth balls and set aside. You should get 12 balls.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 6963, u'name': u'fish stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/matzo.jpg', u'id': 18217, u'name': u'matzo meal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add the balls to the simmering broth in a single layer and simmer until cooked through, about 10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove the gefilte fish with a slotted spoon and drain on a paper towel.To make the horseradish sauce, combine all ingredients.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}, {u'equipment': [], u'step': u'Serve gefilte fish warm or cold on a bed of lettuce with the horseradish sauce!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fish-fillet.jpg', u'id': 10115261, u'name': u'fish'}]}], u'name': u'For the stock'}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. You could try Maso Canali Pinot Grigio. Reviewers quite like it with a 4.6 out of 5 star rating and a price of about 15 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The Maso Canali Pinot Grigio displays a brilliant pale golden color indicative of its crisp, citrus aromas and floral notes. This wine is well-balanced and full-flavored with hints of nectarine. Pair it with seafood and light poultry for a delightful meal. View More', u'title': u'Maso Canali Pinot Grigio', u'price': u'$14.79', u'id': 448945, u'link': u'https://www.wine.com/product/maso-canali-pinot-grigio-2011/118957', u'imageUrl': u'https://spoonacular.com/productImages/448945-312x231.jpg'}]}, u'aggregateLikes': 37, u'instructions': u'For the stock: Pour into a large soup pot and add 2 cups of water. Add the garlic, celery, and salt and pepper. If you are skinning your fish yourself, add the fish skin, too. Squeeze the lemon into the broth and then drop the rind in, too. Bring to a boil, then simmer while you prepare the fish balls.In a small pan, heat the olive oil over medium heat and saute the onion until soft, or about 5 minutes. Let cool.Chop the fish into fine pieces and place in a bowl. Add the cooled onions, eggs, matzo meal, parsley, salt, and pepper and combine. The mixture should be firm enough to be able to form into balls. If it is too soft, add a bit more matzo meal, if it is too hard add a bit of the fish stock.Form 2-3 tablespoons of the fish mixture into smooth balls and set aside. You should get 12 balls.Add the balls to the simmering broth in a single layer and simmer until cooked through, about 10 minutes.Remove the gefilte fish with a slotted spoon and drain on a paper towel.To make the horseradish sauce, combine all ingredients.Serve gefilte fish warm or cold on a bed of lettuce with the horseradish sauce!', u'spoonacularSourceUrl': u'https://spoonacular.com/gefilte-fish-guest-video-on-hilah-cooking-480879', u'dishTypes': [u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}