{u'recipes': [{u'sourceName': u'Serena Bakes Simple from Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/520468-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 520468, u'veryPopular': False, u'lowFodmap': False, u'title': u'Asian Shrimp Soba Noodles With Vegetables', u'diets': [u'dairy free', u'pescatarian'], u'pricePerServing': 278.6, u'creditText': u'Serena Bakes Simple from Scratch', u'extendedIngredients': [{u'originalString': u'2 cups Broccoli', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11090, u'unit': u'cups'}, {u'originalString': u'1/2 bunch Cilantro, Chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'bunches', u'unitShort': u'bunch', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'bunch'}, {u'originalString': u'1/4 cup Extra Virgin Olive Oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 1034053, u'unit': u'cup'}, {u'originalString': u'1 teaspoon Fresh Ginger, Grated', u'aisle': u'Produce', u'name': u'fresh ginger', u'metaInformation': [u'fresh', u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 11216, u'unit': u'teaspoon'}, {u'originalString': u'2 teaspoons Honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoons'}, {u'originalString': u'1 whole Jalapeno, finely Diced And Seeded', u'aisle': u'Canned and Jarred;Produce;Ethnic Foods', u'name': u'jalapeno', u'metaInformation': [u'diced', u'whole', u'seeded', u'finely'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/jalapeno-pepper.png', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11979, u'unit': u''}, {u'originalString': u'1/2 whole Lime, Juiced', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [u'whole', u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'2 cups Mung Bean Sprouts', u'aisle': u'Produce;Ethnic Foods', u'name': u'mung bean sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bean-sprouts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11043, u'unit': u'cups'}, {u'originalString': u'2 cups Red Cabbage, Shredded', u'aisle': u'Produce', u'name': u'red cabbage', u'metaInformation': [u'shredded', u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-cabbage.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11112, u'unit': u'cups'}, {u'originalString': u'1/2 cup Plain Rice Vinegar', u'aisle': u'Ethnic Foods;Oil, Vinegar, Salad Dressing', u'name': u'rice vinegar', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1022053, u'unit': u'cup'}, {u'originalString': u'2 tablespoons Toasted Sesame Seed Oil', u'aisle': u'Ethnic Foods', u'name': u'sesame seed oil', u'metaInformation': [u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4058, u'unit': u'tablespoons'}, {u'originalString': u'1 pound Shrimp, Peeled And Deveined', u'aisle': u'Seafood', u'name': u'shrimp', u'metaInformation': [u'deveined', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 15152, u'unit': u'pound'}, {u'originalString': u'2 cups Sugar Snap Peas Or Snow Peas', u'aisle': u'Produce', u'name': u'snow peas', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/snow-peas.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11300, u'unit': u'cups'}, {u'originalString': u'9.5 ounce Soba Noodles', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'soba noodles', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 9.5, u'consistency': u'solid', u'id': 20114, u'unit': u'ounce'}, {u'originalString': u'2 tablespoons Soy Sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'soy sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 16124, u'unit': u'tablespoons'}, {u'originalString': u'1/2 teaspoon Sriracha Sauce, Or To Taste', u'aisle': u'Condiments', u'name': u'sriracha sauce', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 1016168, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup Thai Basil, Chopped', u'aisle': u'Produce;Spices and Seasonings', u'name': u'thai basil', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 2044, u'unit': u'cup'}, {u'originalString': u'2 whole Bell Peppers, Sliced (I like red, orange or yellow)', u'aisle': u'Produce', u'name': u'yellow bell peppers', u'metaInformation': [u'whole', u'red', u'yellow', u'sliced', u'(I like , orange or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/yellow-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11951, u'unit': u''}], u'healthScore': 31.0, u'imageType': u'jpg', u'spoonacularScore': 92.0, u'sourceUrl': u'http://www.serenabakessimplyfromscratch.com/2012/10/asian-shrimp-soba-noodles-with.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place all ingredients in a large bowl, top with dressing and toss to combine.', u'number': 1, u'ingredients': []}], u'name': u'TO ASSEMBLE'}, {u'steps': [{u'equipment': [], u'step': u'Combine all jalape\xf1o, olive oil, rice vinegar, sesame seed oil, honey, soy sauce, lime juice, sriracha sauce, ginger and stir well. Set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sesame-oil.jpg', u'id': 4058, u'name': u'sesame oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/hot-sauce-or-tabasco.png', u'id': 1016168, u'name': u'sriracha'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vinegar-(white).jpg', u'id': 1022053, u'name': u'rice vinegar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'id': 16124, u'name': u'soy sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'id': 11216, u'name': u'ginger'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'FOR SHRIMP: Bring a pot of boiling water to add shrimp and cook shrimp until pink. About 1-2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shrimp.jpg', u'id': 15152, u'name': u'shrimp'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'FOR SOBA NOODLES: Bring a large pot of water to boil and cook according to package directions.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soba-noodles.jpg', u'id': 20114, u'name': u'soba noodles'}]}, {u'equipment': [], u'step': u'Drain and rinse under cold water.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Drain well.', u'number': 5, u'ingredients': []}], u'name': u'FOR DRESSING'}], u'winePairing': {u'pairingText': u"Pinot Grigio, Gruener Veltliner, and Pinot Noir are my top picks for Fish. Fish is as diverse as wine, so it's hard to pick wines that go with every fish. A crisp white wine, such as a pinot grigio or Gr\xfcner Veltliner, will suit any delicately flavored white fish. Meaty, strongly flavored fish such as salmon and tuna can even handle a light red wine, such as a pinot noir. The Santa Cristina by Antinori Pinot Grigio with a 4.1 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'pinot grigio', u'gruener veltliner', u'pinot noir'], u'productMatches': [{u'description': u'The 2012 wine is deep straw-yellow in color. This classic Pinot Grigio offers intense aromas of tropical fruit and citrus. Soft and flavorful on the palate with flavors of pineapple and pear, this wine has well-balanced acidity and a long finish.', u'title': u'Santa Cristina by Antinori Pinot Grigio', u'price': u'$11.79', u'id': 444296, u'link': u'https://www.wine.com/product/santa-cristina-by-antinori-pinot-grigio-2012/126696', u'imageUrl': u'https://spoonacular.com/productImages/444296-312x231.jpg'}]}, u'aggregateLikes': 111, u'instructions': u'FOR DRESSING: Combine all jalape\xf1o, olive oil, rice vinegar, sesame seed oil, honey, soy sauce, lime juice, sriracha sauce, ginger and stir well. Set aside.                    FOR SHRIMP: Bring a pot of boiling water to add shrimp and cook shrimp until pink. About 1-2 minutes.                    FOR SOBA NOODLES: Bring a large pot of water to boil and cook according to package directions. Drain and rinse under cold water. Drain well.                    TO ASSEMBLE: Place all ingredients in a large bowl, top with dressing and toss to combine.', u'spoonacularSourceUrl': u'https://spoonacular.com/asian-shrimp-soba-noodles-with-vegetables-520468', u'dishTypes': [u'side dish', u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}