{u'recipes': [{u'sourceName': u'For the Love of Cooking', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/497526-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 497526, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheese Tortellini Soup with Turkey Italian Sausage and Kale', u'diets': [], u'preparationMinutes': 5, u'pricePerServing': 120.99, u'creditText': u'For the Love of Cooking', u'extendedIngredients': [{u'originalString': u'1 package of cheese tortellini', u'aisle': u'Refrigerated', u'name': u'cheese tortellini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 10093727, u'unit': u'package'}, {u'originalString': u'8 cups of homemade chicken broth (or store bought works too)', u'aisle': u'Canned and Jarred', u'name': u'chicken broth', u'metaInformation': [u'homemade', u'store bought', u'(or works too)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 8.0, u'consistency': u'liquid', u'id': 6194, u'unit': u'cups'}, {u'originalString': u'3 cloves of garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'5 links of turkey Italian sausage, removed from casings, and formed into tiny meatballs', u'aisle': u'Meat', u'name': u'italian turkey sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-or-turkey-sausage.jpg', u'unitLong': u'links', u'unitShort': u'links', u'amount': 5.0, u'consistency': u'solid', u'id': 7927, u'unit': u'links'}, {u'originalString': u'2 cups of fresh kale, chopped', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'fresh', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'1 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'Sea salt and freshly cracked pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 14.0, u'imageType': u'jpg', u'spoonacularScore': 78.0, u'sourceUrl': u'http://www.fortheloveofcooking.net/2013/02/cheese-tortellini-soup-with-turkey-italian-sausage-and-kale.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Heat the olive oil in a large Dutch oven over medium high heat.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u"Remove the turkey Italian sausage from it's casings and form into tiny meatballs.", u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Place the meatballs into the HOT Dutch oven and cook for 5 or so minutes, or until golden brown on all sides.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the minced garlic and cook, stirring constantly  for 1 minute.', u'length': {u'number': 1, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chicken broth then bring to a slight boil.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-broth.png', u'id': 6194, u'name': u'chicken broth'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/ladle.jpg', u'id': 404630, u'name': u'ladle'}], u'step': u'Add the cheese tortellini and chopped kale and cook for 5-7 minutes, or until the pasta has cooked through. Taste the soup and season with sea salt and freshly cracked pepper, if needed, to taste. Ladle the soup into bowls and serve. Enjoy.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tortellini-isolated.jpg', u'id': 10093727, u'name': u'cheese tortellini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1012047, u'name': u'sea salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Italian works really well with Chianti, Trebbiano, and Verdicchio. Italians know food and they know wine. Trebbiano and Verdicchio are Italian white wines that pair well with fish and white meat, while Chianti is a great Italian red for heavier, bolder dishes. You could try Selvapiana Chianti Rufina. Reviewers quite like it with a 4.3 out of 5 star rating and a price of about 14 dollars per bottle.', u'pairedWines': [u'chianti', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'This is a big and juicy Chianti Rufina, offering delicious strawberry and cherry aromas followed by subtle notes of spice box, leather, earth and mushrooms. Dense, smooth and medium-bodied, with great concentration and fine tannins.Easy-going and supple, this is great food wine: ideal for rich pastas, creamy soups, barbecued meats and cheeses.', u'title': u'Selvapiana Chianti Rufina', u'price': u'$14.09', u'id': 436167, u'link': u'https://www.wine.com/product/selvapiana-chianti-rufina-2007/98486', u'imageUrl': u'https://spoonacular.com/productImages/436167-312x231.jpg'}]}, u'aggregateLikes': 281, u'instructions': u"Heat the olive oil in a large Dutch oven over medium high heat. Remove the turkey Italian sausage from it's casings and form into tiny meatballs. Place the meatballs into the HOT Dutch oven and cook for 5 or so minutes, or until golden brown on all sides. Add the minced garlic and cook, stirring constantly  for 1 minute. Add the chicken broth then bring to a slight boil. Add the cheese tortellini and chopped kale and cook for 5-7 minutes, or until the pasta has cooked through. Taste the soup and season with sea salt and freshly cracked pepper, if needed, to taste. Ladle the soup into bowls and serve. Enjoy.", u'spoonacularSourceUrl': u'https://spoonacular.com/cheese-tortellini-soup-with-turkey-italian-sausage-and-kale-497526', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}