{u'recipes': [{u'sourceName': u'The Housewife in Training Files', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/619268-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 619268, u'veryPopular': False, u'lowFodmap': False, u'title': u'Maple Roasted Autumn Vegetable Pasta', u'diets': [u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 148.5, u'creditText': u'The Housewife in Training Files', u'extendedIngredients': [{u'originalString': u'1\xbd cup sliced asparagus', u'aisle': u'Produce', u'name': u'asparagus', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/asparagus.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11011, u'unit': u'cup'}, {u'originalString': u'Balsamic Glaze, to serve', u'aisle': u'Condiments', u'name': u'balsamic glaze', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/no.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 98998, u'unit': u'servings'}, {u'originalString': u'1\xbd cups broccoli, trimmed small', u'aisle': u'Produce', u'name': u'broccoli', u'metaInformation': [u'small', u'trimmed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broccoli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11090, u'unit': u'cups'}, {u'originalString': u'1\xbd cups small diced butternut squash', u'aisle': u'Produce', u'name': u'butternut squash', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butternut-squash.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11485, u'unit': u'cups'}, {u'originalString': u'1 lemon, juiced', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [u'juiced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'3 Tbsp maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'Tbsp'}, {u'originalString': u'1\xbd cups sliced mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 11260, u'unit': u'cups'}, {u'originalString': u'2 Tbsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'Tbsp'}, {u'originalString': u'2 cups uncooked pasta', u'aisle': u'Pasta and Rice', u'name': u'pasta', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 20420, u'unit': u'cups'}, {u'originalString': u'1 tsp pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'tsp'}, {u'originalString': u'1 tsp sea salt', u'aisle': u'Spices and Seasonings', u'name': u'sea salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'tsp'}, {u'originalString': u'Sea Salt and Pepper', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}], u'healthScore': 54.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://thehousewifeintrainingfiles.com/maple-roasted-autumn-vegetable-pasta/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 450 degrees F.Line a large baking sheet with parchment paper or a silicon baking sheet.Lay all the chopped veggies onto sheet. Try not to overlap them too much.In a small bowl, combine the olive oil and maple syrup.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}]}, {u'equipment': [], u'step': u'Drizzle over the veggies. Generously season with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Place in oven and roast for 20 minutes. At the same time, add another baking sheet to preheat for the lavash.Once the veggies are done.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven.Meanwhile, cook pasta according to packages instructions.When done, drain and toss with the remaining 2 Tbsp olive oil, lemon juice, salt and pepper.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}]}, {u'equipment': [], u'step': u'Add roasted vegetables, and serve immediately drizzled with balsamic glaze.', u'number': 5, u'ingredients': [{u'image': None, u'id': 98998, u'name': u'balsamic glaze'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 12, u'instructions': u'Preheat oven to 450 degrees F.Line a large baking sheet with parchment paper or a silicon baking sheet.Lay all the chopped veggies onto sheet. Try not to overlap them too much.In a small bowl, combine the olive oil and maple syrup. Drizzle over the veggies. Generously season with salt and pepper.Place in oven and roast for 20 minutes. At the same time, add another baking sheet to preheat for the lavash.Once the veggies are done. Remove from oven.Meanwhile, cook pasta according to packages instructions.When done, drain and toss with the remaining 2 Tbsp olive oil, lemon juice, salt and pepper. Add roasted vegetables, and serve immediately drizzled with balsamic glaze.', u'spoonacularSourceUrl': u'https://spoonacular.com/maple-roasted-autumn-vegetable-pasta-619268', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}