{u'recipes': [{u'sourceName': u'Alidas Kitchen', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547514-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 547514, u'veryPopular': True, u'lowFodmap': False, u'title': u'Easy Ice Cream Pie + {Family Size Party Tips}', u'diets': [u'dairy free'], u'pricePerServing': 123.51, u'creditText': u'Alidas Kitchen', u'extendedIngredients': [{u'originalString': u'1/2 cup chocolate syrup', u'aisle': u'Frozen;Baking;Condiments', u'name': u'chocolate syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-syrup.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 14181, u'unit': u'cup'}, {u'originalString': u"1 quart ice cream, softened (such as Edy's Slow Churned A Very Merry Egg Nog or Peppermint Wonderland)", u'aisle': u'Frozen', u'name': u'ice cream', u'metaInformation': [u'softened', u"(such as Edy's Slow Churned A Very Merry Egg Nog or Peppermint Wonderland)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'unitLong': u'quart', u'unitShort': u'quart', u'amount': 1.0, u'consistency': u'liquid', u'id': 19095, u'unit': u'quart'}, {u'originalString': u'1 ready made pie crust (graham cracker or chocolate cookie)', u'aisle': u'Refrigerated', u'name': u'ready to use pie crust', u'metaInformation': [u'(graham cracker or chocolate cookie)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pie-crust.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 18334, u'unit': u''}, {u'originalString': u'sprinkles, for decoration', u'aisle': u'Baking', u'name': u'sprinkles', u'metaInformation': [u'for decoration'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sprinkles-colorful.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 93645, u'unit': u'servings'}, {u'originalString': u'2 cups whipped topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 42135, u'unit': u'cups'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://alidaskitchen.com/2013/12/10/easy-ice-cream-pie/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 23, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Scoop ice cream into crust, pressing down with a spatula to flatten.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-ice-cream.png', u'id': 19095, u'name': u'ice cream'}]}, {u'equipment': [], u'step': u'Drizzle with chocolate syrup.  Top with whipped topping and decorate as desired.Freeze until firm, about 4 hours to overnight.  Then slice and serve!', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-syrup.jpg', u'id': 14181, u'name': u'chocolate syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Vanillan Ice Cream works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'nutty , butterscotch , caramel', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 406, u'instructions': u'Scoop ice cream into crust, pressing down with a spatula to flatten.  Drizzle with chocolate syrup.  Top with whipped topping and decorate as desired.Freeze until firm, about 4 hours to overnight.  Then slice and serve!', u'spoonacularSourceUrl': u'https://spoonacular.com/easy-ice-cream-pie-+-family-size-party-tips-547514', u'dishTypes': [u'dessert'], u'occasions': [u'summer'], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}