{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/222547-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 222547, u'veryPopular': False, u'lowFodmap': False, u'title': u'Marbled chocolate brownies', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 81.5, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'250g pack unsalted butter, cut into cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'unsalted', u'cut into cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 250.0, u'consistency': u'solid', u'id': 1001, u'unit': u'g'}, {u'originalString': u"200g white chocolate (we used Green & Black's)", u'aisle': u'Sweet Snacks', u'name': u'chocolate', u'metaInformation': [u'white', u'green', u"(we used & Black's)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 19081, u'unit': u'g'}, {u'originalString': u'200g dark chocolate (70% cocoa)', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'70%', u'( cocoa)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'liquid', u'id': 19904, u'unit': u'g'}, {u'originalString': u'4 eggs, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'300g golden caster sugar', u'aisle': u'Baking', u'name': u'golden brown sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 300.0, u'consistency': u'solid', u'id': 19334, u'unit': u'g'}, {u'originalString': u'140g plain flour', u'aisle': u'Baking', u'name': u'plain flour', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 140.0, u'consistency': u'solid', u'id': 20081, u'unit': u'g'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/4677/marbled-chocolate-brownies', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 180.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Butter and line a 23cm square brownie tin (or a similar size rectangular tin) and heat oven to 180C/fan 160C/gas 4.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Put the dark and white chocolates into two separate large bowls and add half of the butter to each. One bowl at a time, heat in the microwave on High for 1\xbd mins, stirring halfway, until the chocolate and butter are both melted. Alternatively, melt over a pan of simmering water (making sure the water doesn’t touch the base of the bowl). Stir until the chocolate and butter are totally incorporated.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk-chocolate.jpg', u'id': 19081, u'name': u'chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-skewers.jpg', u'id': 3065, u'name': u'skewers'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add 150g sugar and 2 beaten eggs to each bowl, then beat until smooth. Now stir 50g of the flour into the dark chocolate mix and the remaining 90g into the white mix. Spoon tbsps of the batter into the tin, alternating dark and white chocolate to make a patchwork pattern of blobs. Once the bottom of the tin is covered, go over the first layer, spooning white on top of the dark blobs and dark on top of the white. To marble the brownies, pull a skewer through the pan several times to make feathery swirls.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'id': 19904, u'name': u'dark chocolate'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 35 mins or until the middle of the brownie is just set and the white chocolate patches on top have a pale golden crust. Leave to cool completely in the tin before cutting into 16 squares. Will keep in an airtight container for up to 3 days, or freeze for up to 1 month.', u'length': {u'number': 35, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 164, u'instructions': u'Butter and line a 23cm square brownie tin (or a similar size rectangular tin) and heat oven to 180C/fan 160C/gas 4. Put the dark and white chocolates into two separate large bowls and add half of the butter to each. One bowl at a time, heat in the microwave on High for 1\xbd mins, stirring halfway, until the chocolate and butter are both melted. Alternatively, melt over a pan of simmering water (making sure the water doesn’t touch the base of the bowl). Stir until the chocolate and butter are totally incorporated.  Add 150g sugar and 2 beaten eggs to each bowl, then beat until smooth. Now stir 50g of the flour into the dark chocolate mix and the remaining 90g into the white mix. Spoon tbsps of the batter into the tin, alternating dark and white chocolate to make a patchwork pattern of blobs. Once the bottom of the tin is covered, go over the first layer, spooning white on top of the dark blobs and dark on top of the white. To marble the brownies, pull a skewer through the pan several times to make feathery swirls. Bake for 35 mins or until the middle of the brownie is just set and the white chocolate patches on top have a pale golden crust. Leave to cool completely in the tin before cutting into 16 squares. Will keep in an airtight container for up to 3 days, or freeze for up to 1 month.', u'spoonacularSourceUrl': u'https://spoonacular.com/marbled-chocolate-brownies-222547', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 40, u'servings': 16, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}