{u'recipes': [{u'sourceName': u'How Sweet Eats', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/625692-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 625692, u'veryPopular': False, u'lowFodmap': False, u'title': u'Creamy Roasted Garlic Potato Soup with Crispy Brussels', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 344.09, u'creditText': u'How Sweet Eats', u'extendedIngredients': [{u'originalString': u'1/2 pound brussels sprouts, stems removed and leaves removed', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 11098, u'unit': u'pound'}, {u'originalString': u'crispy brussels', u'aisle': u'Produce', u'name': u'brussels sprouts', u'metaInformation': [u'crispy'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 11098, u'unit': u'servings'}, {u'originalString': u'chili oil, for serving', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'chili oil', u'metaInformation': [u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-oil.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'liquid', u'id': 1014053, u'unit': u'servings'}, {u'originalString': u'1/3 cup cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'1 tablespoon olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'2 bulbs roasted garlic', u'aisle': u'Produce', u'name': u'roasted garlic', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'3 pounds russet potatoes, peeled and chopped', u'aisle': u'Produce', u'name': u'russet potatoes', u'metaInformation': [u'peeled', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/russet-or-Idaho-potatoes.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 3.0, u'consistency': u'solid', u'id': 11353, u'unit': u'pounds'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'salt and pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 sweet onion, diced', u'aisle': u'Produce', u'name': u'sweet onion', u'metaInformation': [u'diced', u'sweet'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11294, u'unit': u''}, {u'originalString': u'1 tablespoon unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoon'}, {u'originalString': u'4 cups vegetable oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'vegetable oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 4513, u'unit': u'cups'}, {u'originalString': u'4 to 5 cups low-sodium chicken or vegetable stock', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'low-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cups'}], u'healthScore': 24.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.howsweeteats.com/2015/01/creamy-roasted-garlic-potato-soup-with-crispy-brussels-chili-oil/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 30, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Heat a large stock pot over medium heat and add olive oil and butter. Once melted, stir in the onion with a pinch of salt and cook until softened, about 5 minutes.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the potatoes and enough stock to cover the potatoes - starting with 4 cups and using more if needed. Bring the mixture to a simmer. Cover and cook until the potatoes are tender and falling apart, about 20 to 30 minutes. Turn off the heat.Carefully add the mixture to a blender. Squeeze out the roasted garlic cloves and add them to the blender too. Puree the soup until totally creamy and smooth.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-roasted.jpg', u'id': 11215, u'name': u'roasted garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour the mixture back into the pot and heat over low heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the cream, salt and pepper. Taste and season additionally with salt and pepper if needed.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Serve the soup and drizzle the chili oil on top.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-oil.jpg', u'id': 1014053, u'name': u'chili oil'}]}, {u'equipment': [], u'step': u'Add the brussels as garnish and eat! crispy brussels', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/candy-thermometer.jpg', u'id': 404670, u'name': u'candy thermometer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'While the potatoes are simmering, heat a pot over medium heat and add the vegetable oil. Attach a candy thermometer if you have one - you want the temperature to be around 325 to 350 degrees - no higher!', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4513, u'name': u'vegetable oil'}]}, {u'equipment': [], u'step': u'Add the brussels sprouts leaves a few handfuls at a time and fry until crispy, about 2 to 3 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brussels-sprouts.jpg', u'id': 11098, u'name': u'brussels sprouts'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slotted-spoon.jpg', u'id': 404636, u'name': u'slotted spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}], u'step': u'Remove with a slotted spoon and place on a paper towel to drain, covering with salt and pepper.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 87, u'instructions': u'Heat a large stock pot over medium heat and add olive oil and butter. Once melted, stir in the onion with a pinch of salt and cook until softened, about 5 minutes. Add the potatoes and enough stock to cover the potatoes - starting with 4 cups and using more if needed. Bring the mixture to a simmer. Cover and cook until the potatoes are tender and falling apart, about 20 to 30 minutes. Turn off the heat.Carefully add the mixture to a blender. Squeeze out the roasted garlic cloves and add them to the blender too. Puree the soup until totally creamy and smooth. Pour the mixture back into the pot and heat over low heat. Add the cream, salt and pepper. Taste and season additionally with salt and pepper if needed. Serve the soup and drizzle the chili oil on top. Add the brussels as garnish and eat! crispy brusselsWhile the potatoes are simmering, heat a pot over medium heat and add the vegetable oil. Attach a candy thermometer if you have one - you want the temperature to be around 325 to 350 degrees - no higher! Add the brussels sprouts leaves a few handfuls at a time and fry until crispy, about 2 to 3 minutes. Remove with a slotted spoon and place on a paper towel to drain, covering with salt and pepper.', u'spoonacularSourceUrl': u'https://spoonacular.com/creamy-roasted-garlic-potato-soup-with-crispy-brussels-625692', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}