{u'recipes': [{u'sourceName': u'Table for Two Blog', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/593943-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 593943, u'veryPopular': False, u'lowFodmap': False, u'title': u'Molasses Ginger Cookies #fbcookieswap', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 17.78, u'creditText': u'Table for Two Blog', u'extendedIngredients': [{u'originalString': u'2\xbc cup all purpose flour', u'aisle': u'Baking', u'name': u'all purpose flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.25, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'2 tsp. baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 18372, u'unit': u'tsp'}, {u'originalString': u'1 cup dark brown sugar', u'aisle': u'Baking', u'name': u'dark brown sugar', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10019334, u'unit': u'cup'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 tsp. ground cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'\xbd tsp. ground cloves', u'aisle': u'Spices and Seasonings', u'name': u'ground cloves', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2011, u'unit': u'tsp'}, {u'originalString': u'1 tsp. ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 2021, u'unit': u'tsp'}, {u'originalString': u'\xbc cup molasses', u'aisle': u'Baking', u'name': u'molasses', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19304, u'unit': u'cup'}, {u'originalString': u'\xbc tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1\xbd sticks unsalted butter, room temperature', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'sticks', u'unitShort': u'sticks', u'amount': 1.5, u'consistency': u'solid', u'id': 1145, u'unit': u'sticks'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 12.0, u'sourceUrl': u'http://www.tablefortwoblog.com/molasses-ginger-cookies/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat oven to 350 degrees. Line baking sheets with parchment paper or silicone baking mats.In a medium bowl, whisk together flour, baking soda, salt, cinnamon, ginger, and cloves. Set aside.In the bowl of a stand mixer fitted with the paddle attachment, cream together butter and brown sugar until creamy and fluffy.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cloves.jpg', u'id': 1002011, u'name': u'clove'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Add in the the egg and molasses. Beat until incorporated.Slowly add in the dry ingredients until just combined. Drop onto prepared baking sheets with a cookie scoop. To make extra large sizes, I did two scoops of cookie dough, rolled in a ball, and gently pressed the tops down.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 19304, u'name': u'molasses'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake for 12-14 minutes. I took mine out a minute before they were done as I like mine softer and chewier.', u'length': {u'number': 14, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Let sit for 5 minutes before removing baking sheets.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}], u'step': u'Let cool completely on a wire rack.Store in an airtight container.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies works really well with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 61, u'instructions': u'Preheat oven to 350 degrees. Line baking sheets with parchment paper or silicone baking mats.In a medium bowl, whisk together flour, baking soda, salt, cinnamon, ginger, and cloves. Set aside.In the bowl of a stand mixer fitted with the paddle attachment, cream together butter and brown sugar until creamy and fluffy. Add in the the egg and molasses. Beat until incorporated.Slowly add in the dry ingredients until just combined. Drop onto prepared baking sheets with a cookie scoop. To make extra large sizes, I did two scoops of cookie dough, rolled in a ball, and gently pressed the tops down.Bake for 12-14 minutes. I took mine out a minute before they were done as I like mine softer and chewier.Let sit for 5 minutes before removing baking sheets. Let cool completely on a wire rack.Store in an airtight container.', u'spoonacularSourceUrl': u'https://spoonacular.com/molasses-ginger-cookies-fbcookieswap-593943', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}