{u'recipes': [{u'sourceName': u'Life, Love, and Sugar', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/547901-556x370.png', u'cheap': False, u'gaps': u'no', u'id': 547901, u'veryPopular': True, u'lowFodmap': False, u'title': u'{Skinny} Rainbow Ice Cream Cake with Fresh Fruit', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'pricePerServing': 335.87, u'creditText': u'Life, Love, and Sugar', u'extendedIngredients': [{u'originalString': u'1 cup blueberries', u'aisle': u'Produce', u'name': u'blueberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/blueberries.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9050, u'unit': u'cup'}, {u'originalString': u'20 oz cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1 cup grapes', u'aisle': u'Produce', u'name': u'grapes', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cup'}, {u'originalString': u'1 cup chopped kiwi (about 2 kiwis), OR juice from 2 limes', u'aisle': u'Produce', u'name': u'limes', u'metaInformation': [u'chopped', u'( 2 kiwis)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-wedge.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 9159, u'unit': u'cup'}, {u'originalString': u'1/2 cup + 1/8 cup milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1077, u'unit': u'cup'}, {u'originalString': u'20 oz Cool Whip (OR 2 1/2 recipes of homemade whipped cream)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'nonfat cool whip', u'metaInformation': [u'homemade', u'(OR 2 1/2 recipes of whipped cream)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'solid', u'id': 1200, u'unit': u'oz'}, {u'originalString': u'1 cup chopped peaches (about 2 peaches)', u'aisle': u'Produce', u'name': u'peaches', u'metaInformation': [u'chopped', u'( 2 peaches)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/peaches.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9236, u'unit': u'cup'}, {u'originalString': u'1 cup chopped pineapple', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u'cup'}, {u'originalString': u'Purple, blue, green, yellow, orange and red Gel Icing Color', u'aisle': u'Produce', u'name': u'purple plum', u'metaInformation': [u'green', u'blue', u'red', u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plum.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 9279, u'unit': u'servings'}, {u'originalString': u'1 cup chopped strawberries', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9316, u'unit': u'cup'}, {u'originalString': u'1 1/4 cups sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}], u'healthScore': 10.0, u'imageType': u'png', u'spoonacularScore': 66.0, u'sourceUrl': u'http://www.lifeloveandsugar.com/2013/06/03/skinny-rainbow-ice-cream-cake-with-fresh-fruit/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 31, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Making the ice cream:1.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix cream cheese, milk and sugar together with a mixer until completely combined. Should be somewhat thick and creamy.2. Fold in the Cool Whip.3. Separate ice cream mixture evenly between 6 bowls, about 1 3/4 cup + 1/8 cup per bowl. 4. Puree or crush each fruit, adding each to a different bowl so that you have all 6 flavors of ice cream.NOTE: I found the fruit tough to puree in a food processor because each amount is so small. I used a muddler to crush each of them instead. Do whichever you prefer. 5.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u"Add desired amount of appropriate gel icing color to each bowl to get the shade of each color you want. Layering the ice cream:1. Prepare your two 8-inch cake pans with parchment paper and cake circles. You can use spingform cake pans or regular. For more on pan preparation, see my note below. NOTE: The rest of the recipe will be written as if you are using 2 pans. If you are using 3, you'll do two layers of ice cream in each pan instead of 3.2. In the bottom of one pan, add the purple ice cream.", u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Spread evenly. 3. In the bottom of the other pan, add the yellow ice cream.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Spread evenly.4. Put both pans in the freezer for about 45 minutes to an hour, or until fairly firm. It should be firm enough that you can spread another layer on top without messing the previous layer up.5.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add a cup of Cool Whip to each pan, spreading evenly. Make sure you know which pan has which color in it. 6. Freeze again for about 30 minutes or until firm.7.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the blue ice cream to the pan with the purple ice cream.', u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Spread evenly.8.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the orange ice cream to the pan with the yellow ice cream.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Spread evenly.9. Freeze again for about 45 minutes to an hour or until firm.10.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add a cup of Cool Whip to each pan, spreading evenly. Freeze again for about 30 minutes or until firm.11.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the green ice cream to the pan with purple and blue ice cream.', u'number': 12, u'ingredients': []}, {u'equipment': [], u'step': u'Spread evenly.12.', u'number': 13, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the red ice cream to the pan with yellow and orange ice cream.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Spread evenly.13. Freeze again for about 45 minutes to an hour or until firm.14.', u'length': {u'number': 45, u'unit': u'minutes'}, u'number': 15, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add a cup of Cool Whip to the pan with the green ice cream on top. Do not add more Cool Whip to the pan with the red ice cream. This layer will be the filling between the green and yellow layers. Freeze again for about 30 minutes or until both layers are completely frozen.Putting it all together:1. Once completely frozen, remove both halves from their pans. You may need to run a knife around the top edge, but the parchment paper should have kept it from sticking. If you used sringform pans, remove the sides. If you used regular cake pans, lift the cakes out using the saran wrap.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 16, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}], u'step': u'Remove all parchment paper and saran wrap and remove the cake circle from the bottom of the yellow ice cream.2.', u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Spread a very thin layer of Cool Whip on top of the Cool Whip on the green ice cream, just to give something for the other layer to adhere to. 3.', u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}], u'step': u"Put the yellow/orange/red cake half on top of the purple/blue/green cake half. The green and yellow should meet in the middle. You should end up with purple on the bottom of the full cake and red on the top. 4. Freeze again until firm and steady.5. Frost your cake with the remaining Cool Whip and freeze. NOTE about preparing the pans: I used two 8-inch by 3-inch cake pans (not springform). This is a pretty tall cake, about 6 inches in height. Because my pans were 3 inches high, I only needed 2 pans, but if your pans are 2 inches high, you will probably need 3. Using multiple pans allows you to make the two halves (or 3 parts if you use three 2-inch pans) all at the same time. The other option is to use the same pan for each section, finishing and removing one section before moving to the next. It will work, but just take longer to get through all the layers. The best way to prepare the pans is to put a cardboard cake circle (found at craft stores like Michaels and JoAnns; I've also seen them at WalMart) in the bottom to help you remove it from the pan when done. You also should put parchment paper around the edges, allowing it to stick above the top edge of the pan. This will keep the ice cream from sticking to the sides of the pan. If you are using a regular cake pan, as I did, I recommend putting Saran wrap (or other clear wrap) in the pan underneath the cake circle and parchment paper (so put it in first). I used it to help lift the cake out of the pan once it was frozen. It came out really easily.", u'number': 19, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Ice Cream Cake on the menu? Try pairing with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 485, u'instructions': u"Making the ice cream:1. Mix cream cheese, milk and sugar together with a mixer until completely combined. Should be somewhat thick and creamy.2. Fold in the Cool Whip.3. Separate ice cream mixture evenly between 6 bowls, about 1 3/4 cup + 1/8 cup per bowl. 4. Puree or crush each fruit, adding each to a different bowl so that you have all 6 flavors of ice cream.NOTE: I found the fruit tough to puree in a food processor because each amount is so small. I used a muddler to crush each of them instead. Do whichever you prefer. 5. Add desired amount of appropriate gel icing color to each bowl to get the shade of each color you want. Layering the ice cream:1. Prepare your two 8-inch cake pans with parchment paper and cake circles. You can use spingform cake pans or regular. For more on pan preparation, see my note below. NOTE: The rest of the recipe will be written as if you are using 2 pans. If you are using 3, you'll do two layers of ice cream in each pan instead of 3.2. In the bottom of one pan, add the purple ice cream. Spread evenly. 3. In the bottom of the other pan, add the yellow ice cream. Spread evenly.4. Put both pans in the freezer for about 45 minutes to an hour, or until fairly firm. It should be firm enough that you can spread another layer on top without messing the previous layer up.5. Add a cup of Cool Whip to each pan, spreading evenly. Make sure you know which pan has which color in it. 6. Freeze again for about 30 minutes or until firm.7. Add the blue ice cream to the pan with the purple ice cream. Spread evenly.8. Add the orange ice cream to the pan with the yellow ice cream. Spread evenly.9. Freeze again for about 45 minutes to an hour or until firm.10. Add a cup of Cool Whip to each pan, spreading evenly. Freeze again for about 30 minutes or until firm.11. Add the green ice cream to the pan with purple and blue ice cream. Spread evenly.12. Add the red ice cream to the pan with yellow and orange ice cream. Spread evenly.13. Freeze again for about 45 minutes to an hour or until firm.14. Add a cup of Cool Whip to the pan with the green ice cream on top. Do not add more Cool Whip to the pan with the red ice cream. This layer will be the filling between the green and yellow layers. Freeze again for about 30 minutes or until both layers are completely frozen.Putting it all together:1. Once completely frozen, remove both halves from their pans. You may need to run a knife around the top edge, but the parchment paper should have kept it from sticking. If you used sringform pans, remove the sides. If you used regular cake pans, lift the cakes out using the saran wrap. Remove all parchment paper and saran wrap and remove the cake circle from the bottom of the yellow ice cream.2. Spread a very thin layer of Cool Whip on top of the Cool Whip on the green ice cream, just to give something for the other layer to adhere to. 3. Put the yellow/orange/red cake half on top of the purple/blue/green cake half. The green and yellow should meet in the middle. You should end up with purple on the bottom of the full cake and red on the top. 4. Freeze again until firm and steady.5. Frost your cake with the remaining Cool Whip and freeze. NOTE about preparing the pans: I used two 8-inch by 3-inch cake pans (not springform). This is a pretty tall cake, about 6 inches in height. Because my pans were 3 inches high, I only needed 2 pans, but if your pans are 2 inches high, you will probably need 3. Using multiple pans allows you to make the two halves (or 3 parts if you use three 2-inch pans) all at the same time. The other option is to use the same pan for each section, finishing and removing one section before moving to the next. It will work, but just take longer to get through all the layers. The best way to prepare the pans is to put a cardboard cake circle (found at craft stores like Michaels and JoAnns; I've also seen them at WalMart) in the bottom to help you remove it from the pan when done. You also should put parchment paper around the edges, allowing it to stick above the top edge of the pan. This will keep the ice cream from sticking to the sides of the pan. If you are using a regular cake pan, as I did, I recommend putting Saran wrap (or other clear wrap) in the pan underneath the cake circle and parchment paper (so put it in first). I used it to help lift the cake out of the pan once it was frozen. It came out really easily.", u'spoonacularSourceUrl': u'https://spoonacular.com/skinny-rainbow-ice-cream-cake-with-fresh-fruit-547901', u'dishTypes': [], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}