{u'recipes': [{u'sourceName': u'Cookie Monster Cooking', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/490345-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 490345, u'veryPopular': True, u'lowFodmap': False, u'title': u'Apple Pie Popsicles', u'diets': [u'lacto ovo vegetarian'], u'pricePerServing': 57.01, u'creditText': u'Cookie Monster Cooking', u'extendedIngredients': [{u'originalString': u'dash of allspice', u'aisle': u'Spices and Seasonings', u'name': u'allspice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2001, u'unit': u'dash'}, {u'originalString': u'\xbc cup apple cider', u'aisle': u'Beverages', u'name': u'apple cider', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1009016, u'unit': u'cup'}, {u'originalString': u'\xbd cup unsweetened applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 9019, u'unit': u'cup'}, {u'originalString': u'\xbc teaspoon cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup crushed graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 18617, u'unit': u'cup'}, {u'originalString': u'\xbe cup half and half', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'half and half', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 1049, u'unit': u'cup'}, {u'originalString': u'1 tablespoon packed light brown sugar', u'aisle': u'Baking', u'name': u'light brown sugar', u'metaInformation': [u'light', u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 19334, u'unit': u'tablespoon'}, {u'originalString': u'2 teaspoons pure maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'teaspoons'}, {u'originalString': u'dash of nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'dash', u'unitShort': u'dash', u'amount': 1.0, u'consistency': u'solid', u'id': 2025, u'unit': u'dash'}, {u'originalString': u'\xbd teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 30.0, u'sourceUrl': u'http://cookiemonstercooking.com/2013/09/25/apple-pie-popsicles/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Add the applesauce, cider, half and half, brown sugar, cinnamon, nutmeg, allspice, maple syrup and vanilla to a blender.  Process until smooth.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1049, u'name': u'half and half'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-dark.jpg', u'id': 19334, u'name': u'brown sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'id': 19911, u'name': u'maple syrup'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'id': 9019, u'name': u'applesauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/allspice-ground.jpg', u'id': 2001, u'name': u'allspice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/popsicle-molds.jpg', u'id': 405929, u'name': u'popsicle molds'}], u'step': u"Add in the graham cracker crumbs and pulse a few times to combine.  Immediately pour the mixture into popsicle molds and then freeze according to the manufacturer's directions (for me it takes about 5 to 8 hours to freeze completely).", u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 10018617, u'name': u'graham cracker crumbs'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are great choices for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. The Snake River Late Harvest Riesling with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'honey , minerality , lime', u'title': u'Snake River Late Harvest Riesling', u'price': u'$16.0', u'id': 431450, u'link': u'https://www.amazon.com/2010-Snake-River-Harvest-Riesling/dp/B00GWUM1A4', u'imageUrl': u'https://spoonacular.com/productImages/431450-312x231.jpg'}]}, u'aggregateLikes': 1429, u'instructions': u"Add the applesauce, cider, half and half, brown sugar, cinnamon, nutmeg, allspice, maple syrup and vanilla to a blender.  Process until smooth.  Add in the graham cracker crumbs and pulse a few times to combine.  Immediately pour the mixture into popsicle molds and then freeze according to the manufacturer's directions (for me it takes about 5 to 8 hours to freeze completely).", u'spoonacularSourceUrl': u'https://spoonacular.com/apple-pie-popsicles-490345', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}