{u'recipes': [{u'sourceName': u'Beyond Frosting', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/591013-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 591013, u'veryPopular': True, u'lowFodmap': False, u'title': u'Coconut Key Lime Monkey Bread', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 33.39, u'creditText': u'Beyond Frosting', u'extendedIngredients': [{u'originalString': u'2 pkg Pillsbury Grand Homestyle Biscuits', u'aisle': u'Refrigerated', u'name': u'biscuits', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'unitLong': u'packages', u'unitShort': u'pkg', u'amount': 2.0, u'consistency': u'solid', u'id': 18009, u'unit': u'pkg'}, {u'originalString': u'\xbc C Shredded coconut', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 12104, u'unit': u'C'}, {u'originalString': u'\xbd C Shredded coconut, toasted', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'shredded', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12104, u'unit': u'C'}, {u'originalString': u'\xbd C Granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'C'}, {u'originalString': u'Lime Zest', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'servings'}, {u'originalString': u'1-2 tbsp Milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'tbsp'}, {u'originalString': u'1\xbc C Powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 19336, u'unit': u'C'}, {u'originalString': u'\xbc C Unsalted butter, melted', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'melted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1145, u'unit': u'C'}, {u'originalString': u'1 tsp Vanilla bean paste', u'aisle': u'Gourmet', u'name': u'vanilla bean paste', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93813, u'unit': u'tsp'}, {u'originalString': u'1 C Pillsbury Key Lime Cake Mix (dry)', u'aisle': u'Baking', u'name': u'white cake mix', u'metaInformation': [u'dry', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cake-mix.jpg', u'unitLong': u'C', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 18137, u'unit': u'C'}, {u'originalString': u'\xbc C White chocolate chips', u'aisle': u'Baking', u'name': u'white chocolate chips', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'unitLong': u'Cs', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 10019087, u'unit': u'C'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://beyondfrosting.com/2014/04/16/coconut-key-lime-monkey-bread/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 12, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-paper.jpg', u'id': 404770, u'name': u'baking paper'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Pre-heat oven to 350 F. Grease a muffin pan with Crisco or cooking spray. Make sure to get the top of the pan as well.Line a baking sheet with parchment paper or baking mat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Bake coconut until it start to turn light brown.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to cool. Save until muffins are glazed.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Remove biscuits from container and cut into quarters.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/microwave.jpg', u'id': 404762, u'name': u'microwave'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place in a large Ziploc bag.Melt butter in a microwave safe bowl, about 30 seconds.', u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Pour melted butter in Ziploc bag and shake to coat the biscuits in butter.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}]}, {u'equipment': [], u'step': u'Pour dry key lime cake mix and granulated sugar into the bag. Seal and shake vigorously to coat the biscuit dough with the dry ingredients.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'granulated sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-tray.jpg', u'id': 404671, u'name': u'muffin tray'}], u'step': u'Place 3 pieces of biscuit dough in the bottom of each muffin pan to form the base.Sprinkle some coconut and white chocolate chips on top of the dough. Zest a little bit of lime into the middle of each muffin.', u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-chocolate-chips.jpg', u'id': 10019087, u'name': u'white chocolate chips'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/buttermilk-biscuits.jpg', u'id': 18009, u'name': u'biscuits'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}]}, {u'equipment': [], u'step': u'Place another 2-4 pieces of dough on top of each base and gently squish with your finger. Use up all remaining dough. Top with additional sprinkle of coconut', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}, {u'equipment': [], u'step': u'Bake at 350 F for 15-20 minutes until the tops are golden brown.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 10, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and allow to cool for 15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 11, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine powdered sugar, vanilla bean paste and 1 tablespoon of milk in a small bowl.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/molasses.jpg', u'id': 93813, u'name': u'vanilla paste'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk until smooth. To make glaze thinner, add additional milk. To make glaze thicker, add additional powdered sugar. Glaze warm muffins.Top with toasted coconut and zest of lime.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime.jpg', u'id': 9159, u'name': u'lime'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Monkey Bread works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1124, u'instructions': u'Pre-heat oven to 350 F. Grease a muffin pan with Crisco or cooking spray. Make sure to get the top of the pan as well.Line a baking sheet with parchment paper or baking mat. Bake coconut until it start to turn light brown. Remove from oven and allow to cool. Save until muffins are glazed.Remove biscuits from container and cut into quarters. Place in a large Ziploc bag.Melt butter in a microwave safe bowl, about 30 seconds. Pour melted butter in Ziploc bag and shake to coat the biscuits in butter.Pour dry key lime cake mix and granulated sugar into the bag. Seal and shake vigorously to coat the biscuit dough with the dry ingredients.Place 3 pieces of biscuit dough in the bottom of each muffin pan to form the base.Sprinkle some coconut and white chocolate chips on top of the dough. Zest a little bit of lime into the middle of each muffin.Place another 2-4 pieces of dough on top of each base and gently squish with your finger. Use up all remaining dough. Top with additional sprinkle of coconutBake at 350 F for 15-20 minutes until the tops are golden brown. Remove from oven and allow to cool for 15 minutes.Combine powdered sugar, vanilla bean paste and 1 tablespoon of milk in a small bowl. Whisk until smooth. To make glaze thinner, add additional milk. To make glaze thicker, add additional powdered sugar. Glaze warm muffins.Top with toasted coconut and zest of lime.', u'spoonacularSourceUrl': u'https://spoonacular.com/coconut-key-lime-monkey-bread-591013', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}