{u'recipes': [{u'sourceName': u'Desserts with Benefits', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/610451-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 5, u'id': 610451, u'veryPopular': True, u'lowFodmap': False, u'title': u'Healthy Apple Pie Cheesecake Dip (sugar free, low carb, low fat, high protein & gluten free)', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 111.51, u'creditText': u'Desserts with Benefits', u'extendedIngredients': [{u'originalString': u'1/2 Tbs Apple Cider Vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 0.5, u'consistency': u'liquid', u'id': 2048, u'unit': u'Tbs'}, {u'originalString': u'1 cup Unsweetened Applesauce', u'aisle': u'Canned and Jarred', u'name': u'applesauce', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/applesauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9019, u'unit': u'cup'}, {u'originalString': u'2 tsp Cinnamon', u'aisle': u'Spices and Seasonings', u'name': u'cinnamon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2010, u'unit': u'tsp'}, {u'originalString': u'2 cups Low Fat Cottage Cheese', u'aisle': u'Cheese', u'name': u'low fat cottage cheese', u'metaInformation': [u'low fat'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cottage-cheese.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 1016, u'unit': u'cups'}, {u'originalString': u'1 tsp Stevia Extract', u'aisle': u'Baking', u'name': u'stevia extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stevia.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 93628, u'unit': u'tsp'}], u'healthScore': 9.0, u'imageType': u'jpg', u'spoonacularScore': 71.0, u'sourceUrl': u'http://dessertswithbenefits.com/healthy-apple-pie-cheesecake-dip/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/food-processor.png', u'id': 404771, u'name': u'food processor'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/blender.png', u'id': 404726, u'name': u'blender'}], u'step': u'Place all the ingredients in a blender or food processor and blend until smooth.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'Pour into a dish, cover with plastic wrap and refrigerate overnight.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve the next day with freshly sliced apples, strawberries, (gluten free) graham crackers or spoons alone!', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Dip works really well with Sparkling ros\xe9 and Sparkling Wine. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Bellissima Sparkling ros\xe9. It has 4.5 out of 5 stars and a bottle costs about 24 dollars.", u'pairedWines': [u'sparkling rose', u'sparkling wine'], u'productMatches': [{u'description': u'This is an elegant, bright ros\xe9, with hints of strawberry and grapefruit, and a soft, persistent foam. Uncorked at the very last minute, Bellissima Sparkling Ros\xe9 pairs perfectly with smoked salmon, shellfish, and seafood hor d’oeuvres such as tuna tartare, sushi, and sashimi. View More', u'title': u'Bellissima Sparkling Rose', u'price': u'$23.99', u'id': 458665, u'link': u'https://www.wine.com/product/bellissima-sparkling-rose/293794', u'imageUrl': u'https://spoonacular.com/productImages/458665-312x231.jpg'}]}, u'aggregateLikes': 421, u'instructions': u'Place all the ingredients in a blender or food processor and blend until smooth.Pour into a dish, cover with plastic wrap and refrigerate overnight.Serve the next day with freshly sliced apples, strawberries, (gluten free) graham crackers or spoons alone!', u'spoonacularSourceUrl': u'https://spoonacular.com/healthy-apple-pie-cheesecake-dip-sugar-free-low-carb-low-fat-high-protein-gluten-free-610451', u'dishTypes': [u'antipasti', u'condiment', u'starter', u'snack', u'appetizer', u'dip', u'antipasto', u"hor d'oeuvre", u'spread'], u'occasions': [u'super bowl'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 15, u'servings': 3, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}