{u'recipes': [{u'sourceName': u'Bakers Royale', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/673349-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 673349, u'veryPopular': True, u'lowFodmap': False, u'title': u'Graham Cracker & Popcorn Toffee Bars', u'diets': [], u'pricePerServing': 59.93, u'creditText': u'Bakers Royale', u'extendedIngredients': [{u'originalString': u'1 cup chopped semisweet chocolate or chocolate chips (about 6 oz.)', u'aisle': u'Baking', u'name': u'chocolate chips', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-chips.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 10019146, u'unit': u'oz'}, {u'originalString': u'15 graham crackers', u'aisle': u'Sweet Snacks', u'name': u'graham crackers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 18617, u'unit': u''}, {u'originalString': u'4 cups popped popcorn (from \xbc cup kernels)', u'aisle': u'Savory Snacks', u'name': u'popcorn', u'metaInformation': [u'(from \xbc cup kernels)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'liquid', u'id': 19034, u'unit': u'cups'}, {u'originalString': u'\xbe cup puffed Special K cereal', u'aisle': u'Cereal', u'name': u'puffed rice cereal', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rice-crispy-cereal.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 8066, u'unit': u'cup'}, {u'originalString': u'Flaky sea salt (for serving)', u'aisle': u'Spices and Seasonings', u'name': u'sea-salt', u'metaInformation': [u'(for serving)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 12.0, u'consistency': u'solid', u'id': 1012047, u'unit': u'servings'}, {u'originalString': u'\xbe cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1\xbd cups (3 sticks) unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'(3 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 1145, u'unit': u'cups'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.bakersroyale.com/candy/graham-cracker-popcorn-toffee-bars/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Heatoven to 350. Line a large rimmed baking sheet with foil and lightly coat with nonstick spray. Arrange graham crackers in a single layer on baking sheet, breaking to fit as needed to cover entire surface. Top with popcorn, peanuts, and cereal.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Place butter and sugar, in a medium saucepan and bring it to a boil over medium-high heat. Once boiling, stir once, then reduce heat and simmer, swirling occasionally, until mixture is golden brown and syrupy, 810 minutes.', u'length': {u'number': 810, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Pour toffee mixture evenly over graham crackers and popcorn mixture.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/graham-crackers.jpg', u'id': 18617, u'name': u'graham crackers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn.jpg', u'id': 19034, u'name': u'popcorn'}]}, {u'equipment': [], u'step': u'Bake until toffee is slightly darkened to the shade of a brown paper bag and bubbling, about 1012 minutes.', u'length': {u'number': 1012, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Remove from oven and top with chocolate and sprinkle with salt. Set aside to cool in baking sheet before breaking into pieces.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Fingerfood can be paired with Sparkling Wine and Sparkling ros\xe9. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. One wine you could try is Billecart-Salmon Brut ros\xe9 ( Magnum). It has 4.7 out of 5 stars and a bottle costs about 170 dollars.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'Persistent mousse, with fine bubbles rising slowly. Pale salmon pink in color, with a shade of gold. A nose of red fruits and fresh pear. Delicate fruit on the palate, elegant, and showing great finesse. View More', u'title': u'Billecart-Salmon Brut Rose ( Magnum)', u'price': u'$169.99', u'id': 457927, u'link': u'https://www.wine.com/product/billecart-salmon-brut-rose-15-liter-magnum/57383', u'imageUrl': u'https://spoonacular.com/productImages/457927-312x231.jpg'}]}, u'aggregateLikes': 644, u'instructions': u'Heatoven to 350. Line a large rimmed baking sheet with foil and lightly coat with nonstick spray. Arrange graham crackers in a single layer on baking sheet, breaking to fit as needed to cover entire surface. Top with popcorn, peanuts, and cereal.Place butter and sugar, in a medium saucepan and bring it to a boil over medium-high heat. Once boiling, stir once, then reduce heat and simmer, swirling occasionally, until mixture is golden brown and syrupy, 810 minutes.Pour toffee mixture evenly over graham crackers and popcorn mixture. Bake until toffee is slightly darkened to the shade of a brown paper bag and bubbling, about 1012 minutes. Remove from oven and top with chocolate and sprinkle with salt. Set aside to cool in baking sheet before breaking into pieces.', u'spoonacularSourceUrl': u'https://spoonacular.com/graham-cracker-popcorn-toffee-bars-673349', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}