{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/738375-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 738375, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Raspberry Pavlova', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 140.61, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 to 2 ounces dark chocolate', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounce', u'unitShort': u'oz', u'amount': 1.0, u'consistency': u'solid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'2 ounces dark chocolate, finely chopped', u'aisle': u'Sweet Snacks', u'name': u'dark chocolate', u'metaInformation': [u'dark', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-chocolate-pieces.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 2.0, u'consistency': u'solid', u'id': 19904, u'unit': u'ounces'}, {u'originalString': u'6 large egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 cups heavy cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cups'}, {u'originalString': u'4 cups raspberries', u'aisle': u'Produce', u'name': u'raspberries', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 9302, u'unit': u'cups'}, {u'originalString': u'1 teaspoon balsamic or red wine vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'red wine vinegar', u'metaInformation': [u'red'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine-vinegar.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1022068, u'unit': u'teaspoon'}, {u'originalString': u'2 cups superfine sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'3 tablespoons unsweetened cocoa powder, sifted', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened', u'sifted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 19165, u'unit': u'tablespoons'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 37.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/nigella-lawson/chocolate-raspberry-pavlova-recipe.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 19, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/cake-pan.png', u'id': 404747, u'name': u'cake form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Prepare the pan: Preheat the oven to 350 degrees F and line a baking sheet with parchment. Draw a 9-inch-diameter circle on the paper with a pencil, tracing a round cake tin that size.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u"Flip the paper over so your meringue doesn't touch the pencil marks - you'll still be able to see the circle.", u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Make the meringue: Beat the egg whites with a mixer until satiny peaks form, and then beat in the sugar a spoonful at a time until the meringue is stiff and shiny.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Add the chocolate: Sprinkle the cocoa, vinegar and then the chopped chocolate over the egg whites. Gently fold everything with a rubber spatula until the cocoa is thoroughly mixed in.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Shape the meringue: Secure the parchment to the baking sheet with a dab of meringue under each corner. Mound the meringue onto the parchment within the circle, smoothing the sides and the top with a spatula.', u'number': 5, u'ingredients': []}], u'name': u''}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 300.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u"Place in the oven, then immediately turn the temperature down to 300 degrees F and cook for one to one and a quarter hours. When it's ready, it should look crisp and dry on top, but when you prod the center you should feel the promise of squidginess beneath your fingers.", u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u"Let it cool: Turn off the oven and open the door slightly; let the chocolate meringue disk cool completely in the oven. When you'reready to serve, invert onto a big flatbottomed plate and peel off the parchment.", u'number': 2, u'ingredients': []}], u'name': u'Bake the meringue'}, {u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u"Whisk the cream till thick but still soft and pile it on top of the meringue, then scatter the raspberries on top. Coarsely grate the chocolate haphazardly over the top so that you get curls of chocolate rather than rubble, as you don't want the raspberries' luscious color and form to be obscured. You want the Pavlova to look like a frosted cake.", u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raspberries.jpg', u'id': 9302, u'name': u'raspberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'id': 1053, u'name': u'cream'}]}, {u'equipment': [], u'step': u'Photographs by Lis Parsons', u'number': 2, u'ingredients': []}], u'name': u'Decorate the Pavlova'}], u'aggregateLikes': 2934, u'instructions': u"Prepare the pan: Preheat the oven to 350 degrees F and line a baking sheet with parchment. Draw a 9-inch-diameter circle on the paper with a pencil, tracing a round cake tin that size.                          Flip the paper over so your meringue doesn't touch the pencil marks - you'll still be able to see the circle.                          Make the meringue: Beat the egg whites with a mixer until satiny peaks form, and then beat in the sugar a spoonful at a time until the meringue is stiff and shiny.                          Add the chocolate: Sprinkle the cocoa, vinegar and then the chopped chocolate over the egg whites. Gently fold everything with a rubber spatula until the cocoa is thoroughly mixed in.                          Shape the meringue: Secure the parchment to the baking sheet with a dab of meringue under each corner. Mound the meringue onto the parchment within the circle, smoothing the sides and the top with a spatula.                          Bake the meringue: Place in the oven, then immediately turn the temperature down to 300 degrees F and cook for one to one and a quarter hours. When it's ready, it should look crisp and dry on top, but when you prod the center you should feel the promise of squidginess beneath your fingers.                          Let it cool: Turn off the oven and open the door slightly; let the chocolate meringue disk cool completely in the oven. When you'reready to serve, invert onto a big flatbottomed plate and peel off the parchment.                          Decorate the Pavlova: Whisk the cream till thick but still soft and pile it on top of the meringue, then scatter the raspberries on top. Coarsely grate the chocolate haphazardly over the top so that you get curls of chocolate rather than rubble, as you don't want the raspberries' luscious color and form to be obscured. You want the Pavlova to look like a frosted cake.                          Photographs by Lis Parsons", u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-raspberry-pavlova-738375', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}