{u'recipes': [{u'sourceName': u'Moms with Crock Pots', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/483573-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 483573, u'veryPopular': True, u'lowFodmap': False, u'title': u'Crock Pot Lasagna', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 242.2, u'creditText': u'Moms with Crock Pots', u'extendedIngredients': [{u'originalString': u'1 pound bulk Italian sausage', u'aisle': u'Meat', u'name': u'bulk pork sausage', u'metaInformation': [u'italian'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7063, u'unit': u'pound'}, {u'originalString': u'3 cans (15 ounces each) Italian-style tomato sauce', u'aisle': u'Canned and Jarred', u'name': u'canned tomato sauce', u'metaInformation': [u'italian-style', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 45.0, u'consistency': u'solid', u'id': 11549, u'unit': u'ounces'}, {u'originalString': u'2 teaspoons dried basil leaves', u'aisle': u'Spices and Seasonings', u'name': u'dried basil leaves', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/basil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2003, u'unit': u'teaspoons'}, {u'originalString': u'15 uncooked lasagna noodles', u'aisle': u'Pasta and Rice', u'name': u'lasagna noodles', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lasagna-noodles.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 15.0, u'consistency': u'solid', u'id': 10620420, u'unit': u''}, {u'originalString': u'1 medium onion, chopped (1/2 cup)', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'1 cup grated Parmesan cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 container (15 ounces) part-skim ricotta cheese', u'aisle': u'Cheese', u'name': u'part-skim ricotta cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ricotta-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 15.0, u'consistency': u'solid', u'id': 1037, u'unit': u'ounces'}, {u'originalString': u'\xbd teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'2 cups shredded mozzarella cheese (8 ounces)', u'aisle': u'Cheese', u'name': u'shredded mozzarella cheese', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1001026, u'unit': u'ounces'}], u'healthScore': 15.0, u'imageType': u'jpg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://momswithcrockpots.com/2011/10/crock-pot-lasagna/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cook sausage and onion in 10-inch skillet over medium heat 6 to 8 minutes, stirring occasionally, until sausage is no longer pink; drain. Stir in tomato sauce, basil and salt.', u'length': {u'number': 6, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato-sauce-or-pasta-sauce.jpg', u'id': 11549, u'name': u'tomato sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Mix 1 cup of the mozzarella cheese and the ricotta and Parmesan cheeses. (Refrigerate remaining mozzarella cheese while lasagna cooks.)Spoon one-fourth of the sausage mixture into 6-quart slow cooker; top with 5 noodles, broken into pieces to fit.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Spread with half of the cheese mixture and one-fourth of the sausage mixture. Top with 5 noodles, remaining cheese mixture and one-fourth of the sausage mixture. Top with remaining 5 noodles and remaining sausage mixture.Cover and cook on Low heat setting 4 to 6 hours or until noodles are tender.Sprinkle top of lasagna with remaining 1 cup mozzarella cheese. Cover and let stand about 10 minutes or until cheese is melted.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fusilli.jpg', u'id': 20420, u'name': u'pasta'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-pork-sausage.jpg', u'id': 1017063, u'name': u'sausage'}]}, {u'equipment': [], u'step': u'Cut into pieces.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Lasagne works really well with Montepulciano, Sangiovese, and Chianti. Lasagna pairs well with medium-bodied red wine with higher acidity. Sangiovese, Montepulciano, and Chianti all fit the bill. The Buccicatino Montepulciano d with a 4.5 out of 5 star rating seems like a good match. It costs about 18 dollars per bottle.', u'pairedWines': [u'montepulciano', u'sangiovese', u'chianti'], u'productMatches': [{u'description': u'plum , dark chocolate , rich', u'title': u'Buccicatino Montepulciano d', u'price': u'$17.98', u'id': 469179, u'link': u'https://www.amazon.com/2013-Buccicatino-Montepulciano-dAbruzzo-750/dp/B00N491YF4', u'imageUrl': u'https://spoonacular.com/productImages/469179-312x231.jpg'}]}, u'aggregateLikes': 2116, u'instructions': u'Cook sausage and onion in 10-inch skillet over medium heat 6 to 8 minutes, stirring occasionally, until sausage is no longer pink; drain. Stir in tomato sauce, basil and salt.Mix 1 cup of the mozzarella cheese and the ricotta and Parmesan cheeses. (Refrigerate remaining mozzarella cheese while lasagna cooks.)Spoon one-fourth of the sausage mixture into 6-quart slow cooker; top with 5 noodles, broken into pieces to fit. Spread with half of the cheese mixture and one-fourth of the sausage mixture. Top with 5 noodles, remaining cheese mixture and one-fourth of the sausage mixture. Top with remaining 5 noodles and remaining sausage mixture.Cover and cook on Low heat setting 4 to 6 hours or until noodles are tender.Sprinkle top of lasagna with remaining 1 cup mozzarella cheese. Cover and let stand about 10 minutes or until cheese is melted. Cut into pieces.', u'spoonacularSourceUrl': u'https://spoonacular.com/crock-pot-lasagna-483573', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}