{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/744093-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 360, u'id': 744093, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bite-Size Cheesecakes on Lemon-Pepper-Cornmeal Crusts', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 40.33, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1 pound cream cheese', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 1017, u'unit': u'pound'}, {u'originalString': u'1 egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'2 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup plus 2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'1 tablespoon all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoon'}, {u'originalString': u'1/2 lemon, rind grated', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'Lemon confit, finely chopped, for garnish', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'finely chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 9150, u'unit': u'servings'}, {u'originalString': u'2 large lemons', u'aisle': u'Produce', u'name': u'lemons', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 9150, u'unit': u''}, {u'originalString': u'Pinch salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2047, u'unit': u'pinch'}, {u'originalString': u'1/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/2 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'6 tablespoons cold unsalted butter, cut into pieces', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cold', u'cut into pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/8 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'2 cups water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cups'}, {u'originalString': u'1 1/4 cups polenta, or yellow cornmeal, if unavailable', u'aisle': u'Ethnic Foods;Baking', u'name': u'yellow cornmeal', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 35137, u'unit': u'cups'}], u'healthScore': 1.0, u'imageType': u'jpeg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/bite-size-cheesecakes-on-lemon-pepper-cornmeal-crusts-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 9, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cut a slice off the top and bottom of each lemon to expose the flesh.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}, {u'equipment': [], u'step': u'Cutting from top to bottom and following the contours of the fruit, cut off the peel and white pith in 1-inch-wide strips. Scrape off any pulp adhering to the strips, but leave the pith intact. You should have several 1-inch wide strips of lemon peel and pith.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Cut each 1 into long strips, about 1/4-inch by 3 inches each.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Meanwhile, boil a kettleful of water.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour about 2 cups of the boiling water into a small saucepan, bring back to a boil, add all the lemon rind, and boil 30 seconds.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Drain in a strainer and rinse under cold running water. Repeat 2 times more, using fresh boiling water each time.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Combine the sugar and 2 cups of water in the saucepan and bring to a boil.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Add the blanched rind and reduce the heat to a simmer. Simmer until tender, about 1 hour.', u'number': 8, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wire-rack.jpg', u'id': 405900, u'name': u'wire rack'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}], u'step': u'Drain in a strainer (reserve the sweet, lemony syrup for sweetening drinks, if you like). Arrange the strips on a wire rack, using your fingers to gently spread them out so that they do not touch each other.', u'number': 9, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool and store in an airtight container.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'To make the crust: Cream the butter until soft and smooth in a mixer fitted with a paddle attachment.', u'number': 11, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sugar and continue creaming until light and fluffy.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Mix in the egg and the vanilla. In a separate bowl, stir together the dry ingredients.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Add the dry ingredients to the mixer and mix at low speed until almost blended. Turn the dough out onto a work surface and knead briefly, just until the dough comes together. Form into a disk and chill at least 2 hours or overnight.', u'number': 14, u'ingredients': []}, {u'equipment': [], u'step': u'Flour a work surface.', u'number': 15, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}]}, {u'equipment': [], u'step': u'Roll out the dough 1/8-inch thick and prick all over with a fork. Use a cutter to cut out rounds of pastry that are slightly larger in diameter than your mini-muffin cups.', u'number': 16, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Transfer the pastry rounds to a sheet pan and chill 30 minutes. Preheat the oven to 375 degrees F and bake until light golden brown, about 20 minutes.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 17, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool.', u'number': 18, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Butter 2 mini-muffin tins and then lay a large piece of heavy duty plastic wrap over the tin. Push the plastic wrap down into each cup (this is to line it very well). Do not worry, the plastic wrap will not burn or melt in the oven.', u'number': 19, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 375.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Heat the oven to 375 degrees F.', u'number': 20, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'To make the filling: Whip the cream cheese until light and fluffy in a mixer fitted with a whisk attachment.', u'number': 21, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Add the sugar and mix.', u'number': 22, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [], u'step': u'Mix in the eggs and vanilla, then the flour and salt. Divide the filling among the lined cups, filling each one all the way up.', u'number': 23, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake for 20 minutes.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 24, u'ingredients': []}, {u'equipment': [], u'step': u'Let cool to room temperature, then chill.', u'number': 25, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}], u'step': u'When ready to serve, cut the plastic wrap so you can remove each cup of cheesecake individually. Lift each one out of the cup and invert onto a cornmeal crust. Peel off the plastic wrap. When all the cakes have been assembled, top each one with a tiny mound of chopped lemon confit and serve.', u'number': 26, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cornmeal.jpg', u'id': 35137, u'name': u'cornmeal'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}], u'name': u'To make the confit'}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 26, u'instructions': u'To make the confit: Cut a slice off the top and bottom of each lemon to expose the flesh. Cutting from top to bottom and following the contours of the fruit, cut off the peel and white pith in 1-inch-wide strips. Scrape off any pulp adhering to the strips, but leave the pith intact. You should have several 1-inch wide strips of lemon peel and pith. Cut each 1 into long strips, about 1/4-inch by 3 inches each.                          Meanwhile, boil a kettleful of water. Pour about 2 cups of the boiling water into a small saucepan, bring back to a boil, add all the lemon rind, and boil 30 seconds. Drain in a strainer and rinse under cold running water. Repeat 2 times more, using fresh boiling water each time. Combine the sugar and 2 cups of water in the saucepan and bring to a boil. Add the blanched rind and reduce the heat to a simmer. Simmer until tender, about 1 hour.                          Drain in a strainer (reserve the sweet, lemony syrup for sweetening drinks, if you like). Arrange the strips on a wire rack, using your fingers to gently spread them out so that they do not touch each other. Let cool and store in an airtight container.                          To make the crust: Cream the butter until soft and smooth in a mixer fitted with a paddle attachment. Add the sugar and continue creaming until light and fluffy. Mix in the egg and the vanilla. In a separate bowl, stir together the dry ingredients. Add the dry ingredients to the mixer and mix at low speed until almost blended. Turn the dough out onto a work surface and knead briefly, just until the dough comes together. Form into a disk and chill at least 2 hours or overnight.                          Flour a work surface. Roll out the dough 1/8-inch thick and prick all over with a fork. Use a cutter to cut out rounds of pastry that are slightly larger in diameter than your mini-muffin cups. Transfer the pastry rounds to a sheet pan and chill 30 minutes. Preheat the oven to 375 degrees F and bake until light golden brown, about 20 minutes. Let cool.                          Butter 2 mini-muffin tins and then lay a large piece of heavy duty plastic wrap over the tin. Push the plastic wrap down into each cup (this is to line it very well). Do not worry, the plastic wrap will not burn or melt in the oven. Heat the oven to 375 degrees F.                          To make the filling: Whip the cream cheese until light and fluffy in a mixer fitted with a whisk attachment. Add the sugar and mix. Mix in the eggs and vanilla, then the flour and salt. Divide the filling among the lined cups, filling each one all the way up. Bake for 20 minutes. Let cool to room temperature, then chill.                          When ready to serve, cut the plastic wrap so you can remove each cup of cheesecake individually. Lift each one out of the cup and invert onto a cornmeal crust. Peel off the plastic wrap. When all the cakes have been assembled, top each one with a tiny mound of chopped lemon confit and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/bite-size-cheesecakes-on-lemon-pepper-cornmeal-crusts-744093', u'dishTypes': [], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 370, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}