{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/442945-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 45, u'id': 442945, u'veryPopular': False, u'lowFodmap': False, u'title': u'Sunshine Sponge Cake', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 25, u'pricePerServing': 42.68, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon baking powder', u'aisle': u'Baking', u'name': u'baking powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 18371, u'unit': u'teaspoon'}, {u'originalString': u'1/3 cup butter, softened', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'softened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 1001, u'unit': u'cup'}, {u'originalString': u"4-1/2 cups confectioners' sugar", u'aisle': u'Baking', u'name': u"confectioners' sugar", u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 4.0, u'consistency': u'solid', u'id': 19336, u'unit': u'cups'}, {u'originalString': u'1 teaspoon cream of tartar', u'aisle': u'Spices and Seasonings;Baking', u'name': u'cream of tartar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18373, u'unit': u'teaspoon'}, {u'originalString': u'9 eggs, separated', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [u'separated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 9.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1-1/4 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'Daisies and additional lemon verbena leaves, optional', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'leave', u'unitShort': u'leaves', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u'leaves'}, {u'originalString': u'1 tablespoon minced fresh lemon verbena leaves', u'aisle': u'Produce', u'name': u'lemon', u'metaInformation': [u'fresh', u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-wedge.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 9150, u'unit': u'tablespoon'}, {u'originalString': u'1/4 teaspoon lemon extract', u'aisle': u'Baking', u'name': u'lemon extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-oil.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'liquid', u'id': 12311111, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup lemon juice', u'aisle': u'Produce', u'name': u'lemon juice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 9152, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1-1/2 cups sugar, divided', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cups'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 11.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/sunshine-sponge-cake', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 15, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a bowl, beat the egg yolks on high until thickened and lemon-colored.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add water, lemon verbena and vanilla. Gradually beat in 1 cup sugar. beat for 4-5 minutes or until mixture doubles in volume.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Combine flour and baking powder; sprinkle 1/4 cupful over batter and fold in until combined. Repeat with remaining flour mixture; set aside. In another bowl, beat the egg whites, cream of tartar and salt until soft peaks form.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18373, u'name': u'cream of tartar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18371, u'name': u'baking powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add remaining sugar, 1 tablespoon at a time, beating until stiff peaks form. Gently fold into batter.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Pour into an ungreased 10-in. tube pan.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Bake at 350\xb0 for 45-50 minutes or until top springs back when lightly touched. Immediately invert the pan; cool completely. Run a knife around sides of pan and remove cake to a serving plate. In a bowl, cream 2 cups sugar, butter, lemon juice and extracts. Slowly add remaining sugar. If needed, beat in a small amount of water until the frosting reaches desired spreading consistency. Frost cake.', u'length': {u'number': 50, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Garnish with daisies and lemon verbena if desired.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon.jpg', u'id': 9150, u'name': u'lemon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Cake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Solera Cream Sherry. Reviewers quite like it with a 4.5 out of 5 star rating and a price of about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 9, u'instructions': u"Directions                                                                                In a bowl, beat the egg yolks on high until thickened and lemon-colored. Add water, lemon verbena and vanilla. Gradually beat in 1 cup sugar. beat for 4-5 minutes or until mixture doubles in volume. Combine flour and baking powder; sprinkle 1/4 cupful over batter and fold in until combined. Repeat with remaining flour mixture; set aside. In another bowl, beat the egg whites, cream of tartar and salt until soft peaks form. Add remaining sugar, 1 tablespoon at a time, beating until stiff peaks form. Gently fold into batter. Pour into an ungreased 10-in. tube pan. Bake at 350\xb0 for 45-50 minutes or until top springs back when lightly touched. Immediately invert the pan; cool completely. Run a knife around sides of pan and remove cake to a serving plate. In a bowl, cream 2 cups sugar, butter, lemon juice and extracts. Slowly add remaining sugar. If needed, beat in a small amount of water until the frosting reaches desired spreading consistency. Frost cake. Garnish with daisies and lemon verbena if desired.                                        Yield: 14 servings.                                                                                                     Editor's Note: Verify that flowers are edible and have not been treated with chemicals.                                                                                                Originally published as Sunshine Sponge Cake in  Birds & BloomsAugust/September 1998, p55                                                                                                                                                                                                        Nutritional Facts                                                                             1 serving (1 slice) equals 363 calories, 8 g fat (4 g saturated fat), 148 mg cholesterol, 184 mg sodium, 69 g carbohydrate, trace fiber, 5 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/sunshine-sponge-cake-442945', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 14, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}