{u'recipes': [{u'sourceName': u'Kitchen Confidante', u'cuisines': [u'southern'], u'image': u'https://spoonacular.com/recipeImages/496894-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 496894, u'veryPopular': True, u'lowFodmap': True, u'title': u'Cranberry Curd', u'diets': [u'gluten free', u'lacto ovo vegetarian', u'fodmap friendly'], u'pricePerServing': 52.56, u'creditText': u'Kitchen Confidante', u'extendedIngredients': [{u'originalString': u'1/2 pound fresh cranberries (a little over 2 cups)', u'aisle': u'Produce', u'name': u'cranberries', u'metaInformation': [u'fresh', u'(a little over 2 cups)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 9078, u'unit': u'pound'}, {u'originalString': u'3 egg yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'3/4 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'4 tablespoons unsalted butter, cut into small cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'small', u'cut into  cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'1/2 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}, {u'originalString': u'1 whole egg', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whole egg', u'metaInformation': [u'whole'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 18.0, u'sourceUrl': u'http://kitchenconfidante.com/simple-sundays-cranberry-curd-recipe', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 10, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/strainer.png', u'id': 405600, u'name': u'sieve'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small saucepan, combine the cranberries and water, cover, and place over medium heat. Cook until the cranberries pop and the liquid bubbles. Pass the cranberries through a strainer, pressing well with a spoon. Be sure to scrape all the lovely red puree on the underside of the strainer into the bowl to use.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberries.jpg', u'id': 9078, u'name': u'cranberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Pour the cranberry puree back into the saucepan and set aside.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Let it cool a tad.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk together the egg yolks and egg until combined. While whisking, pour in sugar and whisk until a light yellow color.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Add the egg mixture to the cranberry puree in the sauce pan, and continue whisking until creamy and well incorporated, about one minute.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Place over medium heat, whisking constantly, until the custard thickens and can coat the back of a wooden spoon, about 8-10 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/plastic-wrap.jpg', u'id': 404730, u'name': u'plastic wrap'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove the pan from the heat, and stir in the butter, one cube at a time. Strain into a bowl or jar, cover surface with plastic wrap and chill in the refrigerator for at least one hour.', u'number': 7, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Riesling, Sparkling Wine, and Zinfandel are my top picks for Southern. In general, there are a few rules that will help you pair wine with southern food. Food-friendly riesling or sparkling white wine will work with many fried foods, while zinfandel is great with barbecued fare. The Columbia Winery Cellarmaster's Riesling with a 4.7 out of 5 star rating seems like a good match. It costs about 12 dollars per bottle.", u'pairedWines': [u'riesling', u'sparkling wine', u'zinfandel'], u'productMatches': [{u'description': u"The Columbia Valley Cellarmaster's Riesling is sweet and beautifully balanced with classic floral aromas. This wine is almost clear in color, as Rieslings have very little pigment and are generally tank fermented. Flavors of juicy tropical fruit, peach and freshly squeezed lime create a zippy natural acidity.This wine pairs well with spicy Szechuan and Thai dishes, as well as glazed ham.", u'title': u"Columbia Winery Cellarmaster's Riesling", u'price': u'$11.99', u'id': 435555, u'link': u'https://www.wine.com/product/columbia-winery-cellarmasters-riesling-2011/126977', u'imageUrl': u'https://spoonacular.com/productImages/435555-312x231.jpg'}]}, u'aggregateLikes': 7281, u'instructions': u'In a small saucepan, combine the cranberries and water, cover, and place over medium heat. Cook until the cranberries pop and the liquid bubbles. Pass the cranberries through a strainer, pressing well with a spoon. Be sure to scrape all the lovely red puree on the underside of the strainer into the bowl to use. Pour the cranberry puree back into the saucepan and set aside. Let it cool a tad.Whisk together the egg yolks and egg until combined. While whisking, pour in sugar and whisk until a light yellow color. Add the egg mixture to the cranberry puree in the sauce pan, and continue whisking until creamy and well incorporated, about one minute. Place over medium heat, whisking constantly, until the custard thickens and can coat the back of a wooden spoon, about 8-10 minutes. Remove the pan from the heat, and stir in the butter, one cube at a time. Strain into a bowl or jar, cover surface with plastic wrap and chill in the refrigerator for at least one hour.', u'spoonacularSourceUrl': u'https://spoonacular.com/cranberry-curd-496894', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}