{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/463387-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 270, u'id': 463387, u'veryPopular': False, u'lowFodmap': False, u'title': u"Sweet 'n' Sour Sausage", u'diets': [u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 145.07, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1-1/2 cups fresh baby carrots, quartered lengthwise', u'aisle': u'Produce', u'name': u'baby carrots', u'metaInformation': [u'fresh', u'quartered'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/baby-carrots.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11960, u'unit': u'cups'}, {u'originalString': u'1/3 cup packed brown sugar', u'aisle': u'Baking', u'name': u'brown sugar', u'metaInformation': [u'packed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-sugar-light.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19334, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon chicken bouillon granules', u'aisle': u'Canned and Jarred', u'name': u'chicken bouillon granules', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/stock-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 1006080, u'unit': u'teaspoon'}, {u'originalString': u'Hot cooked rice or chow mein noodles', u'aisle': u'Pasta and Rice;Ethnic Foods', u'name': u'cooked chow mein noodles', u'metaInformation': [u'hot', u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/udon-noodles.png', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 10093803, u'unit': u'servings'}, {u'originalString': u'2 tablespoons cornstarch', u'aisle': u'Baking', u'name': u'cornstarch', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20027, u'unit': u'tablespoons'}, {u'originalString': u'1/4 teaspoon garlic powder', u'aisle': u'Spices and Seasonings', u'name': u'garlic powder', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1022020, u'unit': u'teaspoon'}, {u'originalString': u'1 large green pepper, cut into 1-inch pieces', u'aisle': u'Produce', u'name': u'green bell pepper', u'metaInformation': [u'green', u'large', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/green-bell-pepper.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11333, u'unit': u''}, {u'originalString': u'1/4 teaspoon ground ginger', u'aisle': u'Spices and Seasonings', u'name': u'ground ginger', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ginger.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2021, u'unit': u'teaspoon'}, {u'originalString': u'1 tablespoon reduced-sodium soy sauce', u'aisle': u'Ethnic Foods;Condiments', u'name': u'low sodium soy sauce', u'metaInformation': [u'reduced-sodium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/soy-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 16424, u'unit': u'tablespoon'}, {u'originalString': u'1 medium onion, cut into chunks', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'medium', u'cut into chunks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'1 can (20 ounces) unsweetened pineapple chunks, undrained', u'aisle': u'Canned and Jarred', u'name': u'pineapple chunks', u'metaInformation': [u'unsweetened', u'undrained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 20.0, u'consistency': u'liquid', u'id': 1029354, u'unit': u'ounces'}, {u'originalString': u'1 pound Johnsonville\xae Polish Kielbasa Sausage or Polish sausage, sliced', u'aisle': u'Meat', u'name': u'polish sausage', u'metaInformation': [u'sliced', u'johnsonville\xae'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/smoked-sausage.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 7059, u'unit': u'pound'}, {u'originalString': u'1/4 cup cold water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 10.0, u'imageType': u'jpg', u'spoonacularScore': 57.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/sweet--n--sour-sausage', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 20, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'In a 3-qt. slow cooker, combine the first 10 ingredients. Cover and cook on low for 4-5 hours or until vegetables are tender.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix cornstarch and water until smooth; stir into sausage mixture. Cover and cook on high for 30 minutes or until thickened.', u'length': {u'number': 30, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 20027, u'name': u'corn starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Serve with rice.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 26, u'instructions': u"Directions                                                                                In a 3-qt. slow cooker, combine the first 10 ingredients. Cover and cook on low for 4-5 hours or until vegetables are tender.                                                                                            Mix cornstarch and water until smooth; stir into sausage mixture. Cover and cook on high for 30 minutes or until thickened. Serve with rice.                                        Yield: 6 servings.                                                                                                                         Originally published as Sweet 'n' Sour Sausage in  Quick CookingMay/June 2002, p36                                                                                                                                                                                                        Nutritional Facts                                                                             One 1-cup serving (prepared with smoked turkey sausage and reduced-sodium soy sauce; calculated without rice) equals 250 calories, 4 g fat (1 g saturated fat), 34 mg cholesterol, 869 mg sodium, 43 g carbohydrate, 1 g fiber, 10 g protein. Diabetic Exchanges: 2 fruit, 1 lean meat, 1 vegetable, 1/2 starch.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend", u'spoonacularSourceUrl': u'https://spoonacular.com/sweet-n-sour-sausage-463387', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 285, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}