{u'recipes': [{u'sourceName': u'White Lights On Wednesday', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/593257-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 593257, u'veryPopular': False, u'lowFodmap': False, u'title': u'Bacon-Corn Relish', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 10, u'pricePerServing': 215.67, u'creditText': u'White Lights On Wednesday', u'extendedIngredients': [{u'originalString': u'6 ears of corn, shucked', u'aisle': u'Produce', u'name': u'ears of corn', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 11167, u'unit': u''}, {u'originalString': u'2 teaspoons fresh sage, chopped (or 1 teaspoon dried sage)', u'aisle': u'Spices and Seasonings', u'name': u'fresh sage', u'metaInformation': [u'dried', u'fresh', u'chopped', u'(or 1 teaspoon sage)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 2038, u'unit': u'teaspoons'}, {u'originalString': u"1 tablespoon Jack Daniel's or Jack Daniel's Honey", u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'3 tablespoons maple syrup', u'aisle': u'Cereal', u'name': u'maple syrup', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/maple-syrup-or-agave-nectar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 19911, u'unit': u'tablespoons'}, {u'originalString': u'2 onions, diced', u'aisle': u'Produce', u'name': u'onions', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'Salt & pepper, to taste', u'aisle': u'Spices and Seasonings', u'name': u'Salt & Pepper', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 package thick cut bacon, diced', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'diced', u'thick cut'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'package'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 45.0, u'sourceUrl': u'http://www.whitelightsonwednesday.com/2012/02/bacon-corn-relish/', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 16, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Place a small bowl upside down inside a large mixing bowl. Stand the ear of corn on its end on top of the small bowl. Using a sharp knife remove the kernels from the cob.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-on-the-cob.jpg', u'id': 11167, u'name': u'corn on the cob'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add corn kernels to a skillet over medium heat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Add syrup and whiskey, stir to coat corn. Cook for 5 to 7 minutes until corn is tender and syrup has caramelized.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Remove to bowl; set aside.In the same skillet cook the bacon over medium heat for 7 to 10 minutes – bacon should should be almost crisped.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [], u'step': u'Add the onion and cook and additional 5 to 7 minutes, or until onions are slightly caramelized. Stir in the corn and cook 2 minutes more.', u'length': {u'number': 7, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Remove corn mixture from heat, add the sage and season to taste with salt and pepper. Stir well and serve warm.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sage.jpg', u'id': 2038, u'name': u'sage'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 341, u'instructions': u'Place a small bowl upside down inside a large mixing bowl. Stand the ear of corn on its end on top of the small bowl. Using a sharp knife remove the kernels from the cob.Add corn kernels to a skillet over medium heat. Add syrup and whiskey, stir to coat corn. Cook for 5 to 7 minutes until corn is tender and syrup has caramelized. Remove to bowl; set aside.In the same skillet cook the bacon over medium heat for 7 to 10 minutes – bacon should should be almost crisped. Add the onion and cook and additional 5 to 7 minutes, or until onions are slightly caramelized. Stir in the corn and cook 2 minutes more.Remove corn mixture from heat, add the sage and season to taste with salt and pepper. Stir well and serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/bacon-corn-relish-593257', u'dishTypes': [u'side dish'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}