{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/304045-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 120, u'id': 304045, u'veryPopular': False, u'lowFodmap': False, u'title': u'Tiramisu', u'diets': [], u'preparationMinutes': 25, u'pricePerServing': 125.12, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 cup chocolate shavings', u'aisle': u'Baking', u'name': u'chocolate shavings', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 10219903, u'unit': u'cup'}, {u'originalString': u'3 egg whites', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg whites', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 3.0, u'consistency': u'solid', u'id': 1124, u'unit': u''}, {u'originalString': u'2 1/2 cups cooled espresso', u'aisle': u'Tea and Coffee', u'name': u'espresso', u'metaInformation': [u'cooled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 14210, u'unit': u'cups'}, {u'originalString': u'1 1/2 tablespoons powdered gelatin', u'aisle': u'Baking', u'name': u'gelatin', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 1.5, u'consistency': u'solid', u'id': 19177, u'unit': u'tablespoons'}, {u'originalString': u'1 cup heavy cream, whipped', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'heavy cream', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fluid-cream.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 1053, u'unit': u'cup'}, {u'originalString': u'20 to 24 ladyfingers', u'aisle': u'Sweet Snacks', u'name': u'ladyfingers', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 20.0, u'consistency': u'solid', u'id': 18423, u'unit': u''}, {u'originalString': u'3 cups or 1 (750-gram) container mascarpone', u'aisle': u'Cheese', u'name': u'mascarpone', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 750.0, u'consistency': u'solid', u'id': 93820, u'unit': u'gram'}, {u'originalString': u'1/4 cup sugar for whites', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'for whites'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1 cup sugar for yolks', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'for yolks'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'4 1/2 tablespoons water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.5, u'consistency': u'liquid', u'id': 14412, u'unit': u'tablespoons'}, {u'originalString': u'7 yolks', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'yolks', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 1125, u'unit': u''}, {u'originalString': u'1/2 cup kalhua', u'aisle': u'?', u'name': u'kalhua', u'metaInformation': [], u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 23.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/tiramisu-recipe2.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 29, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'In a mixer with the whip attachment, whip yolks and sugar until thick and pale in color (ribbon stage).', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [], u'step': u'Add mascarpone and whip until well incorporated.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/double-boiler.jpg', u'id': 404699, u'name': u'double boiler'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Pour water into a small bowl then pour powdered gelatin over it. Do not stir. Allow gelatin to absorb all of the water (about 15 minutes) then place the bowl on top of a small saucepan containing simmering water (creating a double boiler). Immediately turn off the heat and allow the gelatin to dissolve completely. In a separate bowl, whip egg whites to a soft peak, gradually add sugar, then slowly pour in dissolved gelatin. Whip to a stiff, glossy peak. Fold whites into mascarpone and yolk mixture then fold in whipped cream.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-white.jpg', u'id': 1124, u'name': u'egg whites'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gelatin.png', u'id': 19177, u'name': u'gelatin'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-yolk.jpg', u'id': 1125, u'name': u'egg yolk'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'In a separate bowl, combine espresso and kalhua. Soak 1 ladyfinger at a time in the espresso mixture. In an 8 by 10-inch pan, arrange soaked ladyfingers close together in neat rows until the bottom of the pan is completely covered.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'id': 18423, u'name': u'ladyfingers'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brewed-coffee.jpg', u'id': 14210, u'name': u'espresso'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/spatula-or-turner.jpg', u'id': 404642, u'name': u'spatula'}], u'step': u'Pour 1/2 of the mousse over the ladyfingers and smooth with a rubber spatula. Sprinkle 1/2 of the chocolate shavings over mousse. Create another layer and chill until set.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'id': 10219903, u'name': u'chocolate shavings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ladyfingers.jpg', u'id': 18423, u'name': u'ladyfingers'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Chianti, and Moscato d'Asti are great choices for Tiramisu. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'chianti', u'moscato dasti', u'port', u'trebbiano', u'verdicchio'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 13, u'instructions': u'Watch how to make this recipe.                    In a mixer with the whip attachment, whip yolks and sugar until thick and pale in color (ribbon stage). Add mascarpone and whip until well incorporated. Pour water into a small bowl then pour powdered gelatin over it. Do not stir. Allow gelatin to absorb all of the water (about 15 minutes) then place the bowl on top of a small saucepan containing simmering water (creating a double boiler). Immediately turn off the heat and allow the gelatin to dissolve completely. In a separate bowl, whip egg whites to a soft peak, gradually add sugar, then slowly pour in dissolved gelatin. Whip to a stiff, glossy peak. Fold whites into mascarpone and yolk mixture then fold in whipped cream.                          In a separate bowl, combine espresso and kalhua. Soak 1 ladyfinger at a time in the espresso mixture. In an 8 by 10-inch pan, arrange soaked ladyfingers close together in neat rows until the bottom of the pan is completely covered. Pour 1/2 of the mousse over the ladyfingers and smooth with a rubber spatula. Sprinkle 1/2 of the chocolate shavings over mousse. Create another layer and chill until set.', u'spoonacularSourceUrl': u'https://spoonacular.com/tiramisu-304045', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 145, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}