{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/738431-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 260, u'id': 738431, u'veryPopular': True, u'lowFodmap': False, u'title': u'Chocolate Sweet Potato Cupcakes', u'diets': [u'dairy free'], u'preparationMinutes': 25, u'pricePerServing': 59.8, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'2 tablespoons white or apple cider vinegar', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'apple cider vinegar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple-cider-vinegar.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2048, u'unit': u'tablespoons'}, {u'originalString': u'1 teaspoon baking soda', u'aisle': u'Baking', u'name': u'baking soda', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 18372, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u'Chocolate shavings, for garnish, optional', u'aisle': u'Baking', u'name': u'chocolate shavings', u'metaInformation': [u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'solid', u'id': 10219903, u'unit': u'servings'}, {u'originalString': u'2 13.5-ounce cans of coconut milk (not lite), such as Thai Kitchen brand or Whole Foods 365 brand, chilled in the refrigerator overnight (be sure not to shake or stir)', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'whole', u' such as thai kitchen brand or  foods 365 brand, chilled in the refrigerator overnight (be sure not to shake or stir)', u'canned', u'(not lite)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 27.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'ounce'}, {u'originalString': u'1 1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'Ground cinnamon, for garnish, optional', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [u'for garnish, optional'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 14.0, u'consistency': u'solid', u'id': 2010, u'unit': u'servings'}, {u'originalString': u'1/4 cup powdered sugar', u'aisle': u'Baking', u'name': u'powdered sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 19336, u'unit': u'cup'}, {u'originalString': u'1/2 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1 cup sugar', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'3/4 cup pureed sweet potato', u'aisle': u'Produce', u'name': u'sweet potato', u'metaInformation': [u'pureed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11507, u'unit': u'cup'}, {u'originalString': u'1/3 cup unsweetened cocoa powder', u'aisle': u'Baking', u'name': u'unsweetened cocoa powder', u'metaInformation': [u'unsweetened'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 19165, u'unit': u'cup'}, {u'originalString': u'2 teaspoons pure vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [u'pure'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoons'}, {u'originalString': u'1 cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 2.0, u'imageType': u'jpeg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/chocolate-sweet-potato-cupcakes.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'For the cupcakes: Preheat the oven to 350 degrees F. Line two 12-cup cupcake pans with 14 cupcake liners.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a large bowl, whisk together the flour, sugar, cocoa, baking soda, and salt. In a separate bowl, whisk together the water, oil, vinegar, vanilla, and sweet potato until smooth.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sweet-potato.jpg', u'id': 11507, u'name': u'sweet potato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 18372, u'name': u'baking soda'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cocoa-powder.jpg', u'id': 19165, u'name': u'cocoa powder'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [], u'step': u'Pour the wet mixture into the dry mixture and mix until just combined. Do not overmix.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/muffin-or-cupcake-forms.png', u'id': 404676, u'name': u'muffin liners'}], u'step': u'Fill the cupcake liners about two-thirds full with the batter.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/toothpicks.jpg', u'id': 404644, u'name': u'toothpicks'}], u'step': u'Bake for 20 minutes, or until a toothpick inserted in the center of a cupcake comes out clean with a few crumbs clinging to it. Cool the cupcakes completely before frosting.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stand-mixer.jpg', u'id': 404665, u'name': u'stand mixer'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'For the coconut whipped cream: Chill the bowl and whisk of a stand mixer in the freezer for about 10 minutes. If they are not very cold, the cream will not whip properly. Skim the solidified coconut cream from the chilled can of coconut milk and transfer the solids to the bowl of the stand mixer. Do not include any of the coconut water, even if you have to leave behind a little margin of coconut cream (even a little bit of coconut water can harm your results).', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'id': 12118, u'name': u'coconut milk'}]}, {u'equipment': [], u'step': u'Add the powdered sugar and whip for a few minutes until the mixture begins to stiffen and turn into whipped cream. Chill the whipped cream in a covered container in the refrigerator. It should firm up even more as it sits in the refrigerator for the next few hours or overnight.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/powdered-sugar.jpg', u'id': 19336, u'name': u'powdered sugar'}]}, {u'equipment': [], u'step': u'To serve: Top each cupcake with whipped cream.', u'number': 8, u'ingredients': []}, {u'equipment': [], u'step': u'Garnish each cupcake with chocolate shavings or a dash of ground cinnamon.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chocolate-curls.jpg', u'id': 10219903, u'name': u'chocolate shavings'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'ground cinnamon'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cupcakes works really well with Cream Sherry, Moscato d'Asti, and Port. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. You could try NV Johnson Estate Cream Sherry. Reviewers quite like it with a 5 out of 5 star rating and a price of about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 1057, u'instructions': u'For the cupcakes: Preheat the oven to 350 degrees F. Line two 12-cup cupcake pans with 14 cupcake liners.                          In a large bowl, whisk together the flour, sugar, cocoa, baking soda, and salt. In a separate bowl, whisk together the water, oil, vinegar, vanilla, and sweet potato until smooth. Pour the wet mixture into the dry mixture and mix until just combined. Do not overmix.                          Fill the cupcake liners about two-thirds full with the batter. Bake for 20 minutes, or until a toothpick inserted in the center of a cupcake comes out clean with a few crumbs clinging to it. Cool the cupcakes completely before frosting.                          For the coconut whipped cream: Chill the bowl and whisk of a stand mixer in the freezer for about 10 minutes. If they are not very cold, the cream will not whip properly. Skim the solidified coconut cream from the chilled can of coconut milk and transfer the solids to the bowl of the stand mixer. Do not include any of the coconut water, even if you have to leave behind a little margin of coconut cream (even a little bit of coconut water can harm your results).                          Add the powdered sugar and whip for a few minutes until the mixture begins to stiffen and turn into whipped cream. Chill the whipped cream in a covered container in the refrigerator. It should firm up even more as it sits in the refrigerator for the next few hours or overnight.                          To serve: Top each cupcake with whipped cream. Garnish each cupcake with chocolate shavings or a dash of ground cinnamon.', u'spoonacularSourceUrl': u'https://spoonacular.com/chocolate-sweet-potato-cupcakes-738431', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 285, u'servings': 14, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}