{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/438147-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 438147, u'veryPopular': False, u'lowFodmap': False, u'title': u'Watermelon Grape Salad', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal'], u'preparationMinutes': 10, u'pricePerServing': 53.19, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1/2 teaspoon finely chopped fresh tarragon', u'aisle': u'Produce;Spices and Seasonings', u'name': u'fresh tarragon', u'metaInformation': [u'fresh', u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2041, u'unit': u'teaspoon'}, {u'originalString': u'1/2 teaspoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 19296, u'unit': u'teaspoon'}, {u'originalString': u'1 cup seedless red grapes', u'aisle': u'Produce', u'name': u'red grapes', u'metaInformation': [u'red', u'seedless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9132, u'unit': u'cup'}, {u'originalString': u'1 cup cubed seeded watermelon', u'aisle': u'Produce', u'name': u'watermelon', u'metaInformation': [u'cubed', u'seeded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 9326, u'unit': u'cup'}, {u'originalString': u'2 tablespoons white grape juice', u'aisle': u'Beverages', u'name': u'white grape juice', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 9135, u'unit': u'tablespoons'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 44.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/watermelon-grape-salad', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 0, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'In a small bowl, combine watermelon and grapes. In another bowl, whisk the grape juice, tarragon and honey.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grape-juice.jpg', u'id': 9135, u'name': u'grape juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/watermelon.jpg', u'id': 9326, u'name': u'watermelon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tarragon.jpg', u'id': 2041, u'name': u'tarragon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-grapes.jpg', u'id': 9132, u'name': u'grapes'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [], u'step': u'Pour over fruit and toss to coat.', u'number': 2, u'ingredients': []}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Salad works really well with Chardonnay, Gruener Veltliner, and Sauvignon Blanc. Sauvignon Blanc and Gruner Veltliner both have herby notes that complement salads with enough acid to match tart vinaigrettes, while a Chardonnay can be a good pick for creamy salad dressings. One wine you could try is Raymond Reserve Selection Chardonnay. It has 4.4 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'gruener veltliner', u'sauvignon blanc'], u'productMatches': [{u'description': u'The Napa Valley Reserve Chardonnay opens with toasty aromas of vanilla bean, baked pears and a hint of cantaloupe. In the mouth, it offers a medley of harmonious flavors, orange zest, caramel, golden delicious apples, jasmine and lemon. This wine is beautifully balanced with crisp acidity and an elegant lingering finish. View More', u'title': u'Raymond Reserve Selection Chardonnay', u'price': u'$18.29', u'id': 432869, u'link': u'https://www.wine.com/product/raymond-reserve-selection-chardonnay-2004/87725', u'imageUrl': u'https://spoonacular.com/productImages/432869-312x231.jpg'}]}, u'aggregateLikes': 22, u'instructions': u'Directions                                                                                In a small bowl, combine watermelon and grapes. In another bowl, whisk the grape juice, tarragon and honey. Pour over fruit and toss to coat. Serve immediately.                                        Yield: 2 servings.                                                                                                                         Originally published as Watermelon Grape Salad in  Cooking for 2Summer 2005, p  24                                                                                                                                                                                                      Nutritional Facts                                                                             1 cup equals 92 calories, trace fat (trace saturated fat), 0 cholesterol, 5 mg sodium, 25 g carbohydrate, 1 g fiber, 1 g protein. Diabetic Exchange: 1-1/2 fruit.                                                                                                                                                                    Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/watermelon-grape-salad-438147', u'dishTypes': [u'side dish', u'salad'], u'occasions': [u'summer'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}