{u'recipes': [{u'sourceName': u'Eat at Home Cooks', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/504767-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 504767, u'veryPopular': True, u'lowFodmap': False, u'title': u'Slow Cooker Hawaiian BBQ Chicken Sandwiches – an easy twist on an old favorite', u'diets': [], u'pricePerServing': 47.86, u'creditText': u'Eat at Home Cooks', u'extendedIngredients': [{u'originalString': u'1-2 cups barbecue sauce', u'aisle': u'Condiments', u'name': u'barbecue sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 6150, u'unit': u'cups'}, {u'originalString': u'2 - 2.5 lbs. boneless chicken breast', u'aisle': u'Meat', u'name': u'boneless chicken breast', u'metaInformation': [u'boneless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 5062, u'unit': u''}, {u'originalString': u'pineapple slices', u'aisle': u'Produce', u'name': u'pineapple', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 9266, u'unit': u'slices'}, {u'originalString': u'provolone cheese slices', u'aisle': u'Cheese', u'name': u'provolone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/provolone-cheese.jpg', u'unitLong': u'slice', u'unitShort': u'slices', u'amount': 1.0, u'consistency': u'solid', u'id': 1035, u'unit': u'slices'}, {u'originalString': u'hoagie buns', u'aisle': u'Bakery/Bread', u'name': u'sub buns', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/french-rolls.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 98940, u'unit': u'servings'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://eatathomecooks.com/2013/08/slow-cooker-hawaiian-bbq-chicken-sandwiches-an-easy-twist-on-an-old-favorite.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/slow-cooker.jpg', u'id': 404718, u'name': u'slow cooker'}], u'step': u'Put the chicken and bbq sauce in the slow cooker.Cook on high for 5-6 hours or low for 7-8 hours.Shred meat with a fork.Toast buns.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/barbecue-sauce.jpg', u'id': 6150, u'name': u'barbecue sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}, {u'equipment': [], u'step': u'Place meat on buns.  Top with pineapple and cheese.Broil until cheese melts.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple.jpg', u'id': 9266, u'name': u'pineapple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whole-chicken.jpg', u'id': 1065062, u'name': u'meat'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken can be paired with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. One wine you could try is District 7 Estate Chardonnay. It has 5 out of 5 stars and a bottle costs about 18 dollars.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u'tropical fruit , pineapple , pear', u'title': u'District 7 Estate Chardonnay', u'price': u'$17.99', u'id': 430702, u'link': u'https://www.amazon.com/District-Monterey-Estate-Chardonnay-White/dp/B01EXEX4P6', u'imageUrl': u'https://spoonacular.com/productImages/430702-312x231.jpg'}]}, u'aggregateLikes': 6740, u'instructions': u'Put the chicken and bbq sauce in the slow cooker.Cook on high for 5-6 hours or low for 7-8 hours.Shred meat with a fork.Toast buns.Place meat on buns.  Top with pineapple and cheese.Broil until cheese melts.', u'spoonacularSourceUrl': u'https://spoonacular.com/slow-cooker-hawaiian-bbq-chicken-sandwiches-an-easy-twist-on-an-old-favorite-504767', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}