{u'recipes': [{u'sourceName': u'Creative Culinary', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/622577-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 622577, u'veryPopular': False, u'lowFodmap': False, u'title': u'Potato, Leek and Goat Cheese Tart', u'diets': [], u'preparationMinutes': 15, u'pricePerServing': 71.01, u'creditText': u'Creative Culinary', u'extendedIngredients': [{u'originalString': u'Freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'4 ounces goat cheese, crumbled', u'aisle': u'Cheese', u'name': u'goat cheese', u'metaInformation': [u'crumbled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1159, u'unit': u'ounces'}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 24.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'2 leeks, rinsed well to remove grit and thinly sliced', u'aisle': u'Produce', u'name': u'leeks', u'metaInformation': [u'rinsed', u'thinly sliced', u'well'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 2.0, u'consistency': u'solid', u'id': 11246, u'unit': u''}, {u'originalString': u'\xbc cup grated Parmesan', u'aisle': u'Cheese', u'name': u'parmesan', u'metaInformation': [u'grated'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 1033, u'unit': u'cup'}, {u'originalString': u'1 package puff pastry, thawed', u'aisle': u'Refrigerated;Frozen', u'name': u'puff pastry', u'metaInformation': [u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'unitLong': u'package', u'unitShort': u'pkg', u'amount': 1.0, u'consistency': u'solid', u'id': 18337, u'unit': u'package'}, {u'originalString': u'4 small red potatoes, sliced paper thin with a food processor, mandoline or sharp knife', u'aisle': u'Produce', u'name': u'red potatoes', u'metaInformation': [u'paper thin', u'red', u'with a food processor, mandoline or sharp knife', u'small', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-potatoes.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 10011355, u'unit': u''}, {u'originalString': u'\xbd lb shredded mozzarella', u'aisle': u'Cheese', u'name': u'shredded mozzarella', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/shredded-cheese-white.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 0.5, u'consistency': u'solid', u'id': 1001026, u'unit': u'lb'}, {u'originalString': u'4 slices thick-cut bacon, cut into 1-inch pieces', u'aisle': u'Meat', u'name': u'thick-cut bacon', u'metaInformation': [u'thick-cut', u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 4.0, u'consistency': u'solid', u'id': 10310123, u'unit': u'slices'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.creative-culinary.com/potato-leek-and-goat-cheese-tart/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 7, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 450.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 450 degrees F. Fit the pastry into a rectangular tart pan; pinching the edges together with a bit of water.Fry the bacon over medium heat until cooked but not crisp; remove and set aside.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}], u'step': u'Pour off most of the grease and return the skillet to the stove and turn the heat to medium low; add the leeks and saute until soft, about 3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}]}, {u'equipment': [], u'step': u'Drizzle the pastry with just a bit of olive oil.Arrange the potatoes in a single layer all over the crust, slightly overlapping the edges. Sprinkle the potatoes lightly with salt, then scatter the mozzarella on top of the potatoes.Arrange the sauteed leeks on top of the cheese and sprinkle the fried bacon pieces over the top, followed by the crumbled goat cheese, grated Parmesan and freshly ground black pepper.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/goat-cheese.jpg', u'id': 1159, u'name': u'goat cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mozzarella-fresh.jpg', u'id': 1026, u'name': u'mozzarella'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'id': 1033, u'name': u'parmesan'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/leeks.jpg', u'id': 11246, u'name': u'leek'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Bake until the edges of the crust are golden brown and the cheese is melted and bubbly, 13-15 minutes.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/tart-pan.jpg', u'id': 406922, u'name': u'tart form'}], u'step': u"Cut into squares and serve immediately.NOTE: If you don't have a tart pan just use a baking sheet. Put a layer of aluminum foil into a baking sheet with sides.", u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Place the puff pastry onto the foil and cut pieces of dough to fit into either a square or a rectangle. Moisten overlapping edges and pinch together creating one solid piece of pastry.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/puff-pastry.png', u'id': 18337, u'name': u'puff pastry sheets'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}], u'step': u'Roll over the edges to form a border, placing two sides of the dough up the sides of the baking pan.', u'number': 7, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/aluminum-foil.png', u'id': 404765, u'name': u'aluminum foil'}], u'step': u'Roll up the outside edges of the foil as a collar for the other two sides of the pastry to help hold the rolled up edge in place.', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are my top picks for Tart. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. One wine you could try is NV Johnson Estate Cream Sherry. It has 5 out of 5 stars and a bottle costs about 19 dollars.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'oak , vanilla , hazelnut', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 8, u'instructions': u"Preheat the oven to 450 degrees F. Fit the pastry into a rectangular tart pan; pinching the edges together with a bit of water.Fry the bacon over medium heat until cooked but not crisp; remove and set aside.Pour off most of the grease and return the skillet to the stove and turn the heat to medium low; add the leeks and saute until soft, about 3 minutes.Drizzle the pastry with just a bit of olive oil.Arrange the potatoes in a single layer all over the crust, slightly overlapping the edges. Sprinkle the potatoes lightly with salt, then scatter the mozzarella on top of the potatoes.Arrange the sauteed leeks on top of the cheese and sprinkle the fried bacon pieces over the top, followed by the crumbled goat cheese, grated Parmesan and freshly ground black pepper.Bake until the edges of the crust are golden brown and the cheese is melted and bubbly, 13-15 minutes. Cut into squares and serve immediately.NOTE: If you don't have a tart pan just use a baking sheet. Put a layer of aluminum foil into a baking sheet with sides. Place the puff pastry onto the foil and cut pieces of dough to fit into either a square or a rectangle. Moisten overlapping edges and pinch together creating one solid piece of pastry. Roll over the edges to form a border, placing two sides of the dough up the sides of the baking pan. Roll up the outside edges of the foil as a collar for the other two sides of the pastry to help hold the rolled up edge in place.", u'spoonacularSourceUrl': u'https://spoonacular.com/potato-leek-and-goat-cheese-tart-622577', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 24, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}