{u'recipes': [{u'sourceName': u'An Edible Mosaic', u'cuisines': [u'mexican'], u'image': u'https://spoonacular.com/recipeImages/764496-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 15, u'id': 764496, u'veryPopular': False, u'lowFodmap': False, u'title': u'Cheesy Kale-Artichoke Quesadillas', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 67.77, u'creditText': u'An Edible Mosaic', u'extendedIngredients': [{u'originalString': u'\xbd cup chopped artichoke hearts, drained well (see Note)', u'aisle': u'Canned and Jarred', u'name': u'artichoke hearts', u'metaInformation': [u'drained', u'chopped', u'well', u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 93828, u'unit': u'cup'}, {u'originalString': u'\xbd of a 7 oz bag of GO VEGGIE Lactose and Soy Free Mozzarella Shreds', u'aisle': u'Gluten Free;Health Foods;Baking', u'name': u'fat free soy flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chickpea-flour-or-another-gluten-free-flour.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 16117, u'unit': u''}, {u'originalString': u'3 cloves garlic, crushed', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'crushed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 3.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'2 cups chopped kale', u'aisle': u'Produce', u'name': u'kale', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11233, u'unit': u'cups'}, {u'originalString': u'1 tablespoon light olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'light olive oil', u'metaInformation': [u'light'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoon'}, {u'originalString': u'\xbd medium onion, chopped small', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'small', u'medium', u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'4 (8-inch) soft tortillas (see Note)', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'tortillas', u'metaInformation': [u'soft', u'()', u'(see Note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'8-inchs', u'unitShort': u'8-inch', u'amount': 4.0, u'consistency': u'solid', u'id': 18364, u'unit': u'8-inch'}, {u'originalString': u'\xbd of an 8 oz tub of GO VEGGIE Vegan Classic Plain Cream Cheese', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'vegan cream cheese', u'metaInformation': [u'plain'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'solid', u'id': 93634, u'unit': u''}], u'healthScore': 59.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://www.anediblemosaic.com/cheesy-kale-artichoke-quesadillas-lactose-free-gluten-free-option/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a large skillet over medium to medium-low heat.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the onion, kale, and garlic, and cook until the onion is softened and the kale is wilted, about 5 minutes, stirring frequently. Turn the heat down to low and stir in the artichoke hearts and cream cheese.', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/artichoke-hearts.jpg', u'id': 93828, u'name': u'artichoke hearts'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [], u'step': u'Spread the creamy kale/artichoke mixture out on 2 of the tortillas, and then sprinkle on the mozzarella shreds.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/kale.jpg', u'id': 11233, u'name': u'kale'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/griddle.jpg', u'id': 404779, u'name': u'griddle'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place a tortilla on top of each.Cook the quesadillas on a griddle until golden brown on both sides, about 3 to 5 minutes per side. (Or use a large nonstick skillet to cook the quesadillas 1 at a time.)', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u'Serve warm.', u'number': 5, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'Pinot Noir, Riesling, and Sparkling ros\xe9 are great choices for Quesadilla. Acidic white wines like riesling or low-tannin reds like pinot noir can work well with Mexican dishes. Sparkling ros\xe9 is a safe pairing too. One wine you could try is Dutton-Goldfield Dutton Ranch Pinot Noir. It has 4.4 out of 5 stars and a bottle costs about 43 dollars.', u'pairedWines': [u'pinot noir', u'riesling', u'sparkling rose'], u'productMatches': [{u'description': u'The ripening season was classic Russian River, with warm days and cool nights—and with no major heat spells, the fruit ripening was perfect to give lush tannins, bright berry fruit and bright acidity. The wine shows rich, dense black cherry and blackberry fruit and nuances of strawberry, raspberry, and nutmeg in the nose. In the mouth, the first impression is fresh berry fruit, then the soft, broad tannins carry notes of marionberries, nutmeg and sandalwood through a lingering finish. Thanks partially to the moderate alcohol and bright acidity, the finish lingers with fresh cherry fruit and creamy berry compote.This wine has a broad range of food pairings, whether alone with some well chosen cheeses, richer fish preparations or a good old steak on the barbeque.', u'title': u'Dutton-Goldfield Dutton Ranch Pinot Noir', u'price': u'$42.99', u'id': 438099, u'link': u'https://www.wine.com/product/dutton-goldfield-dutton-ranch-pinot-noir-2014/154141', u'imageUrl': u'https://spoonacular.com/productImages/438099-312x231.jpg'}]}, u'aggregateLikes': 82, u'instructions': u'Heat the oil in a large skillet over medium to medium-low heat. Add the onion, kale, and garlic, and cook until the onion is softened and the kale is wilted, about 5 minutes, stirring frequently. Turn the heat down to low and stir in the artichoke hearts and cream cheese.Spread the creamy kale/artichoke mixture out on 2 of the tortillas, and then sprinkle on the mozzarella shreds. Place a tortilla on top of each.Cook the quesadillas on a griddle until golden brown on both sides, about 3 to 5 minutes per side. (Or use a large nonstick skillet to cook the quesadillas 1 at a time.)Serve warm.', u'spoonacularSourceUrl': u'https://spoonacular.com/cheesy-kale-artichoke-quesadillas-764496', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 25, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}