{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/311005-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 311005, u'veryPopular': False, u'lowFodmap': False, u'title': u'Chicken with Mustard Mascarpone Marsala Sauce', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 253.2, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'5 tablespoons butter, divided', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [u'divided'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 5.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoons'}, {u'originalString': u'1 pound cremini mushrooms, sliced', u'aisle': u'Produce', u'name': u'cremini mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11266, u'unit': u'pound'}, {u'originalString': u'2 tablespoons Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoons'}, {u'originalString': u'12 ounces dried fettuccine', u'aisle': u'Pasta and Rice', u'name': u'fettuccine', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 10020409, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons minced garlic', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'tablespoons'}, {u'originalString': u'1 cup dry Marsala wine', u'aisle': u'Alcoholic Beverages', u'name': u'marsala wine', u'metaInformation': [u'dry'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-wine.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 14057, u'unit': u'cup'}, {u'originalString': u'1 cup (8 ounces) mascarpone cheese', u'aisle': u'Cheese', u'name': u'mascarpone cheese', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 93820, u'unit': u'ounces'}, {u'originalString': u'2 tablespoons olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tablespoons'}, {u'originalString': u'3/4 cup chopped onion', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 11282, u'unit': u'cup'}, {u'originalString': u'2 tablespoons chopped fresh Italian parsley leaves, plus whole sprigs, for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'parsley leaves', u'metaInformation': [u'fresh', u'whole', u'italian', u'chopped', u'for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 11297, u'unit': u'tablespoons'}, {u'originalString': u'Salt and freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'salt and pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1102047, u'unit': u'servings'}, {u'originalString': u'1 1/2 pounds boneless skinless chicken breasts, each breast cut crosswise into 3 pieces', u'aisle': u'Meat', u'name': u'skinless boneless chicken breasts', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'unitLong': u'pounds', u'unitShort': u'lb', u'amount': 1.5, u'consistency': u'liquid', u'id': 1055062, u'unit': u'pounds'}], u'healthScore': 18.0, u'imageType': u'jpeg', u'spoonacularScore': 83.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/giada-de-laurentiis/chicken-with-mustard-mascarpone-marsala-sauce-recipe.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 24, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Watch how to make this recipe.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Sprinkle the chicken with salt and pepper.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the oil in a heavy large skillet over high heat.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Add the chicken and cook just until brown, about 4 minutes per side.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the chicken to a plate and cool slightly.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'While the chicken cools, melt 2 tablespoons of butter to the same skillet over medium-high heat, then add the onion and saute until tender, about 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add the mushrooms and garlic and saute until the mushrooms are tender and the juices evaporate, about 12 minutes.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}]}, {u'equipment': [], u'step': u'Add the wine and simmer until it is reduced by half, about 4 minutes. Stir in the mascarpone and mustard.', u'length': {u'number': 4, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream-fluffy.jpg', u'id': 93820, u'name': u'mascarpone'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/regular-mustard.jpg', u'id': 2046, u'name': u'mustard'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Cut the chicken breasts crosswise into 1/3-inch-thick slices. Return the chicken and any accumulated juices to the skillet. Simmer, uncovered, over medium-low heat until the chicken is just cooked through and the sauce thickens slightly, about 2 minutes. Stir in the chopped parsley. Season the sauce, to taste, with salt and pepper.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-breasts.jpg', u'id': 5062, u'name': u'chicken breast'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Meanwhile, bring a large pot of salted water to a boil.', u'number': 10, u'ingredients': []}, {u'equipment': [], u'step': u'Add the fettuccine and cook until al dente, stirring occasionally, about 8 minutes.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 10020409, u'name': u'fettuccine'}]}, {u'equipment': [], u'step': u'Drain. Toss the fettuccine with 3 tablespoons of butter and season, to taste, with salt and pepper. Swirl the fettuccine onto serving plates. Spoon the chicken mixture over top.', u'number': 12, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg-noodles.jpg', u'id': 10020409, u'name': u'fettuccine'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}, {u'equipment': [], u'step': u'Garnish with parsley sprigs and serve.', u'number': 13, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parsley.jpg', u'id': 11297, u'name': u'parsley'}]}], u'name': u''}], u'winePairing': {u'pairingText': u'Chicken works really well with Chardonnay, Pinot Noir, and Sauvignon Blanc. White meat is typically paired with white wine as to not overpower the flavor of the meat, so chardonnay and sauvignon blanc are safe choices. Chicken prepared with a tomato sauce or certainly a red wine sauce can and should be served with a red like a pinot noir. The Downton Abbey Countess of Grantham Chardonnay with a 5 out of 5 star rating seems like a good match. It costs about 16 dollars per bottle.', u'pairedWines': [u'chardonnay', u'pinot noir', u'sauvignon blanc'], u'productMatches': [{u'description': u"Our Downton Abbey Chardonnay displays lovely aromas of tropical fruits and subtle oak on the nose, which give way to flavors of citrus and fresh-cut pineapple on a soft, silky palate. The wine's bright characters and luscious mouthfeel continue through a clean, medium finish. The beautifully balanced and food-friendly bottling is the perfect wine choice for you most regal gatherings or spontaneous get-togethers.", u'title': u'Downton Abbey Countess of Grantham Chardonnay', u'price': u'$15.99', u'id': 428720, u'link': u'https://www.amazon.com/Downton-Abbey-Countess-Grantham-Chardonnay/dp/B00TXUZYEU', u'imageUrl': u'https://spoonacular.com/productImages/428720-312x231.jpg'}]}, u'aggregateLikes': 43, u'instructions': u'Watch how to make this recipe.                    Sprinkle the chicken with salt and pepper. Heat the oil in a heavy large skillet over high heat. Add the chicken and cook just until brown, about 4 minutes per side. Transfer the chicken to a plate and cool slightly.                          While the chicken cools, melt 2 tablespoons of butter to the same skillet over medium-high heat, then add the onion and saute until tender, about 2 minutes. Add the mushrooms and garlic and saute until the mushrooms are tender and the juices evaporate, about 12 minutes. Add the wine and simmer until it is reduced by half, about 4 minutes. Stir in the mascarpone and mustard. Cut the chicken breasts crosswise into 1/3-inch-thick slices. Return the chicken and any accumulated juices to the skillet. Simmer, uncovered, over medium-low heat until the chicken is just cooked through and the sauce thickens slightly, about 2 minutes. Stir in the chopped parsley. Season the sauce, to taste, with salt and pepper.                          Meanwhile, bring a large pot of salted water to a boil. Add the fettuccine and cook until al dente, stirring occasionally, about 8 minutes. Drain. Toss the fettuccine with 3 tablespoons of butter and season, to taste, with salt and pepper. Swirl the fettuccine onto serving plates. Spoon the chicken mixture over top. Garnish with parsley sprigs and serve.', u'spoonacularSourceUrl': u'https://spoonacular.com/chicken-with-mustard-mascarpone-marsala-sauce-311005', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 50, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}