{u'recipes': [{u'sourceName': u'Leites Culinaria', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/599322-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 599322, u'veryPopular': False, u'lowFodmap': False, u'title': u'Mix-and-Match Thumbprint Cookies', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 31.44, u'creditText': u'Leites Culinaria', u'extendedIngredients': [{u'originalString': u'About 1/2 cup fig jam, or other preserves', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'fig jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fig-preserves.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11519297, u'unit': u'cup'}, {u'originalString': u'2 1/2 cups all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.5, u'consistency': u'solid', u'id': 20081, u'unit': u'cups'}, {u'originalString': u'1/2 cup granulated sugar', u'aisle': u'Baking', u'name': u'granulated sugar', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'1/3 cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'1 1/4 cups finely chopped pine nuts, walnuts, or pistachios', u'aisle': u'Produce;Baking', u'name': u'pine nuts', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pine-nuts.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.25, u'consistency': u'solid', u'id': 12147, u'unit': u'cups'}, {u'originalString': u'1 cup (2 sticks) unsalted butter, at room temperature, plus more for the baking sheets', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'plus more for the baking sheets', u'at room temperature', u'(2 sticks)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1145, u'unit': u'cup'}, {u'originalString': u'1 teaspoon vanilla extract', u'aisle': u'Baking', u'name': u'vanilla extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla-extract.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 2050, u'unit': u'teaspoon'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://leitesculinaria.com/60442/recipes-mix-and-match-thumbprint-cookies.html', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 4, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 350.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat the oven to 350\xb0F (176\xb0C). Lightly butter 2 baking sheets or line them with Silpats.2. In a large bowl with a standing or handheld mixer, beat the butter until creamy.', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Add the sugar, honey, and vanilla on medium speed until light, about 2 minutes. Reduce speed to low and gradually beat in the flour just until incorporated. The dough will be quite stiff. Switch to a spoon and stir in 1 cup of the nuts.3. Pinch off walnut-size pieces of dough and roll them between your palms into balls.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vanilla.jpg', u'id': 2050, u'name': u'vanilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place on the prepared baking sheets, spacing them about 1 1/2 inches apart.4.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Bake until firm to the touch and just golden on the bottom, 10 to 13 minutes.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/wooden-spoon.jpg', u'id': 404732, u'name': u'wooden spoon'}], u'step': u'Let the cookies cool on the baking sheets for about 5 minutes before making an indentation in the center of each with your thumb, the handle of a large wooden spoon, or the tip of a clothespin. (If you try to make the dent too soon, the cookies will crack.)', u'length': {u'number': 5, u'unit': u'minutes'}, u'number': 5, u'ingredients': []}, {u'equipment': [], u'step': u'Transfer the indented cookies to wire racks to cool completely. Repeat with the remaining dough.5. Fill the indentation in each cooled cookie with 1/4 to 1/2 teaspoon of the jam. Then sprinkle the jammy center with the remaining nuts and watch the cookies disappear. (If giving the cookies away, be careful to package them in a single layer so as to avoid the dread jam-sticking-to-the-bottom-of-the-other-cookies-and-making-them-slightly-soggy situation.)', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberry-jam.jpg', u'id': 19297, u'name': u'jam'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Cookies on the menu? Try pairing with Cream Sherry, Madeira, and Prosecco. Sweet bubbly Prosecco doesn't overwhelm simple sugar or shortbread cookies, a sweet cream sherry complements spiced cookies, and madeira's nutty notes match cookies with nuts perfectly. The NV Solera Cream Sherry with a 4.5 out of 5 star rating seems like a good match. It costs about 17 dollars per bottle.", u'pairedWines': [u'cream sherry', u'madeira', u'prosecco'], u'productMatches': [{u'description': u'The Solera Cream Sherry has a brilliant amber and deep copper hue. With butterscotch and pecan aromas, the sweet salted nut and brown spice aromas carry a complex caramel accent. A sweet entry leads to a rounded, lush, moderately full-bodied palate with a lengthy, flavorful finish.', u'title': u'NV Solera Cream Sherry', u'price': u'$16.99', u'id': 428475, u'link': u'https://www.amazon.com/NV-Solera-Cream-Sherry-750/dp/B00HSME8OW', u'imageUrl': u'https://spoonacular.com/productImages/428475-312x231.jpg'}]}, u'aggregateLikes': 20, u'instructions': u'1. Preheat the oven to 350\xb0F (176\xb0C). Lightly butter 2 baking sheets or line them with Silpats.2. In a large bowl with a standing or handheld mixer, beat the butter until creamy. Add the sugar, honey, and vanilla on medium speed until light, about 2 minutes. Reduce speed to low and gradually beat in the flour just until incorporated. The dough will be quite stiff. Switch to a spoon and stir in 1 cup of the nuts.3. Pinch off walnut-size pieces of dough and roll them between your palms into balls. Place on the prepared baking sheets, spacing them about 1 1/2 inches apart.4. Bake until firm to the touch and just golden on the bottom, 10 to 13 minutes. Let the cookies cool on the baking sheets for about 5 minutes before making an indentation in the center of each with your thumb, the handle of a large wooden spoon, or the tip of a clothespin. (If you try to make the dent too soon, the cookies will crack.) Transfer the indented cookies to wire racks to cool completely. Repeat with the remaining dough.5. Fill the indentation in each cooled cookie with 1/4 to 1/2 teaspoon of the jam. Then sprinkle the jammy center with the remaining nuts and watch the cookies disappear. (If giving the cookies away, be careful to package them in a single layer so as to avoid the dread jam-sticking-to-the-bottom-of-the-other-cookies-and-making-them-slightly-soggy situation.)', u'spoonacularSourceUrl': u'https://spoonacular.com/mix-and-match-thumbprint-cookies-599322', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 60, u'servings': 48, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}