{u'recipes': [{u'sourceName': u'What Jew Wanna Eat', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/616933-556x370.png', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 75, u'id': 616933, u'veryPopular': False, u'lowFodmap': False, u'title': u'Vegetarian Stuffed Cabbage with Creamy Beet Sauce', u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 180.73, u'creditText': u'What Jew Wanna Eat', u'extendedIngredients': [{u'originalString': u'Salted almonds, small diced', u'aisle': u'Nuts', u'name': u'almonds', u'metaInformation': [u'salted', u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 12061, u'unit': u'servings'}, {u'originalString': u'2 medium beets, diced small (about 2 cups)', u'aisle': u'Produce', u'name': u'beets', u'metaInformation': [u'diced', u'small', u'medium'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11080, u'unit': u'cups'}, {u'originalString': u'\xbc teaspoon chili pepper flakes, or more to taste', u'aisle': u'Spices and Seasonings', u'name': u'chili flakes', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/red-pepper-flakes.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 1032009, u'unit': u'teaspoon'}, {u'originalString': u'\xbd cup cilantro, minced, plus more for garnish', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'minced', u'plus more for garnish'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'3 cups cooked farro (kamut, brown rice, or other chewy grains work as well)', u'aisle': u'Pasta and Rice;Ethnic Foods;Health Foods', u'name': u'cooked farro', u'metaInformation': [u'cooked', u'well', u'(kamut, brown rice, or other chewy grains work as )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/farro-or-spelt.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 3.0, u'consistency': u'solid', u'id': 10020006, u'unit': u'cups'}, {u'originalString': u'2 cups cooked lentils', u'aisle': u'Pasta and Rice;Canned and Jarred', u'name': u'cooked lentils', u'metaInformation': [u'cooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lentils-brown.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 16070, u'unit': u'cups'}, {u'originalString': u'1 tablespoon extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons extra virgin olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'extra virgin olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 1034053, u'unit': u'tablespoons'}, {u'originalString': u'2 cloves garlic, minced', u'aisle': u'Produce', u'name': u'garlic', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'cloves', u'unitShort': u'cloves', u'amount': 2.0, u'consistency': u'solid', u'id': 11215, u'unit': u'cloves'}, {u'originalString': u'\xbd cup Greek yogurt', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'greek yogurt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1256, u'unit': u'cup'}, {u'originalString': u'1 large green cabbage', u'aisle': u'Produce', u'name': u'green cabbage', u'metaInformation': [u'green', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11109, u'unit': u''}, {u'originalString': u'\xbc cup honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 19296, u'unit': u'cup'}, {u'originalString': u'Juice from \xbd lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 0.5, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Juice from 1 lemon', u'aisle': u'Produce', u'name': u'juice of lemon', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9152, u'unit': u''}, {u'originalString': u'Kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'Kosher salt and fresh cracked black pepper to taste', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [u'fresh', u'black', u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'1 cup mushrooms, small diced', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 11260, u'unit': u'cup'}, {u'originalString': u'1 small onion, small diced', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'diced', u'small'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'\xbc cup raisins', u'aisle': u'Dried Fruits;Produce;Baking', u'name': u'raisins', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 9299, u'unit': u'cup'}, {u'originalString': u'2 teaspoons sumac', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'sumac', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sumac.png', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'solid', u'id': 10211111, u'unit': u'teaspoons'}, {u'originalString': u'\xbd cup tahini', u'aisle': u'Ethnic Foods;Health Foods', u'name': u'tahini', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 12698, u'unit': u'cup'}, {u'originalString': u'\xbd cup vegetable stock (can use chicken stock if not concerned with keeping this vegetarian)', u'aisle': u'Canned and Jarred', u'name': u'vegetable stock', u'metaInformation': [u'with keeping this vegetarian)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}, {u'originalString': u'Water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 9.0, u'consistency': u'liquid', u'id': 14412, u'unit': u'servings'}], u'healthScore': 54.0, u'imageType': u'png', u'spoonacularScore': 93.0, u'sourceUrl': u'http://whatjewwannaeat.com/vegetarian-stuffed-cabbage-creamy-beet-sauce/', u'glutenFree': False, u'vegan': False, u'veryHealthy': True, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat olive oil over medium high in a large saut pan and add onion. Saut while stirring until onion starts to soften, about five minutes. Then add in diced mushrooms and saut while stirring until mushrooms start to soften, about 2-3 minutes. Lastly (finally!) add minced garlic and saut while stirring for one more minute. Set aside to cool.Once cool, combine lentils, farro, mushroom mixture, raisins, tahini, lemon juice, sumac, honey, cilantro, chili pepper flakes and salt to taste.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raisins.jpg', u'id': 9299, u'name': u'raisins'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tahini-paste.png', u'id': 12698, u'name': u'tahini'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sumac.png', u'id': 10211111, u'name': u'sumac'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Lets boil the cabbage! Woo hoo. Fill a large stock pot with water and bring to a boil. Carefully place cabbage in the water (dont burn yourself, please!) and boil for a few minutes while rotating every so often until the color changes and the outer leaves start to separate.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/chefs-knife.jpg', u'id': 404745, u'name': u'knife'}], u'step': u'Remove cabbage from water and rinse under cold water to cool. Carefully remove leaves making sure not to tear them.On the end of each leave, youll find a thick stem. Using a sharp knife, thin down the spine to make it more palatable.Now we roll!', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Place about  cup of filling in each leaf towards the spine end.', u'number': 4, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/dutch-oven.jpg', u'id': 404667, u'name': u'dutch oven'}], u'step': u'Cute, right?Fold the spine side up, then fold in sides and roll like a little Jewish burrito. Ole!Repeat with other leaves and put in a large Dutch oven spine side down. You may have a little filling leftover. Eat it! Its okay if they are tight! Cuddling is okay.', u'number': 5, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404794, u'name': u'stove'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/stock-pot.jpg', u'id': 404752, u'name': u'pot'}], u'step': u'Pour a  inch layer of stock on the bottom of the pot and bring to a boil. Lower to a simmer on the lowest setting of your stovetop, and cover. Simmer for 1 hour, checking periodically to make sure there is still some stock in there.', u'number': 6, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Add some stock if needed so rolls dont burn.Meanwhile, make your sauce! Preheat oven to 400 degrees F.', u'number': 7, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'stock'}]}, {u'equipment': [], u'step': u'Drizzle diced beets with olive oil, salt and pepper and roast for about 20 minutes. until very tender.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 8, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [], u'step': u'Let beets cool slightly and puree with Greek yogurt, lemon juice, and olive oil.', u'number': 9, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-cream.jpg', u'id': 1256, u'name': u'greek yogurt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lemon-juice.jpg', u'id': 9152, u'name': u'lemon juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'id': 4053, u'name': u'olive oil'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beets.jpg', u'id': 11080, u'name': u'beet'}]}, {u'equipment': [], u'step': u'Add water to get desired texture, sauce should be thick enough to coat the back of a spoon and puree. Season with salt and pepper to taste.', u'number': 10, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt-and-pepper.jpg', u'id': 1102047, u'name': u'salt and pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Drizzle sauce over hot cabbage rolls, garnish with almonds and cilantro, and dig in!', u'number': 11, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/almonds.jpg', u'id': 12061, u'name': u'almonds'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cabbage.jpg', u'id': 11109, u'name': u'cabbage'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 26, u'instructions': u'Heat olive oil over medium high in a large saut pan and add onion. Saut while stirring until onion starts to soften, about five minutes. Then add in diced mushrooms and saut while stirring until mushrooms start to soften, about 2-3 minutes. Lastly (finally!) add minced garlic and saut while stirring for one more minute. Set aside to cool.Once cool, combine lentils, farro, mushroom mixture, raisins, tahini, lemon juice, sumac, honey, cilantro, chili pepper flakes and salt to taste.Lets boil the cabbage! Woo hoo. Fill a large stock pot with water and bring to a boil. Carefully place cabbage in the water (dont burn yourself, please!) and boil for a few minutes while rotating every so often until the color changes and the outer leaves start to separate.Remove cabbage from water and rinse under cold water to cool. Carefully remove leaves making sure not to tear them.On the end of each leave, youll find a thick stem. Using a sharp knife, thin down the spine to make it more palatable.Now we roll! Place about  cup of filling in each leaf towards the spine end. Cute, right?Fold the spine side up, then fold in sides and roll like a little Jewish burrito. Ole!Repeat with other leaves and put in a large Dutch oven spine side down. You may have a little filling leftover. Eat it! Its okay if they are tight! Cuddling is okay. Pour a  inch layer of stock on the bottom of the pot and bring to a boil. Lower to a simmer on the lowest setting of your stovetop, and cover. Simmer for 1 hour, checking periodically to make sure there is still some stock in there. Add some stock if needed so rolls dont burn.Meanwhile, make your sauce! Preheat oven to 400 degrees F. Drizzle diced beets with olive oil, salt and pepper and roast for about 20 minutes. until very tender.Let beets cool slightly and puree with Greek yogurt, lemon juice, and olive oil. Add water to get desired texture, sauce should be thick enough to coat the back of a spoon and puree. Season with salt and pepper to taste.Drizzle sauce over hot cabbage rolls, garnish with almonds and cilantro, and dig in!', u'spoonacularSourceUrl': u'https://spoonacular.com/vegetarian-stuffed-cabbage-with-creamy-beet-sauce-616933', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 95, u'servings': 9, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}