{u'recipes': [{u'sourceName': u'Pancake Warriors', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/702731-556x370.jpg', u'cheap': False, u'gaps': u'no', u'id': 702731, u'veryPopular': True, u'lowFodmap': False, u'title': u'Best Ever Mushroom Soup', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'whole 30', u'vegan'], u'pricePerServing': 269.03, u'creditText': u'Pancake Warriors', u'extendedIngredients': [{u'originalString': u'\xbd Tbs. liquid aminos (GF) (or soy sauce)', u'aisle': u'Health Foods;Condiments', u'name': u'braggs liquid aminos', u'metaInformation': [u'(GF)', u'(or soy sauce)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'Tbs', u'unitShort': u'Tbs', u'amount': 0.5, u'consistency': u'liquid', u'id': 93767, u'unit': u'Tbs'}, {u'originalString': u'1 cup almond or cashew milk (unsweetened)', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'cashew milk', u'metaInformation': [u'unsweetened', u'()'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cashew-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 99088, u'unit': u'cup'}, {u'originalString': u'1 dried bay leaf', u'aisle': u'Produce;Spices and Seasonings', u'name': u'dried bay leaf', u'metaInformation': [u'dried'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 2004, u'unit': u''}, {u'originalString': u'10 stalks fresh thyme, leaves removed', u'aisle': u'Produce', u'name': u'fresh thyme', u'metaInformation': [u'fresh'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'unitLong': u'stalks', u'unitShort': u'stalks', u'amount': 10.0, u'consistency': u'solid', u'id': 2049, u'unit': u'stalks'}, {u'originalString': u'freshly ground pepper', u'aisle': u'Spices and Seasonings', u'name': u'pepper', u'metaInformation': [u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 2.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'servings'}, {u'originalString': u'1 package baby portobello mushrooms (10 oz) sliced', u'aisle': u'Produce', u'name': u'baby bella mushrooms', u'metaInformation': [u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11266, u'unit': u'oz'}, {u'originalString': u'\xbd tsp. salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2047, u'unit': u'tsp'}, {u'originalString': u'1 Tbs. tapioca flour', u'aisle': u'Ethnic Foods;Health Foods;Baking', u'name': u'tapioca flour', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'Tb', u'unitShort': u'Tbs', u'amount': 1.0, u'consistency': u'solid', u'id': 93696, u'unit': u'Tbs'}, {u'originalString': u'1 cup organic vegetable broth', u'aisle': u'Canned and Jarred', u'name': u'vegetable broth', u'metaInformation': [u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 6615, u'unit': u'cup'}, {u'originalString': u'1 package white button mushrooms (10 oz) sliced', u'aisle': u'Produce', u'name': u'white button mushrooms', u'metaInformation': [u'white', u'sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 10.0, u'consistency': u'solid', u'id': 11260, u'unit': u'oz'}, {u'originalString': u'1 large white onion, diced', u'aisle': u'Produce', u'name': u'white onion', u'metaInformation': [u'diced', u'white', u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 10611282, u'unit': u''}], u'healthScore': 52.0, u'imageType': u'jpg', u'spoonacularScore': 99.0, u'sourceUrl': u'http://www.pancakewarriors.com/best-ever-mushroom-soup/', u'glutenFree': True, u'vegan': True, u'veryHealthy': True, u'weightWatcherSmartPoints': 3, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'In a large saucepan, over medium heat, add the diced onions. Allow to sweat while slicing the mushrooms. About 5-7 minutes.Move onions to the sides of the saucepan and add mushrooms, allow to cook 5 minutes uncovered.Stir the onions and mushrooms together.', u'length': {u'number': 12, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}]}, {u'equipment': [], u'step': u'Add fresh thyme and allow to continue to cook, at least 10 minutes.You will notice a substantial amount of water has come out of the mushrooms, and they are reduced in volume by half.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/thyme.jpg', u'id': 2049, u'name': u'fresh thyme'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add the bay leaf, the salt and the liquid aminos to the mushrooms.Stir the 1 tbs. of tapioca starch into the organic broth.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'id': 93696, u'name': u'tapioca starch'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/bay-leaves.jpg', u'id': 2004, u'name': u'bay leaves'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/broth.jpg', u'id': 1006615, u'name': u'broth'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [], u'step': u'Add to mushrooms and stir.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}]}, {u'equipment': [], u'step': u'Add almond milk.Allow to cook for at least 15 minutes, stirring occasionally. Taste and add freshly ground black pepper to taste.This soup is amazing the next day as well and can easily be doubled.', u'length': {u'number': 15, u'unit': u'minutes'}, u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'ground black pepper'}]}, {u'equipment': [], u'step': u'Add cashew cheese, Parmesan cheese or enjoy the soup just as it is!', u'number': 6, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u'', u'pairedWines': [], u'productMatches': []}, u'aggregateLikes': 262810, u'instructions': u'In a large saucepan, over medium heat, add the diced onions. Allow to sweat while slicing the mushrooms. About 5-7 minutes.Move onions to the sides of the saucepan and add mushrooms, allow to cook 5 minutes uncovered.Stir the onions and mushrooms together. Add fresh thyme and allow to continue to cook, at least 10 minutes.You will notice a substantial amount of water has come out of the mushrooms, and they are reduced in volume by half.Add the bay leaf, the salt and the liquid aminos to the mushrooms.Stir the 1 tbs. of tapioca starch into the organic broth. Add to mushrooms and stir. Add almond milk.Allow to cook for at least 15 minutes, stirring occasionally. Taste and add freshly ground black pepper to taste.This soup is amazing the next day as well and can easily be doubled.Add cashew cheese, Parmesan cheese or enjoy the soup just as it is!', u'spoonacularSourceUrl': u'https://spoonacular.com/best-ever-mushroom-soup-702731', u'dishTypes': [u'soup'], u'occasions': [u'fall', u'winter'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 2, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}