{u'recipes': [{u'sourceName': u'Kraft Recipes', u'cuisines': [u'mediterranean', u'european', u'italian'], u'image': u'https://spoonacular.com/recipeImages/274322-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 274322, u'veryPopular': False, u'lowFodmap': False, u'title': u'Spaghetti Carbonara', u'diets': [], u'preparationMinutes': 20, u'pricePerServing': 73.05, u'creditText': u'Kraft Recipes', u'extendedIngredients': [{u'originalString': u'8 slices OSCAR MAYER Bacon, cut into 1-inch pieces', u'aisle': u'Meat', u'name': u'bacon', u'metaInformation': [u'cut into 1-inch pieces'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'unitLong': u'slices', u'unitShort': u'slices', u'amount': 8.0, u'consistency': u'liquid', u'id': 10123, u'unit': u'slices'}, {u'originalString': u'4 oz. (1/2 of 8-oz. pkg.) PHILADELPHIA Cream Cheese, cubed, softened', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'cubed', u'softened', u'(1/2 of 8-oz. pkg.)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 4.0, u'consistency': u'solid', u'id': 1017, u'unit': u'oz'}, {u'originalString': u'1/2 cup KRAFT Zesty Italian Dressing', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'italian dressing', u'metaInformation': [u'italian', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/italian-dressing.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 4114, u'unit': u'cup'}, {u'originalString': u'1 onion, finely chopped', u'aisle': u'Produce', u'name': u'onion', u'metaInformation': [u'finely chopped'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11282, u'unit': u''}, {u'originalString': u'3 Tbsp. KRAFT Grated Parmesan Cheese', u'aisle': u'Cheese', u'name': u'parmesan cheese', u'metaInformation': [u'grated', u'kraft'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/parmesan-or-romano.jpg', u'unitLong': u'Tbsps', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 1033, u'unit': u'Tbsp'}, {u'originalString': u'1 pkg. (1 lb.) spaghetti, uncooked', u'aisle': u'Pasta and Rice', u'name': u'spaghetti', u'metaInformation': [u'uncooked'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'solid', u'id': 11420420, u'unit': u'lb'}], u'healthScore': 4.0, u'imageType': u'jpg', u'spoonacularScore': 40.0, u'sourceUrl': u'http://www.kraftrecipes.com/recipes/spaghetti-carbonara-65344.aspx', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 13, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Cook spaghetti as directed on package, omitting salt.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Meanwhile, cook and stir bacon and onions in large skillet on medium-high heat 8 min. or until bacon is crisp and onions are tender.', u'length': {u'number': 8, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/brown-onion.jpg', u'id': 11282, u'name': u'onion'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/paper-towels.jpg', u'id': 405895, u'name': u'paper towels'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Remove from skillet; drain.  Wipe skillet with paper towel.', u'number': 3, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Drain spaghetti.  Immediately add to skillet with bacon mixture and all remaining ingredients; toss until cream cheese is completely melted and mixture is well blended.', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spaghetti.jpg', u'id': 11420420, u'name': u'spaghetti'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/raw-bacon.png', u'id': 10123, u'name': u'bacon'}]}], u'name': u''}], u'aggregateLikes': 36, u'instructions': u'Cook spaghetti as directed on package, omitting salt.                                            Meanwhile, cook and stir bacon and onions in large skillet on medium-high heat 8 min. or until bacon is crisp and onions are tender.  Remove from skillet; drain.  Wipe skillet with paper towel.                                             Drain spaghetti.  Immediately add to skillet with bacon mixture and all remaining ingredients; toss until cream cheese is completely melted and mixture is well blended.', u'spoonacularSourceUrl': u'https://spoonacular.com/spaghetti-carbonara-274322', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}