{u'recipes': [{u'sourceName': u'Cinnamon Spice and Everything Nice', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/492116-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 25, u'id': 492116, u'veryPopular': True, u'lowFodmap': False, u'title': u'Blueberry Rhubarb Baby Galettes', u'diets': [], u'preparationMinutes': 30, u'pricePerServing': 83.88, u'creditText': u'Cinnamon Spice and Everything Nice', u'extendedIngredients': [{u'originalString': u'6 ounces cream cheese, room temperature', u'aisle': u'Cheese', u'name': u'cream cheese', u'metaInformation': [u'room temperature'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.0, u'consistency': u'solid', u'id': 1017, u'unit': u'ounces'}, {u'originalString': u'1 + 3/4 cup blueberries', u'aisle': u'Bakery/Bread', u'name': u'cup cake', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/plain-cupcake.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 18139, u'unit': u''}, {u'originalString': u'1 egg, beaten', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'egg', u'metaInformation': [u'beaten'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 cup all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 20081, u'unit': u'cup'}, {u'originalString': u'3 tablespoons ice water', u'aisle': u'Frozen', u'name': u'ice', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ice-cubes.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'solid', u'id': 10014412, u'unit': u'tablespoons'}, {u'originalString': u'the zest of 1 lemon, just the yellow part not the pith', u'aisle': u'Produce', u'name': u'lemon zest', u'metaInformation': [u'yellow'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9156, u'unit': u''}, {u'originalString': u'3/4 cup rhubarb, diced', u'aisle': u'Produce', u'name': u'rhubarb', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.75, u'consistency': u'solid', u'id': 9307, u'unit': u'cup'}, {u'originalString': u'1/4 teaspoon salt', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.25, u'consistency': u'solid', u'id': 2047, u'unit': u'teaspoon'}, {u'originalString': u'1/2 cup sugar, divided, plus more for sprinkling over crust', u'aisle': u'Baking', u'name': u'sugar', u'metaInformation': [u'divided', u'plus more for sprinkling over crust'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}, {u'originalString': u'6 tablespoons unsalted butter, cut into 1/2-inch cubes', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted', u'cut into 1/2-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 6.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}, {u'originalString': u'fresh whipped cream, for serving', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped cream', u'metaInformation': [u'fresh', u'for serving'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 6.0, u'consistency': u'solid', u'id': 1054, u'unit': u'servings'}], u'healthScore': 1.0, u'imageType': u'jpg', u'spoonacularScore': 25.0, u'sourceUrl': u'http://www.cinnamonspiceandeverythingnice.com/blueberry-rhubarb-cream-cheese-baby-galettes/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 17, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'In a medium bowl gently toss blueberries, rhubarb and 1/4 cup of sugar together. In a separate mixing bowl beat cream cheese until fluffy then beat in 1/4 cup sugar and the lemon zest.Preheat oven to 400 degrees F. Line a large baking sheet with parchment and grease well. Divide pie crust into 3 equal pieces and roll out on a lightly floured board into 1/8 inch thick circles. Trim the uneven edges if desired to make a uniform circle (save the scraps to decorate the top).', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lemon.jpg', u'id': 9156, u'name': u'lemon zest'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/rhubarb.jpg', u'id': 9307, u'name': u'rhubarb'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/baking-sheet.jpg', u'id': 404727, u'name': u'baking sheet'}], u'step': u'Place the crusts on the well greased baking sheet and spread 1/3 of the cream cheese mixture over bottom leaving a 1-2 inch border around the edge. Pile on 1/3 of the blueberry mixture and fold the dough up and over the side, starting in one place and pleating it around the blueberries.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cream-cheese.jpg', u'id': 1017, u'name': u'cream cheese'}]}, {u'equipment': [], u'step': u'Brush with egg and sprinkle with sugar (raw sugar, if you have it). Repeat with the remaining two crusts. Stick all the scraps together, roll out and cut into small shapes to decorate the tops.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}, {u'equipment': [], u'step': u'Bake about 20-25 minutes or until crust is golden. If the juices overflow and cause the galettes to stick to the parchment, refrigerate and the parchment will easily peel off.', u'length': {u'number': 25, u'unit': u'minutes'}, u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Serve warm or chilled with fresh whipped cream.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 1054, u'name': u'whipped cream'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 718, u'instructions': u'In a medium bowl gently toss blueberries, rhubarb and 1/4 cup of sugar together. In a separate mixing bowl beat cream cheese until fluffy then beat in 1/4 cup sugar and the lemon zest.Preheat oven to 400 degrees F. Line a large baking sheet with parchment and grease well. Divide pie crust into 3 equal pieces and roll out on a lightly floured board into 1/8 inch thick circles. Trim the uneven edges if desired to make a uniform circle (save the scraps to decorate the top).Place the crusts on the well greased baking sheet and spread 1/3 of the cream cheese mixture over bottom leaving a 1-2 inch border around the edge. Pile on 1/3 of the blueberry mixture and fold the dough up and over the side, starting in one place and pleating it around the blueberries. Brush with egg and sprinkle with sugar (raw sugar, if you have it). Repeat with the remaining two crusts. Stick all the scraps together, roll out and cut into small shapes to decorate the tops.Bake about 20-25 minutes or until crust is golden. If the juices overflow and cause the galettes to stick to the parchment, refrigerate and the parchment will easily peel off. Serve warm or chilled with fresh whipped cream.', u'spoonacularSourceUrl': u'https://spoonacular.com/blueberry-rhubarb-baby-galettes-492116', u'dishTypes': [u'side dish'], u'occasions': [u'spring', u"mother's day"], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}