{u'recipes': [{u'sourceName': u'BBC Good Food', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/219442-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 30, u'id': 219442, u'veryPopular': True, u'lowFodmap': False, u'title': u'Veggie breakfast bakes', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30'], u'preparationMinutes': 15, u'pricePerServing': 156.26, u'creditText': u'BBC Good Food', u'extendedIngredients': [{u'originalString': u'4 eggs', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'eggs', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 1123, u'unit': u''}, {u'originalString': u'1 garlic clove, thinly sliced', u'aisle': u'Produce', u'name': u'garlic clove', u'metaInformation': [u'thinly sliced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11215, u'unit': u''}, {u'originalString': u'4 large field mushrooms', u'aisle': u'Produce', u'name': u'mushrooms', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 4.0, u'consistency': u'solid', u'id': 11260, u'unit': u''}, {u'originalString': u'2 tsp olive oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'olive oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/olive-oil.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 2.0, u'consistency': u'liquid', u'id': 4053, u'unit': u'tsp'}, {u'originalString': u'200g bag spinach', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'grams', u'unitShort': u'g', u'amount': 200.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'g'}, {u'originalString': u'8 tomatoes, halved', u'aisle': u'Produce', u'name': u'tomatoes', u'metaInformation': [u'halved'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 8.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}], u'healthScore': 27.0, u'imageType': u'jpg', u'spoonacularScore': 93.0, u'sourceUrl': u'http://www.bbcgoodfood.com/recipes/1897719/veggie-breakfast-bakes', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 2, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 200.0, u'unit': u'Celsius'}, u'name': u'oven'}], u'step': u'Heat oven to 200C/180C fan/gas 6.', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Put the mushrooms and tomatoes into4 ovenproof dishes. Divide garlic betweenthe dishes, drizzle over the oil and someseasoning, then bake for 10 mins.Meanwhile, put the spinach into a largecolander, then pour over a kettle ofboiling water to wilt it. Squeeze out anyexcess water, then add the spinach tothe dishes. Make a little gap between thevegetables and crack an egg into eachdish. Return to the oven and cook for afurther 8-10 mins or until the egg iscooked to your liking.', u'length': {u'number': 20, u'unit': u'minutes'}, u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mushrooms.jpg', u'id': 11260, u'name': u'mushrooms'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/garlic.jpg', u'id': 11215, u'name': u'garlic'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/egg.jpg', u'id': 1123, u'name': u'egg'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 457, u'instructions': u'Heat oven to 200C/180C fan/gas 6.Put the mushrooms and tomatoes into4 ovenproof dishes. Divide garlic betweenthe dishes, drizzle over the oil and someseasoning, then bake for 10 mins.Meanwhile, put the spinach into a largecolander, then pour over a kettle ofboiling water to wilt it. Squeeze out anyexcess water, then add the spinach tothe dishes. Make a little gap between thevegetables and crack an egg into eachdish. Return to the oven and cook for afurther 8-10 mins or until the egg iscooked to your liking.', u'spoonacularSourceUrl': u'https://spoonacular.com/veggie-breakfast-bakes-219442', u'dishTypes': [u'side dish', u'morning meal', u'brunch', u'breakfast'], u'occasions': [u'christmas'], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 45, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}