{u'recipes': [{u'sourceName': u'Taste of Home', u'cuisines': [u'european', u'english', u'british', u'scottish'], u'image': u'https://spoonacular.com/recipeImages/446653-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 446653, u'veryPopular': True, u'lowFodmap': False, u'title': u'Pineapple Orange Trifle', u'diets': [u'gluten free'], u'preparationMinutes': 20, u'pricePerServing': 108.24, u'creditText': u'Taste of Home', u'extendedIngredients': [{u'originalString': u'1 prepared angel food cake (8 to 10 ounces), cut into 1-inch cubes', u'aisle': u'Bakery/Bread', u'name': u'angel food cake', u'metaInformation': [u'prepared', u'cut into 1-inch cubes'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/angel-food-cake.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'liquid', u'id': 18088, u'unit': u'ounces'}, {u'originalString': u'1 can (11 ounces) mandarin oranges, drained', u'aisle': u'Canned and Jarred;Produce', u'name': u'canned mandarin oranges', u'metaInformation': [u'drained', u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/mandarin-or-tangerines-or-clementines.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 11.0, u'consistency': u'solid', u'id': 9218, u'unit': u'ounces'}, {u'originalString': u'1/3 cup flaked coconut, toasted', u'aisle': u'Produce', u'name': u'coconut', u'metaInformation': [u'flaked', u'toasted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.3333333333333333, u'consistency': u'solid', u'id': 12104, u'unit': u'cup'}, {u'originalString': u'2 packages (3.4 ounces each) instant vanilla pudding mix', u'aisle': u'Baking', u'name': u'instant vanilla pudding mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/instant-vanilla-pudding.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 6.8, u'consistency': u'solid', u'id': 19206, u'unit': u'ounces'}, {u'originalString': u'2 cups cold 2% milk', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'milk', u'metaInformation': [u'2%', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'liquid', u'id': 1077, u'unit': u'cups'}, {u'originalString': u'1/2 teaspoon orange extract', u'aisle': u'Baking', u'name': u'orange extract', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/extract.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'liquid', u'id': 12511111, u'unit': u'teaspoon'}, {u'originalString': u'1 can (14 ounces) pineapple tidbits', u'aisle': u'Canned and Jarred', u'name': u'pineapple tidbits', u'metaInformation': [u'canned'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pineapple-with-can.png', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 14.0, u'consistency': u'liquid', u'id': 1039354, u'unit': u'ounces'}, {u'originalString': u'1 cup (8 ounces) sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 1056, u'unit': u'ounces'}, {u'originalString': u'1 carton (8 ounces) frozen whipped topping, thawed', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'whipped topping', u'metaInformation': [u'frozen', u'thawed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 8.0, u'consistency': u'solid', u'id': 42135, u'unit': u'ounces'}], u'healthScore': 2.0, u'imageType': u'jpg', u'spoonacularScore': 36.0, u'sourceUrl': u'http://www.tasteofhome.com/recipes/pineapple-orange-trifle', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 11, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Drain pineapple, reserving 2/3 cup juice; set pineapple aside. In a large bowl, whisk the milk, pineapple juice and pudding mixes for 2 minutes.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/milk.jpg', u'id': 1077, u'name': u'milk'}]}, {u'equipment': [], u'step': u'Let stand for 2 minutes or until soft-set.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/whisk.png', u'id': 404661, u'name': u'whisk'}], u'step': u'Whisk in sour cream; fold in oranges and pineapple.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/bowl.jpg', u'id': 404783, u'name': u'bowl'}], u'step': u'Place a third of the cake cubes in a 3-qt. trifle bowl; top with a third of the pudding mixture. Repeat layers twice. Cover and refrigerate for 3 hours.', u'number': 4, u'ingredients': []}, {u'equipment': [], u'step': u'Combine whipped topping and extract; spread over the top. Sprinkle with coconut.', u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/whipped-cream.jpg', u'id': 42135, u'name': u'whipped topping'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut.jpg', u'id': 12104, u'name': u'coconut'}]}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 5763, u'instructions': u'Directions                                                                                Drain pineapple, reserving 2/3 cup juice; set pineapple aside. In a large bowl, whisk the milk, pineapple juice and pudding mixes for 2 minutes. Let stand for 2 minutes or until soft-set. Whisk in sour cream; fold in oranges and pineapple.                                                                                           Place a third of the cake cubes in a 3-qt. trifle bowl; top with a third of the pudding mixture. Repeat layers twice. Cover and refrigerate for 3 hours. Combine whipped topping and extract; spread over the top. Sprinkle with coconut.                                        Yield: 12 servings.                                                                                                                         Originally published as Pineapple Orange Trifle in  Taste of Home Christmas AnnualAnnual 2010, p70                                                                                                                                                                                                        Nutritional Facts                                                                             1 cup equals 269 calories, 9 g fat (7 g saturated fat), 16 mg cholesterol, 404 mg sodium, 43 g carbohydrate, 1 g fiber, 3 g protein.                                                                                                                                                                     Print                                                                                    Add to Recipe Box                            Email a Friend', u'spoonacularSourceUrl': u'https://spoonacular.com/pineapple-orange-trifle-446653', u'dishTypes': [], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 20, u'servings': 12, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}