{u'recipes': [{u'sourceName': u'Allrecipes', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/622168-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 50, u'id': 622168, u'veryPopular': False, u'lowFodmap': False, u'title': u"Aunt Bev's Famous Apple Pie", u'diets': [u'lacto ovo vegetarian'], u'preparationMinutes': 20, u'pricePerServing': 78.12, u'creditText': u'Allrecipes', u'extendedIngredients': [{u'originalString': u'1 tablespoon butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'butter', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1001, u'unit': u'tablespoon'}, {u'originalString': u'2 tablespoons all-purpose flour', u'aisle': u'Baking', u'name': u'flour', u'metaInformation': [u'all-purpose'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 20081, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 teaspoons ground cinnamon, or to taste', u'aisle': u'Spices and Seasonings', u'name': u'ground cinnamon', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 2010, u'unit': u'teaspoons'}, {u'originalString': u'1/2 teaspoon ground nutmeg', u'aisle': u'Spices and Seasonings', u'name': u'ground nutmeg', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.5, u'consistency': u'solid', u'id': 2025, u'unit': u'teaspoon'}, {u'originalString': u'salt to taste', u'aisle': u'Spices and Seasonings', u'name': u'salt', u'metaInformation': [u'to taste'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 8.0, u'consistency': u'solid', u'id': 2047, u'unit': u'servings'}, {u'originalString': u'7 tart apples, peeled and cored', u'aisle': u'Produce', u'name': u'tart apples', u'metaInformation': [u'cored', u'peeled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grannysmith-apples.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 7.0, u'consistency': u'solid', u'id': 1029003, u'unit': u''}, {u'originalString': u'1 cup white sugar', u'aisle': u'Baking', u'name': u'white sugar', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 19335, u'unit': u'cup'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://allrecipes.com/Recipe/Aunt-Bevs-Famous-Apple-Pie/Detail.aspx?src=rss', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'temperature': {u'number': 400.0, u'unit': u'Fahrenheit'}, u'name': u'oven'}], u'step': u'Preheat oven to 400 degrees F (200 degrees C).', u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/mixing-bowl.jpg', u'id': 405907, u'name': u'mixing bowl'}], u'step': u'Cut the apples into 1/4 inch slices.In a mixing bowl, combine sugar, cinnamon, flour, nutmeg (or apple pie spice), and salt; mix thoroughly.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cinnamon.jpg', u'id': 2010, u'name': u'cinnamon'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/ground-nutmeg.jpg', u'id': 2025, u'name': u'nutmeg'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour.png', u'id': 20081, u'name': u'all purpose flour'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sugar-cubes.jpg', u'id': 19335, u'name': u'sugar'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pie-pan.png', u'id': 405915, u'name': u'pie form'}], u'step': u'Pour the spice mix over the apples and stir until the apples are coated.Line one crust in a 9 inch deep dish pie pan.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}]}, {u'equipment': [], u'step': u'Place the apples in the pie crust. Dot the apple filling evenly with butter. Fit the top crust over the apples. Press the crust down gently and cut 3 or 4 slits in the top crust to allow steam to escape while the pie bakes', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apple.jpg', u'id': 9003, u'name': u'apple'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'id': 1001, u'name': u'butter'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Lambrusco Dolce, Late Harvest Riesling, and Vin Santo are my top picks for Pie. These wines are all sweet, which is important since wine should usually be sweeter than the food you're pairing with it. You could try Vineyards Late Harvest Riesling. Reviewers quite like it with a 5 out of 5 star rating and a price of about 25 dollars per bottle.", u'pairedWines': [u'lambrusco dolce', u'late harvest riesling', u'vin santo'], u'productMatches': [{u'description': u'pineapple , apple , orange blossom', u'title': u'Vineyards Late Harvest Riesling', u'price': u'$25.0', u'id': 431536, u'link': u'https://www.amazon.com/Willamette-Valley-Vineyards-Harvest-Riesling/dp/B00X4IQOV4', u'imageUrl': u'https://spoonacular.com/productImages/431536-312x231.jpg'}]}, u'aggregateLikes': 58, u'instructions': u'Preheat oven to 400 degrees F (200 degrees C).Cut the apples into 1/4 inch slices.In a mixing bowl, combine sugar, cinnamon, flour, nutmeg (or apple pie spice), and salt; mix thoroughly. Pour the spice mix over the apples and stir until the apples are coated.Line one crust in a 9 inch deep dish pie pan. Place the apples in the pie crust. Dot the apple filling evenly with butter. Fit the top crust over the apples. Press the crust down gently and cut 3 or 4 slits in the top crust to allow steam to escape while the pie bakesBake in the preheated oven 50 minutes, or until the crust is golden brown. Check the pie after the first 30 minutes of cooking: if the crust is already browned reduce the heat to 350 degrees F (175 degrees C) to allow the apples to cook without the crust burning.Kitchen-Friendly View', u'spoonacularSourceUrl': u'https://spoonacular.com/aunt-bevs-famous-apple-pie-622168', u'dishTypes': [u'dessert'], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 70, u'servings': 8, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}