{u'recipes': [{u'sourceName': u'A Family Feast ', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/701669-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 701669, u'veryPopular': False, u'lowFodmap': True, u'title': u'Champagne Cosmos', u'diets': [u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'fodmap friendly', u'vegan'], u'preparationMinutes': 5, u'pricePerServing': 382.99, u'creditText': u'A Family Feast ', u'extendedIngredients': [{u'originalString': u'1\xbd cup cranberry juice cocktail, chilled', u'aisle': u'Beverages', u'name': u'cranberry juice cocktail', u'metaInformation': [u'chilled'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-juice.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 1.5, u'consistency': u'solid', u'id': 14242, u'unit': u'cup'}, {u'originalString': u'\xbd cup Grand Marnier', u'aisle': u'Alcoholic Beverages', u'name': u'grand marnier', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grand-marnier.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 10314534, u'unit': u'cup'}, {u'originalString': u'3 tablespoons freshly squeezed lime juice', u'aisle': u'Produce', u'name': u'lime juice', u'metaInformation': [u'freshly squeezed'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 3.0, u'consistency': u'liquid', u'id': 9160, u'unit': u'tablespoons'}, {u'originalString': u'8 strips of lime zest, each about \xbd an inch wide and 2 to 3 inches long (approximately 2 limes)', u'aisle': u'Produce', u'name': u'lime zest', u'metaInformation': [u'(approximately 2 limes)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'unitLong': u'strips', u'unitShort': u'strips', u'amount': 8.0, u'consistency': u'solid', u'id': 1009159, u'unit': u'strips'}, {u'originalString': u'2 750 ml. bottles Proseco, Champagne, or sparkling wine', u'aisle': u'Alcoholic Beverages', u'name': u'sparkling wine', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'unitLong': u'milliliters', u'unitShort': u'ml', u'amount': 1500.0, u'consistency': u'liquid', u'id': 43155, u'unit': u'ml'}], u'healthScore': 0.0, u'imageType': u'jpg', u'spoonacularScore': 10.0, u'sourceUrl': u'http://www.afamilyfeast.com/champagne-cosmos/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 6, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Combine cranberry juice cocktail, Grand Marnier and lime juice in a pitcher. Stir to mix.Divide cranberry mixture evenly among 8 martini glasses or 8 champagne glasses or flutes.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cranberry-juice', u'id': 14242, u'name': u'cranberry juice cocktail'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/grand-marnier.jpg', u'id': 10314534, u'name': u'grand marnier'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'id': 9160, u'name': u'lime juice'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/champagne.jpg', u'id': 10043155, u'name': u'champagne'}]}, {u'equipment': [], u'step': u'Pour Proseco in each glass with the cranberry juice mixture and fill to the top. Take a strip of lime zest and fold it in half over each glass, releasing the essential oils into the cocktail. Drop the lime zest strip into the glass.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/zest-lime.jpg', u'id': 1009159, u'name': u'lime zest'}]}, {u'equipment': [], u'step': u'Serve immediately.', u'number': 3, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 22, u'instructions': u'Combine cranberry juice cocktail, Grand Marnier and lime juice in a pitcher. Stir to mix.Divide cranberry mixture evenly among 8 martini glasses or 8 champagne glasses or flutes.Pour Proseco in each glass with the cranberry juice mixture and fill to the top. Take a strip of lime zest and fold it in half over each glass, releasing the essential oils into the cocktail. Drop the lime zest strip into the glass.Serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/champagne-cosmos-701669', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u"new year's eve"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 5, u'servings': 8, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}