{u'recipes': [{u'sourceName': u'Gimme Delicious', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/828917-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 20, u'id': 828917, u'veryPopular': False, u'lowFodmap': False, u'title': u'Homemade Beef CrunchWraps', u'diets': [], u'preparationMinutes': 10, u'pricePerServing': 179.32, u'creditText': u'Gimme Delicious', u'extendedIngredients': [{u'originalString': u'6 Large burrito-size flour tortillas (10 or 12 inch)', u'aisle': u'Ethnic Foods', u'name': u'burrito size tortillas', u'metaInformation': [u'large', u'(10 or )'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'unitLong': u'12-inchs', u'unitShort': u'12-inch', u'amount': 6.0, u'consistency': u'solid', u'id': 10118364, u'unit': u'12-inch'}, {u'originalString': u'\xbd cup queso or nacho cheese dip', u'aisle': u'Canned and Jarred', u'name': u'cheese dip', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheez-whiz.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'liquid', u'id': 1188, u'unit': u'cup'}, {u'originalString': u'\xbc cup minced cilantro', u'aisle': u'Produce;Spices and Seasonings', u'name': u'cilantro', u'metaInformation': [u'minced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'solid', u'id': 11165, u'unit': u'cup'}, {u'originalString': u'6 tostada shells or corn tortillas (see note)', u'aisle': u'Bakery/Bread;Pasta and Rice;Ethnic Foods', u'name': u'corn tortillas', u'metaInformation': [u'(see note)'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/corn-tortillas.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 18363, u'unit': u''}, {u'originalString': u'1 lb ground beef', u'aisle': u'Meat', u'name': u'ground beef', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'unitLong': u'pound', u'unitShort': u'lb', u'amount': 1.0, u'consistency': u'liquid', u'id': 10023572, u'unit': u'lb'}, {u'originalString': u'juice of 1 lime', u'aisle': u'Produce', u'name': u'juice of lime', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/lime-juice.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'liquid', u'id': 9160, u'unit': u''}, {u'originalString': u'2 cups shredded lettuce', u'aisle': u'Produce', u'name': u'lettuce', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 11252, u'unit': u'cups'}, {u'originalString': u'1 cup shredded Mexican cheese blend', u'aisle': u'Cheese', u'name': u'shredded mexican cheese blend', u'metaInformation': [u'shredded'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'solid', u'id': 1251, u'unit': u'cup'}, {u'originalString': u'\xbd cup sour cream', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'sour cream', u'metaInformation': [u'sour'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.5, u'consistency': u'solid', u'id': 1056, u'unit': u'cup'}, {u'originalString': u'1 packet taco seasoning mix', u'aisle': u'Ethnic Foods;Spices and Seasonings', u'name': u'taco seasoning mix', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'packet', u'unitShort': u'packet', u'amount': 1.0, u'consistency': u'solid', u'id': 2073, u'unit': u'packet'}, {u'originalString': u'1 tomato, diced', u'aisle': u'Produce', u'name': u'tomato', u'metaInformation': [u'diced'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 11529, u'unit': u''}, {u'originalString': u'\xbc cup water', u'aisle': u'Beverages', u'name': u'water', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 14412, u'unit': u'cup'}], u'healthScore': 7.0, u'imageType': u'jpg', u'spoonacularScore': 55.0, u'sourceUrl': u'http://gimmedelicious.com/2016/11/12/homemade-crunchwraps/', u'glutenFree': False, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 14, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a large skillet to medium/high heat for 2-3 minutes.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 1, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add beef to skillet and cook and crumble the ground beef until no longer pink;', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/fresh-ground-beef.jpg', u'id': 10023572, u'name': u'ground beef'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/beef-cubes-raw.png', u'id': 23572, u'name': u'beef'}]}, {u'equipment': [], u'step': u'Drain grease. Stir in the taco seasoning mix and water and allow mixture to simmer for 10 minutes. On a clean flat surface, lay one flour tortilla on a flat surface.', u'length': {u'number': 10, u'unit': u'minutes'}, u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2073, u'name': u'taco seasoning mix'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'id': 10218364, u'name': u'flour tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/water.jpg', u'id': 14412, u'name': u'water'}]}, {u'equipment': [], u'step': u'Spread about 2 tablespoons of queso on the center of tortilla, Top with about  cup of taco meat. Top the meat with 1 tostada,', u'number': 4, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}]}, {u'equipment': [], u'step': u"Spread a thin layer of sour cream over the tostada shell. Top with lettuce, tomato, cilantro, a sprinkle of lime and shredded Mexican cheese.To fold the crunch wrap, start with the bottom of the flour tortilla and fold the edge up over the center. Continue to work your way around, folding the flour tortilla over the center fillings. If there is a spot left open in the center, cut a piece of another flour tortilla and tuck it in the center, so it's fully covered. Repeat with all remaining tortillas, tostadas and fillings.", u'number': 5, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortilla.jpg', u'id': 10218364, u'name': u'flour tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cheddar-cheese.jpg', u'id': 1251, u'name': u'mexican cheese'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/sour-cream.jpg', u'id': 1056, u'name': u'sour cream'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 18364, u'name': u'tortilla'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/cilantro.png', u'id': 11165, u'name': u'cilantro'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/iceberg-lettuce.jpg', u'id': 11252, u'name': u'lettuce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/tomato.jpg', u'id': 11529, u'name': u'tomato'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/flour-tortillas.jpg', u'id': 10018364, u'name': u'wrap'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat a medium non-stick pan to medium heat; pray with cooking spray or drizzle with a light layer of oil.', u'number': 6, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Place one crunch-wrap seam-side down onto the skillet. Cook for 2 - 3 minutes per side or until golden-brown and crunchy. Repeat process with all crunch-wraps.', u'length': {u'number': 3, u'unit': u'minutes'}, u'number': 7, u'ingredients': []}, {u'equipment': [], u'step': u'Serve hot!', u'number': 8, u'ingredients': []}], u'name': u''}], u'winePairing': {}, u'aggregateLikes': 78, u'instructions': u"Heat a large skillet to medium/high heat for 2-3 minutes. Add beef to skillet and cook and crumble the ground beef until no longer pink; Drain grease. Stir in the taco seasoning mix and water and allow mixture to simmer for 10 minutes. On a clean flat surface, lay one flour tortilla on a flat surface. Spread about 2 tablespoons of queso on the center of tortilla, Top with about  cup of taco meat. Top the meat with 1 tostada, Spread a thin layer of sour cream over the tostada shell. Top with lettuce, tomato, cilantro, a sprinkle of lime and shredded Mexican cheese.To fold the crunch wrap, start with the bottom of the flour tortilla and fold the edge up over the center. Continue to work your way around, folding the flour tortilla over the center fillings. If there is a spot left open in the center, cut a piece of another flour tortilla and tuck it in the center, so it's fully covered. Repeat with all remaining tortillas, tostadas and fillings. Heat a medium non-stick pan to medium heat; pray with cooking spray or drizzle with a light layer of oil. Place one crunch-wrap seam-side down onto the skillet. Cook for 2 - 3 minutes per side or until golden-brown and crunchy. Repeat process with all crunch-wraps. Serve hot!", u'spoonacularSourceUrl': u'https://spoonacular.com/homemade-beef-crunchwraps-828917', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 30, u'servings': 6, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}