{u'recipes': [{u'sourceName': u'Foodnetwork', u'cuisines': [u'american'], u'image': u'https://spoonacular.com/recipeImages/746196-556x370.jpeg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 746196, u'veryPopular': True, u'lowFodmap': False, u'title': u'Hickory and Gorgonzola Popcorn', u'diets': [u'gluten free', u'lacto ovo vegetarian'], u'preparationMinutes': 10, u'pricePerServing': 14.57, u'creditText': u'Foodnetwork', u'extendedIngredients': [{u'originalString': u'1 teaspoon freshly ground black pepper', u'aisle': u'Spices and Seasonings', u'name': u'black pepper', u'metaInformation': [u'black', u'freshly ground'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'unitLong': u'teaspoon', u'unitShort': u'tsp', u'amount': 1.0, u'consistency': u'solid', u'id': 1002030, u'unit': u'teaspoon'}, {u'originalString': u'1/4 cup canola oil', u'aisle': u'Oil, Vinegar, Salad Dressing', u'name': u'canola oil', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.25, u'consistency': u'liquid', u'id': 4582, u'unit': u'cup'}, {u'originalString': u"2 tablespoons Gorgonzola powder (See Cook's Note)", u'aisle': u'Cheese', u'name': u'gorgonzola', u'metaInformation': [u"(See Cook's Note)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 2.0, u'consistency': u'solid', u'id': 1011004, u'unit': u'tablespoons'}, {u'originalString': u'1 1/2 teaspoons kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 1.5, u'consistency': u'solid', u'id': 1082047, u'unit': u'teaspoons'}, {u'originalString': u"1/8 teaspoon hickory smoke powder (See Cook's Note)", u'aisle': u'Spices and Seasonings', u'name': u'alum powder', u'metaInformation': [u"(See Cook's Note)"], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-powder.jpg', u'unitLong': u'teaspoons', u'unitShort': u'tsp', u'amount': 0.125, u'consistency': u'solid', u'id': 10118371, u'unit': u'teaspoon'}, {u'originalString': u'2/3 cup popcorn kernels', u'aisle': u'Savory Snacks', u'name': u'popcorn kernels', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn-kernels.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 0.6666666666666666, u'consistency': u'solid', u'id': 25002, u'unit': u'cup'}, {u'originalString': u'4 tablespoons unsalted butter', u'aisle': u'Milk, Eggs, Other Dairy', u'name': u'unsalted butter', u'metaInformation': [u'unsalted'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/butter-sliced.jpg', u'unitLong': u'tablespoons', u'unitShort': u'Tbsp', u'amount': 4.0, u'consistency': u'solid', u'id': 1145, u'unit': u'tablespoons'}], u'healthScore': 0.0, u'imageType': u'jpeg', u'spoonacularScore': 14.0, u'sourceUrl': u'http://www.foodnetwork.com/recipes/damaris-phillips/hickory-and-gorgonzola-popcorn.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 5, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Put the oil and 3 popcorn kernels in a 6-quart saucepan. Cover and cook over medium-high heat until the kernels pop.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/popcorn-kernels.jpg', u'id': 25002, u'name': u'popcorn kernels'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/vegetable-oil.jpg', u'id': 4582, u'name': u'cooking oil'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Add the remaining kernels, cover, and remove from the heat for 30 seconds. Return the pan to the heat; within a minute you should hear the kernels start to pop. Cook, gently shaking the pan occasionally, until the popping sound slows down, about 2 minutes. Towards the end of popping, lift up the lid slightly to let out the steam to help keep the popcorn crisp. Wait 5 seconds and pour the popcorn into a large paper bag.', u'length': {u'number': 2, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}], u'step': u'Melt the butter in the popcorn saucepan and drizzle it over the popcorn. Shake the bag, then add the gorgonzola powder, salt, pepper and hickory smoke powder. Shake the bag once more to coat all the kernels.', u'number': 3, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/gorgonzola.jpg', u'id': 1011004, u'name': u'gorgonzola'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/pepper.jpg', u'id': 1002030, u'name': u'pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 2047, u'name': u'salt'}]}], u'name': u''}], u'winePairing': {u'pairingText': u"Sparkling Wine and Sparkling ros\xe9 are great choices for Fingerfood. If you're serving a selection of appetizers, you can't go wrong with these. Both are very food friendly and complement a variety of flavors. The Perrier-Jouet Nuit Blanche with a 4.9 out of 5 star rating seems like a good match. It costs about 68 dollars per bottle.", u'pairedWines': [u'sparkling wine', u'sparkling rose'], u'productMatches': [{u'description': u'The sweeter taste, combined with the rounded and smooth mouth feel give the wine, a full body and richness that makes Perrier-Jou\xebt Nuit Blanche the perfect champagne to awaken the senses.Perrier-Jou\xebt Nuit Blanche is an exceptional Non-Vintage blend of 20% Chardonnay, 40% Pinot Noir and 40% Pinot Meunier, sweetened to taste with a 20g/l dosage of cane sugar to create a sensual style.   View More', u'title': u'Perrier-Jouet Nuit Blanche', u'price': u'$67.99', u'id': 461023, u'link': u'https://www.wine.com/product/perrier-jouet-nuit-blanche/137331', u'imageUrl': u'https://spoonacular.com/productImages/461023-312x231.jpg'}]}, u'aggregateLikes': 500, u'instructions': u'Put the oil and 3 popcorn kernels in a 6-quart saucepan. Cover and cook over medium-high heat until the kernels pop. Add the remaining kernels, cover, and remove from the heat for 30 seconds. Return the pan to the heat; within a minute you should hear the kernels start to pop. Cook, gently shaking the pan occasionally, until the popping sound slows down, about 2 minutes. Towards the end of popping, lift up the lid slightly to let out the steam to help keep the popcorn crisp. Wait 5 seconds and pour the popcorn into a large paper bag.                          Melt the butter in the popcorn saucepan and drizzle it over the popcorn. Shake the bag, then add the gorgonzola powder, salt, pepper and hickory smoke powder. Shake the bag once more to coat all the kernels.', u'spoonacularSourceUrl': u'https://spoonacular.com/hickory-and-gorgonzola-popcorn-746196', u'dishTypes': [u'fingerfood', u'antipasti', u'starter', u'snack', u'appetizer', u'antipasto', u"hor d'oeuvre"], u'occasions': [], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 10, u'sustainable': False, u'dairyFree': False, u'whole30': False}]}