{u'recipes': [{u'sourceName': u'Simply Sugar and Gluten Free', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/539560-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 0, u'id': 539560, u'veryPopular': True, u'lowFodmap': False, u'title': u'Strawberry Coconut "Milkshake', u'diets': [u'caveman', u'gluten free', u'dairy free', u'lacto ovo vegetarian', u'primal', u'whole 30', u'vegan'], u'preparationMinutes': 10, u'pricePerServing': 328.04, u'creditText': u'Simply Sugar and Gluten Free', u'extendedIngredients': [{u'originalString': u'1 tablespoon chia seeds', u'aisle': u'Health Foods', u'name': u'chia seeds', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chia-seeds.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'solid', u'id': 12006, u'unit': u'tablespoon'}, {u'originalString': u'1 cup cold unsweetened So Delicious Coconut Milk', u'aisle': u'Canned and Jarred;Milk, Eggs, Other Dairy', u'name': u'coconut milk', u'metaInformation': [u'unsweetened', u'cold'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/coconut-milk.jpg', u'unitLong': u'cup', u'unitShort': u'cup', u'amount': 1.0, u'consistency': u'liquid', u'id': 12118, u'unit': u'cup'}, {u'originalString': u'1 large medjool date**', u'aisle': u'Dried Fruits;Produce', u'name': u'date', u'metaInformation': [u'large'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dates.jpg', u'unitLong': u'', u'unitShort': u'', u'amount': 1.0, u'consistency': u'solid', u'id': 9087, u'unit': u''}, {u'originalString': u'2 cups of spinach or 2 to 3 big leaves of kale', u'aisle': u'Produce', u'name': u'spinach', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'unitLong': u'cups', u'unitShort': u'cup', u'amount': 2.0, u'consistency': u'solid', u'id': 10011457, u'unit': u'cups'}, {u'originalString': u'10 frozen strawberries, organic if possible', u'aisle': u'Produce', u'name': u'strawberries', u'metaInformation': [u'frozen', u'organic'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'unitLong': u'', u'unitShort': u'', u'amount': 10.0, u'consistency': u'solid', u'id': 9316, u'unit': u''}], u'healthScore': 40.0, u'imageType': u'jpg', u'spoonacularScore': 98.0, u'sourceUrl': u'http://simplysugarandglutenfree.com/strawberry-coconut-milkshake/', u'glutenFree': True, u'vegan': True, u'veryHealthy': False, u'weightWatcherSmartPoints': 26, u'analyzedInstructions': [{u'steps': [{u'equipment': [], u'step': u'Put the ingredients into your Vita', u'number': 1, u'ingredients': []}, {u'equipment': [], u'step': u'Mix in the order listed in the ingredient list, with the strawberries on the bottom and the spinach on the top. Start on the lowest speed and gradually increase into high speed. Use the tamper to push the ingredients into the blades.', u'number': 2, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/strawberries.png', u'id': 9316, u'name': u'strawberries'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/spinach.jpg', u'id': 10011457, u'name': u'spinach'}]}, {u'equipment': [], u'step': u'Mix until completely smooth.', u'number': 3, u'ingredients': []}, {u'equipment': [], u'step': u'Pour into chilled glasses and serve immediately.', u'number': 4, u'ingredients': []}], u'name': u''}], u'winePairing': {u'pairingText': u"Cream Sherry, Moscato d'Asti, and Port are great choices for Milkshake. A common wine pairing rule is to make sure your wine is sweeter than your food. Delicate desserts go well with Moscato d'Asti, nutty desserts with cream sherry, and caramel or chocolate desserts pair well with port. The NV Johnson Estate Cream Sherry with a 5 out of 5 star rating seems like a good match. It costs about 19 dollars per bottle.", u'pairedWines': [u'cream sherry', u'moscato dasti', u'port'], u'productMatches': [{u'description': u'Very aromatic with notes of hazelnut, vanilla, and a touch of oak followed by sweet raisins and a touch of yeast. Clean lasting finish. Good now but will reward those allow it to age"". A favorite pre-prandial beverage. Consider it with nuts before dinner as an aperitif, or after dinner with dessert, especially chocolates and fruit-based desserts. Also wonderful on cold afternoons, served with biscotti to dip in ""Italian-style"". "', u'title': u'NV Johnson Estate Cream Sherry', u'price': u'$19.49', u'id': 430626, u'link': u'https://www.amazon.com/Johnson-Estate-Cream-Sherry-750/dp/B00D3GQSRW', u'imageUrl': u'https://spoonacular.com/productImages/430626-312x231.jpg'}]}, u'aggregateLikes': 403, u'instructions': u'Put the ingredients into your VitaMix in the order listed in the ingredient list, with the strawberries on the bottom and the spinach on the top. Start on the lowest speed and gradually increase into high speed. Use the tamper to push the ingredients into the blades. Mix until completely smooth.Pour into chilled glasses and serve immediately.', u'spoonacularSourceUrl': u'https://spoonacular.com/strawberry-coconut-milkshake-539560', u'dishTypes': [u'beverage', u'drink'], u'occasions': [u"mother's day"], u'vegetarian': True, u'ketogenic': False, u'readyInMinutes': 10, u'servings': 1, u'sustainable': False, u'dairyFree': True, u'whole30': True}]}