{u'recipes': [{u'sourceName': u'Simply Scratch', u'cuisines': [], u'image': u'https://spoonacular.com/recipeImages/763824-556x370.jpg', u'cheap': False, u'gaps': u'no', u'cookingMinutes': 40, u'id': 763824, u'veryPopular': False, u'lowFodmap': False, u'title': u'Apricot Glazed Chicken', u'diets': [u'gluten free', u'dairy free'], u'preparationMinutes': 15, u'pricePerServing': 227.26, u'creditText': u'Simply Scratch', u'extendedIngredients': [{u'originalString': u'1 jar (12 to 13 ounces) apricot jam', u'aisle': u'Nut butters, Jams, and Honey', u'name': u'apricot jam', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'unitLong': u'ounces', u'unitShort': u'oz', u'amount': 12.0, u'consistency': u'solid', u'id': 19719, u'unit': u'ounces'}, {u'originalString': u'pinch of cayenne pepper', u'aisle': u'Spices and Seasonings', u'name': u'cayenne pepper', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'unitLong': u'pinch', u'unitShort': u'pinch', u'amount': 1.0, u'consistency': u'solid', u'id': 2031, u'unit': u'pinch'}, {u'originalString': u'6 to 8 boneless skinless chicken thighs', u'aisle': u'Meat', u'name': u'chicken thighs', u'metaInformation': [u'boneless', u'skinless'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thighs.png', u'unitLong': u'', u'unitShort': u'', u'amount': 6.0, u'consistency': u'solid', u'id': 5091, u'unit': u''}, {u'originalString': u'1 heaping tablespoon Dijon mustard', u'aisle': u'Condiments', u'name': u'dijon mustard', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dijon-mustard.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 1002046, u'unit': u'tablespoon'}, {u'originalString': u'1 heaping tablespoon honey', u'aisle': u'Nut butters, Jams, and Honey;Health Foods', u'name': u'honey', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 19296, u'unit': u'tablespoon'}, {u'originalString': u'kosher salt', u'aisle': u'Spices and Seasonings', u'name': u'kosher salt', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 1082047, u'unit': u'servings'}, {u'originalString': u'white pepper', u'aisle': u'Spices and Seasonings', u'name': u'white pepper', u'metaInformation': [u'white'], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'unitLong': u'servings', u'unitShort': u'servings', u'amount': 4.0, u'consistency': u'solid', u'id': 2032, u'unit': u'servings'}, {u'originalString': u'1 1 tablespoon Worcestershire sauce', u'aisle': u'Condiments', u'name': u'worcestershire sauce', u'metaInformation': [], u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'unitLong': u'tablespoon', u'unitShort': u'Tbsp', u'amount': 1.0, u'consistency': u'liquid', u'id': 6971, u'unit': u'tablespoon'}], u'healthScore': 6.0, u'imageType': u'jpg', u'spoonacularScore': 52.0, u'sourceUrl': u'http://www.simplyscratch.com/2016/05/apricot-glazed-chicken.html', u'glutenFree': True, u'vegan': False, u'veryHealthy': False, u'weightWatcherSmartPoints': 22, u'analyzedInstructions': [{u'steps': [{u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/roasting-pan.jpg', u'id': 404646, u'name': u'baking pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/sauce-pan.jpg', u'id': 404669, u'name': u'sauce pan'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}], u'step': u'Preheat your oven to 425 degrees and spray a baking dish with cooking spray (I use my olive oil mister).Arrange chicken thighs in the bottom of the pan and sprinkle with pinches of kosher salt and white pepper.In a saucepan, combine the apricot jam, honey, Dijon, cayenne and Worcestershire sauce. Stir until combined.', u'number': 1, u'ingredients': [{u'image': u'https://spoonacular.com/cdn/ingredients_100x100/dark-sauce.jpg', u'id': 6971, u'name': u'worcestershire sauce'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chicken-thigh.jpg', u'id': 5091, u'name': u'chicken thighs'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/white-pepper.jpg', u'id': 2032, u'name': u'white pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/apricot-jam.jpg', u'id': 19719, u'name': u'apricot jam'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/salt.jpg', u'id': 1082047, u'name': u'kosher salt'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/chili-powder.jpg', u'id': 2031, u'name': u'ground cayenne pepper'}, {u'image': u'https://spoonacular.com/cdn/ingredients_100x100/honey.jpg', u'id': 19296, u'name': u'honey'}]}, {u'equipment': [{u'image': u'https://spoonacular.com/cdn/equipment_100x100/oven.jpg', u'id': 404784, u'name': u'oven'}, {u'image': u'https://spoonacular.com/cdn/equipment_100x100/pan.png', u'id': 404645, u'name': u'frying pan'}], u'step': u'Heat the apricot glaze over medium to medium-high heat until bubbling. Cook for 10 minutes or until reduced and thickened.Spoon all of the glaze over top of chicken, basting and brushing with the back of the spoon, and place on the middle rack of your preheated oven and bake for 40 to 45 minutes. While baking, spoon the glaze from the bottom of the pan over the chicken every 10 to 12 minutes, until fully cooked.Once cooked, remove the pan from the oven and spoon glaze over top one last time before allowing the chicken to cool for 5 minutes or so. Serving with an extra drizzle of the apricot glaze over top.NOTE: Feel free to add a clove of finely minced garlic to the glaze (before reducing) for some added flavor!', u'length': {u'number': 65, u'unit': u'minutes'}, u'number': 2, u'ingredients': []}], u'name': u''}], u'aggregateLikes': 134, u'instructions': u'Preheat your oven to 425 degrees and spray a baking dish with cooking spray (I use my olive oil mister).Arrange chicken thighs in the bottom of the pan and sprinkle with pinches of kosher salt and white pepper.In a saucepan, combine the apricot jam, honey, Dijon, cayenne and Worcestershire sauce. Stir until combined. Heat the apricot glaze over medium to medium-high heat until bubbling. Cook for 10 minutes or until reduced and thickened.Spoon all of the glaze over top of chicken, basting and brushing with the back of the spoon, and place on the middle rack of your preheated oven and bake for 40 to 45 minutes. While baking, spoon the glaze from the bottom of the pan over the chicken every 10 to 12 minutes, until fully cooked.Once cooked, remove the pan from the oven and spoon glaze over top one last time before allowing the chicken to cool for 5 minutes or so. Serving with an extra drizzle of the apricot glaze over top.NOTE: Feel free to add a clove of finely minced garlic to the glaze (before reducing) for some added flavor!', u'spoonacularSourceUrl': u'https://spoonacular.com/apricot-glazed-chicken-763824', u'dishTypes': [u'lunch', u'main course', u'main dish', u'dinner'], u'occasions': [], u'vegetarian': False, u'ketogenic': False, u'readyInMinutes': 55, u'servings': 4, u'sustainable': False, u'dairyFree': True, u'whole30': False}]}